{"name": "A_Real_Indication", "url": "https://twinpeaks.fandom.com/wiki/A_Real_Indication", "text": "A Real Indication\n\"A Real Indication\" is a song composed by Angelo Badalamenti, credited to the Thought Gang project. The song appears in Twin Peaks: Fire Walk With Me during the scene where Laura and Bobby talk and say goodbye after school and also during the scene in which Laura finds that there are missing pages in her diary.\nDescription found in \"David Lynch: The Lime Green Set\"\n David Lynch & Badalamenti's 'Thought Gang - A Real Indication \n\"Filmed on Hi-8 in 1992, this DIY music video is a rare visual document of Lynch & Badalamenti's 'Thought Gang.' An esoteric jazz side-project born amidst the landscape of Twin Peaks, 'Thought Gang' featured several talented players in a mostly improvisational setting with Badalamenti providing vocal duties. 'A Real Indication' was the first of around 10 tracks to be recorded under the Thought Gang moniker, and one of only two Thought Gang tracks to have been released over the years (both 'A Real Indication' and 'The Black Dog Runs at Night' are included on the soundtrack to Twin Peaks: Fire Walk With Me). The remaining tracks await an LP release in 2011.\"\nLyrics\nSo I'm goin' down this street\nAnd I'm tryin' not to smile\n'Cause the street is where I'm goin'\nAnd the curb is at the side\nBy the sewer\nWhere the rain goes down\nLike this girl I once knew\n'Cause the sewer is so hollow\nAnd the yell\nCould last forever\nLike the night my girl went away\nGone off in a world filled with stuff\nLights start changin'\nAnd there's wires in the air\nAnd the asphalt man\nIs all around me\nAnd I look down\nAnd my shoes are so far away from me, man\nI can't believe it\nI got a real indication\nOf a laugh comin' on\nThat old wind\nIs howling like a cold steel train\nGirl has left me\nNot comin' back again\nGot rusted bullet holes in the Dodge\nAnd a heartburn like a solar flare\nThe grass by the house is dry, man\nAnd a horsefly\nBuzzes\nBy the big mistake In the distance, man\nI see myself start to smile\nI got a real indication of a laugh comin' on"}