{"name": "Albert_Rosenfield", "url": "https://twinpeaks.fandom.com/wiki/Albert_Rosenfield", "text": "Albert Rosenfield\n\"Albert's path is a strange and difficult one.\"\n ―Dale Cooper\nAlbert Rosenfield was a forensics specialist in the Federal Bureau of Investigation who assisted in the investigation of Laura Palmer's murder in 1989. Twenty-five years later, he assisted FBI deputy director Gordon Cole on the Blue Rose case relating to Dale Cooper's reappearance in South Dakota.\nBiography\n\nEducation and early career\nAlbert attended Yale University prior to entering the FBI Academy.\nHe first met Special Agent Dale Cooper in February of 1978.\nReappearance of Agent Jeffries\nIn February 1989, Albert watched as previously missing Special Agent Phillip Jeffries came to the FBI offices in Philadelphia, stating that he was not going to talk about \"Judy\" and questioned who Agent Cooper was. Jeffries then told Albert, Cooper, and Regional Bureau Chief Gordon Cole of a sort of meeting he was at, above a convenience store. This confused Albert, Cooper, and Gordon further. He also went on saying he and other individuals lived inside a dream. Jeffries said he found \"them\" in Seattle at Judy's and followed them. Gordon then told Albert to go get a mineral water and Jeffries disappeared. Albert then called the front desk, who said Phillip was never there.\nMurder of Laura Palmer\nLater, Cooper told Albert that he predicted that Teresa Banks' killer would strike again, and the victim would be a woman, blonde, in high school, sexually active, using drugs, and crying out for help. Albert responded, \"Well, damn, Cooper, that really narrows it down. You're talking about half the high school girls in America!\"\nOn February 24, Cooper's prediction came true. Albert was assigned to assist Cooper in the investigation of murdered high school student Laura Palmer, per Cooper's instruction.\nAlbert called the Twin Peaks sheriff's department the following day, discussing with Agent Cooper his plans to perform an autopsy on Laura Palmer.\nHe arrived in Twin Peaks with his team on February 26, telling the sheriff's station receptionist Lucy Moran to inform Cooper of his arrival. He then met Sheriff Harry S. Truman, with whom he immediately had a tense relationship due to Albert's belief that the small town's sheriff's department was primitive and amateur, and was unimpressed by the findings of the autopsy. He was threatened by Harry but brushed it off as he got to work with his team.\nThe following day, Albert got into a fight with Doctor Will Hayward, who wished to stop his further testing on Laura's body so it could be buried for the funeral. When the argument became physical, he was restrained by Benjamin Horne, who took Hayward's side. Albert insisted the funeral should have been delayed as he continued his tests. The disagreement became physical once again before Sheriff Truman and Agent Cooper arrived. Albert let out a string of insults to Sheriff Truman, who punched him causing Albert to land on top of Laura's body. Cooper intervened and sent the Sheriff out, then ordered Albert to let the body be released.\nHe later presented his findings to Cooper and Truman. Laura was a cocaine user, she was bound with two types of twine, and industrial soap particles were found on the back of her neck. He also noted that wounds on her shoulders appeared to be claw marks. Lastly, he presented a partially-digested plastic fragment bearing the letter 'J.'\nWhen Truman excused himself to go to Laura's funeral, Albert kept Cooper behind, asking him to sign a form regarding the physical attack by the sheriff earlier in the day, but Cooper refused.\nFive days later, Albert returned to Twin Peaks under Cole's orders after Cooper had been shot. He went to the home of Leo Johnson, where Deputy Andy Brennan ran inside to warn Sheriff Truman, but stepped on a loose board, hitting himself in the head. This revealed a hidden pair of boots and cocaine.\n \nBack at the Sheriff's station, Albert examined Cooper's gunshot wound. Deputy Andy entered and informed Cooper that Leo was imprisoned in Hungry Horse, Montana on February 9, 1988, confirming an alibi for the Teresa Banks murder, therefore eliminating him as a suspect in Laura's murder, if they were indeed killed by the same person.\nHe later walked through the hospital with Truman and Cooper. When they saw Ed Hurley, Truman pours Albert a coffee to leave Cooper alone with Big Ed for a moment. Albert was amused by Ed's story of shooting his wife's eye out on a honeymoon hunting trip. He then went to book a room at the Great Northern Hotel.\nLater, he sat in the conference room, where he and Cooper went over the events that occurred the night Laura died. Andy cried over a picture of Laura, causing Albert to mock him, upsetting him further.\n \nThe next morning, Albert had breakfast with Cooper, who told him about Tibet and that Ronette Pulaski—who had been present at Laura's murder—had woken from her coma and said they would show her sketches of Leo Johnson and \"BOB,\" a man whom Sarah Palmer had a vision of, though Albert was skeptical about BOB even existing. He delivered the autopsy report on suspect Jacques Renault, having found that he was smothered with a pillow. He also suspected the Packard Sawmill fire to be a result of arson, and to have been done by Leo. Albert then informed Cooper that his renegade former partner Windom Earle had escaped from a mental institution.\nThe next day, he went to Ronette with Cooper and Truman as the former extracted a small piece of paper with the letter 'B' from underneath her fingernail. Cooper believed it to have been placed by Laura's killer, and Albert noted that Ronette's IV was tainted. Cooper then told Albert and Harry that he was visited by a giant who gave him three clues. Albert scoffed, \"any relation to the dwarf?\"\n \nAlbert later delivered the results on the cocaine found in James Hurley's gas tank as being from the same source as the drugs in Jacques's and Leo's possession. He also said that the letter 'B' under Ronette's finger was cut from a copy of Flesh World. He stated that the sketch of \"BOB\" had been run through several agencies, with no results and also noted that Cooper was shot with a Walther PPK, \"James Bond's gun,\" and that he found fibers left from the shooter. He insulted Truman yet again, causing the sheriff to take him by the collar. Albert explained his methods to be built on the foundation of love and calmly said, \"I love you, Sheriff Truman,\" before leaving.\nAfter the body of Laura Palmer's cousin, Maddy Ferguson was found, Albert presented a letter 'O' found under her ring finger, determining her killer to be the same person that murdered Teresa Banks and Laura. He also said that fur from a taxidermy white fox was in her hand. Albert then encouraged Cooper to find the killer before he struck again.\nHarry confirmed to Albert and Cooper his suspicion that Benjamin Horne was responsible for the deaths of Laura and Maddy. Albert then presented Horne's blood test.\nAlbert went to the Roadhouse, where Cooper called several men, including Ben Horne, Leland Palmer, and Leo Johnson. He believed the killer to be there and used \"magic\" to determine the culprit. He asked to have Ben Horne escorted back to the station, with Leland as his attorney.\nThey took Ben down to interrogation, but the sheriff and Cooper pushed Leland into the room, with the attorney being thrown into a rage, revealed as BOB's host.\nThey entered the room, where Leland was restrained and read his rights by Sheriff Truman. Through Leland, BOB laughed and howled as he was interrogated, soon confessing to the murders. Satisfied, the lawmen left the room.\n \nCooper then went over the evidence against Leland and the events that must have occurred the night of Laura's death. After BOB chanted a poem, the sprinkler system went off, and BOB slammed Leland's head into the interrogation room door. They frantically entered to find Leland bleeding on the floor, BOB apparently gone. Leland expressed his guilt and died in Cooper's arms.\nLater, with Dale and Harry, Albert discussed the nature of BOB. He came to the conclusion that Bob is the \"evil that men do.\"\nReturn of Windom Earle\nFollowing Windom Earle's arrival in Twin Peaks, taunting Cooper, Albert returned to the town. He went to the sheriff's station, where he enthusiastically greeted Truman with a hug before presenting a file on Windom Earle, under Cole's orders. He told them that Earle had been sending boxes to various law enforcement agencies, each containing a piece of wardrobe from his late wife Caroline Earle on their wedding day.\nLater, he confirmed to Cooper through forensic analysis that Josie Packard was the one who shot him and was the prime suspect in the murder of Jonathan Kumagai, though Cooper hoped for Harry's sake that this was not the case, as the sheriff and Josie were lovers.\nHe soon matched up the bullets fired at Cooper, and at Jonathan. He showed Cooper and was eager to arrest Josie, but Cooper wanted more evidence to be absolutely sure that she was guilty and then wished to see if she would confess first.\nLater, he came to the station to deliver more evidence of Josie's guilt to Cooper. However, Harry overheard them and left. Josie died later in the night of unknown causes.\nOn April 1, Albert performed an autopsy on Leo Johnson, who had been found dead inside a cabin in the woods. He concluded that Leo had been killed by gunshot wounds to the chest by an assailant who stood \"Bureau style,\" based on scuff marks found by the cabin's door. Due to this evidence, Albert theorized that the killer was Windom Earle.\nRe-emergence of Cooper\nIn September 2016, after Agent Tamara Preston briefed Albert and Gordon of the deaths of Sam Colby and Tracey Barberato, a call was received concerning Agent Cooper, who had been missing since 1989. It was found that he had been incarcerated in a federal prison in South Dakota, and Cole planned to go there with Albert and Preston in tow.\nUpon arrival, they were presented with the contents that were found in Cooper's trunk: cocaine, a machine gun, and a dog leg. They then met with Cooper, who claimed to have been working undercover with Phillip Jeffries and was on his way to debrief with Cole when he had his car accident that led to his incarceration.\nAfter this interview, Cole spoke with Albert privately, having noticed an unusual reaction to Cooper. Albert admitted to him that he had provided Jeffries with information several years before after Jeffries said it was pertinent to Cooper's safety. This information regarded an agent in Colombia, who was killed a week after Albert relayed this information. Albert and Gordon then discussed the meeting with Cooper, both feeling something was wrong. Cole asks Albert about a person that they planned to bring to Cooper and Albert noted that he knew where she drank.\nWith this knowledge, Albert went to Max Von's Bar, where he found Diane Evans, Cooper's former secretary.\nFollowing Diane's interview with Cooper, the group headed back to Philadelphia, but the plane was re-routed to Buckhorn, South Dakota after the body of Major Garland Briggs was found.\nDetective Dave Macklay explained to them that the body had been found in a bed along with the severed head of Ruth Davenport, who, along with her murder's prime suspect, William Hastings, had an interest in alternate dimensions. Albert noted that the body appeared to be the wrong age for Briggs, which caused Cole to connect it to Cooper.\nAfter having dinner with coroner Constance Talbot, Albert showed Gordon texts connected to Diane, pointing suspicion to her possibly being in league with Cooper. Tammy soon showed up, bringing them a picture of Cooper and another man with the glass box at the scene of Sam Colby and Tracey Barberato's deaths.\nHastings led Albert, Gordon, Tammy, and Diane to where he claimed to have entered \"the zone,\" which he claimed to be an alternate dimension. Albert and Gordon both saw \"dirty, bearded men\" and just before Gordon could be transported to \"the zone,\" Albert pulled him back and discovered a headless female body, presuming it to be Ruth Davenport's. He photographed it and noted that it had coordinates written on its arm, as Hastings said about Davenport. They returned to Macklay's car when Hastings suddenly died.\nMacklay later confirmed the body as Ruth Davenport's and Albert and Gordon described the bearded men they had seen, which Diane claimed to have also seen exit Macklay's car following Hastings' death.\nAlbert and Gordon inducted Tammy into the Blue Rose task force, then offered Diane an official position into the investigation into Cooper's re-appearance.\nHe later showed Gordon texts to and from Diane, reading \"Las Vegas?\" and \"THEY HAVEN'T ASKED YET.\"\nAlbert explained to Tammy the first Blue Rose case before Cole came to meet with them and Diane. After Diane confirmed that Cooper had mentioned Major Briggs during their last meeting, Albert explained the Major's significance and Diane states that she recognized the names on the ring found in Briggs' stomach as belonging to her half-sister and brother-in-law, Janey-E and Dougie Jones, who lived in Las Vegas. This prompted Cole to contact the FBI branch in Las Vegas, stating the Joneses to be suspects in a double murder.\nAfter Diane left, Gordon explained that he had contacted the Twin Peaks Sheriff's Department, who had found something from Laura Palmer's diary that indicated the existence of two Coopers. He then described a dream he had about Monica Bellucci, in which he recalled Jeffries' brief appearance at the FBI headquarters in 1989, particularly Jeffries question of who Cole thought Cooper was.\nDiane later met with Albert, Gordon, and Tammy to recount the evening she last saw Cooper. After describing the events that took place, Diane became upset and drew a gun from her purse. Albert and Tammy reacted in time, drawing their guns and shooting Diane, who then disappeared, prompting Tammy to note that Diane was actually a tulpa.\nAs the agents recovered from this, Cole received word from Las Vegas that Dougie Jones and Dale Cooper were one and the same. Tammy researched Dougie Jones, finding that his car had exploded, an assassination attempt had been made on him, and he had been in the company with two organized crime figures. Tammy further stated that he had been electrocuted by sticking a fork in a wall socket, which Albert noted as \"strange, even for Cooper.\" Cole then told them to get ready to leave, as he knew where Cooper was headed.\nThey met Cooper at the Twin Peaks Sheriff's Station, where Cooper's doppelganger and BOB had just been defeated. Cooper told them he wished to meet them again and stated that some things would change, as the past dictated the future.\nBehind the scenes\nAlbert was played by Miguel Ferrer, who later starred in Mark Frost and David Lynch's short-lived television series, On the Air, alongside Ian Buchanan and David L. Lander.\nFerrer posthumously appeared in the 2017 revival following his death on January 19, 2017.\nFerrer was one of three actors from the 1987 film RoboCop to appear in Twin Peaks, the other two being Ray Wise and Dan O'Herlihy.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}