{"name": "Andrew_Packard", "url": "https://twinpeaks.fandom.com/wiki/Andrew_Packard", "text": "Andrew Packard\nAndrew Packard was a sprightly and high-spirited man in spite of his old age, and was formerly the owner of the Packard Sawmill. \nBiography\nAt the age of 16 in 1927, Packard was a Scout First Class in the Boy Scouts. In May, he and fellow scouts Rusty and Theo set out to earn a hiking merit badge whilst supervised by scoutmaster Dwayne Milford. Upon reaching Glastonbury Grove, Rusty and Theo became lightheaded as dark clouds approached the area. Preparing for a storm, Milford led the boys back to their camp.\nThe storm lasted for several hours, during which time, Packard went to retrieve Nehi orange sodas Milford had brought for them and saw lightning strike a nearby Douglas fir. In the flash of lightning, he spotted an extremely tall man looking at him, then vanish into the woods. Initially thinking the man must have been a lumberjack, he returned to camp with the sodas and told the scouts of the man he saw.\nThroughout the night, Packard heard thudding outside of the tent until he managed to fall asleep. In the morning, Milford found a large footprint and told Packard of a camping trip his brother, Douglas went on six months prior, where he claimed to have seen a giant, walking owl.\nBy 1947, he was a scoutmaster and was also involved in several organizations in Twin Peaks, including the Rotary, Chamber of Commerce, Optimists Club, Elk Lodge, and Masonic Lodge.\nIn 1948, Packard took control of the Packard Sawmill.\nIn 1983, he met Josette Mai Wong at a state-sponsored black-tie \"mixer\" at the Hong Kong trade center. He brought her to his hometown of Twin Peaks, where she accepted his proposal of marriage.\nA boating enthusiast, he named his 1936 Chris-Craft Sportsman \"JOSIE.\" On September 27, 1987, the boat exploded, leaving unidentifiable human remains. Anticipating the attempt on his life by Thomas Eckhardt—who Josie had ties with—Packard managed to escape and go into hiding, with the town believing he had perished.\nIn March 1989, after listening on a conversation between his sister Catherine and Josie about his apparent death. Andrew entered Catherine's office and commented that everything is going exactly as planned, and a trap had been set for Eckhardt.\nDays later, Catherine revealed Andrew to her husband Pete, who was flabbergasted at his survival. Catherine and Andrew explained the latter's survival, as his death was faked due to them foreseeing Eckhardt's plan to murder him.\nPete brought Andrew breakfast a couple of mornings later in the shape of a dog's face, much to his amusement. Catherine, however, was not amused. Pete brought salt and pepper, then left. Josie then arrived and fainted upon seeing Andrew.\nHe later had a drink with Josie and revealed to her that he has long since forgiven her for his attempted murder, putting all blame on Eckhardt, who he implored her to visit. He exited, saying they would never speak again.\nPackard went to the Great Northern Hotel, where he revealed himself to Eckhardt as being alive. He also warned him to be careful around Josie, who subsequently killed Eckhardt and died soon after.\nIn the following days, Catherine told Andrew about a box left by Eckhardt's assistant, Jones, which appeared to be a sort of puzzle box with an astrological code on it. He informed her that her investors for the Ghostwood Development Project were on board and he pointed to constellations on the box, putting in a sort of combination, revealing a smaller box, which he busted open with a rolling pin. Contained inside was a metallic box.\nAndrew and Pete attempted to open the final box the next day but were unsuccessful until Packard angrily shot it with a revolver. Inside it was a safety deposit box key, which Catherine placed in the cake saver.\nHe took the key from the cake saver later at night and replaced it with another key. Pete then came to bid him goodnight.\nLater, he and Pete went to the Twin Peaks Savings and Loan, where clerk Dell Mibbler was shocked upon seeing him alive and well. Mibbler led them to a safety deposit box, past Audrey Horne, who was chained to the vault door out of civil disobedience. Upon opening the box, a bomb planted by Eckhardt was triggered, killing Andrew and Pete.\nBehind the scenes\nAndrew Packard was played by Irish actor Dan O'Herlihy, who was one of three actors from the 1987 film RoboCop to appear in Twin Peaks, the other two being Ray Wise and Miguel Ferrer.\nTrivia\nAndrew has the distinction of being the only character in the original series to say the word \"shit.\" However, it was censored by the bomb in order to adhere to television regulations."}