{"name": "Andy_Brennan", "url": "https://twinpeaks.fandom.com/wiki/Andy_Brennan", "text": "Andy Brennan\n\"Andy\" redirects here. For the character of the same name from The Autobiography of Dale Cooper: My Life, My Tapes, see Andy (Bryn Mawr).\nAndy Brennan was a sheriff's deputy and a Bookhouse Boy in Twin Peaks. Andy was a bit slow on the uptake, even \"dimwitted,\" very sensitive, and tended to cry at murder scenes. However, he was very loyal and trustworthy, and was compared to a dog by Albert Rosenfield. \nAfter a lengthy on-and-off-again relationship with the station's receptionist, Lucy, he married her.\nBiography\nAndy was born to a large family with at least one younger sibling.\nIn mid-February 1989, upon hearing Harry's suggestion that they set a trap for Bernard Renault, who was coming in from Canada, Andy made a stray comment that he would be coming in on foot. After a long silence, Harry asked if he meant they would have a lot of trails to cover. Andy denied this, explaining he thought it would be a very long hike.\nLater, he and Harry were sitting in the interrogation room when Lucy Moran — Andy's on-and-off girlfriend — called them over the intercom to let Harry know Josie Packard heard a prowler outside her house. Harry left, telling Andy to monitor the radio for a call from Hawk. Andy heard Lucy screaming a few moments later (she was surprised by Sheriff Truman appearing in front of her), and ran out into the hallway, colliding with her as she was going back to make sure he was still there.\n \nWhen Pete Martell discovered a body wrapped in plastic on the morning of February 24, 1989, Andy was called to the scene to take pictures. He cried, but this was not the first time, as Sheriff Truman noted that the same thing happened \"last year in Mr. Blodgett's barn.\" He handed the camera to Doctor Will Hayward and was sent to get a stretcher as Hayward finished his job and they identified the body as homecoming queen Laura Palmer.\nLater, Andy sat with Deputy Hawk at the high school as they asked Laura's boyfriend, Bobby Briggs about his whereabouts until Sheriff Truman arrived and informed him of Laura's death. Truman then had Andy assist Bobby to make a phone call to his parents to contact their lawyer.\nLater, Andy went with the sheriff to the Palmer home, where Truman questioned Sarah Palmer about Laura and Hawk searched for possible evidence. While there, they received a call from Lucy that a mill worker named Janek Pulaski reported his daughter, Ronette missing.\nAndy, along with other deputies, found a train car where the murder took place. He called Lucy in tears, requesting her to tell Harry that he did not cry.\nWhen James Hurley was arrested, he and Hawk took him to his cell.\nAndy had breakfast the next morning, watching two men weld when FBI Special Agent Dale Cooper arrived at the sheriff's station.\n \nThe following morning, Andy helped Agent Cooper set up a demonstration he had prepared for the investigation, which he derived from a dream about Tibet and used it to determine which individuals bearing the initial 'J' could be involved with the Laura Palmer case. Cooper had Andy stand near a bottle as he threw rocks at it. The rock for Doctor Lawrence Jacoby knocked the bottle down, but did not break it. Andy put it back into place. He was then hit in the head when the rock for Shelly Johnson was thrown. The bottle then broke when the rock for Leo Johnson was thrown.\nAndy contacted Sheriff Truman the next day, informing him that a fight had broken out between Doctor Hayward and FBI Agent Albert Rosenfield at the morgue concerning whether Laura's body would be released for the funeral or kept for more tests. When it became physical, he was helped by the present Benjamin Horne to restrain them. The argument became physical once more before Sheriff Truman arrived with Agent Cooper. Truman punched Albert and Cooper ordered the body be released, taking Hayward's side.\nAndy later came to inform Sheriff Truman and Cooper when it was time for Laura's funeral.\nThe following morning, Andy sketched a gray-haired man that Sarah Palmer saw in a vision and he returned to the sheriff's station with Harry, who went to the conference to meet Cooper and Doctor Jacoby. Andy then asked Lucy why he could not spend the previous night with her, but she ignored the question, instead asking him if he would be having coffee.\nAfter Jacoby left, Andy went to the conference room and showed the finished sketch to Cooper and Truman. Cooper said that he had seen this man in a dream he had. A call was then received from Hawk, who had seen a one-armed man that was wanted for questioning.\nAndy went with Cooper and Truman to the Timber Falls Motel, where the one-armed man, Gerard was staying. When they approached the room, Andy drew his gun but dropped it, making it go off. Truman sent him away as he and Cooper kicked in the door.\nHe looked around Gerard's hotel room and found his sample case of right shoes.\nWhen they went to the Lydecker Veterinary Clinic, Cooper asked Andy to go to the nearby convenience store to pick up twine, bringing him Finley's Fine Twine.\nThey brought back files from the clinic and he apologized for what happened with his gun. He was told by Harry to meet in the pistol range, and on the way he saw Lucy, who brushed him off. Cooper asked him about his situation with Lucy, and he said he did not know why she would not talk to him. He then practiced shooting, but was told that he needed practice.\nAs he looked through the files with Harry and Cooper, Cooper's supervisor, Gordon Cole called, saying that the bird they were looking for was either a parrot or myna bird. Andy then found a file on a myna bird named Waldo owned by Jacques Renault.\nThe next morning, Andy assisted Sheriff Truman's investigation in Jacques's apartment and was ordered to get donuts for Agent Cooper, which he brought with a cup of coffee.\nHe then went to the Johnson home and spoke to Shelly, asking about Leo's whereabouts. She told him that she overheard an argument about Laura between Leo and Jacques. He told her to call the sheriff's department whenever Leo got in touch with her then left.\nAndy entered the sheriff's station and went to Lucy, who still did not want to talk to him.\nWhen a gunshot rang out in the conference room, he went in with the other lawmen to find that Waldo had been shot.\nAndy sits with Sheriff Truman on a stakeout later that night, awaiting Jacques to cross the border. Harry asked him about his situation with Lucy, which had not improved. Jacques soon arrived and they arrest him, but he put up a fight. He disarmed an officer and nearly shot Sheriff Truman, but Andy managed to calmly shoot him in the arm.\nLater at the sheriff's station, he stood with Hawk, Ed Hurley, and some other lawmen as they discussed his heroic actions earlier in the evening. Lucy listened in and went to the kitchen area. The other men encouraged him to follow her and he did, closing the divider behind him. He and Lucy kissed until she announced she was pregnant and Andy left.\nLater in the evening, after finding Leo shot in his own living room, Andy tried to call Agent Cooper.\nAfter Cooper's line was hung up, he went with Truman and Hawk to the special agent's room at the Great Northern Hotel, where they found him on the floor, bleeding from a gunshot wound.\n \nWhen Albert Rosenfield returned to Twin Peaks and came to Leo Johnson's home, Andy called out to Sheriff Truman, calling Albert \"Agent Rosenflower.\" As he ran inside to warn Truman, he stepped on a loose board, which smacked him in the face. Harry found that this had revealed a hidden pair of boots and cocaine and praised Andy.\nBack at the station, Andy went to Agent Cooper and informed him that Leo had been imprisoned in Hungry Horse, Montana on February 9, 1988, which Albert noted to be the night Teresa Banks was murdered. This lessened Leo's status as a suspect in Laura's murder.\nAgent Cooper later had Andy and Lucy search copies of Flesh World for a picture of Teresa Banks.\nHe sat in the conference room later as Agent Cooper went over the events that occurred the night Laura died. He cried while looking at a photo of Laura. Albert mocked him, which upset him further. Then calling him \"Albert Rozerfeld,\" he stood up to defend the Sheriff against the FBI Agent's verbal attacks, then left.\nAndy struggled with tape as he hung a poster of \"BOB\" in the Double R Diner the next day.\nLater, he paced outside of the sheriff's station before mustering up the courage to go in and talk to Lucy. After a small struggle for her to listen to him, he revealed to her that he was sterile and wished to know how she was having a baby. Lucy leaned closer to him, which he assumed to be for a kiss, but she instead pulled a piece of tape off of his head and closed the window on him.\n \nA couple of days later, Andy confided in Doctor Hayward that he needed to have a sperm test done. Doc gave him a vial to use for his sample and went out to his car. On his way to the bathroom with an issue of Flesh World, Andy bumped into Lucy, who saw the magazine and their proximity to the bathroom and was disgusted with him.\nHe ran into another deputy and dropped his sample, which rolled under a chair. He chased after it and Cooper told him not to move. He asked Andy where he got his boots, which he said were from Phillip Gerard. He picked up his sample and left.\nHe later attempted to speak with Lucy, who was upset with catching him with the magazine. Cooper then arrived and dismisses him, and he watched through the window as the FBI man talked to Lucy.\nAndy later escorted Leland Palmer — arrested for the murder of Jacques Renault — past a room where Lucy cried and to the conference room, where Truman and Cooper were with Judge Clinton Sternwood. After the proceedings were delayed due to the absence of prosecutor Daryl Lodwick, Andy led Leland back to his cell.\nHe attended Leland's hearing the next day, making sketches of the proceedings.\nWith Lucy out of town to see her sister, Andy sat at the receptionist's desk and called for his sperm test results. He was informed that he had oligospermia at the time of his previous test, but no longer had it. Realizing what this meant, he declared, \"I'm a whole damn town!\"\nWhile going through sticky notes on the desk, he found a number written under \"Gwen and Larry,\" Lucy's sister and brother-in-law. He called the number but was shocked to find that it was for Adam's Abortion Clinic.\nTwo days later, Andy had coffee with Hawk, Cole, Cooper, and Phillip Gerard - now displaying a different personality: a spirit known as Mike - outside the receptionist's desk. Harry came to tell them that everything was ready for their trip up to the Great Northern.\nHe went with Cooper and Truman to the hotel, where he brought guests one-by-one to Mike to determine if they were the host of BOB, who was also a spirit. Mike had a seizure when Ben Horne entered the room.\nLater, he went to assist with the arrest of Ben Horne, who had been named a prime suspect in the murder of Laura Palmer.\nAndy entered the sheriff's station the next day, where he saw Lucy holding a baby, causing him to faint. Lucy held ice on his head as Gwen told him about how she used to pass out when she was pregnant. He attempted to tell Lucy about the results of his tests, but Gwen interrupted until they told her to shut up and she went away. He then revealed the results of his sperm test.\nWhile eating a crepe at the diner the next morning, he recited \"J'ai une âme solitaire,\" the suicide note of Harold Smith. Donna Hayward came over with James, the former asking what he meant by this and if he knew a Mrs. Tremond, but he said no and explained the suicide note. Following this, he went with Donna and Agent Cooper to Mrs. Tremond's house. He took Donna home after she read a once-missing page from Laura's diary.\nHe went to Lucy at the station, wishing to talk about their child. However, Lucy informed him that he may not be the father and that Dick Tremayne may be. Andy called Horne's Department Store and asked for Dick.\nLucy later sat him down in a room with Dick and she told them that she wanted full cooperation from both of them throughout her pregnancy.\nAndy overheard a conversation between Dick and Lucy concerning the baby a few days later. He intervened, stating that there should not be any fighting between them.\nAs Agent Cooper prepared to leave Twin Peaks, he expressed his admiration for Andy's bravery and his large heart. However, Cooper was stopped at the door by Special Agent Roger Hardy, who informed Cooper that he had been suspended from the FBI.\nAndy and Hawk went to Sheriff Truman's office the next day with a matching scarf and ascot for Dougie Milford and his wife-to-be Lana Budding.\nLater, as Dick arrived at the station, Andy left potted flowers at Lucy's desk. Dick introduced him to a young boy named Nicky, who he had temporarily adopted from Happy Helping Hand. Tremayne wished to go have a malted with Nicky and Lucy, but Andy told him that Lucy was helping set up for the Milford wedding at the Great Northern and offered to go with them instead.\n \nThey went to the diner, where Andy and Dick got pie while Nicky got the malted he was promised. Nicky blew whipped cream into Dick's face, which amused Andy. However, when he stood to get Dick a napkin, Nicky spun his stool, causing him to fall when he sat back down.\nHe later attended the Milford wedding, where he danced with Denise Bryson at the reception.\nThe next day, Andy introduced Dick to Nicky's case manager, Judy Swain, who explained to them that Nicky may have been traumatized by events such as his parents' deaths under mysterious circumstances. Sheriff Truman came in to get Andy, as there was an emergency at the Great Northern.\nAt the hotel, Dougie Milford had died of an apparent heart attack. After Mayor Milford came and wept over his brother, Andy escorted him out.\nDick came to the station and told Andy that he believed Nicky was the devil and killed his parents. He saw Lana Milford and was taken by her charms, just like the rest of the men present.\nAndy went to the station the following day, late for a meeting with Dick, as he was saving a cat from a tree. Dick told him that Nicky's records were sealed, but he came up with a plan to retrieve them, so they could find out what happened to the boy's parents.\nThey broke into the Happy Helping Hand's files and found the one belonging to Nicky. A couple identifying themselves as the Brunstons entered, eager to see a little boy named Donnie.\nAndy was later called in as backup at the Dead Dog Farm, where Cooper was being held hostage by Jean Renault.\nAfter a body was found later at night in Sheriff Truman's office, Cooper had Andy look for fingerprints on a chess pawn found in the dead man's mouth.\nAndy told Lucy the next day that Little Nicky murdered his parents when he was 6 years old. Lucy said she did not believe him and did not find he or to be Dick suitable fathers.\nHe retrieved Truman and Cooper and took them to the conference room, where Doctor Jacoby waited with Lana Milford. After Jacoby told them that Lana is not cursed, but possessed a high sexual drive, they left to go bowling, but were confronted by Mayor Milford with a rifle. Cooper had the mayor and Lana settle their differences alone as the rest of the men waited outside. The agent soon gave the order to enter the room, where Lana was kissing Dwayne, who announced their plan to adopt a child.\nLater in the evening, Doctor Hayward ordered Andy, Lucy, and Dick together for a meeting concerning Nicky. Hayward dismissed the accusations about Nicky being a murderer. He explained that Nicky was conceived by a rape and that his mother died in childbirth and that his adoptive parents died in a car accident.\nThe next day, Andy played a game of chess against Lucy, who was frustrated when he moved one of his knights without doing the \"little hook thing,\" as he believed it was optional. However, Pete corrected him.\nLater, he kept watch on Harry, who was drunkenly tearing up the Bookhouse, following the death of his beloved Josie Packard.\nIn the evening, Andy appeared as a model for the Stop Ghostwood campaign's fashion show. After the endangered weasel was presented, it bit Dick's nose and became loose, causing a panic among the attendees.\nAndy dropped through the ceiling at the station the next day in front of Lucy's desk, practicing his spelunking skills for the department's excursion to Owl Cave. He gave her his word that he would be careful.\nAt the cave, the men found the symbol Cooper came to find, but then owls swooped over them. Andy swung his pickaxe and it became stuck in the cave wall, which then caused part of the wall to be pushed out, revealing a petroglyph.\nThe men return to the cave a few days later, where someone else had been - Windom Earle, Cooper's insane former partner. Cooper had Andy draw the petroglyph.\nBack at the station, Andy again drew the petroglyph onto the conference room's blackboard, with Major Garland Briggs correcting one of the lines.\nHe later attended Dick's wine-tasting event with Lucy and displayed his knowledge of fine wines. However, he swallowed the wine instead of spitting it out.\nLater in the evening, he was called to a crime scene where a large wooden box had been found. He brought his metal detector in case it was a bomb, but it was revealed to contain a large pawn with a dead youth inside. Andy cried as a friend of the victim told the lawmen about him.\nWhen he went back to the station, Lucy asked for his help on her speech for the Miss Twin Peaks Contest and also revealed that in 24 hours, she would reveal who would act as the father of her baby, regardless of its biological parentage.\nLater, he, Cooper, and Truman tried to decipher the petroglyph. Briggs had yet to arrive, so Harry had Andy call his home.\nAndy studied the petroglyph the next day, soon discovering that it was a map and his attempts to tell Agent Cooper were ignored. He accidentally knocked over a bonsai plant in the room, revealing that it had a microphone planted in it by Earle.\nHe followed Cooper and Truman to the Miss Twin Peaks Contest, still trying to get the former's attention, but he arrived as Lana Milford began her talent - an exotic dance - and was mesmerized.\nAfter the speeches, Lucy pulled Andy and Dick aside to announce to them that she had chosen Andy to be the father of her child. Dick congratulated him and Andy expressed his excitement of being a father, but then excused himself to find Agent Cooper.\nAmid the chaos following Annie Blackburn's win, Andy managed to find Cooper and told him that the petroglyph was a map.\nBack at the station, Andy asked Lucy if she was scared, and she stated her worry that they may become stuck in an elevator at the hospital when she was in labor with their child. Andy declared that if this happened, he would help her deliver the baby in the elevator. They shared a kiss and said: \"I love you.\"\nAndy went to Glastonbury Grove to Sheriff Truman, who was waiting for Cooper to return from the Black Lodge. There they waited for ten hours until Andy went to get coffee and breakfast for the sheriff.\nLater life\nLucy's child, a boy, was born on Marlon Brando's birthday and, as a result, Andy fought to name him Marlon, but the name Wally was eventually decided upon. Andy and Lucy married at some point over the next twenty-five years and kept their jobs with the sheriff's department.\n \nHawk — by then promoted to Deputy Chief—called Andy and Lucy to the conference room, where he had brought boxes of files. He stated, per the Log Lady, that something from the files was missing and pertained to Agent Cooper, who had been missing since before Wally was born.\nUpon examination of the files, Andy and Lucy were still not sure what is missing. Lucy soon noticed that a chocolate bunny from the evidence was missing and admitted that she had eaten it. Andy asked Hawk if chocolate bunnies had anything to do with his heritage, but the deputy chief soon brought them to the conclusion that they were not looking for the bunny.\nAndy later reassured his wife when she had a scare due to her misunderstanding of cell phones. Soon after, their son came to the station to pay his respects for Harry and give his blessing for his parents to turn his room into a study.\nLater, while continuing to look through files, Andy asked Hawk if he had yet found any Indians.\nAndy later spoke to a local farmer about his truck that was involved in a hit-and-run incident that killed a young boy. The farmer refused to say who was driving and arranged to meet with Andy two hours later to explain. Andy waited for him at the discussed meeting place, but the farmer never showed.\nAndy and Lucy later shopped online for a chair, arguing over whether to get it in red or beige, Andy arguing for the former. However, he eventually decided to let Lucy have the decision her way.\nAfter arresting Deputy Broxford, Bobby led Andy, Frank, and Hawk to Jack Rabbit's Palace, following instructions left by his father. While in the woods, they came across a nude, eyeless woman. Andy held her hand and was transported through a portal, and was sat in front of a man who identified himself as the Fireman. He was shown a white figure regurgitating BOB, Woodsmen, a high school girl screaming, Laura Palmer, angels, the eyeless woman, two Coopers, a telephone, himself and Lucy, and a utility pole before being transported back out, carrying the woman. He told his fellow lawmen that she was important and wanted dead. They put the woman in a jail cell at the station and Lucy provided her with clothing.\nOn a later evening, Hawk called Andy, Lucy, and Bobby to the conference room with Frank to announce the death of the Log Lady.\nIn the station's parking lot, Andy encountered Cooper's doppelganger. Believing him to be the real Agent Cooper, he welcomed him into the station. As Cooper went with Frank to his office, Andy recalled the vision he had of himself and Lucy.\nAfter Andy escorted Cooper to Truman's office, he went looking for Hawk, only to reach the cell block, finding that Chad had escaped and armed himself. As Chad approached Andy, a gun trained on him and insulting him, Freddie punched open his cell door, incapacitating Chad. He secured Chad and heard a gunshot, deciding to bring the woman, Freddie, and James upstairs.\nLucy, holding a gun and standing before the body of Cooper's doppelganger, told Andy that she now understood cellular phones. After making sure both women were okay, Andy hurriedly left the room as it darkened, meeting the real Agent Cooper in the station entryway and leading him to the doppelganger.\nAndy witnessed BOB being pulled out of the doppelganger to be shattered by Freddie. Cooper told all those present that he hoped to see them again and advised them that some things would change, as the past dictated the future.\nRelationships\n\nLucy Moran\n \nDespite Lucy's boredom with Andy and the fact that she dated Dick, Andy is devoted to Lucy. Although he was initially shocked at Lucy's pregnancy announcement, he quickly accepts the responsibility to be the baby's father, regardless of who is biologically responsible. They marry and are still together 25 years later.\nDick Tremayne\nAndy and Dick's relationship starts as a rivalry, due to the love triangle with Lucy. The two men later formed a mutual respect through the process of proving their fatherhood capabilities to Lucy.\nDale Cooper\nAndy immediately finds a respect for Agent Cooper, who expresses his admiration for Andy's bravery and his large heart.\nSheriff Harry S. Truman\nHarry acts as a sort of \"older brother\" type to Andy, always gently expressing his annoyance with Andy's sensitive nature, but also knowing his value to the local law enforcement.\nDeputy Hawk\nAndy works closely with Hawk, and as a result, his fellow deputy becomes a sort of wingman to him in his relationship with Lucy, encouraging him to talk to her when she is alone and attempting to advise him with the Dick Tremayne situation.\nNon-canon appearances\n\nInternational Pilot\nThis section covers only the alternate ending in the International Pilot.\nAt Lucy's house, Andy plays trumpet while Lucy plays with a paddle-ball. Lucy gets a call from Leland Palmer, whose wife possibly saw Laura's killer.\nAndy goes to the hospital with Sheriff Truman, where Cooper comes to meet with a man who called him, Claiming to know who killed Teresa Banks a year ago.\nGeorgia Coffee Commercials\n\nLost\nWhen Cooper mentions to Ken that they should discuss a case over coffee, Andy and Lucy bring some in, but Cooper rejects this coffee for a can of Georgia Coffee, which he suggests to them.\nA Mystery of \"G\"\nAndy connects pins on a map of Twin Peaks and finds that it forms the letter 'G'.\nThe Rescue\nAndy travels with Cooper, Ken, and Hawk to the grove, where Cooper recovers Ken's wife, Asami, from the Black Lodge.\nSaturday Night Live sketch\n \nAndy (played by an uncredited Conan O'Brien) brings a handcuffed Leo Johnson to Agent Cooper's room at the Great Northern after Leo confesses to murdering Laura.\nEven after much evidence is shown to Cooper, he is unconvinced that Leo did it. Andy leaves with Leo and Sheriff Truman.\nBehind the scenes\nAndy is played by Harry Goaz, who reprised the role in the 2017 series.\nTrivia\nIn Twin Peaks: Access Guide to the Town, one of the players on the 1968 Twin Peaks High School football team is identified as Vince Brennan. It is unknown if there is any relation to Andy.\nHis favorite book is The World According to Garp by John Irving.\nIn the International Pilot, he was revealed as a trumpeter, albeit not a very good one.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}