{"name": "Annie_Blackburn", "url": "https://twinpeaks.fandom.com/wiki/Annie_Blackburn", "text": "Annie Blackburn\n\"Listen to me! I've been out of circulation so long I've completely forgotten the social niceties. I mean, you ask me how I am, I'm not really supposed to say how I am; I'm supposed to say, 'I'm fine, thanks! How are you?'\"\nAnnie Blackburn, born Annie Smith, was the illegitimate daughter of Marty Lindstrom and Vivian Smythe and, through Marty, the half-sister of Norma Jennings. After a troubled upbringing and a spell at a convent, Annie moved to Twin Peaks and started working at her sister's diner, where she began a relationship with the visiting Special Agent Dale Cooper.\nBiography\n\nEarly life\nAnnie was born in Yakima, Washington, the product of a years-long affair between Double R Diner founder Marty Lindstrom and Vivian Smythe, who managed Lindstrom's Weary Traveler motel. She grew up around the motel and, for over a decade, believed Marty was her visiting uncle. Annie learned the truth when Norma Jennings visited after learning about the affair from her own mother, Ilsa.\nSix weeks after Marty's death from heart disease, Vivian married Yakima beer distributor Roland Blackburn, who adopted Annie. The two immediately sent her to a Catholic boarding school a hundred miles to the east in Kennewick, Washington. Norma was her only visitor for the first year she was away.\nDuring Annie's holiday vacation in her junior year, an incident occurred one night at the Blackburn home. After inquiries on the matter, Tammy Preston believed that Roland attempted to sexually assault Annie after a night of heavy drinking, and was only stopped by Vivian's intervention. The same night, Roland left the house and drove his car into the Yakima River; he was reported dead on the scene. Annie attempted to commit suicide by taking several tranquilizers and cutting her own wrists; Vivian rushed her to a hospital, saving her life. She was committed to a psychiatric hospital in western Washington for six months after this incident.\nAfter being released, Annie returned to school and completed her final year, graduating with honors. During this time, she had a boyfriend, but the relationship ended poorly. Impulsively, against Norma's advice, Annie joined the convent at her school. She stayed there for five years before having second thoughts and leaving in early 1989. Norma agreed to give her a job at the diner she owned, the Double R.\nReturn to Twin Peaks\nAfter leaving the convent, Annie arrived in her hometown of Twin Peaks and went to the Double R Diner. There, she saw her sister, Norma, who introduced her to waitress Shelly Johnson.\nLater, she poured a coffee for FBI Special Agent Dale Cooper, who was an outsider but had become quite comfortable with the town. He approved of her coffee and she smiled.\nThe next day, Annie went to Agent Cooper and Sheriff Truman's table, where they observed through the window a chickadee on a Dodge Dart. Truman asked her what she suggested to cure a hangover, to which she responded, \"teetotaling and prayer.\" She poured them coffee and took their orders, getting along with Cooper quite well. He began telling her a joke about two penguins on an iceberg. However, she was called over by Shelly but came back for the punchline, which amused her. She then observed a drawing Dale had made on a napkin, telling him it was from Owl Cave.\nWhile cleaning up dishes, she found an advertisement for the Miss Twin Peaks Contest, which she did not want to enter. Shelly came in and asked her about her time in the convent compared to now, which she said was not much different aside from the convent's absence of men. She asked about Cooper in particular but denied being interested in him.\n \nIn the evening, Annie went to the bar at the Great Northern Hotel and ordered a rum and tonic, with Agent Cooper then approaching her. She expressed her fascination with people but then noticed that he saw a scar on her wrist. She said she was afraid that she would fail again like she had in the past, but was resistant to talk about it. He offered his help and she made up reasons for him not to pursue, but he persisted and she accepted his offer.\nCooper came to get donuts and coffee for the Sheriff's Department the next day, then also asked Annie if she would like to accompany him in a nature study, to which she agreed. He admitted that he would get \"a tingling sensation\" in his toes and stomach when he talked to her.\nLater, she went out on the lake with Cooper. Her ex-boyfriend was brought up, but she did not wish to talk about it, instead expressing her fears of returning to the real world. He told her he understood her pain, having felt the same before. They then shared a kiss.\nDale and Annie went back to the diner, where they joined Cooper's supervisor, Regional Bureau Chief Gordon Cole, and Shelly for pie.\nAs she wiped down the counter at the diner the following day, she crumpled up an advertisement for Miss Twin Peaks. Dale arrives and urged her to enter. She poured him coffee and noticed that something was bothering him. He said that he had been thinking about her all day, and Annie said that she had been thinking of him as well. He asked her to go dancing with him later that night and they kissed, which caused her to accidentally drop plates onto the floor.\n \nShe went to the Roadhouse, where Cooper met with her. Annie was reluctant to dance, but she finally did at his insistence. She expressed worry over dancing, but he easily showed her how to do so. She expressed that she wanted more than his kisses and was interrupted by Mayor Dwayne Milford attempting to speak into the microphone onstage. She then expressed her attraction to Cooper and they kissed, only to be interrupted by the Mayor again. She then decided to enter the Miss Twin Peaks Contest.\nThe next day, Norma made pies for the Contest and told Annie and Shelly that she expects to see one of them win. They teased her about which one of them she will vote for.\nLater in the morning, Tim Pinkle taught choreography to Annie and the rest of the women participating in Miss Twin Peaks.\nLater, she went to Dale's room at the Great Northern and he welcomed her in. She requested his help on her speech for the contest, concerning conservation of the forest. Talk of trees became a metaphor for her life and they then made love.\n \nAt the pageant, she made a speech, quoting Chief Seattle and moving the audience.\nAnnie won the title of Miss Twin Peaks. During the applause, the lights in the building shut off and then strobes were turned on. Smoke bombs were set off and she was taken from the stage by Windom Earle.\nThe Black Lodge\nEarle took Annie to Glastonbury Grove, commenting that he liked the fear she had. He took her to a circle of Sycamore trees, which seemingly hypnotized her, and he led her through red drapes - into the Black Lodge.\nIn the Lodge, she appeared to Cooper on the floor, bleeding. In another room, she appeared to him, saying she \"saw the face of the man\" who killed her and that it was her husband. Caroline Earle then took her place. She appeared to him again, saying she was alive, then Laura Palmer took her place. She appeared to him once again, with Earle present, then disappeared.\nLater, Sheriff Truman discovered her at the grove with blood on her face and took her to the hospital, still alive but in shock.\nAnnie appeared to Laura Palmer in a dream bruised and bloodied to warn her of her death, but as the events were still to happen, Laura did not understand the message. Annie said, \"My name is Annie. I've been with Dale and Laura. The good Dale is in the Lodge, and he can't leave. Write it in your diary.\" When Laura looked back a few seconds later, Annie was gone.\n \nLater Annie was taken to the hospital, wearing the ring that Laura Palmer and Teresa Banks had worn on the nights they were killed. Her physical wounds were treated, but she was still in a trance. She repeated her message for Laura to the nurse attending to her (this time reversing the order of the names to \"Laura and Dale\"), though it was not clear if she knew who she was talking to. The nurse proceeded to steal Annie's ring, unaware of its importance.\nTrapped in the Black Lodge, Cooper asked the arm where the ring was. The man replied that \"someone else has it now,\" and silently confirmed Cooper's fears that it was Annie.\nCatatonia\nFollowing her return from Glastonbury Grove, Annie lapsed into a catatonic state, slowly regaining her health but seemingly unable to see or hear those around her. Two months later, Norma moved Annie back home to care for her personally. As Annie was now unable to carry out the civic duties befitting her new title of Miss Twin Peaks, the title instead went to the first runner-up, Lana Milford.\nExactly one year after she was found in the woods, Annie attempted to commit suicide and was rushed to the hospital. The next morning at 8:38 a.m., with no prior prompting by Norma or anyone else in the room, Annie said a single phrase: \"I'm fine.\"\nAnnie's condition did not improve, and Norma sadly found herself unable to continue to care for her. Her mother Vivian ignored all of Norma's entreaties for assistance in her care. Annie was eventually moved to a private psychiatric hospital in Spokane thanks to a community fundraiser. Benjamin Horne was one of the largest donors to this effort.\nThe diary entry Annie told Laura to write was found in late 2016, hidden inside a bathroom stall door at the Twin Peaks Sheriff's Department, along with several other torn-out pages.\nIn 2017, Special Agent Tammy Preston met with Annie personally while compiling a new dossier about the town of Twin Peaks. She noted that Annie had \"hardly aged a day\" and in general seemed uninterested in engaging in her surroundings, though she allowed herself to be fed with \"no interest in feeding herself.\" Every year, on the anniversary of her kidnapping, at exactly 8:38 in the morning, she would only say \"I'm fine.\" Preston expressed sadness and frustration at Annie's fate, noting the doctors told her it was unlikely her condition would ever change or improve.\nBehind the scenes\nAnnie is played by American actress Heather Graham. Annie was originally added to the show to take Audrey Horne's planned role as Agent Cooper's love interest. Kyle MacLachlan objected to the idea of Cooper having a romance with a high school student, so the character of Annie was written, as well as John Justice Wheeler, who became Audrey's love interest. Rumors persist that Lara Flynn Boyle (MacLachlan's partner at the time) had some influence on this decision, as she allegedly did not get along with Sherilyn Fenn.\nIn the shooting scripts of episodes 24 through 29 and on the laser disc jackets, her name is \"Annie Blackburne\" but the spelling \"Blackburn\" has been adopted since at least Twin Peaks: Fire Walk with Me's shooting script.\nLynch confirmed that Laura wrote down what Annie said to her although the movie shooting script says that Annie tried to get through to the nurse instead.\nHarley Peyton clarified that, at least when originally conceived, Annie was a real person and not an agent of the Black or White Lodge.\nGraham was not asked to reprise her role in Twin Peaks: The Return, though she would have been happy to return and work with Lynch again."}