{"name": "Audrey_Horne", "url": "https://twinpeaks.fandom.com/wiki/Audrey_Horne", "text": "Audrey Horne\n\"I like you very much. You're beautiful, intelligent, desirable. You're everything a man wants in his life. But what you need right now, more than anything else, is a friend. Someone who will listen.\"\n ―Dale Cooper\nAudrey Horne was the daughter of wealthy businessman Benjamin Horne, who neglected her in favor of Laura Palmer. Following Laura's murder, Audrey became enamored with FBI Special Agent Dale Cooper and tried to assist in his investigation.\nBiography\n\nEarly life\nOne Thanksgiving morning, Audrey, as a toddler, pushed her nine-year-old brother Johnny down the stairs.\nMurder of Laura Palmer\nOn the morning of February 24, 1989, Audrey left her home at the Great Northern Hotel and was driven to Twin Peaks High School. After arriving, she changed out of her saddle shoes into a pair of red heels whilst smoking a cigarette at her locker, observed by Donna Hayward. She then went to class, where she sat in the front row. A deputy came in and spoke to the teacher, who said there would be an announcement of the death of Laura Palmer, which Audrey listened to.\nLater, Audrey sat at the Great Northern concierge desk, where she stuck a pencil into a Styrofoam cup of coffee and overheard orders to not tell the attendants at her father's meeting with Norwegians about Laura's death, for it would ruin the deal Mr. Horne was trying to come to with them. She pulled the pencil out, getting coffee all over the concierge's papers. She went into the meeting and told the Norwegians that her friend Laura was found naked and had been murdered.\n \nShe giggled as the Norwegians left and her father begged them to come back. She later sat with her mother as her brother Johnny hit his head against a dollhouse because Laura—his tutor—was not present.\nThe next morning, she observed FBI Special Agent Dale Cooper as he drank his coffee and they introduced themselves to each other as he allowed her to sit with him. She told him her connection with Laura Palmer through her brother, Johnny. Forming a crush on the special agent, she asked him more questions.\nAudrey later stood in her father's office, dancing in place when he came in to turn off her music. He then asked her if she had anything to do with the Norwegians leaving, which she admitted to. He threatened her if she ever did something like this again and left.\nAudrey silently had dinner with her family until her uncle Jerry arrived.\nShe went to the Double R Diner for a cup of coffee the next morning and was joined by Donna and they discussed Laura as well as her crush on Agent Cooper. Audrey also asked if Laura ever talked about her father and she got up and began dancing in place to the music she played on the jukebox.\nAudrey went to meet Agent Cooper at breakfast again the following day, calling him \"Colonel.\" He had her write her name for him and he presented a note she delivered to his room saying \"Jack with one eye,\" referring to One Eyed Jacks, a casino and brothel across the Canadian border. She revealed to him that Laura worked at the perfume counter at Horne's Department Store. Cooper then asked her to leave, as he had police business to deal with.\nShe later listened to her parents argue over Johnny, then went into a hidden closet where she watched Doctor Lawrence Jacoby coax Johnny into removing his headdress for Laura's funeral.\nAudrey went into the bathroom at school the next day, where Donna was doing her makeup. She revealed what she learned about Laura's secrets, including that she had been seeing Doctor Jacoby, which had been unknown to Donna. She also supposed that Laura worked at One Eyed Jacks.\nShe went to her father and asked him if he was ashamed of her and asked him his plans for the family business when he needed someone to take over. She asked him for a job at the department store and when Ben took a call, she left.\nAudrey went to see a tired Cooper at breakfast the next morning, telling him she had gotten a job and wanted to help him on the investigation, but he interrupted her, saying he only had time for coffee.\nShe went to Horne's Department Store to discuss her job with Emory Battis, who stated that her father suggested she work in the wrapping department, but she insisted on being put on the perfume counter and threatened him. They made a deal for him to say she was working in the wrapping department while she was actually in perfume.\nAudrey went to a party held for her father's Icelandic potential business partners and went to spy on a meeting between her father and Catherine Martell regarding a poker chip the latter found from One Eyed Jacks. Catherine smacked Ben and then they kissed, discussing a plan to burn down the Packard Sawmill.\nShe then tearfully watched as Leland Palmer had a breakdown and was mocked through dance by nearly everyone else in attendance.\nAudrey went to Agent Cooper's room and when he came in, she begged him to let her stay. Cooper sat down on the bed and told Audrey that he could not allow himself to become romantically involved, and what she needed more than anything was a friend. He offered to talk about her troubles over malts and fries.\nSylvia held Audrey responsible for her brother Johnny's disability in a bitter speech that obviously upsets Audrey greatly. However, Dr. Jacoby insisted that Johnny's condition was self-induced: a retreat to childhood as a result of an unknown emotional trauma.\nAudrey later dealt with a customer at the department store and overheard Emory wishing to speak with another employee named Jenny in his office. Audrey told Jenny she was going to the restroom, but went to Battis' office, distracting a nearby employee by telling him there was a bus accident outside. She took a cigarette from Battis' desk and hid in his closet as he brought in Jenny. Audrey spied on them, Battis giving Jenny a unicorn trinket and offering her a full-time position at One Eyed Jacks. He gave her a number for a \"Black Rose.\" When they left, Audrey stepped out and found a book on Battis' desk containing Ronette Pulaski's name and she took the unicorn.\nAs Jenny left from work, Audrey convinced her that she would be working as a hostess at One Eyed Jacks and showed the stolen unicorn as her own, and said that she lost the number for \"Black Rose,\" which Jenny provided to her.\nAudrey later had the front desk at the Great Northern leave an urgent message for Agent Cooper, then slipped a note under his door as she left the hotel.\n \nShe went to One Eyed Jacks, where she was introduced to Blackie O'Reilly and used the alias Hester Prynne, but her resume was soon found to be bogus. To prove that she deserved a position at the brothel, she tied a cherry stem in a knot with her mouth.\nAudrey entered Blackie's office in her lingerie she had been given. She approached her desk and saw camera feed of Agent Cooper at a blackjack table. Blackie then said that it would be a good night for her to be \"broken in\" by the owner of One Eyed Jacks, who Blackie did not name.\nShe waited in her room for the owner to arrive and was shocked to discover his identity - her own father.\nShe hid behind her bed curtains as Ben tried to get in, and she swatted at his hands, suggesting that he leave. He pretended to leave by opening and closing the door, then he burst through her bed curtains after she had covered herself with her blanket and found a mask. Jerry then interrupted and Ben left.\nAudrey went to Blackie's office the following morning, asking why her room was locked, and Blackie noted that the owner was not happy with her performance the previous night.\nShe later called out to Cooper as a sort of prayer, hoping he got her note she left and admitted she was in over her head at One Eyed Jacks.\nThe next day, Audrey took an ice bucket to a room in the brothel where Emory Battis was tied up while another girl ran a vacuum cleaner. Convincing the other girl to leave by insisting she would finish the scene herself, Audrey unplugged the vacuum cleaner. She removed his blindfold and threatened to have him arrested if he did not reveal the connection between the perfume counter and One Eyed Jacks. He confirmed the owner to be her father and that he had recruited Ronette and Laura for the brothel, the latter being thrown out for using drugs. He also said that her father made sure he \"entertains\" all of the girls.\nShe tearfully called Agent Cooper, but Blackie hung up the phone.\nAudrey was tied up by Blackie while being filmed by Battis as she was sedated by heroin.\nShe later laid in bed as she was woken by a man named Jean who gave her English caramels.\nShe was later led to Jean, who she told that Emory had hit her. Jean also informed her that he spoke to her father and that she was in no danger. Battis attempted to further explain the situation to her, but he was shot dead by Jean. This caused her to cry and he held her.\nLater, Audrey was tied up, asleep. She heard Cooper's voice and wakes up to him telling her he was there to get her out. He untied her and hoisted her over his shoulder. He escaped with her along with Sheriff Harry S. Truman and Deputy Hawk, the latter of whom ambushed an armed guard to save them.\nShe was taken to the Bookhouse and seemed to have a nightmare until she was awoken by Cooper.\nHer father later arrived to see her, saying he was thankful that she was alive, but she was skeptical. She wished to have Agent Cooper take her home, but her father suggested they all three went together.\nThe next day, in her father's office, she informed him that she was aware of his connection to One Eyed Jacks. She also got him to admit that he had slept with Laura during her time working there, but he denied killing her, declaring that he loved her.\nAudrey went to the sheriff's station, where she told her special agent about her father's relationship with Laura, which surprised him. She was told to go home and not say a word about the subject to anyone.\nAudrey visited Agent Cooper the next day, asking about her father and his possible guilt. She revealed her strained relationship with him, that all she ever wanted from him was to love her. However, Cooper got a desperate phone call and told her to go to her room and lock the door.\nFollowing the funeral of Leland Palmer, Audrey attended the reception. Leland had been arrested for Laura's murder and died in custody.\nBusiness endeavors\nShe later went to Cooper's room at the Great Northern, where he was packing to go fishing with Major Garland Briggs. He also stated that he would be leaving town and once again stated his policy of why he could not pursue a relationship with her. He explained the origin of this to be a lover of his who was murdered on his and his partner Windom Earle's watch.\nAudrey approached Bobby Briggs, who stood outside of her father's office, wishing to speak to him about a job. She got him permission to meet with her father, but he was immediately kicked out.\nThe next day, Audrey danced with Agent Cooper at the wedding reception for Dougie Milford and his new bride, Lana.\nThe following day, she saw Bobby, who was then on her father's payroll with an assignment. She proposed that they do business together, and he went to her father's office. She spied on them and saw that Ben was interested in Bobby having a full-time position.\nAudrey went to Agent Cooper and gave him stolen photos of a gathering between Hank Jennings and other men, objects that may \"save life.\" Denise Bryson then came, and Audrey was surprised to find that the DEA had female agents. She gave Dale a big kiss and leaves.\nAudrey saw a disheveled hotel employee leave from her father's office the next day. She went to investigate and found Ben in the middle of a miniature Civil War re-enactment. She called her uncle.\nBobby came out to her, commenting on her father's current state. She said that her uncle was coming along with Doctor Jacoby to help.\nShe made plans with Bobby the next day to break her father out of his current mental state.\nShe brought her uncle to Ben's office, Ben believing Jerry to be Jeb Stuart.\nThe following day, Jacoby told her that his experiment in letting Ben mingle with the public did not help his mental state, as he continued to believe he was General Lee. She and Jerry then made plans to develop projects in her father's stead. She went back to Jacoby and requested that he return Ben to the \"real world,\" to which he sais they should re-enact the surrender at Appomattox.\nDuring the re-enactment of the surrender, she played Scarlett McLean, the daughter of Wilmer McLean, who was played by Jerry. Jacoby soon arrived as General Grant and surrendered, despite the historical inaccuracy. Ben collapsed and came to, believing his Civil War to have been a dream.\nAudrey had an abrasive conversation with Randy at the concierge desk the next morning. After Randy left, a man approached the desk, having checked into the hotel. She mostly ignored him at first, but after looking at him, she tried to be more attentive. He noticed her name and asked her to send someone to the airport to retrieve his luggage that he did not have room for in the van he took to the hotel. He then told her about a picture he had of her when she was younger. He went and she opened a letter Randy delivered to her. Inside were torn pieces of paper along with a request for her presence at the Roadhouse later in the evening.\nLater, she attended a board meeting, which the man came to, introduced as John Justice \"Jack\" Wheeler. At the meeting, Ben presented his plan to work against Catherine's Ghostwood development plan, by calling to preserve the near-extinct Pine Weasel.\nThat evening, she had dinner with her father and Jack, who revealed the nature of his work, which would especially benefit the Hornes. However, she was resistant to his help, as she felt her family was well-off on its own. She soon excused herself for the Roadhouse. When she arrived, she found that Shelly Johnson and Donna were also there with adjoining pieces of the torn paper, forming a poem.\nThe next day, Audrey approached Dick Tremayne about the Stop Ghostwood campaign's fashion show to take place that evening. She then ran into Jack, apologizing for her behavior the previous evening. He then asked her out to a picnic, which she accepted.\nAt their picnic, Jack sang to Audrey, which she admired, as nobody had sung to her before. He also wondered if there was another man in her life, and she says there once was, but not anymore.\nAt the fashion show, Audrey readied the models. Subsequently, the pine weasel was presented and it bit Dick's nose before becoming loose, causing a panic among the crowd. Audrey got knocked over but was caught by Jack and they shared a kiss.\nShe brought Jack room service the next morning and she accepted his offer to take her for a flight and dinner.\nDonna later came to the hotel and asked Audrey if she knew why her mother was visiting Audrey's father, but Audrey did not have an answer, so she took Donna to her peephole.\nAudrey later went to the library to research civil disobedience, and she ran into a poetry teacher named Edward Perkins. She showed him the poem she received and he had her read it for him. Perkins commented that watching her while she read made her look like a queen.\n \nLater, her father expressed to her his realization that his family was much more important than he had ever made it out to be, and promised to become a better father and made her his business partner. He told her to pack her bags and go to the airport, as her flight left in an hour, a statement which confused her. Jack then entered, realizing this meant their plans were canceled, and she left.\nAudrey arrived back to the hotel two days later, where Deputy Hawk was waiting for her, saying she was urgently needed at the sheriff's station.\nAt the station, Cooper went over the poem received by Audrey, Donna, and Shelly. She told him about Edward Perkins at the library and Shelly then pointed out that the poem was in her husband Leo's handwriting, and Cooper advised the girls to check in with the Sheriff's Department twice a day.\nShe went back to the hotel, where her father welcomed her back. She asked about Jack, but her father instead named her as the spokesperson for Stop Ghostwood campaign. When she finally got through to him, he told her that Jack had left for Brazil due to an urgent matter, and gave her a letter Jack left for her. He said he left a few minutes before and she quickly left, getting a ride from Pete Martell to the airport.\nThey arrived at the airport just before Jack took off in his jet. She stopped him and he got out and kissed her. They stated that they loved each other and she told him she was a virgin, so they boarded his jet together.\nLater in the evening, Jack left and alongside Pete, Audrey tearfully watched him fly away. Pete told her that Jack would return one day. She mentioned that Jack had promised to take her fishing, and Pete mentioned that he had some tackle in his truck.\n \nShe sat by the fire in her father's office the next day. He came in with various religious texts, which he intended to use to learn about the meaning of goodness. When he noticed she was thinking about Jack, he comforted her by telling her time healed all wounds and promised that Jack was a man of his word and would return. She then reported to him that during her trip to Seattle, she discovered that the Packards were using Twin Peaks Savings and Loan to funnel cash to the Ghostwood project. Ben then urged her to enter the Miss Twin Peaks Contest.\nHer impassioned speech at the contest was met with much applause later in the evening. After Annie Blackburn's win, chaos ensued.\nBank explosion\n \nAudrey went to Twin Peaks Savings and Loan the next day, where she chained herself to the vault door in protest of the bank's connection to the Ghostwood project. She asked bank clerk Dell Mibbler for water, which he brought to her. Andrew Packard and Pete arrived and entered the vault with Mibbler. Following a trail of clues left behind by Thomas Eckhardt, they opened a safety deposit box, which triggered a bomb. Both men were killed instantly, as was Mr. Mibbler.\nAudrey survived the explosion at the bank, apparently shielded from the blast by Pete in his final moments. She was taken to the hospital in critical condition and was taken to an intensive care unit when she slipped into a coma. Cooper was seen exiting the unit the following day. During her stay at the hospital, Ben Horne — having found a letter from Audrey that morning — was seen by her side almost constantly.\nLater life\nAudrey awoke from her coma three and a half weeks later, and two months after her release she discovered that she was pregnant. She refused all offers of financial help from her parents and moved into an apartment of her own, preparing to raise her child as a single mother, what she described in a letter as \"the most important role\" of her life. Her son, named Richard, was born nine months after her stay in the hospital, just after her nineteenth birthday.\nIn lieu of graduating from high school, Audrey completed her GED through independent study and took classes at a local community college, studying economics and business administration. She then opened a successful hair and beauty salon in Twin Peaks. With few friends outside her customers and employees, Audrey kept to herself and did not publicly comment, or apparently inquire, as to whom Richard's father might be, although she kept a framed photograph of Dale Cooper on her office wall. She raised Richard alone, with limited help from her mother Sylvia, and apparently refused to let him meet his grandfather Ben. In the 1990s, she briefly exchanged letters with Donna Hayward, their contents unknown.\nCirca 2000, after her son's tenth birthday, Audrey unexpectedly married her longtime accountant – possibly Charlie – in a private ceremony, seemingly motivated more by financial convenience than genuine affection. There were numerous accounts of public arguing, heavy drinking, and verbal abuse on Audrey's part. In 2012, Audrey suddenly closed her hair salon and disappeared from public view. A Horne family spokesperson declined to comment to Tammy Preston on the rumor that she had been remanded to a private care facility.\nSearching for Billy\nIn the following years, Audrey began having an affair with Billy. One night, she tried to persuade Charlie to accompany her to the Roadhouse to look for Billy, but for one reason or another they constantly failed to leave the house. Billy had been missing for at least two days, and Audrey had a dream in which he was bleeding from his nose and mouth. Charlie complained that he had a great amount of paperwork and was too sleepy to go that night. In response, she berated him for failing to call Tina like she had asked and for not signing the papers she had given him. He was cowed into going along when Audrey threatened to have Paul pay him a visit.\nWhen Audrey mentioned that Chuck had told her Tina was the last person to see Billy, Charlie, surprised, told her that Chuck had stolen Billy's truck the previous week, but it had apparently been recovered without incident. Charlie called Tina to follow up on what she knew about Billy, and received some startling news. Afterward, he refused to divulge what Tina had told him, infuriating Audrey even more.\nNear-hysterical and having an existential crisis, Audrey demanded Charlie to tell her what Tina had told him. He reminded her that she wanted to go out to look for Billy, but she became indecisive, and said she wasn't sure who or where she was, that it was \"like Ghostwood here.\" Now, Charlie insisted that she must go to the Roadhouse, or he might need to end her story.\n\"What story is that, Charlie? Is is the story of the little girl who lived down the lane?\"\n ―Audrey Horne\nCharlie soon put on his coat so they could leave for the Roadhouse, but Audrey delayed them, commenting that Charlie seemed like a different person to her. Making good on his prior threat, Charlie took his coat off and announced his intention to stay in for the night. Audrey attacked Charlie, screaming that she hated him.\nAudrey and Charlie eventually reached the Roadhouse during Edward Severson's solo performance, where Charlie ordered them two martinis. Charlie toasted the two of them, but Audrey insisted on drinking to Billy instead. Suddenly, the MC announced \"Audrey's Dance,\" and the crowd cleared a space for her. Captivated by the music, Audrey danced for the crowd until a fight broke out, started by a jealous husband. She ran to Charlie, and implored to him: \"Get me out of here!\". As electricity buzzed, Audrey then found herself in an brightly-lit white room, dressed in a white hospital gown with disheveled hair, looking in terror at her own reflection in a mirror.\nIn the waiting room, the arm echoed Audrey's question about \"the little girl who lived down the lane\" while speaking to Dale Cooper.\nNon-canon appearances\n\nSaturday Night Live sketch\nAfter Leo Johnson confesses to Laura's murder, Audrey (played by Victoria Jackson) goes to Agent Cooper's room at the Great Northern. He asks her if she found any leads at the perfume counter, but she says she quit the job after Leo confessed. She gives him a present, tying a ribbon into a bow with her tongue.\nBehind the scenes\nAudrey is played by American actress Sherilyn Fenn, who reprised the role in the 2017 series.\nFor her performance as Audrey, Fenn was nominated for a Golden Globe for Best Supporting Actress in a Series, Miniseries or Television Film. Piper Laurie won the award for her performance as Catherine Martell.\nAccording to Fenn, Lynch's 2001 film Mulholland Drive was originally conceived as a spin-off centered on Audrey in which she goes to Hollywood to pursue an acting career.\nAngelo Badalamenti composed the leitmotifs Audrey's Dance, Audrey's Prayer, and Audrey for the character.\nTrivia\nThe reconciliation between Audrey and her father is not apparent in The Secret History of Twin Peaks, which states that Ben still had control of the Ghostwood project and Audrey was protesting him after writing a bitter letter.\nAudrey's alias at One Eyed Jacks, Hester Prynne, is the name of the protagonist of Nathaniel Hawthorne's The Scarlet Letter. This allusion is referenced when Blackie calls her out, remarking \"I read The Scarlett Letter in high school too, honey.\"\nWhen asked at a panel about Audrey's situation in the third season, David Lynch merely laughed and encouraged the audience and viewers in general to decide for themselves what happened to her. Though some media reports attributed a reference in The Final Dossier to a \"private care facility\" as confirmation of her current status, Mark Frost has also avoided giving a definitive answer as to her current situation.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}