{"name": "Bad_Binoculars", "url": "https://twinpeaks.fandom.com/wiki/Bad_Binoculars", "text": "Bad Binoculars\nBad Binoculars is the fifth short film of Impressions: A Journey Behind the Scenes of Twin Peaks.\nSynopsis\nI have been traveling for seventy days now, searching for the man with the gray elevated hair. Never staying in one place for more than one day. A woman is angry with a man in a sleeveless suit. She tells him of her grief. Again, he speaks words that I do not understand. Does he want her to say the things she says?\nDavid Lynch rehearses Audrey and Charlie's second scene together with Sherilyn Fenn and Clark Middleton. (\"Part 13\") Several times, Lynch whispers secret directions to Fenn, once right before her line about a \"little girl who lived down the lane.\" When asked about the missing red jacket Audrey put on earlier, Lynch says it doesn't matter, as this scene is happening at a \"completely different time.\"\nHigh above the water, we can see the reflections. A funny little man dressed like an elf comes into view. He has eaten the medicine that he made himself. Why was he not more careful?\nAt the hilly filming location for Richard Horne's death scene, a production truck drives past Riley Lynch giving the middle finger. David plans the shots of Richard and Mr. C approaching the hilltop with Scott Cameron. Lynch again greets David Patrick Kelly, and explains that since viewers last say Jerry Horne, he has wandered \"out and about\" very far without seeing people for a very long time. Kelly practices his reaction to his binoculars \"killing\" someone, refining the \"bad binoculars\" refrain and spitting on them.\nEndless buckets of energy along an iron rail. The strangeness continues to grow, all for the good of those involved. Order must be restored to a chaotic situation. A small piece of flesh looks ripped from her face, but why can she not see?\nDuring filming at the DirtFish Rally School (standing in for the Twin Peaks Sheriff's Department), Lynch angrily tells several crew members to clear the conference room for a rehearsal, later telling Peter Deming that they need to limit traffic in and out. He rehearses the scene between Hawk, Andy, and Lucy regarding a box of chocolate bunnies. (\"Part 3\")\nRuth De Jong shows Lynch photographs of the under-construction convenience store facade. Lynch approves and says their work is \"beautiful.\" Outside, Lynch looks at Naido's facial prosthetic with Debbie Zoller, asking them to add a dark brown-red blood effect to the stitches. Lynch says her makeup in the forest should match what she will have on in the mansion room scenes.\nLynch walks through the scene of Doris Truman shouting down the hallway at Frank. (\"Part 6\") Candy Clark notices they are being filmed, but Lynch assures her that Jason is a \"good guy\" working on behind-the-scenes material. He directs several more scenes for the sheriff's department, including Bobby's first appearance and the nighttime case file review. (\"Part 4\") Robert Forster asks for clarification about Bobby and Laura's relationship and the late Major Briggs. Lynch tells him that Frank probably knew Briggs at one point, while Harry certainly did; a \"lot of spokes\" come from that hub. Later, Lynch provides Margaret Lanterman's dialogue for her phone conversation with Truman and Deputy Hawk. (\"Part 11\")\nAfter the end of filming at DirtFish, employee Eugean Thompson shows Lynch an old aerial photograph of the Snoqualmie Valley. Lynch recalls seeing the nearby lumber mill in action when they filmed the pilot. He thanks Eugean for opening the school to the production, and says it's very sad to leave.\nLOS ANGELES\nLynch, Sabrina S. Sutherland, and several other crew members laugh upon seeing Jay Aaseng in preliminary prosthetics to play the jail cell drunk. Lynch greets Harry Goaz, Kimmy Robertson, and John Pirruccello for the jail cell scenes, directing each to their initial marks for rehearsal. He then directs Nae Yuuki on Naido's attitude in the jail cell, likening her motions to a \"praying mantis.\"\nFollowing filming on the jail set, Lynch gathers Robertson, Dana Ashbrook and Michael Horse and announces over the megaphone that their \"dear friends\" Hawk, Lucy, and Bobby have wrapped. All three thank him and the entire crew; Horse says it was an honor to be part of Lynch's creative process. He then jokes that \"once we take our land back,\" he will make sure that everyone in the crew receives a green card.\nPeople featured\nJay Aaseng\nEric Amundsen\nDana Ashbrook\nGeorge Billinger\nScott Cameron\nCandy Clark\nTim Collins\nRuth De Jong\nPeter Deming\nDavid Eubank\nIme N. Etuk\nEamon Farren\nSherilyn Fenn\nRobert Forster\nCori Glazer\nHarry Goaz\nJames Grixoni\nMichael Horse\nDavid Patrick Kelly\nR. Scott Lawrence\nDavid Lynch\nRiley Lynch\nKyle MacLachlan\nJames Marshall\nFlorencia Martin\nClark Middleton\nJohn Pirruccello\nKimmy Robertson\nSabrina S. Sutherland\nJodee Thelen\nEugean Thompson\nJake Wardle\nNae Yuuki\nDebbie Zoller\nCredits\nSee: Impressions: A Journey Behind the Scenes of Twin Peaks § Credits\nMusic\n\"Cloud Bags\"\n\"Inflated Question\"\n\"Zapped\"\n\"Late Backe\"\n\"Zu Dallas Atmos\"\n\"Bli\"\n\"Juliju Song\"\n\"Crying Long\"\n\"NordBanhoff\"\n\"Pickled Piper\"\n\"Slab Stalks\"\nAttribution\n↑ 1.0 1.1 1.2 1.3 1.4 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers and Ann-Kristin Mayr and Jason Denner\nProduced by Josef Maria Schäfers\n↑ 2.0 2.1 2.2 2.3 2.4 2.5 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers\nProduced by Josef Maria Schäfers\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}