{"name": "Becky_Burnett", "url": "https://twinpeaks.fandom.com/wiki/Becky_Burnett", "text": "Becky Burnett\nRebecca McCauley \"Becky\" Burnett (née Briggs) was the daughter of Bobby and Shelly Briggs.\nBiography\nBy 2016, Becky worked at Sweet Loaf bakery owned by Norma Jennings and had made a habit of asking her mother Shelly for money to support both her and her husband, Steven. She did this one day upon delivering bread to the Double R Diner, this being the third time in two weeks. She went out to Steven, who gave her a drug and promised her dinner.\nSteven later verbally abused and physically threatened Becky over financial matters and cleanliness of their trailer.\nShe later received a phone call concerning Steven's affair with Gersten Hayward. In hysterics, Becky called her mother to borrow her car. When Shelly arrived at the trailer park, Becky snatched the car keys, locked the doors and started driving off, with Shelly leaping onto the hood and holding on until she was flung off. Becky drove to Gersten's apartment building, armed with a pistol. After being told that Steven and Gersten had left, Becky shot the apartment door in a rage.\nBecky later met with her parents at the diner, discussing her situation with Steven. Despite Becky saying she hated Steven and wanted out of their marriage, she also said she loved him and was reluctant to leave him. Bobby's position as a deputy spared Becky any jail time but Bobby and Shelly insisted Becky pay for the damages to Gersten's apartment. Becky said she has no money, since Steven spent all the money Shelly ever gave them. Bobby offered to pay for the damages but told Becky she has to pay him back and make it right. Bobby assured Becky that if Steven ever abused her or broke the law, he would bring him down. Shelly cried and expressed her fear of not wanting to lose her daughter and, with silent prodding from Norma, Becky profusely apologized to Shelly for causing her to fly off the car windshield. They embraced and Shelly insisted that Becky stay with her for the night. Though Becky shared an emotional moment with her mother, she and Bobby showed clear misgivings moments later when they saw Shelly run off and embrace Red.\nAfter Steven was absent for two days, Becky worriedly called her mother, who invited her to the diner for pie.\nAs of September 2017, Becky was free of legal troubles. Steven, who had since gone missing, had an outstanding warrant for his involvement in a local drug smuggling operation involving ex-Deputy Chad Broxford and Richard Horne.\nBehind the scenes\nAlthough \"Part 15\" possibly implies that Steven shot Becky, this is not the opinion of co-creator Mark Frost. Frost states, \"Steven did not kill Becky.\" Frost briefly writes of Becky's post-series fate in The Final Dossier."}