{"name": "Benjamin_Horne", "url": "https://twinpeaks.fandom.com/wiki/Benjamin_Horne", "text": "Benjamin Horne\n\"Someday I'm gonna tell the world about Ben Horne. I'm gonna tell them who Ben Horne really is.\"\n ―Laura Palmer\nBenjamin Joseph Horne, CEO of Horne Industries, Inc. and owner of the Great Northern Hotel was the richest citizen of Twin Peaks. He expressed his love for Laura Palmer over his own daughter, Audrey, ultimately leading to suspicion in Laura's murder.\nBiography\n\nEarly life\nHorne was born on August 4, 1940 to J.J. Horne, who was the son of Orville Horne and grandson of Danville Horne.\n \nAt some point in his childhood, Ben was present with his family at the groundbreaking for the Great Northern Hotel and, with his brother, watched Louise Dombrowski dance in their room with a flashlight.\nAt some point in his childhood, Ben's father bought him a secondhand Schwinn bicycle that he would grow to have fond memories of despite its imperfections.\nHe was the student manager of the Twin Peaks High School football team of 1968.\nBen attended Stanford University, where he was President of Sigma Alpha Epsilon.\nHe married a woman named Sylvia, with whom he had a son, Johnny, and a daughter, Audrey. He inherited the family businesses of Horne's Department Store and the Great Northern Hotel.\nIn the early 1970s, Horne had an affair with Eileen Hayward, which possibly resulted in the birth of Donna Hayward.\nSometime around 1984, he purchased the casino and brothel One Eyed Jacks. There, he would \"break in\" girls who had been hired, often from the perfume department at Horne's Department Store, which was run by Emory Battis. Among the girls was Laura Palmer, daughter of his chief counsel, Leland Palmer. During Laura's childhood, he had treated her with more care than his own children, and when she was hired for a brief period at One Eyed Jacks, he slept with her.\nOn the night of February 23, 1989, Ben was with Catherine Martell, whom he had been having an affair with to seize the land on which the Packard Sawmill stood, in order to proceed with the Ghostwood Development Project.\nMurder of Laura Palmer\nThe next morning, Ben spat into a fireplace at the Great Northern Hotel, speaking to Leland Palmer about papers for foreign businessmen to invest in his country club he planned to build on the land where the Packard Sawmill stood. Leland pointed out that they had not yet acquired the land, but Ben insisted that the mill would be through within a year. The charismatic Horne then led a conference with Norwegian businessmen, concerning the Ghostwood estate. Leland received a call from his wife and excused himself while Ben continued the conference. They reached a point where they needed Leland back, but Ben found him sobbing and gripping Sheriff Harry S. Truman's jacket, announcing that his daughter, Laura Palmer, was dead.\nLater, Horne's daughter, Audrey, told the Norwegians that her friend Laura was found murdered, which scared them away from the town, regardless of how much Ben begged them to return.\nHe later attended a conference held by FBI Special Agent Dale Cooper, who announced the Bureau's takeover of the Laura Palmer investigation due to its possible link to a murder that occurred the previous year.\nIn the evening, he was on the phone with Catherine Martell and they planned to meet.\nThe next day, he fixed his tie as Catherine laid under the covers. They discussed their plan to get rid of the mill for the Ghostwood project, and he suggested starting a fire at the mill as he kissed her feet, then removed his jacket and kissed her chest.\nHe later went to his office where his daughter danced in place. He turned off her music and questioned her about the Norwegians leaving the previous day. She told him she spoke to them about Laura being murdered, which may have caused them to leave. He threatened her to ensure she never did something like this again and left.\nBenjamin eats dinner with his family in silence the next day until his brother Jerry arrived from Paris, bringing sandwiches that Ben highly approved of. He left the dining room with him and told him about Laura's murder as well as the fact that the Norwegians had left. He also mentioned that there was a new girl at One Eyed Jacks—a brothel and casino he secretly owned—and that one of them was \"first in line.\"\nThey took a boat to One Eyed Jacks and after Jerry ordered them drinks, the madame Blackie O'Reilly brought out the girls. After Ben recited Shakespeare's Sonnet 18 to Blackie, the new girl came out and Jerry flipped a coin, Ben winning.\nBen was present at the morgue the following morning, observing Laura's body as a fight broke out between Doctor Will Hayward and FBI Agent Albert Rosenfield, Hayward believing Laura's body to be released for the funeral, while Albert wished to complete more tests on it. When the argument became physical, Ben restrained the two and took Hayward's side, despite the appreciation for Rosenfield's expertise. The situation became physical again before Agent Cooper and Sheriff Truman arrived. After Harry punched Albert, Cooper ordered that the body be released. Ben later attended Laura's funeral.\nBen met with Catherine the next day at the Timber Falls Motel. She told him about Josie finding the mill's fake ledger and where she had hidden the real one. They further discussed the plan to destroy the mill when they heard a gunshot outside. Ben then went to take a bath.\nLater, he used an exercise bike as he talks on the phone with a potential Icelandic business partner and Jerry. After he hung up, Audrey came in, asking if he was ashamed of her and she asked about the family business, wishing to run it when he was no longer able to and requested to have a job at his department store. When the phone rang, he had Audrey leave and arranged to meet with the caller - Leo Johnson. They met in the woods, Leo showing him the body of Bernard Renault, who Leo killed. They then came to an agreement to have Leo burn down the mill.\nBen lit a cigar in his office the following day as his brother came, announcing the arrival of the Icelandic businessmen, who were disturbing most of the hotel's guests. He discussed plans to get the men to sign the partnership, including a possible trip to One Eyed Jacks to convince them. Leland then showed up, wishing to occupy his mind by helping with the Icelandic businessmen, but Ben insisted he went home and rested, following doctor's orders.\nLater at a party for the Icelandic businessmen, he entertained a group of them until Catherine came and poured a drink on his shoe. They went to his office, where Catherine presented to him a poker chip from One Eyed Jacks that he dropped and she smacked him. They then kissed and agreed to give Josie one more chance to sell the mill. They went back out to the guests as Leland had a breakdown, tearfully dancing alone. Ben commanded Catherine to dance with Palmer. His brother came, confused, and Ben told him \"get Doctor Jacoby, a net and get out of my life.\" Ben went back to his office, where Josie waited for him and she presented the ledger she found hidden in his desk. They arranged to proceed with their business dealings the following night.\nThe following day, Horne was with a group of Icelanders with his brother, singing loudly, each with a beer in hand. He asked Jerry to send them to the dining room and asked when they were signing the contracts. Jerry said they would be ready once they went to One Eyed Jacks, so Ben sent his brother to round up the Icelanders for the trip, then called Josie, saying they needed Catherine to be at the mill.\nThe trip to One Eyed Jacks with the Icelanders convinced Einar Thorson to sign the agreement for the Ghostwood project. Horne then received a call from Hank Jennings, who was set to take out Leo for Ben.\nHe completed signing the Ghostwood forms and expressed to Blackie that he wished to celebrate with the newest girl at the brothel. He went to her room and said, \"Close your eyes. This is such stuff that dreams are made of,\" partially quoting Prospero from Shakespeare's The Tempest. The girl hid behind her bed curtains and swatted at his hands when he tried to enter. The girl insisted that he leave, and he tried to fool her by opening and closing the door before pulling back her bed curtains. He pulled back the sheet that covered her and she wore a mask. She continued to resist him until Jerry interrupted, informing him of a situation, prompting him to leave.\nLater, he spoke with Jerry, planning to find Catherine and receive a medical report on Leo Johnson. They are interrupted by Leland, who cheerfully sang, with his hair having turned white. Ben and Jerry danced along to the song Leland sang before Palmer announced to them that he was \"back and ready.\"\nBen and Jerry exited an elevator later and walk through the hotel, talking about a dessert. They both noted that Audrey had been absent. They went to Ben's office, where Hank waited in front of the fireplace. He told them about Josie leaving and Leo's status being in a coma. Hank also said that he believed Catherine to be dead in the rubble of the mill.\nThe next day, he sat with Jerry in front of the two Packard Sawmill ledgers, going over the rest of the plan to gain the land. Later, Ben called Sheriff Truman to inform him that Audrey had been missing for, at most, two days.\nJerry brought him an insurance policy for the mill, which was not signed by Catherine. He had Jerry call the Icelanders as Leland entered, informing them to call the businessmen, but found that they were already on it. Jerry gave the phone to Ben and he reached Einar. The Icelandic businessman voiced his worries about the recent fire at the mill, which Leland told him about. Upset with this, Ben suggested to Leland that he be given different responsibilities, specifically his tax return. Palmer then recognized a police sketch on an end table and left to tell Sheriff Truman. Ben told Jerry, \"Please kill Leland.\"\nHe was approached the next day by Agent Cooper, who told him that he was contacted by Audrey. Horne warned him about Audrey's charms and to avoid her. He also said that he would let him know if Audrey came home.\nAs Ben walked through the hotel the next morning, a desk clerk told him about the upcoming arrival of travel writer M.T. Wentz. Ben told her he wanted an hourly update. He went to his office, where Jean Renault waited. He was shown a video of Audrey in captivity, angering Horne. Renault made an offer to become his business partner and wanted Agent Cooper in exchange for Audrey.\nHe showed Cooper the tape of Audrey and planned to have him make a money exchange for her, per Renault's suggestion, though unknown to Cooper that his life was at stake. Later, Ben flirted with a couple of women at the Great Northern and bowed to a businessman.\nThe following morning, he attended the hearing of Leland, who had been charged with the murder of Jacques Renault and was released on bail until his trial.\nBen went to his office and was told that Mr. Tojamura had arrived, the businessman he bowed to the night before. Tojamura made an offer to him for the Ghostwood Project superior to what he had already received. Ben bowed to him and his assistant as they left, due to meet again soon. Hank then stuck his head in his office to warn him that Cooper was on his way. The agent arrived as a call was received from Jean Renault, who gave the instructions for the operation. Cooper instructed him to stay by a phone and left with the money. Ben then told Hank to follow him and retrieve Audrey and the money. He then proudly looked at the $5,000,000 check from Mr. Tojamura.\nThe next day, Cooper having been successful in his operation, he met with Ben at the Great Northern. Cooper told him about the events that occurred at the brothel and Ben played oblivious to it all, though he was surprised to hear of drug overdose his daughter had suffered. He was taken to Audrey and expressed a satisfaction that she was alive. After she said she wanted Cooper to take her home, Ben suggested they all went together.\nLater in his office, he gave Josie a glass of wine and they drank to the fire. She said she was there for the money he owed her, which he says would be paid at a later time. He warned her by telling her he had a dossier on her, including the true nature of her husband's death. She also revealed blackmail against him, putting them at a stalemate. He handed her Mr. Tojamura's $5,000,000 check and she left.\nHe brought Leland to his office, wishing to have him back at work while Jerry was on the road. He filled him in on the new business investors and Leland proposed a plan to get them on board, which pleased Horne.\nHe had dinner with Tojamura, who said he had received nothing from the deal despite giving Ben the check for $5,000,000. Tojamura threatened to withdraw from the deal and Leland began singing \"Getting to Know You.\"\nThe next morning, Ben walked quickly down a hallway at the hotel, puffing on a cigar. He reached the Timber Room to find a one-armed man with Cooper and the Sheriff's Department while having a seizure of sorts.\nIn his office, Audrey informed him that she was aware of his connection with One Eyed Jacks and that she was the new girl with whom he was interrupted. He admitted to her that he had owned the brothel for five years and slept with Laura during the time she worked there. When asked if he killed Laura, he said that he loved her.\nHe met with Mr. Tojamura and approved of his proposal. However, Sheriff Truman interrupted to bring him in for questioning in the murder of Laura Palmer. Ben tried to resist but was ultimately arrested.\n \nBen wiped down the bars in his cell, then brushed his teeth as his brother came and announced that he would be his lawyer. When Jerry asked about an alibi for the night of Laura's death, Ben said he was with Catherine, but they both knew this claim would not hold up due to Catherine's death in the mill fire. They then reminisced about when they were boys and Louise Dombrowski danced on the rug in their room with a flashlight.\nWhile being interrogated, he had blood drawn for a test, which Jerry claimed to be brutal treatment. When Agent Cooper revealed Jerry's spotty past as a lawyer, he quieted down and Ben was presented with Laura's diary, which made claims against him, stating \"Someday, I'm gonna tell the world about Ben Horne.\" After being angered, Ben and Jerry were left alone for a moment, and Jerry told him that he needs a better lawyer, due to the substantial amount of evidence pointing at Ben.\nPete Martell later came to his cell with a tape containing the voice of Catherine, who was apparently still alive. She playfully teased whether his alibi was reliable or not and said she would testify the truth if he signed over the mill and Ghostwood Estates to her. This angered Ben, who then tore up everything he could within the cell.\nThe one-armed man was taken to him, who rambles on about a \"BOB.\" Sheriff Truman then charged Ben with Laura's murder. He tried to attack Truman but was restrained by his brother.\nTojamura came to his cell with papers for the Ghostwood project. Horne told him that there were complications that had arisen, making him unable to sign. As he gave an impassioned rant on his innocence, Tojamura stuck his foot through the cell and Ben joyfully realized that Tojamura was actually Catherine. He kissed her foot and pleaded with her to testify for his alibi in exchange for signing over Ghostwood to her.\nBen was taken to the Roadhouse by Cooper and Rosenfield, where he ate peanuts. After the arrivals of Leo Johnson and Leland Palmer, Cooper announced that the killer was in the room and he would use \"magic\" to determine his identity. Ben was accompanied back the station with Leland as his attorney. However, while being taken to interrogation, Leland was instead pushed into the room by Cooper and Truman. Horne was subsequently released as Leland was thrown into a rage inside the room and subsequently died in custody.\nCivil War\nDays later, Horne had become profoundly depressed, due to losing Ghostwood and his arrest having an effect on business, despite his innocence. Bobby Briggs came to Ben's office to meet with him, leaving a tape and Horne had him taken out by his security.\n \nThe next day, Ben watched a home movie of the Great Northern's groundbreaking by his father, J.J. Horne when Ben was just a boy. He quoted Shakespeare's Richard III as he approached the screen, remembering his mother and the days of his youth. Hank then came through the door and Ben asked where he had been, to which he replied that he had had a busy schedule. Ben explained the previous few days, particularly about Catherine's interference in his work. Hank then revealed he no longer worked for Ben and that Jean Renault had taken over One Eyed Jacks. Hank left and Ben entertained himself with shadow puppets.\nBy the following day, Ben seemed to have had a sort of mental breakdown. As Bobby entered his office, Ben was crouched next to a stack of his furniture. He told Bobby he needed to have balance, distance, and symmetry. Bobby expressed an admiration for Ben, which was ignored as Ben admired his stack of furniture as a skyscraper. He then commanded Bobby to follow Hank.\nBobby later returned to Ben's office, where he had set up a miniature re-enactment of the Battle of Gettysburg. Bobby gave him pictures of Hank, which Horne was satisfied with, and spoke of a full-time position for him.\nBen was in the middle of a miniature Civil War re-enactment as Audrey came and expressed her concern for him the following day.\nBobby later came and Ben brought him into the re-enactment, by then believing himself to be General Robert E. Lee. After Bobby left, Catherine came, saying that despite her hatred for him, she still found an attraction to him.\nBen observed the battlefield the following day as Audrey entered his office with Jerry, who Ben believed to be General Jeb Stuart. Doctor Jacoby then stated his belief that by reversing the Civil War, Ben would reverse his own emotional center.\nThe next day, Ben mused about Stonewall Jackson to Jacoby and his own family, commanding Bobby and Great Northern employees as his troops.\nIn his re-enactment, he arrived at Appomattox, greeted by Wilmer McLean, played by Jerry. General Grant then arrived, played by Jacoby, and surrendered, despite the historical inaccuracy. Ben then collapsed and believed his Civil War re-enactment to have been a dream.\nStop Ghostwood\n \nThe next day, whilst chomping on celery, Ben met with John Justice Wheeler, who he had made an investment in many years ago and wished for him to join him in business. Ben presented a plan to preserve the near-extinct Pine Weasel, which called to work against the Ghostwood development.\nThat evening, he had dinner with Audrey and Jack and they discussed their business plans. Ben left after the chef apparently tried to stab Jerry.\nBen visited the Hayward home the next day and whispered to Eileen, wishing to make right their affair from years before.\nLater in the evening, he hosted a gathering for the Stop Ghostwood campaign on behalf of the weasel and the environment. He passed off the microphone to Dick Tremayne, who hosted the fashion show portion of the evening. He had milk and cookies at the bar during the show, where Catherine approached him, questioning his sincerity.\nEileen came to visit him at the hotel the next morning, trying to give back love letters he had written to her. He expressed his wish that they were still together, but she was made uncomfortable by this.\nHe observed his son outside, then discussed Jack Kennedy's close relationship with his brother, and admitted to Audrey that his family was much more important than he had before made it out to be. He promised to her that he would be a much better father than he ever had been and agreed to make her his business partner. He told her to make her way to the airport, as her flight to Seattle was to leave in an hour, which confused her. Jack then entered and Ben sent Audrey on her way. He asked Jack his secret to \"being good,\" and Jack responded to always tell the truth. He then told Ben that he was falling in love with Audrey, which Ben approved of.\nDick approached Ben the following day, concerned about the wine-tasting he was to host, as Audrey was not present. Horne suggested employing help from the concierge, then asked about the condition of Dick's nose, which was bandaged from being bitten by the weasel at the fashion show. He accepted his request for worker's compensation.\nHorne later addressed the Miss Twin Peaks Judging and Rules Committee, stating that he believed the theme of the speeches given by the contestants should concern how to save the forests.\nThe next day, he met with Will Hayward, who was concerned about Ben's involvement with Eileen, wishing the past to stay buried, though Ben believed he was doing the right thing. Jack then came looking for Audrey as Will left. Jack told Ben that he would be leaving Twin Peaks momentarily, as a partner of his had been murdered. Ben expressed his discouragement to Jack, feeling as though he could not proceed in his business without Jack's help. Jack left him a message for Audrey and went on his way.\nAudrey returned to the hotel and he greeted her. She asked about Jack, but he instead named her as the spokesperson for Stop Ghostwood. When she finally got his attention about Jack, Ben told her that he had left and gave her the letter from him. Ben said that Jack left a few minutes prior and she quickly left. Ben then heard something and looked behind his back.\nBen went into his office the next day, where Audrey sat by the fireplace. He brought in religious texts, hoping to find how he could be a good person. When he noticed she was thinking about Jack, he assured her that time would heal her wounds and that Jack would return. She then filled him in on her trip to Seattle, where she discovered that the Packards were using Twin Peaks Savings and Loan to funnel cash to the Ghostwood project. He then urged her to enter the Miss Twin Peaks Contest, believing that if she won, she would help stop Ghostwood.\nDuring a musical interlude at the contest, he was approached by Donna backstage, who demanded to know about his involvement with Eileen, but he suggested they first all get together, not believing the time and place to be appropriate. He began to tell her about his relationship with her mother and she realized he may be her father, so she ran.\nAt the Hayward home, Donna prepared to leave. Ben begged her to stay at her home, saying that the situation was not her parents' fault, but his, and that he was now trying to make it right. Will arrived and angrily told him to leave. Sylvia then came, questioning Ben's actions. Will then punched Ben, causing him to slam his head into the fireplace.\nAfter Audrey was involved in an explosion of the bank, he stayed near her at her hospital bed. He subsequently bought the Packard Sawmill from Catherine Martell via a contract written by M.J. Kaffee.\nTwenty-five Years Later\nTwenty-five years later, Benjamin was still running the hotel, and by then had switched back to smoking cigars. He told a new hire at the hotel, Beverly Paige, to give a refund to a Mrs. Houseman for two nights of her stay after a skunk found its way into the hotel. Jerry soon entered loudly and Ben dismissed Beverly. Jerry then made crude remarks to his brother and they briefly spoke until Ben asked if Jerry was wearing their mother's hat.\nBen later spoke on the phone with Jerry, who was high and lost in the woods, then at the end of the day, he and Beverly attempted to investigate a strange humming they could hear from inside his office.\nBen and Beverly again investigated the noise, which he likened to a monastery bell. They nearly shared a romantic moment, but Ben refused, stating that he could not.\nHe later received a call from Sylvia, who told him that their grandson, Richard had robbed her of thousands of dollars. After Ben refused to reimburse her or \"send her any more money,\" she said he would hear from his lawyer and hung up. Ben then asked Beverly to dinner.\nSheriff Frank Truman later visited Horne, informing him that Richard was the perpetrator of a hit and run that cost a young boy his life and the brutal assault of the witness, Miriam Sullivan. Ben sent Frank away with Cooper's key to give Harry as a keepsake, then had Beverly arrange to pay for Miriam's medical expenses.\nSergeant Williams of the Jackson Hole, Wyoming police later called Ben, informing him that they had Jerry in custody, claiming to have killed someone with a pair of binoculars. Horne made note to have Jerry returned home.\nBehind the scenes\nHorne is played by Richard Beymer, who previously appeared with co-star Russ Tamblyn in the 1961 musical film, West Side Story.\nRed herring for Laura's killer\nUp until the revelation of Laura's true killer, Horne was used by the writers as a red herring to prevent spoilers from leaking out; at least two scenes were filmed to lead people to believe that Horne was the real killer, so that the true identity of the killer could remain a secret.\nIn one episode, Mike takes Cooper to the Great Northern, where he claims the killer is. When Ben Horne approaches Cooper and Mike, Mike has what amounts to an epileptic seizure and says that the killer's scent is on Ben. Only after Leland is revealed as the killer does the scene make sense and exonerate Ben—Leland and Ben had just been alone together in a room.\nMore blatantly, a scene was filmed for Episode 14 where Ben is revealed as BOB's host. The scene was filmed so that it would spread false rumors and draw people away from the possibility of Leland being the killer. The scene plays out exactly as the one originally broadcast, wherein Leland looks into a mirror to reveal the face of BOB before killing Maddy; however, here, Ben Horne is in the Palmer house, and it is he who murders Maddy. The scene has never aired on television and has never been released.\nTrivia\nHorne's last name is based on real-life department store owner Joseph Horne, founder of Horne's in Pittsburgh where Mark Frost attended college, while his and his brother Jerry's first names are based on the ice cream brand Ben & Jerry's.\nAccording to Twin Peaks: Access Guide to the Town, Ben was named after his father. This contradicts the show, which states his father to be called J.J. Horne.\nThe Secret History of Twin Peaks contains a few contradictions directly related to Horne:\nBen does not lose the Ghostwood Project to Catherine, and thus, continues to pursue it.\nBen surrenders at his Civil War re-enactment. According to Dr. Jacoby, this is because in representing the South, Ben is making \"an unconscious compensation as he's assumed the side with the untenable moral position, attempting to alter or erase his own personal and questionable recent behavioral history\", therefore Jacoby determines that he needs to be convinced to surrender rather than re-write history with a Southern victory.\nThe book also states that he was the student manager of the Twin Peaks High football team in 1968. His birthdate is later given in the book as August 4, 1940. This would make him 27 or 28 in 1968, a decade older than high school seniors.\nBen did not appear in Twin Peaks: Fire Walk with Me. However, scenes were written for his character, but never filmed:\nJohnny's birthday party is held in Ben's office, where Leland notices the picture of Laura on Horne's desk, upsetting him and Sylvia.\nLaura comes to Ben's office for a packet of cocaine, which he trades to her for a kiss.\nGallery\n\nTwin Peaks (1990-1991)\nBen with his brother, Jerry\nTwin Peaks (2017)\n"}