{"name": "Betty_Briggs", "url": "https://twinpeaks.fandom.com/wiki/Betty_Briggs", "text": "Betty Briggs\nBetty Briggs was the unassuming, loving wife of Major Garland Briggs and mother of Bobby Briggs.\nBiography\nOn the evening of February 23, 1989, Betty sat in her living room sewing as her husband read aloud from the Book of Revelation. The doorbell rang and she went to let Bobby's girlfriend, Laura Palmer inside, telling her that Bobby was in the basement.\nShe answers a call the next morning from Laura's mother, Sarah Palmer, saying that her daughter Laura was nowhere in the house and wondered if she was with Bobby, but Betty did not know for sure, as Bobby had apparently left to go running before football practice. When Sarah reasoned that she could be with her husband, Leland, Betty agreed and Mrs. Palmer hung up. Soon, it was announced that Laura had been found dead.\nLater, she was at the sheriff's station with her husband, talking to their lawyer when Bobby left with his best friend, Mike after being questioned in Laura's murder. As they became confused about the situation at hand, they went home.\nThe next day, she prayed with her family at the dinner table. Her husband began talking to their son, wishing to discuss the events over the past few days as well as limits that should be in place given his rebellious nature. When Bobby disrespectfully stayed silent and placed a cigarette in his mouth, Garland smacked him and the cigarette landed in Betty's food. She picked it up and told Bobby that they were there for him.\nTwo days later, she attended Laura's funeral with her family.\nTwo more days later, Betty and her family attended a counseling session with Doctor Lawrence Jacoby. They stated their worries with Bobby's behavior. Jacoby then stated he wished to see Bobby alone, saying he would need to see each family member on his or her own. She and her husband then left Bobby and Jacoby alone.\nIn the days following the death of Leland Palmer, who had been arrested for his daughter's murder, Betty's husband mysteriously disappeared on a fishing trip with FBI Agent Dale Cooper. She discussed his possible whereabouts with Cooper and Sheriff Harry S. Truman and said that Garland had disappeared before for work-related reasons. However, she said that the fact he disappeared from the woods was significant, as he talked about them constantly, but she said that the possibility of this being work-related was classified.\nJust over a day later, Betty sat in her living room in the dark when Bobby came home. She cried for her husband, fearing that his disappearance was not because of his career. Bobby told her about a dream Garland had of harmony and joy, then the power went out and Betty and Bobby saw Garland then standing in the living room. She went to hug him as the power turned back on and asked if everything was alright, to which he said no.\nJust over a week later, Betty had breakfast at the Double R Diner with her husband.\nPrior to Garland's death, he told Betty that she would be visited by Bobby, Hawk, and Sheriff Truman. This visit arrived twenty-five years later and after reflecting on Bobby's growth since Garland's death, she gave them a metal container that Garland had hidden inside of a chair.\nBehind the scenes\nCharlotte Stewart played Betty, having previously appeared in David Lynch's Eraserhead, opposite Jack Nance. She reprised the role of Betty Briggs in the 2017 series of the show.\nTrivia\nShe weighed 115 pounds."}