{"name": "Blackie_O%27Reilly", "url": "https://twinpeaks.fandom.com/wiki/Blackie_O%27Reilly", "text": "Blackie O'Reilly\nBlackie O'Reilly was the madam of One Eyed Jacks, the casino/brothel just north of the Canadian border. Known as \"The Black Rose\", she ran Jack's at the behest of its secret owner, Benjamin Horne. In keeping with the \"upscale\" theme of the establishment, Blackie adorned herself in glamorous black evening gowns and exuded an air of sophistication and being a member of the \"upper class.\" She was the highest authority at Jack's, aside from Ben Horne, eliciting absolute obedience from the cadre of prostitutes in her stable. Whenever a new girl was hired, she oversaw a coin-tossing ceremony between Ben and Jerry Horne to see which man would \"break her in.\"\nBiography\nIn late February 1989, when Ben and Jerry Horne arrived at One Eyed Jacks one evening, Blackie brought out the girls to meet them. When Jerry lost a coin toss for the newest girl at the brothel, Blackie had a drink with him.\nSeveral days later, she saw two men visiting the brothel for the first time, identifying themselves as Barney and Fred, the latter she asked of his line of work. She then pointed them in the way of the casino.\nShe was later introduced to a new girl, Hester Prynne, who had come to work as a hostess, but had a false resume. To prove she deserved to work there, Hester tied a cherry stem into a knot with her mouth.\nHester later entered Blackie's office, dressed in the lingerie she was given and modeled it for her. Blackie then noted that it would be a good night to break the new girl in with the owner, for whom she later lit a cigar and told him about the new girl to celebrate with.\nAs Ben went to test the new girl, Jerry asked her where he was, and she asked why he was holding out on her. This question angered Jerry, who then calmed down and shone a light on her face, commenting that she used to be pretty. He then left her with some heroin, which she was addicted to.\nThe next morning, she was massaged by two of the working girls as Hester entered the room, questioning why action was being taken against her for her lack of performance the previous night.\nEmory Battis revealed to her the next day that Hester was actually Ben Horne's daughter and Blackie confronted her as she called home.\nBlackie tied up Audrey and injected her with heroin while Battis filmed. Emory left and Blackie noted that this action was a form of revenge on Ben Horne, who performed something similar to her in the past.\nShe looked over security footage with Emory, and stopped on a frame of Barney, who Battis recognized as an FBI Agent. Jean Renault then entered with Blackie's sister, Nancy. Jean wanted the FBI agent, Cooper brought to him for causing the deaths of his brothers.\nA couple of days later, Blackie plotted with Renault on killing Agent Cooper and gaining control of One Eyed Jacks, along with making Audrey overdose on heroin. Blackie left the room as her sister entered.\n \nShe and Jean later discussed their plan to have Audrey overdose. She tried to leave, but he asked for a kiss. She kissed him and he stabbed her."}