{"name": "Black_Lodge", "url": "https://twinpeaks.fandom.com/wiki/Black_Lodge", "text": "Black Lodge\nFor the actual location, see red room.\n \n\"There is also a legend of a place called the Black Lodge: the shadow self of the White Lodge, a place of dark forces that pull on this world. A world of nightmares. Shamans reduced to crying children, angry spirits pouring from the woods, graves opening like flowers.\"\n ―Hawk\nThe Black Lodge was a mythological place referenced in the stories of the Nez Perce tribe of northeastern Washington. It was the name used to refer to a particular extra-dimensional location visited by FBI Special Agent Dale Cooper during his 1989 visit to Twin Peaks, which bore the appearance of an endless, red-curtained series of rooms and hallways.\nLegends\nThe Black Lodge and its opposing counterpart, the White Lodge, originated in ancient legends passed down by the Nez Perce tribes who once inhabited the Twin Peaks region. In the stories, the Black Lodge was the \"shadow self\" of the White, a place of pure evil through which all souls passed on the way to perfection. During this process, the pilgrim would confront the Dweller on the Threshold, their own shadow self. If this challenge was not met with perfect courage, the lodge would utterly annihilate their soul. While the White Lodge could supposedly be accessed with strong feelings of love, the Black would open to its opposite: fear.\nThe settlers who followed the Nez Perce gradually became aware of a \"darkness\" or \"presence\" in the surrounding woods and formed a secret society, the Bookhouse Boys, dedicated to fighting against it. Dale Cooper hypothesized that this presence and the Black Lodge of lore were one and the same.\nA \"black lodge\" of evil magicians figured in Moonchild, a 1923 novel by the notorious occultist Aleister Crowley. In the novel, the black lodge was one of two factions vying for an unborn child believed to be the Antichrist.\nRogue former FBI agent Windom Earle described the Black Lodge as a source of world-altering power:\n\"For there is another place, opposite, of almost unimaginable power, chock full of dark forces and vicious secrets. No prayers dare penetrate this frightful maw. Spirits there care not for good deeds and priestly invocations. They are as like to rip the muscle from our bones as greet you with a happy g'day. And, if harnessed, these spirits, this hidden land of unmuffled screams and broken hearts, will offer up a power so vast that its bearer might reorder the earth itself to his liking.\"\nDuring his time with Project Blue Book, Earle became convinced that the dugpas drew their powers from the Black Lodge, a place for which they had many names.\nCooper speculated that BOB, the supposed demonic spirit who possessed Leland Palmer, had originally come from the Black Lodge.\nEntrance\n \nAn ancient pictogram drawn on the wall of Owl Cave depicted the Twin Peaks region and detailed how one might directly enter the Black Lodge itself. A \"portal\" would open in Glastonbury Grove in the center of a circle of twelve sycamore trees during the conjunction of Jupiter and Saturn. This \"opening,\" which manifested as a set of red curtains, could also be found and passed at will by certain individuals at any time of their choosing.\nThe curtains led into a red-curtained set of rooms and corridors, which had no apparent end and exhibited anomalous properties. This place was commonly referred to as the Black Lodge or \"the lodge,\" although its exact connection was unclear.\nHistory\nFollowing his escape from custody, the insane Windom Earle doggedly pursued his goal of finding and entering the Black Lodge, which he believed would grant one the power to reorder the world in their image. For several weeks in March 1989, Earle stalked several of the townspeople and his former partner Dale Cooper, seeking clues to its location. By spying on Cooper and kidnapping Major Garland Briggs, he finally determined that the door would open at the conjunction of Jupiter and Saturn at midnight on March 26, in response to the fear of an innocent.\nDuring the Miss Twin Peaks Contest, Earle, disguised as the town Log Lady, attacked the event and abducted the newly crowned Miss Twin Peaks, Annie Blackburn, knowing that she and Cooper had fallen in love. Earle took her to the circle of trees at Glastonbury Grove, where a red-curtained opening appeared. They stepped through and disappeared. Shortly thereafter, Cooper and Sheriff Harry S. Truman arrived in pursuit. Cooper told Truman to wait for him and stepped through as well, disappearing.\nFurther reading: Red room\nThe next morning, Sarah Palmer, in an agitated state, went with Dr. Lawrence Jacoby to the Double R Diner in search of Major Briggs. She spoke in an inhuman voice, saying: \"I'm in the Black Lodge with Dale Cooper. I'm waiting for you.\"\nAlmost a day after they disappeared, Annie and Cooper (actually a malevolent twin) reappeared in the sycamore grove. Annie was rushed to Calhoun Memorial Hospital while Cooper was brought to his hotel room at the Great Northern to recuperate. While she was being treated, Annie, dazed, told a nurse that she had been with Dale and Laura, and that \"the good Dale in the lodge,\" unable to leave. The same message was found in a diary entry written by Laura Palmer prior to her death, as she had seen Annie say this in a dream.\nTwenty-five years later, the Cooper double explained to Darya that the next day he was supposed to get pulled back into \"what they call the Black Lodge,\" although he had a plan to counter this.\nAside from the reading of Laura's diary entry in \"Part 7,\" this is the only reference to either the Black or White Lodge in Twin Peaks (2017).\nWhile attempting to summarize for Gordon Cole what had happened to Cooper between 1989 and 2016, Tammy Preston decided for the sake of convenience to use \"the Black Lodge\" as shorthand for his whereabouts in those years.\nBehind the scenes\nIn the original script for \"Episode 29,\" the Black Lodge was a black-and-white mirror of the Great Northern Hotel. This and virtually everything else about the lodge sequence were discarded by director David Lynch for the largely improvised sequence that actually appears in the episode. As indicated above, the red room first seen in Cooper's dreams is commonly assumed to be the Black Lodge itself, although the room itself has never been identified.\nIn the Lynch-directed Georgia Coffee commercials, Cooper explains: \"The Black Lodge isn't in this world. Inside, there's a red room.\"\nThe Black Lodge is a concept in the school of theosophy, using the connotation of a fraternal organization rather than a place. Frost deliberately lifted from Psychic Self Defense, a 1930 \"handbook\" by British occultist Dion Fortune, a chapter details the dangers associated with the Black Lodges, which are secret societies who follow the left-handed path in pursuit of worldly gain. It is likewise possible that the Black Lodge of the series refers not merely to a place but to a confluence of spirits."}