{"name": "Blue_Rose", "url": "https://twinpeaks.fandom.com/wiki/Blue_Rose", "text": "Blue Rose\nBlue Rose was a top secret joint task force of the United States military and Federal Bureau of Investigation, formed in the years after the official closure of Project Blue Book in 1970 to investigate cases of a paranormal nature, as well as \"troubling abstractions\" that Project Blue Book could not resolve. The name originated in 1975 from the last words of the tulpa of Lois Duffy: \"I'm like the blue rose.\" Subsequently, cases believed to have some bearing on this mission were known as \"blue rose\" cases among the handful of agents and officers on the task force.\nHistory\nProject Blue Book, the government's public investigation into unidentified flying objects and other phenomena, was shuttered after it officially ruled that they were not a threat to national security, thanks in part to the influence of MJ12. However, President Richard Nixon decided to set up a top secret project with Douglas Milford to continue Blue Book's mission.\nShortly before his resignation, Nixon entrusted Milford with access to an untraceable fund, advising him to avoid the CIA and the MJ12 and to lay low before recruiting FBI Agent Gordon Cole. Milford brought Cole on board by 1982 and established Listening Post Alpha (LPA) on Blue Pine Mountain with himself at its head. Cole suggested Agent Phillip Jeffries to head the task force devoted to these cases. Agents Chester Desmond, Dale Cooper, and Albert Rosenfield were also recruited.\n1980s\nOn May 28, 1983, Cole and Jeffries visited Twin Peaks to conduct an \"investigation\" in response to questions by Mayor Dwayne Milford about the LPA's purpose. In a letter, Cole assured the mayor that he had determined the station was merely part of President Reagan's Strategic Defense Initiative.\nIn 1985, Major Garland Briggs became the new head of the LPA. The station catalogued transmissions from deep space as well as the surrounding woods, searching for evidence of the White Lodge.\nA 1987 case in Buenos Aires during which Jeffries disappeared was implied to be a Blue Rose case.\nThe 1988 murder of Teresa Banks was classified as a Blue Rose case. On arrival in Portland, agents Chet Desmond and Sam Stanley were greeted by Gordon Cole's \"cousin\" Lil, who wore a blue rose on her lapel as a coded message to Desmond indicating the case's significance. Special Agent Dale Cooper also referenced Teresa Banks' murder as being \"one of Cole's Blue Rose cases\" while in Deer Meadow immediately after Special Agent Chester Desmond's mysterious disappearance. Although Chet Desmond and Dale Cooper had the chance to explain the Blue Rose to Sam Stanley, it was never disclosed to him.\nLaura Palmer's murder investigation in 1989 was implied to be another Blue Rose case because of the \"curious linkage\" to Teresa Banks' murder and the Twin Peaks Sheriff's Department's search for the Black Lodge, a continuation of the investigation into the paranormal and unexplained elements of both Teresa and Laura's murders.\nYears later, Albert and Gordon's contact in Colombia was killed after Albert disclosed his identity to Jeffries, for Dale's safety according to the latter.\n2010s\nWhile Agent Cooper stood on a concrete box floating in outer space, a superimposed Major Garland Briggs appeared to him, uttering the words \"Blue Rose\" and when he reentered the American girl's room, a Blue Rose was in a vase.\nWhile investigating the murder of Ruth Davenport, Cole and Agent Albert Rosenfield classified Cooper's re-emergence in South Dakota as a Blue Rose case – Cole commented that \"it doesn't get any bluer.\" During this investigation, Agent Tammy Preston was inducted into the task force.\nMembers\nThe force was founded by FBI Special Agent Gordon Cole and USAF Colonel Douglas Milford with help from President Richard Nixon.\nFBI Special Agent Philip Jeffries was the head of the squad and Agents Chester Desmond, Albert Rosenfield and Dale Cooper were recruited after the squad formation.\nAgent Sam Stanley was part of a Blue Rose investigation but was not trusted with full knowledge.\nAgent Tamara Preston was recruited decades later, although Cole generally avoided recruiting new members due to the mysterious disappearances of Jeffries, Desmond and Cooper.\nUSAF Major Garland Briggs was a member of Project Blue Book and became the head of the LPA.\nIt was implied that Windom Earle was an original member of the task force, due to his involvement with Project Blue Book and Agent Preston finding his name alongside every known FBI Agent involved with the Blue Rose task force on a secret file.\nCole also had a contact in Colombia.\nBehind the scenes\nSince there is no such thing as a blue rose in nature, the designation could represent cases which cannot be rationally or scientifically explained, the \"impossible\" cases, this being Tamara Preston's hypothesis. It could also be a reference to cases involving (or seemingly involving) UFOs, as part of \"Project Blue Book\" referred to by Major Garland Briggs and Windom Earle. The Blue Rose Ministry, Arizona was a ministry operated by a Reverend Robert Short, who claimed to have regular contact with UFOs and be in direct spiritual communication with alien beings from Saturn who had moved into another dimension/time period."}