{"name": "Blue_Velvet", "url": "https://twinpeaks.fandom.com/wiki/Blue_Velvet", "text": "Blue Velvet\nBlue Velvet is a 1986 neo-noir film directed by David Lynch. It can be seen as a predecessor to Twin Peaks, containing many similar elements.\nPlot\nIn the seemingly bright and beautiful town of Lumberton, North Carolina, Tom Beaumont tends his yard when he suddenly suffers a massive stroke. Because of this, his son Jeffrey returns home from college. He goes to the hospital, where his father cries, unable to speak.\nJeffrey makes his way to a vacant lot, where he throws stones until he finds a decomposing severed ear. He places it in a paper bag and takes it to Detective John Williams of the Lumberton Police. The coroner examines the ear and determines that the owner could still be alive and that it was cut off with scissors. A search of the field the ear was found in then takes place, Jeffrey observing.\nHe later went out for a walk, stopping at the Williams home to see the Detective Williams about the case. However, the Detective tells him he cannot release any information about it. Shortly after leaving, Jeffrey encounters the Williams' daughter, Sandy. She tells him that she has overheard details about a singer somehow related to the severed ear.\nSandy shows Jeffrey to the apartment building where the singer lived, located on Lincoln Street, where Jeffrey's aunt Barbara warned him to not go. They turn back and Jeffrey catches up on his old hometown.\nJeffrey picks up Sandy from school the next day, taking her to Arlene's Diner. There, he discusses with her his plan to get into the singer's apartment, posing as a pest control worker and her as a Jehovah's Witness.\nLearning the singer's name to be Dorothy Vallens, Jeffrey makes his way up to her apartment, where he sprays from a bug-spraying rig and steals a key when the singer left to answer the door, where there is a man in a yellow suit.\nSandy cancels her date with her boyfriend, Mike in order to continue her investigation with Jeffrey at the Slow Club, where Vallens sings \"Blue Velvet\" and \"Blue Star.\" After the performance, they make their way to her apartment again so that Jeffrey can sneak in. They agree to have Sandy warn him of her arrival by honking the horn. However, Jeffrey does not hear this due to flushing a toilet.\nUpon realizing that someone else was entering the apartment, Jeffrey hides in a closet, watching as Dorothy takes a call from Frank Booth, who allows her to speak to her husband, who she asks of the well-being of their son. After the phone call, Jeffrey accidentally knocks down a coat hanger, causing Dorothy to notice him. She threatens him with a knife, believing him to be a voyeur. She has him undress at knifepoint and begins to perform oral sex. She takes him to the couch, but they are interrupted by a knock on the door.\nAfter hiding Jeffrey back in the closet, Dorothy answers the door. Frank Booth comes in and sexually assaults her (all while inhaling an unspecified gas) as Jeffrey watches from the closet. After the attack, Jeffrey leaves the closet and tries to comfort Dorothy. She requests him to hit her, but he refuses.\nThe following night, Jeffrey fills in Sandy on the details of his visit. She then tells him of a dream she had where a world of darkness was finally given light by robins that represented love.\nJeffrey goes back to the apartment where he has a sexual encounter with Dorothy. During another visit to the Slow Club, Jeffrey notices that Frank is present at the performance, holding a piece of fabric he cut from Dorothy's robe.\nJeffrey begins to tail Frank and his accomplices, naming two of them \"Yellow Man\" and \"Well-Dressed Man.\" He discovers a criminal underground but is unsure of what to do with the information. They then share a kiss, confirming their attraction to each other.\nBeaumont returns to Dorothy's apartment, where he ends up hitting her during a sexual encounter. As Jeffrey leaves, they encounter Frank, who takes them for a joyride, stopping at This Is It to visit Ben, who possesses Dorothy's child. They antagonize Jeffrey and drink to \"Frank's fuck.\" Dorothy is then allowed to see Donny as Ben lip-synchs \"In Dreams\" for Frank before the joyride continues.\nThey go out to the country, where Frank inhales the gas he used in the assault and begins to start on Dorothy again, but when Jeffrey punches him, Frank and his gang take Jeffrey out of the car and beat him up, despite Dorothy's protests, all while once again listening to \"In Dreams.\"\nJeffrey wakes up, dirty and bruised. He returns home, where he is disturbed by the thought of hitting Dorothy. He calls Sandy and tells her that he will leave her out of the rest of his investigation, so as to keep her safe.\nUpon visiting the police station, Jeffrey spots Frank's accomplice the \"Yellow Man,\" who is actually Lt. T.R. Gordon and Jeffrey takes his information to Detective Williams.\nThe following Friday, Jeffrey waters the yard and visits his father before picking up Sandy for their planned date. Just after Jeffrey arrives, Gordon does to meet Detective Williams, who tells Jeffrey to stay calm before sending he and Sandy on their way.\nJeffrey and Sandy go to a party, where they express their love to each other on the dance floor as \"Mysteries of Love\" plays. After the party, Jeffrey drives Sandy home, but they are chased by Sandy's boyfriend, Mike. Mike challenges Jeffrey to a fight, but it is stopped when a nude and dazed Dorothy emerges. She is taken to the Williams' home, where an ambulance is called for her. Dorothy reveals to Sandy hers and Jeffrey's relationship, but Sandy forgives Jeffrey and agrees to have her father send police to Dorothy's apartment.\nJeffrey goes to the apartment, where he finds Lt. Gordon bloodied and standing, having suffered from a sort of lobotomy, and a dead Don Vallens, having been shot in the head. Jeffrey hears Gordon's radio chattering as an assault on Frank's apartment building takes place. He declares that he will let the police find Frank on their own and he leaves the apartment.\nHowever, as he leaves the building, he sees the \"Well-Dressed Man\" from the stairwell and realizes that he is actually Frank in disguise. He quickly makes his way back to the apartment and takes Gordon's radio. He goes to the bedroom and speaks to Williams. Realizing that Frank also has a radio, he says that he is in the bedroom, then dashes to the closet. As Frank searches and shoots in the bedroom, Jeffrey quickly grabs Gordon's revolver and retreats back into the closet, waiting as Frank begins randomly firing around the apartment. When Frank finally opens the closet, Jeffrey fires a shot into his head, immediately killing him. Detective Williams and Sandy then arrive.\nSoon after, on a bright and sunny day, Sandy calls Jeffrey in for lunch. On his way inside, Jeffrey observes Detective Williams speaking to his father, who has recovered substantially. When inside, Barbara points out to them a robin with a bug gripped in its beak.\nDorothy is then happily reunited with her young son.\nSimilarities to Twin Peaks\nBlue Velvet contains several elements that eventually found their way into the Twin Peaks franchise:\nBoth take place in a small logging town, Blue Velvet being set in Lumberton, North Carolina, and Twin Peaks in the eponymous town of Twin Peaks, Washington. Both towns contain elements that make them appear as if they are \"stuck\" in 1950s America.\nBoth heavily feature the theme of dark secrets that lie below what appears to be beautiful.\nKyle MacLachlan considers Dale Cooper to be a \"grown-up\" version of Jeffrey Beaumont.\nThe severed ear from Blue Velvet was in BOB's pile of dirt seen in Episode 2 and the International Pilot.\nIn Blue Velvet, Jeffrey and Sandy take it upon themselves to investigate the mystery behind the severed ear, much like later in Twin Peaks, when Donna Hayward, James Hurley, and Maddy Ferguson performed their own investigation into Laura Palmer's murder.\nBoth contain significant imagery of birds.\nBoth have a dream motif, apparent by Sandy's dream described in Blue Velvet and Cooper's dream in Episode 2 of Twin Peaks.\nCommon cast/crew\nIn addition, Twin Peaks contained many cast and crew members that worked on Blue Velvet:\nDavid Lynch co-created Twin Peaks, directed Blue Velvet, six episodes of the original Twin Peaks, Twin Peaks: Fire Walk with Me, Twin Peaks: The Missing Pieces and all episodes of the 2017 series.\nKyle MacLachlan appeared as Jeffrey Beaumont in Blue Velvet and Dale Cooper in Twin Peaks, Twin Peaks: Fire Walk with Me, Twin Peaks: The Missing Pieces and the 2017 series of Twin Peaks.\nJack Nance appeared as Paul in Blue Velvet and Pete Martell in Twin Peaks and Twin Peaks: The Missing Pieces.\nFrances Bay appeared in Blue Velvet as Aunt Barbara and Mrs. Tremond / Mrs. Chalfont in Twin Peaks, Twin Peaks: Fire Walk with Me, and Twin Peaks: The Missing Pieces.\nLaura Dern appeared as Sandy Williams in Blue Velvet and as Diane Evans in the 2017 series of Twin Peaks.\nAngelo Badalamenti composed the music for Blue Velvet, Twin Peaks, Twin Peaks: Fire Walk with Me, Twin Peaks: The Missing Pieces, and the 2017 series of Twin Peaks.\nJulee Cruise performed the song \"Mysteries of Love\" for Blue Velvet, appeared and performed the songs \"Falling,\" \"The Nightingale,\" \"Into the Night,\" \"Rockin' Back Inside My Heart,\" and \"The World Spins\" in Twin Peaks, appeared and performed the song \"Questions in a World of Blue\" in Twin Peaks: Fire Walk with Me, and also appeared in the 2017 series of Twin Peaks.\nFrank Silva worked as a set dresser on Blue Velvet and the pilot episode of Twin Peaks. He also played BOB in Twin Peaks, Twin Peaks: Fire Walk with Me, and Twin Peaks: The Missing Pieces.\nIsabella Rossellini played Dorothy Vallens in Blue Velvet and was originally slated to play the role of Josie Packard (then named Giovanna Packard) in Twin Peaks.\nDuwayne Dunham edited Blue Velvet, two episodes of Twin Peaks, and directed three episodes. He also worked as an editor for the 2017 series.\nMary Sweeney worked as an assistant editor on Blue Velvet and as a script supervisor on two episodes of Twin Peaks and an editor on one episode and Twin Peaks: Fire Walk with Me.\nBrian Berden was an apprentice editor on Blue Velvet and was an assistant and associate editor for two episodes of Twin Peaks. He also worked as an additional editor for the 2017 series of Twin Peaks.\nJohanna Ray was the casting director for Blue Velvet, Twin Peaks, Twin Peaks: Fire Walk with Me, and the 2017 series.\nJohn Wentworth was David Lynch's assistant for Blue Velvet, supervised post-production for Twin Peaks, and co-produced Twin Peaks: Fire Walk with Me.\nPatricia Norris worked as production designer for Blue Velvet and was a costume designer for Twin Peaks and Twin Peaks: Fire Walk with Me.\nMark Berger was a re-recording mixer for Blue Velvet and Twin Peaks.\nDavid Parker was a re-recording mixer for Blue Velvet, Twin Peaks, and Twin Peaks: Fire Walk with Me.\nLex duPont was first assistant camera on Blue Velvet and was camera operator for the second season of Twin Peaks.\nJonathan P. Shaw was an assistant editor on Blue Velvet and worked as an editor on both the original and 2017 series of Twin Peaks.\nDan Kneece was a Steadicam operator for Blue Velvet, Twin Peaks, and Twin Peaks: Fire Walk with Me.\nVivien Hillgrove Gilliam and John Nutt worked as a dialogue editors for Blue Velvet and Twin Peaks.\nRonald Leamon worked as a costumer for Blue Velvet and wardrobe supervisor for Twin Peaks.\nworked as a dialogue editor for Blue Velvet and Twin Peaks.\nCatherine Davis was an art department assistant for Blue Velvet\nDavid Boushey was Blue Velvet's stunt coordinator and he was a stunt performer for Twin Peaks and Twin Peaks: Fire Walk with Me.\nMark Shane Davis was a dolly grip for Blue Velvet and key grip for Twin Peaks.\nHenry Earl Lewis worked set wardrobe for Blue Velvet and was key costumer for the pilot episode of Twin Peaks."}