{"name": "BOB", "url": "https://twinpeaks.fandom.com/wiki/BOB", "text": "BOB\n\"He is BOB, eager for fun. He wears a smile, everybody run.\"\n ―Mike\nBOB (or Killer Bob) was a possessing spirit, believed to originate from the mythical Black Lodge. He spent most of his time on Earth possessing human beings, committing horrific acts to \"harvest\" pain and sorrow (known as \"garmonbozia\") from those around him. While inhabiting a human, BOB's true form, that of a long-haired vagrant, could only be seen by the gifted and the damned.\nAs a child, Leland Palmer \"invited\" BOB into himself, becoming his human vessel. From the time Leland's daughter Laura was twelve, BOB tormented and sexually abused her on a regular basis, intending to make her his next host, before he was stymied by Mike and forced to murder her instead. Later, BOB accompanied the doppelganger of Dale Cooper out of the lodge and traveled with him for the next twenty-five years.\nBiography\n\nEarly years\nFollowing a 1945 nuclear test in White Sands, New Mexico, the image of BOB was seemingly regurgitated from a white figure.\nBOB spent several years with Mike, feeding off of fear and pain until Mike \"saw the face of God\" and cut off his own arm. BOB then lurked around the Great Northern Hotel for 40 years.\nWhen Leland Palmer was a boy, Robertson lived in a white house near his grandfather's summer house at Pearl Lakes. He taunted Leland, asking \"do you wanna play with fire, little boy?\" BOB told Leland that he wanted to play, and then \"opened\" Leland and went inside him.\nMolesting Laura\nFrom when she was 12, BOB began molesting and abusing Leland's daughter Laura regularly.\nAn owl told BOB of Laura's first orgy at Jacques Renault's cabin. In a later dream, Laura saw BOB at Jacques' cabin killing his bird Waldo and approaching her but was stopped by a gigantic owl.\nLaura knew him to be a friend of Leland. BOB told her that the only person he feared was Mike. BOB's objective with Laura was to be her or else he would kill her.\nMeeting above the convenience store\nBOB appeared in the meeting room across from The Man from Another Place, who spoke about Garmonbozia and observed the green Formica table in front of them. BOB said \"I have the fury of my own momentum.\" The little man said \"with this ring, I thee wed,\" and laughed with BOB. The little man then said \"fire walk with me,\" and BOB clapped. The little man and BOB then left through a set of drapes.\nMurder of Teresa Banks\nAt the Red Diamond City Motel, Leland changed his mind about a foursome with prostitute Teresa Banks and her friends: Ronette Pulaski and Laura.\nIn 1988, BOB with Leland murdered Teresa after she tried to blackmail him, recognising Jacques' description of Laura's father on the phone.\nMurder of Laura Palmer\nIn 1989, following years of molesting Laura, one day, he spoke through her ceiling fan that he wants to \"taste through\" her mouth.\nBOB later appeared behind Laura's dresser, where she had hidden her secret diary.\nDuring a day, Mike pursued Leland in the traffic and shouted at him that he (Leland/BOB) stole his canned corn from above the convenience store. The odor of something burning could be perceived.\nA few nights later, February 22, BOB climbed into Laura's window and began to assault her. To Laura, his appearance changed to Leland, horrifying her and confirming her deepest fear.\nOn the night of February 23, he followed Laura to a cabin, where she engaged in sex with Leo Johnson, Jacques Renault, and Ronette Pulaski. When Jacques came out, BOB/Leland knocked him out.\nHe took Laura and Ronette to a train car where he murdered Laura, failing to take her as a host. He wrapped her body in plastic and sent it along a river. With Leland's blood he wrote a \"Fire Walk with Me\" note and, on the way to Glastonbury Grove, he abandoned pages of Laura's diary and a towel covered with Leland's blood. He entered the red room via the curtains in Glastonbury Grove, where Mike, together with The Arm demanded all of his garmonbozia. BOB pulled the blood from Leland's shirt, healing him, and threw it on the floor. It then changed into garmonbozia.\n \nDuring the investigation into Laura's murder, BOB was seen in visions by Sarah Palmer, Dale Cooper, and Maddy Ferguson.\n \nThrough Leland, he murdered Maddy, slamming her head into a picture in the Palmer home. He placed her body in a golf bag before wrapping her in plastic.\nAfter Leland was taken into custody and revealed to the authorities as BOB's host, BOB forced him to commit suicide. In his dying breaths, Leland made obscure references to the man at the lake molesting him as a child before stating that he never knew when BOB was in control of his body.\nAfter Leland died, Cooper engaged in a philosophical debate with Sheriff Truman and Albert Rosenfield over how real BOB was, and whether or not BOB was, in fact, a physical incarnation of Leland's repressed personal demons. Although the men could not agree on a unifying idea, they did come to the conclusion that BOB was a manifestation of \"the evil that men do.\"\nFollowing Leland's death, BOB's presence was not noticed again until immediately after Josie Packard's sudden death, when Cooper saw a vision of a cackling BOB crawl out from under her bed and mockingly shout, \"Coop, what happened to Josie?!\" Cooper later speculated that BOB had been drawn to Josie's fear.\nWith Cooper's doppelganger\nWhen Windom Earle tried to take Cooper's soul in the red room, BOB said that he could not ask for it and then took Earle's. After Cooper left, his doppelganger came and laughed with BOB.\nAfter Cooper's doppelganger escaped from the red room, BOB appeared in the mirror to him and broke it, laughing and asking, \"How's Annie?\"\nAfter realizing Sheriff Harry S. Truman and Dr. Will Hayward heard him break the mirror, the doppelganger lay down on the floor, and upon being pulled up by Cooper's concerned friends, explained that he slipped and struck his head in the mirror, and it \"struck as funny.\" When Harry said they should get him to a hospital, he merely stated \"But I haven't brushed my teeth yet.\"\n \nBOB still remained with Cooper's doppelganger 25 years later.\nAfter Cooper's doppelganger was betrayed and shot dead by Ray Monroe, woodsmen gathered around his body and tore him open, extracting BOB. After the doppelganger revived from the dead, BOB was returned..\nAfter Cooper's doppelganger was shot by Lucy Brennan during his infiltration at the Sheriff's Station in Twin Peaks, woodsmen once again gathered and BOB emerged from the body. He began attacking a present Dale Cooper and then proceeded to attack Freddie Sykes, who then pulverized BOB with a special green glove given to him by the Fireman several months previously. During this battle, Freddie successfully defeated BOB and shattered him into pieces, fulfilling his destiny foretold by the Fireman.\nModus operandi\nAfter committing a crime, he puts a letter under a ring finger nail to form the name \"Robert\". The letters are cut from issues of Flesh World. The revealed letters are:\nT for Teresa Banks, left ring finger\nR for Laura Palmer, left ring finger\nB for Ronette Pulaski, left ring finger\nO for Maddy Ferguson, left ring finger\nFollowing this, he wraps the victim in plastic and sends them floating in a body of water.\nNon-canon appearance\n\nInternational Pilot\nBOB is seen by Sarah Palmer, crouching behind Laura's bed.\n \nIn the hospital's basement, BOB stands over a circle of candles and welcomes Agent Cooper and Sheriff Truman to the \"killer's lair.\" They approach him and he asks if Mike is with them. BOB then speaks with Mike, saying \"Heads up, tails up, running to be with scallywag, night falls, morning calls, catch you with my death bag.\" Sheriff Truman asks him what the letters found under Laura Palmer and Teresa Banks' fingers were going to spell, and BOB answers that they were going to spell his proper name, \"Robert.\" He promises he will kill again, then Mike appears, shooting him dead.\nBehind the scenes\nThe impetus for the series Twin Peaks was the mystery of who killed Laura Palmer. When production began on the pilot episode, series creators David Lynch and Mark Frost had decided that the murderer would be revealed as Leland Palmer, Laura's father. During the filming of a scene in the pilot taking place in Laura's room, Frank Silva, a set dresser during the shootings but also an actor, accidentally trapped himself in the room prior to filming by inadvertently moving a dresser in front of the door. Lynch had an image of Silva stuck in the room and thought that it could fit into the series somewhere, and told Silva that he would like for him to be in the series. Lynch had Silva crouch at the foot of Laura's bed and look through the bars of the footboard, as if he were \"trapped\" behind them, and filmed it, then had Silva leave the room and filmed the empty room; after reviewing the footage, Lynch liked the presence that Silva brought to the scene and decided that he would put him somewhere in the series.\nLater that day, a scene was being filmed in which Palmer's mother experiences a vision which frightens her; at the time, the script did not indicate what Mrs. Palmer had seen to frighten her. Lynch was pleased with how the scene turned out, but a crew member informed him that it would have to be re-shot because a mirror in the scene had inadvertently picked up someone's reflection. When Lynch asked who it was, the crew member replied that it had been Silva. Lynch considered this a \"happy accident,\" and decided at that point that the unnamed character to be played by Silva would be revealed as Palmer's true killer.\nIn Episode 1, Sarah Palmer sees a vision of BOB while hugging Donna. The vision consists of BOB crouching at the foot of Laura's bed. In the script, the vision featured a long, empty hospital corridor, with BOB running down it towards the camera at full speed. The scene, as scripted, was indeed filmed, but deemed too \"freaky\" by Lynch and never used, except for a brief clip of it during Ronette's dream of BOB during Episode 8.\nThe name \"Bob\" is a reference to Bob's Big Boy, a restaurant where David Lynch ordered the same lunch every day for several years.\n \nAs Frank Silva passed away in 1995, he appeared posthumously in the 2017 revival through the use of archive footage and CGI, which was always the preferred solution instead of recasting.\nTrivia\nThe credits and hard on-screen subtitles always use the name \"Bob\" or \"Killer Bob\". The name \"BOB\" is used in all caps in Laura's secret diary, his name being an acronym and a warning in itself: \"BEWARE OF BOB\"."}