{"name": "Bobby_Briggs", "url": "https://twinpeaks.fandom.com/wiki/Bobby_Briggs", "text": "Bobby Briggs\nRobert \"Bobby\" Briggs was a student at the Twin Peaks High School and the boyfriend of Laura Palmer, thus one of the initial suspects in her murder. His father was Major Garland Briggs, a member of the United States Air Force, with whom he had an uneasy relationship. Bobby became jealous of James Hurley when he discovered that James was secretly seeing Laura. Laura, on the other hand, did not really love Bobby, and only used him as a source of cocaine. Even before Laura's death, Bobby was seeing Shelly Johnson.\nDuring the years following Laura's death, Bobby became a deputy in the Twin Peaks Sheriff's Department.\nBiography\n\nEarly life\nBobby moved with his family to Twin Peaks, Washington in 1982 when his father was transferred on orders from Lieutenant Colonel Douglas Milford.\nBy the next year, he was noted to often pull the hair and burp in the faces of all of the girls at school, especially Laura Palmer.\nBy 1985, Bobby had begun dating Shelly McCauley, whom he had known since elementary school, but unbeknownst to Shelly, Bobby was also secretly seeing Laura on the side, and he had agreed to supply her with marijuana. The first time they slept together, Bobby told Laura that he loved her, but she laughed at him and he cried. Nevertheless, he called her later that night to apologize.\nShelly, however, eventually realized that Bobby was cheating on her with Laura, and confronted him over this in a big public scene during a prom night, where she broke up with him. As a result, Shelly decided to drown her sorrows at the Roadhouse, where she ran into Leo Johnson, whom she married only three weeks later.\nA couple of months later, Bobby took Laura to a party being had by Leo Johnson. He soon also started to supply her with cocaine, which she had become addicted to. After he started selling the drug for Leo, Bobby and Laura began a more stable relationship.\nBy April 1987, Bobby had secretly begun to rekindle his relationship with Shelly, who was stuck in an unhappy and abusive marriage with Leo. Bobby kept this a secret from Laura, but he began to see her less.\nMurder of Laura Palmer\nOn a morning in mid-February 1989, Bobby and his best friend Mike Nelson sat in the former's car, discussing their cocaine supply going low, worried since they owe $5,000 to Leo. Laura and Mike's girlfriend Donna Hayward then passed by on their way to school. Bobby and Mike declared that Mike was \"the man.\"\nAfter school, he approached a display case containing Laura's picture and he kissed the glass. He left and saw Laura, who had been unaccounted for during the past hour. He was angered by this, believing she was with someone else. However, she managed to brighten his mood and she went home.\nLater, Bobby called Leo Johnson, looking for more cocaine for distribution, but Leo refused, as Bobby owed him $5,000. He then called Jacques Renault, who told him of a supplier he could meet in two days \"by the sound of sawing wood.\"\nAt school two days later, Bobby met Laura and said there is a big score of cocaine to get that night. At night, they drank in woods, also taking what little cocaine they had left until the drug supplier showed up. He said he was sent by Jacques and showed a bag of what he claimed was cocaine before drawing a gun. Bobby, panicking, pulled out his own gun and killed him. As he frantically tried to bury the man, Laura, being drunk, jokingly insisted that he killed Mike, much to his anger.\nThe following day, Bobby, still upset about the shooting, told Laura to hide $10,000 in her safety deposit box. Later, Bobby inspected the supplier's cocaine in the woods only to discover that it was merely baby laxative.\nOn the night of February 23, Laura came to his home to see him and he informed her about the product's true nature. Laura then asked him for more cocaine for the night and told him that she was \"going home.\" Bobby gave her some drugs from his private stash. When she left, he walked her to the door and lit a cigarette, his father telling him to put it out.\n \nBobby drank a coffee at the Double R Diner the next morning when waitress Heidi showed up to work late, claiming she could not get her car started. After Shelly Johnson commented \"too busy jump-starting the old man, huh?\" Heidi giggled. Bobby said that he thought Germans were always on time, but Heidi just giggled in response all the way back to the kitchen. Norma Jennings poured his coffee and he offered to drop off Shelly at her home on his way to football practice, which she accepted. On the way out, he played a song on the jukebox and commented to Norma that he would be seeing her in his dreams. They went out to his car and he suspected that Norma knew about their secret relationship, but Shelly disagreed.\nThey drove to Shelly's house, drinking along the way, but stopped when Bobby saw Leo's truck in the driveway. He backed up and dropped her off away from her house.\nBobby arrived at school, where Mike was waiting. He was told that he is wanted in the office, where he was questioned about his whereabouts by Deputies Hawk and Andy Brennan until Sheriff Harry S. Truman arrived and informs him that Laura had been found dead. Due to his unconfirmed whereabouts for the previous night, he was immediately wanted for questioning. Truman told him he could make a phone call to his parents to get their lawyer. Bobby interpreted this as being considered a suspect and insisted that the two of them loved each other. Truman told Deputy Andy to assist him as he made his phone call, but he resisted until he was restrained by the deputy and sheriff.\nHe was later brought in for questioning before Sheriff Truman and FBI Special Agent Dale Cooper, who had been sent in to investigate the case. Cooper's very first question was if he killed Laura, which he angrily denied. He confirmed that Laura was at his house \"studying\" until around 9:30 the night before and that she drove herself home. He was angered further when Cooper brought up the fight the couple had the week before. The FBI agent then showed him a video of Donna and Laura, but it was not filmed by him. Cooper announced to him that Laura was seeing someone else, as he had suspected during the couple's fight. He was also asked if he had ever used cocaine with Laura, but he denied it, saying that he did not use drugs. Cooper then asked if he knew anyone with the initial 'J' that could have filmed the video. Bobby said, \"no.\"\nAfter being released, Bobby went to Mike, who was waiting for him and Donna, who was then being questioned. He mentioned to him that they were going to rough up a biker with the initial 'J.' He started to leave when he saw his parents talking to their lawyer. His father offered a sympathetic ear, but he rudely declined.\nIn the evening, he went with Mike to speak with Donna, who was not home despite a curfew instated for residents under 18 years of age. They left for the Roadhouse, where a singer performed and they waited for Donna. When she arrived, Mike angrily grabbed her, with Ed Hurley coming to her aid, though Bobby beat him down and the two boys were attacked by other bar patrons.\nThey were arrested and later saw James Hurley being taken to a cell. They began barking at him.\nBobby sat in his cell the next morning with Mike, discussing the money they owed Leo, half of which was in Laura's safety deposit box, for she was supposed to give it to him that day. They argued over how they would get Leo the $10,000 they owed him. They watched as James is escorted back to his cell by Deputy Hawk.\nLater, they sat with Sheriff Truman in the interrogation room when Agent Cooper came in and released them after Mike insisted the fight at the Roadhouse was self-defense. He also told them that if anything happened to James, that they would be immediately suspected.\nAt dinner, he sat at the table as his mother and father prayed. His father began talking to him, wishing to discuss his feelings over the past few days and the limits that should be in place on his rebelliousness. Bobby ignored him and placed a cigarette in his mouth, which caused his father to smack him, sending the cigarette into his mother's food. She picked it up and told him they were there for him.\nBobby and Mike later drove past the Hayward home and saw James' bike outside.\nBobby went with Mike to the woods to pick up the drugs left by Leo inside a football. However, it was not all there and Leo revealed himself. He also noticed another man in the area. They discussed the situation with the money and Leo told him that he knew Shelly had been seeing someone else but did not say if he knew who. He told them to \"go out for a pass\" and threw the football, which landed on the hood of the car Bobby and Mike were driving.\nHe later went to Shelly, who was reluctant to let him in. When he gained entry, he noticed her bruised face, finding that Leo had beaten her. He then declared that if Leo harmed her again, he would kill him.\nThe following day, Bobby stood in front of a sculpture of Jesus on the cross and went to touch it when his father interrupted. The major had him put out his cigarette and the two sat down, Bobby's father talking about his experience with funerals and his wishes to speak more to his son. Bobby was angered when his father insinuated that he was scared of Laura's funeral.\n \nAfter the preacher finished speaking at the funeral, the angered Bobby accused the attendees of killing her, for they all knew she was in trouble. James then charged at him, though they were restrained by the lawmen and Ed.\nBobby was at the Johnson home the next day, kissing Shelly. She told him that Leo was currently with Jacques Renault. He then told her about Leo and Jacques's drug operation and that Laura purchased cocaine from them. She then showed him a bloody shirt belonging to Leo. He happily took the shirt, declaring that it would put Leo away.\nBobby planted Leo's shirt in Jacques's apartment that night and escaped the sheriff's department who were there to question Jacques.\nThe next day, he sat in Shelly's kitchen and kissed her, then played out a scenario in which Leo showed up and Bobby threatened his life. Then Deputy Andy came and Bobby hid, listening in on the conversation. Andy asked about Leo's current whereabouts, and Shelly told him she overheard Leo having an argument with Jacques about Laura. When Andy left, Bobby came out of hiding and kissed Shelly. The phone then rings, Leo on the other end, who would be coming home soon. Bobby placed a pistol in Shelly's hand.\nBobby and his family later attended a family counselling session with Doctor Lawrence Jacoby. Jacoby asked to talk to Bobby alone and his parents left. Dr. Jacoby then started questioning Bobby about Laura, and what he knew of the circumstances surrounding her death. Bobby was at first quite provoked by these questions and irately refused to answer them, but Jacoby revealed that he knew quite a few of his secrets through Laura, specifically his actions during his first sexual encounter with her, where he cried and Laura laughed at him for it. Stunned by this, Bobby grew distraught and opened up about his relationship with Laura. He explained that she held a very dark world-view and believed that she had wanted to die and that she held some secret that made her wish for death. Jacoby insisted that Laura wanted to corrupt Bobby, who tearfully confirmed this, stating she made him sell drugs for her addiction's benefit.\nBobby went to the Johnson home the following day to see Shelly, who was upset after shooting Leo. She went over what happened and Bobby promised to deal with Leo and James, then kissed her.\nAt night, he went to the park, where he saw James and Donna ride away. He followed them to Doctor Jacoby's office and he slipped a bag of cocaine into James' motorcycle's gas tank.\nHe watched as James and Donna left Jacoby's office and pointed his fingers like a gun as they drove away on James' bike.\nBobby called the sheriff's department, posing as Leo, and told them to check out James, for he was an \"easy rider.\"\nHe went to the Johnson home, looking for Shelly. Leo revealed himself, saying Shelly was not there and he attempted to kill him with an axe, while Bobby frantically tried to talk him down. Leo, however, was shot through the living room window and fell backwards into his sofa. Bobby took a quick look out the window and caught a brief glimpse of the gunman, Hank Jennings. When he realized that Leo was not getting back up again, he calmly left.\nBobby visited Shelly—suffering from smoke inhalation after being present at the burning Packard Sawmill— the next morning in the hospital, bringing her flowers. They discussed Leo's actions involving her the previous night. Bobby then left, declaring his love for her.\nHe went to the Double R and he joined his father, who told him about a vision he had of an extravagant home where his happy son came to visit and the two embraced. His father said that the dream had made him sure that Bobby had a very bright future ahead of him, something Bobby was greatly moved by. Teary-eyed, he shook hands with his father, who, before he got up and left for work, told him he was grateful he could share this experience with him. Hearing Hank try to talk to Norma, he remembered that it was Hank who shot Leo the night before.\nIn his car the next day, he sat with Shelly and they discussed living off of disability checks for the paralyzed Leo. Shelly was very resistant to the idea at first, as it required that she would have to abstain from testifying against Leo, but Bobby managed to convince her, saying that the money would be worth it and he would help her look after Leo if need be.\nDays later, Bobby sat in a Port-O-Patient machine sold by Tim Pinkle, testing it out for Leo, but the machine proved itself to be unsafe. Shelly took Bobby aside to ask about their current situation before she went to meet Leo's lawyer. They then went outside, leaving Mr. Pinkle in the Port-O-Patient.\nBobby then followed Hank to the Great Northern Hotel.\nHe struggled to push Leo through the house in his wheelchair the next day, bumping him into several objects. Insurance representative Tom Brockman highly approved of their decision to take care of Leo. However, Bobby and Shelly were dismayed to find out they were to only get $700 a month in insurance rather than the $5000 they expected.\nThey later had a party for Leo, and for the first time, expressing their love in front of him. Bobby brought over a cake and Leo fell into it.\nThe next day, he and Shelly determine the Johnsons' financial situation, determining they only had $42 for the month following expenses. Leo began to scream, then spat and said, \"New shoes.\" Bobby asked what this could mean and Shelly mentioned a pair of boots he had gotten repaired the week before.\nHe retrieved Leo's boots and took them back to the house with Mike. They broke the heel off of one of the boots and found a micro-cassette.\nHe later had a drink at the Roadhouse and was moved by the singer's performance of \"The World Spins.\"\nThe following day, Bobby listened to the tape found in Leo's boot, which contained the voices of Benjamin Horne and Leo planning the arson of the mill. With this blackmail, he wrote a note for Horne, saying they needed to talk, and then Shelly went to him, covered in the food she was trying to feed to Leo.\nBobby took Leo to the roadhouse the next day, as requested by Agent Cooper, who determined Laura's killer to be Leland Palmer, who later died in custody.\nWorking for Horne\nBobby put on one of Leo's suits the following day to meet with Benjamin Horne. He reassured Shelly that this business would make them financially secure.\nHe waited outside Ben's office when his secretary came to tell him that he was not expected and could meet with Horne perhaps the next month. Horne's daughter, Audrey then came asking him what he was doing there. She left for a moment and got him into her father's office. However, Horne kicked him out and he left the tape behind.\nBobby enters Horne's office days later, where he found the furniture stacked, with Ben crouched next to the stack. Ben told Bobby he needed to have balance, distance, and symmetry then asked him to admire the stack of furniture. When Bobby asked about the tape, Ben confirmed that he listened to it. However, he then told him to follow Hank Jennings. As he left, Lana Milford runs past him, screaming.\nHe later saw Audrey and announced that he was on assignment from her father. She proposed doing business together and he went to Ben's office, where he had set up a miniature re-enactment of the battle of Gettysburg. He handed over pictures of Hank and was offered a full-time position.\n \nBobby went home and found his mother sitting in the dark. When he asked her about this, she cried for Bobby's father, who disappeared days before while on a fishing trip with Agent Cooper. He told his mother about the dream his father explained to him. The power then went out and Bobby and his mother saw his father standing in the living room. The power came back on as his mother went to hug him.\nBobby went to the Johnson home the next day, where Shelly was feeding Leo. She was upset as it was his turn to feed him and he left.\nHe went to Horne's office, where the Civil War re-enactment had grown, Ben then believing himself to be General Robert E. Lee. He went out to Audrey, who said her uncle and Jacoby were coming to help her father's condition.\nAudrey planned with Bobby to break Ben out of his mental state, insisting that she was the one he answered to for the time being.\nHe returned to the Johnson home, where Shelly was being attacked by Leo. Bobby got inside, where Leo had raised an ax to kill his wife. Bobby attempted to disarm him but was pinned against the wall by him until Shelly managed to stab Leo in the leg, and the latter escaped.\nBobby and Shelly went to the sheriff's station, where they talked to Agent Cooper and Sheriff Truman about Leo's attack. The sheriff asked why he was at Shelly's house, to which he openly admitted their relationship and the duration of it. Cooper then asked where he was the night the mill was burned down, suspecting him to be the one who shot Leo, but he said that Hank was the one responsible. Truman told Shelly he would assign deputies to keep an eye on her home, though Bobby was resistant to this. They were then dismissed.\nHe went to the Great Northern in a Confederate uniform, where he was commanded to play the bugle for the Great Northern employees also acting as Ben's troops.\nBobby once again played the bugle in Ben's re-enactment, then at the surrender at Appomattox, announcing the arrival of Jacoby as General Grant. Jacoby surrendered, despite the historical inaccuracy. Ben collapsed, then came to, believing his Civil War to have been a dream.\nThe next day, he attended Horne's business meeting with John Justice Wheeler, a potential business partner. Ben presented his plan to work against Catherine Martell's Ghostwood development plan in the name of the near-extinct Pine Weasel.\nAt the diner the next day, Bobby told Shelly that he had noticed that beautiful people get what they want, so she should enter the Miss Twin Peaks Contest.\nHe went to the Roadhouse with Shelly for the contest tryouts, but she worried that she would be unable to give a speech. He reassured her, saying that he would write her speech for her.\nBobby saw Mike with Nadine Hurley and pulled him aside to voice his concern for their relationship. Mike dismissed his concerns, using Nadine's sexual maturity and extreme strength as his reasoning for the relationship.\nHe later went to the diner, where he saw Shelly kiss FBI Regional Bureau Chief Gordon Cole. The man taunted Bobby, then kissed her again, Bobby standing confused.\nBobby and Shelly went over the speech the next day, but then he expressed that he felt like he had been neglecting her, but seeing Cole kiss her made him realize this and that he loved her.\nHe sat backstage at the Miss Twin Peaks contest the following day and noticed that he saw the Log Lady both at the bar and also backstage. He approached her backstage, thinking it may have been a relative, but she bashed his head with the log, knocking him out. In reality, this Log Lady was actually former FBI Agent Windom Earle.\nBobby and Shelly watched his parents having a happy breakfast the next morning and he told Shelly that they should get married. A few days later, Leo was found dead in a cabin in the nearby woods, shot five times by an unknown assailant. After an \"appropriate\" mourning period, Shelly and Bobby resumed their relationship, now a publicly known couple.\nLater life\nAlmost one year to the day after Leo's body was found, Shelly married Bobby during a weekend trip to Reno, Nevada. Seven months later, Shelly gave birth to their daughter, Rebecca McCauley Briggs. Bobby's mother and Norma Jennings co-signed a loan to allow the couple to buy their first home, and continued to provide moral and financial support.\nOver the next twenty-five years, however, Bobby and Shelly's marriage crumbled and ended in divorce some years later. Their daughter \"Becky\" eventually married Steven Burnett.\nIn a Q&A, Mark Frost indicated that Bobby and Mike Nelson remained friends and were in a bowling league together. He also stated that Shelly and Bobby \"raised Rebecca together but slowly grew apart, as young couples often do. Amicable divorce, shared custody. Shelly's weakness for \"bad boys\" never went away, but infidelity was not the root cause for their breakup.\"\nAt some point over the course of these twenty-five years, Bobby became a deputy with the Twin Peaks Sheriff's Department and kept his eye on possible drug trails. He was advised by Sheriff Frank Truman to be aware of Chinese designer drugs. After a much-needed bathroom break, he met with Deputy Chief Hawk and Sheriff Truman in the conference room and saw a photo of Laura Palmer, causing him to become emotional. While Hawk and Truman discussed files pertaining to Agent Cooper - who had been missing for twenty-five years - Bobby informed them that Cooper had been the last person to see Bobby's father alive, but he did not know what the two discussed during their last meeting.\n \nAlong with Truman and Hawk, Bobby visited his mother to discuss his father's activities with Cooper prior to his death. She told them that she had been foretold by the Major about this visit and reflected on Bobby's growth over the previous twenty-five years. She then took a metal container out of a chair and gave it to the men, as it had been left by Garland for this visit.\nThey took the container back to the sheriff's station, kicking Deputy Chad Broxford out of the conference room in the process. However, Bobby became amused at Frank and Hawk trying to open it and said it had to be opened outdoors. They took it outside and Bobby threw it on the ground, causing it to make a noise before he threw it down again to open it. Truman pulled out slips of paper: one with directions referring to the \"Jack Rabbit's Palace,\" an imaginary place he and his father came up with in his childhood, and a slip of paper transcribing transmissions that include Cooper's name twice.\nAfter an incident where Becky took Shelly's car to confront Steven – who was having an affair with Gersten Hayward – Bobby met her and Shelly at the Double R to discuss her situation with Steven. Bobby and Shelly both advised she leave him and Bobby stated that he would no longer allow Steven to get away with his crimes. Shelly then ran off to have a moment with Red, which Bobby and Becky watched from the diner with visible misgivings.\nA shot then rang out and Bobby went outside to investigate, finding that a young boy in a van fired a gun. While waiting for the boy's mother to get her ID out, he noticed the boy standing with a stance that mimicked that of his father's, apparently not affected by what he had just done, disturbing Bobby. Deputy Jesse Holcomb took over the situation and Bobby went to the car of a woman who continuously honked her horn, finding the woman frustrated and with a sick girl in her passenger's seat.\nAnother evening, Bobby went to the diner and joined Ed Hurley and Norma Jennings for dinner, telling them that he had found belongings of his father. However, he and Ed moved to a different booth when Norma's boyfriend, Walter Lawford, arrived.\nAfter arresting Deputy Broxford, Bobby led his fellow lawmen to Jack Rabbit's Palace, following his father's instructions. They continued through the woods and found a nude, eyeless woman, who Andy noted to be important.\nDue to a fight at the Roadhouse, Bobby and Hawk locked up James Hurley and Freddie Sykes. Later, Hawk summoned Bobby, along with Andy, Lucy, and Frank to the conference room to announce the death of Margaret Lanterman.\nAfter a commotion at the station, Bobby wandered to Sheriff Truman's office, where everyone else had gathered, including Dale Cooper. Cooper told Bobby that his father was aware of the events that had unfolded that day, which Bobby himself was unaware of. Cooper said these events had brought them together and that some things would change.\nPersonality\nBobby is initially introduced with a typical \"jocky\" personality, an archetype exemplifying the high-school setting as well as his work as a drug dealer and user. He is presented as an opportunist, constantly scheming for ways to earn money, though to some extent this comes from a desire to build a better life for him and Shelly. Nonetheless, he was willing to let Shelly tend to a vegetative Leo in the name of finding work, ignorant of her obvious frustration.\nUnderneath this tough exterior, however, hides a vulnerable personality. After killing a drug dealer in self-defense, Bobby is left shocked, frantically burying the body and constantly worrying about the incident the next day. His stress is not helped by Laura literally mocking him about the incident, which results in him breaking up with her after realizing she was mainly after him for the cocaine. Following her death, Bobby tried to maintain his old personality, but easily broke down during Dr. Jacoby's session with him.\nIn the series' continuation, Bobby has evidently renounced his old ways, now working as a deputy for the Sheriff's Department and, rather than dealing drugs, keeping an eye out for drug dealers at his old high school. The deaths of Laura Palmer and his father still deeply affect him, as evidenced by his emotional reaction to seeing Laura's old prom photo and learning that his father never gave up hope for him. Though he and Shelly have separated, he still carries a torch for her, sadly watching her flirt with Red.\nBehind the scenes\nBobby was played by American actor Dana Ashbrook, who reprised the role in the 2017 series.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}