{"name": "Bookhouse_Boys", "url": "https://twinpeaks.fandom.com/wiki/Bookhouse_Boys", "text": "Bookhouse Boys\nThe Bookhouse Boys (formerly Citizens Brigade) were a secret society formed to combat the darkness surrounding the town of Twin Peaks. \nThe members, some of whom belonged to the Twin Peaks Sheriff's Department, also played a kind of vigilante role against drug dealers, etc. \nHistory\n \nFollowing an enlistment surge in the town brought about by a screening of the film 49th Parallel, the Citizens Brigade was formed in the 1940s to defend Twin Peaks prior to the United States' entry into World War II. Among the founders was Sheriff Frederick Truman, whose sons Frank and Harry would succeed him as sheriff and become members of the Bookhouse Boys, by which name the group eventually began to be known.\nThe group had their own secret gesture: a stroke with a finger on either temple. They derived their name from the Bookhouse, the group's designated meeting spot as of the late 1960s.\nWhile not initially aware of the existence of the Black and White Lodges, the Bookhouse Boys had long known that there was a kind of evil surrounding the town which caused dark and unusual events to occur. They believed that this might be part of the \"price\" the town had to pay for all the benefits that came from its comparative seclusion from the modern world.\nMembers\n \n \nThe best-known members of the Bookhouse Boys were:\nSheriff Frederick Truman (founder)\nSheriff Harry S. Truman\nDeputy Tommy \"Hawk\" Hill\n\"Big\" Ed Hurley\nJames Hurley\nJoey Paulson\nFBI Special Agent Dale Cooper, made an honorary member; the only known non-resident member.\nFrank Truman\nCappy\nAndy Brennan\nHank Jennings was also once one of the Bookhouse Boys, and in fact, \"one of the best\" according to Harry Truman. However, Hank's later behavior, including drug dealing and assassination attempts, which resulted in him getting sent to prison, suggests that he was almost certainly expelled.\nToad\nJerry Horne\nIn a tweet, Mark Frost implied that Carl Rodd was an original member of the Bookhouse Boys, although he would have been no older than five years of age at the time of formation.\nThe seven members of the starting lineup of the 1968 Twin Peaks High Lumberjacks were all in the Bookhouse Boys.\nLucy Moran bought the books for the organization."}