{"name": "Bradley_Mitchum", "url": "https://twinpeaks.fandom.com/wiki/Bradley_Mitchum", "text": "Bradley Mitchum\nBradley Mitchum, along with his brother, Rodney Mitchum, owned the Silver Mustang Casino.\nBiography\nBradley and Rodney were raised in an orphanage.\nAfter a man won $425,000 at the Silver Mustang, Bradley and his brother went to the casino to punish Burns, the supervisor. After Rodney beat him up and replaced him with Warrick, the pit boss, Bradley told Burns to leave town and told Warrick to inform them if the winner ever returned to the casino.\nLater, while watching the news, Bradley and Rodney saw that Ike \"The Spike\" Stadtler had been arrested for attempting to take the life of \"Dougie Jones,\" the man who had won at the casino.\nAnthony Sinclair later told them that Jones had been attempting to keep them from an insurance claim on a hotel the brothers owned, which had allegedly burned down due to arson.\nBradley had a dream of killing Jones, which he told his brother about the following afternoon. Prior to their meeting with Jones, he stated that the cut from Candie hitting Rodney was gone in his dream, then ripped it off of him. When Jones showed up with a box, Bradley told his brother that in this dream, there was a cherry pie in the box, meaning that Jones was not their enemy. Bradley opened the box, revealing a pie, and found a check to the brothers for $30 million in Jones' pocket. As a result, the brothers treated Jones to dinner.\nThe brothers later delivered gifts for Dougie's boss, Bushnell Mullins: Montecristo Number Twos, diamond cuff links, and a BMW convertible. They also purchased a gym set for Dougie's son and a BMW convertible for the family.\nBradley and his brother later visited Jones in the hospital, where he was comatose due to inserting a fork into an electrical socket. The Mitchums brought food for the family and met Jones' wife Janey-E and Sonny Jim before offering to stock their home.\nLater, while making their delivery to the home, the baffled brothers witnessed a shootout in the neighborhood, the cause of which Brad's brother blamed on stress. They decided to leave as the FBI arrested a Polish accountant, the only survivor of the gunfight.\nDougie later awoke and requested from the brothers and plane to Spokane. They noticed Jones behaving differently and were informed by him that he was actually FBI Special Agent Dale Cooper who had been missing for twenty-five years and needed to reach the town of Twin Peaks. The brothers expressed their doubt that they could continue their allegiance due to the brothers' criminal ties, but Cooper assured them that he could see past this and believed them to have hearts of gold.\nUpon accompanying Cooper to the Twin Peaks Sheriff's Department, Bradley, his brother, and Cooper arrived in time to see BOB removed from the body of Cooper's doppelganger and fight Freddie Sykes, who pulverized him. Bradley stood in stunned silence until Deputy Bobby Briggs entered, asking \"what's going on around here?\" prompting Bradley to respond that Bobby \"took the fucking words right out of mouth.\""}