{"name": "Briggs_house", "url": "https://twinpeaks.fandom.com/wiki/Briggs_house", "text": "Briggs house\nBriggs house was the residence of Briggs family.\nHistory\nOn February 23, 1989, Major Briggs read to Betty from the Book of Revelation. Betty let Laura Palmer in. Bobby revealed to Laura that the supposed cocaine they picked up and killed the mule for was actually baby laxative. Bobby was dealing with the consequences of what he has done, while Laura's thoughts were on getting more cocaine. Bobby gave her the cocaine and let her snort it. After he and Laura officially broke up, Bobby showed her out of the house. After closing the door he pulled out a cigarette and started to light it. Major Briggs looked up and told Bobby to put out the cigarette. Major Briggs continued reading. \nThe next morning, Laura's mother called for her to come down. After receiving no answer, she searched the house for her daughter but did not find her. She called the home of Laura's boyfriend, Bobby Briggs. While Major Briggs read the paper, she asked Bobby's mother Betty if their children were together, but she did not know. Betty gave Sarah the phone number to the school's field office to possibly reach Bobby, as he was supposed to be at football practice.\nOn February 25, 1989, the family sat around the dinner table. Garland Briggs wished to discuss with Bobby the events since Laura's murder, but Bobby instead lighted a cigarette. The major smacked his son, sending the cigarette flying into Betty's dinner. Betty told their son that they are there for him.\nOn the day of Laura's funeral, Bobby, in a suit, stretched in front of a crucifix. His father asked to talk. The major lectured about funerals and responsibility while Bobby plays with his lighter. The major said Bobby did not need to be afraid, and Bobby shouted until his mother, Betty Briggs, entered and asked if everyone is ready to go.\nOn March 16, 1989, Betty Briggs sat alone in the dark waiting for Bobby. The room is lited by a large white ceramic owl lamp and intermittent lightning strikes. Bobby reassured her that the Major will return. Bobby told Betty about the Major's dream and Briggs returned after being missing for two days, wearing an aviator cap, and asked for a strong cocktail.\nOn September 2016, Bobby visited his mother with Sheriff Frank Truman and Hawk to discuss her husband's activities concerning Cooper before his death. She told them that she was expecting this visit, as Garland had told her it would happen, but would not explain what it would be about. Per his instructions, she gave them an object that was hidden inside a chair.\nGallery\nKitchenDining roomBasementLiving roomLiving roomLiving room in 2016\nBehind the scenes\nThe exterior of the house and some interior scenes were shot in 4415 337th Place Southeast, Fall City, Washington.\nIn January 2008, Twin Peaks Archive posted two images of the Briggs house exterior from the location in Agoura Hills, California. \nBriggs sign made from old chainsaw part"}