{"name": "Bushnell_Mullins", "url": "https://twinpeaks.fandom.com/wiki/Bushnell_Mullins", "text": "Bushnell Mullins\nBushnell Mullins was the chief executive of Lucky 7 Insurance, a Las Vegas insurance firm.\nBiography\nIn his younger days, Mullins was a champion boxer known by the moniker \"Battling Bud.\" A poster of a June 18 prize fight at the Civic Auditorium hung in his office.\nOne September 26, Mullins called a staff meeting to review active claims by Lucky 7's clients. Anthony Sinclair reported that the firm was obligated to honor Littlefield's claims, but the man believed to be Dougie Jones blurted out that Sinclair was lying. Shocked, both Sinclair and Mullins asked him to elaborate, but \"Jones\" was incapable of saying any more. Afterward, Mullins called \"Jones\" to his office and gave him a stack of Sinclair's case files to review, saying his performance would directly impact his continued employment.\nThe next day, \"Jones\" returned with the files, in which he had drawn scribbles and lines. At first, Mullins accused the work of being childish, but soon seemed to understand what it all meant and offered to shake the hand of \"Jones\".\nHe gave a statement to the police after an attempt was made on \"Dougie\"'s life and he noted the strange circumstances before giving \"Dougie\" the rest of the day off, suggesting they find answers the next day.\nMullins called \"Dougie\" into his office the next day, informing him that his case files revealed an organized crime conspiracy behind Rodney and Bradley Mitchum's real-estate claim for a hotel that burned down. It was indicated in the files that it burned by accident rather than because of arson, so Mullins sent \"Dougie\" with $30 million to reimburse the brothers.\nThe Mitchum brothers and their assistants brought \"Dougie\" to Mullins' office, bearing gifts for him: Montecristo Number Twos, diamond cuff links, and a BMW convertible.\nSinclair and \"Dougie\" later came to his office, the former confessing to activities with Duncan Todd and Mullins requested him to testify against Todd.\nAfter \"Dougie\" was hospitalized and slipped into a coma due to sticking a fork in a wall outlet, Mullins came to visit him, followed by the Mitchum brothers, who brought food for the Jones family.\nJones' wife, Janey-E soon took their son Sonny Jim to the bathroom and Mullins received a call from Phil Bisby, who told him that the FBI had come to the insurance office, searching for Dougie.\nBushnell eventually began to hear a strange noise in the hospital and followed it. When he returned to \"Dougie\"'s room, he found \"Dougie\" with his family, awake and fully alert, much to Mullins' surprise. After \"Dougie\" announced he was leaving the hospital, Bushnell got him his clothes.\nMullins lent \"Dougie\" his snubnose revolver and was told to contact the Mitchum brothers, from whom \"Dougie\" requested a plane to Spokane. \"Dougie\" then gave him a message to read to a Gordon Cole he expected to call. As \"Dougie\" said his farewells, Bushnell asked him about his concern for the FBI, to which \"Dougie\" responded, \"I am the FBI.\"\nAfter FBI Agents Randall Headley and Wilson arrived at the hospital, they allowed Mullins to deliver \"Dougie's\" message to Gordon Cole.\nBehind the scenes\nBushnell Mullins is possibly a reference to Bushnell Keeler, a close friend of David Lynch who also was in his first 1967 home movie Sailing with Bushnell Keeler.\nTrivia\nOn the poster in his office, the following can be read next to a picture of a young Bushnell Mullins:\n\"Tougher than the rest\"\nBushnell \"Battling Bud\" Mullins\nIn four furious rounds!\nTuesday 18 June 7:30PM\nCivic Auditorium\nGeneral Adm: $150\nReserved seatings: $250-$350\nRingside: $500"}