{"name": "Candie", "url": "https://twinpeaks.fandom.com/wiki/Candie", "text": "Candie\n\"There was so much traffic on the Strip...it was incredible! There were cars everywhere!\"\"\nCandie, along with Mandie and Sandie, was an assistant to Rodney and Bradley Mitchum.\nBiography\nLike her companions, Candie wore a pink cocktail waitress uniform and constantly attended to the Mitchum brothers, both at home and at the Silver Mustang Casino.\nCandie and her companions joined the Mitchums as they disciplined Burns for allowing the unidentified \"Mr. Jackpots\" to make off with several hundred thousand dollars at the slot machines. They leaned disinterestedly against a wall as Rodney beat the man.\nWhile Rodney worked on casino paperwork at home, Candie shuffled around the living room, trying to swat a fly. Eventually, she picked up the TV remote and accidentally smacked Rodney across the face trying to hit it. She began crying and screaming, horrified at what she had done, as Bradley ran into the room to see what had happened. Later that evening, Candie tearfully asked how Rodney could ever forgive her.\nAt the casino, the Mitchums ordered Candie to go out to the floor and bring Anthony Sinclair to the surveillance room. After repeated prompting, she agreed. They watched on a surveillance camera as Candie approached Sinclair and began pointing around the room while telling him something. The brothers exploded with frustration as she took several minutes to bring him to them, but Bradley reminded Rodney that Candie would have nowhere to go if they fired her. When they finally arrived, Candie explained that she had been telling Sinclair how lucky they were to have air conditioning, as the casino was in the version layer. After more prodding, Candie escorted Sinclair out once their meeting was concluded.\nCandie and the other girls joined the Mitchums and Dale Cooper at Santino's, where she explained with wonder that there was heavy traffic on the strip. She brought the men more pie at their request.\nThe girls performed a conga line through the Lucky 7 Insurance office with Cooper and the Mitchums. Candie delightedly presented Bushnell Mullins with several gifts as thanks for honoring the Mitchums' insurance claim, including a set of diamond cuff links and a brand-new convertible to match Dougie's.\nWhen Cooper fell into a shock-induced coma, the Mitchums' entourage brought finger sandwiches and a giant bouquet to his hospital room. Afterwards, they all visited the Jones home to restock the kitchen.\nThe girls accompanied the Mitchums and Cooper in the limousine as Cooper explained that he needed to get to the Twin Peaks Sheriff's Department. Despite the brothers' reservations, Cooper assured them that he could vouch for their character, and Candie enthusiastically agreed.\nBehind the scenes\nCandie is portrayed by Irish actress Amy Shiels, who also provided her voice to The Secret History of Twin Peaks audiobook. Shiels's interpretation of the character on-set was that she had a history of being abused and thus saw the Mitchum brothers as her saviors. Though this was based on her own intuition, it appears to be confirmed by a conversation between the Mitchum brothers remarking that Candie has nowhere to go, which Shiels was not aware of until the episode aired as it was not in her copy of the script and she was not present for its filming.\nShiels improvised Candie's (unheard) monologue about air conditioning units in Part 10 for a good five minutes on-set.\nMark Frost stated that she still lives in Vegas."}