{"name": "Carl_Rodd", "url": "https://twinpeaks.fandom.com/wiki/Carl_Rodd", "text": "Carl Rodd\n\"I've already gone places. I just want to stay where I am.\"\nCarl Rodd was the owner of Fat Trout Trailer Park in Deer Meadow, close to Twin Peaks, Washington.\nBiography\n\nEarly life\nCarl attended Warren G. Harding Elementary School in Twin Peaks, Washington. On September 9, 1947, while on a nature hike near Pearl Lakes, Carl and his classmates Maggie Coulson and Alan Traherne disappeared. They were found by Andrew Packard and his Eagle Scout troop at the Pearl Lakes campground the next day after an intense overnight search, in perfect health, and all three seemed to believe they had only been in the woods for an hour or so. Based on a photograph of Carl Rodd during his military years, he appeared to have gained a strange triangular marking on the back of his knee, possibly during this episode.\nFollowing his graduation from Twin Peaks High School in 1958, Carl joined the United States Coast Guard and achieved the rank of boatswain's mate while on a patrol boat in Vietnam.\nAfter the devastating 1964 earthquake and tsunami in Anchorage, he was reported missing and was rescued by a group of Aleuts, the only survivor from his patrol boat. Carl lived with the Aleuts for five months as he regained his strength and claimed to have had a spiritual conversion during this time. He married an Aleut woman, who died the following year in childbirth, along with their child. Afterward, Carl left the tribe and wandered the Yukon and British Columbia for several years.\nCarl settled in Yellowknife, where he worked as a tracker for hunting expeditions, wrote poems and songs, and occasionally performed. He was also credited as a stunt performer in films that shot on location in the area, among them Emperor of the North (1973) and Rancho Deluxe (1975).\nDeer Meadow\nRodd returned to Twin Peaks in the 1980s and eventually settled at the Fat Trout Trailer Park in Deer Meadow, Washington, becoming the trailer park's manager and part-owner. The Twin Peaks Post began to occasionally record quotes from Carl in a section called \"Carl Said It.\"\nIn May 1983, the Twin Peaks Post printed an open letter from Rodd to Twin Peaks mayor Dwayne Milford demanding an investigation into the government facility being built in secret on Blue Pine Mountain, which he had observed during his daily walks.\nThe letter apparently indicates that the Fat Trout Trailer Park was located in Twin Peaks, not Deer Meadow, at this time.\n \nIn February 1988, a resident at the trailer park, Teresa Banks, was found murdered in the nearby Wind River. FBI Agents Chester Desmond and Sam Stanley visited Carl at his home to request access to Banks' trailer. Exasperated at being disturbed so early in the morning, he reluctantly took them there and left to make some \"Good Morning America.\" He returned a few minutes later, now in a better mood, and joined them for a coffee break. Carl was visibly disturbed when a hunched old woman wandered into the trailer, shuddering beneath her breath. Agent Desmond asked if she had known Teresa Banks, but the woman wordlessly retreated. Rodd, taking a drag on his cigarette, told Desmond, \"I've already gone places. I just want to stay where I am.\"\nThe following evening, Desmond came back, asking to see Deputy Cliff Howard's trailer. An old woman named Margaret asked Carl when her hot water would be fixed, and he left Desmond to take care of her concern.\nSome days later, another FBI agent, Dale Cooper, came looking for Desmond, who had apparently disappeared. Carl told him about the night he had last seen Agent Desmond and pointed him to Depuy Howard's trailer, and was exasperated when Cooper insisted on wandering somewhere else. Cooper went to a spot where a trailer had recently been moved, and Carl explained that an old woman and her grandson had been staying there. They used the name \"Chalfont,\" as had the tenants before them. He followed Cooper to Desmond's abandoned car, which had the words \"Let's rock\" scrawled across the windshield.\nLater years\nIn his waning years, Carl rode into Twin Peaks most mornings with Bill to people-watch. One morning, he was joined by Mickey, who said he needed to fetch his wife Linda's mail at the post office. They made small-talk, and Carl commented that he didn't have much to look forward to at his age other than his morning ritual.\nAt a local park, Carl drank his coffee and enjoyed the morning air, laughing at a boy who ran past playing with his mother. Minutes later, he heard a cacophony and walked over to find that the boy had been struck and killed by a truck, while his mother screamed and cried over him in the street. Carl saw a yellow flame-like aura rise out of the boy's body and into the sky, watching it in awe. As bystanders gaggled, Carl walked alone and knelt beside the woman, placing his hand on her shoulder.\nOne day, Carl played \"Red River Valley\" on guitar in front of his trailer. Suddenly, a coffee mug was thrown out the window of Steven and Becky Burnett's trailer, while inside Steven's screams of rage could be heard, apparently not the first such incident he had witnessed. Carl commented that it was a \"fucking nightmare.\"\nSome days later, Carl saw Shelly Briggs being flung off of the hood of her own car, which Becky had stolen in a blind rage. He rushed over to help her, and agreed to give her a ride back to the Double R Diner. Carl blowed a pan flute, signaling Bill to drive over in his van. On the way, Carl used a two-way radio to reach the sheriff's dispatcher Maggie Brown and then Becky's father Bobby. He was horrified to hear from Shelly that Becky had taken a gun with her when she left.\nOne morning, Carl stopped Kriscol and asked if he had sold his plasma for food recently. He reminded Kriscol that he had performed maintenance and upkeep jobs for other tenants without being paid, and insisted that he didn't like the thought of him selling his blood to eat. Carl gave Kriscol fifty dollars and said that his next month's rent would be free.\nCyril Pons later reported to Carl that he had encountered a man in a suicidal state out in the woods behind the trailer park, and pointed out Steven's trailer.\nBehind the scenes\nCarl Rodd was played by character actor Harry Dean Stanton, who has also appeared in David Lynch's films The Cowboy and the Frenchman, Wild at Heart, The Straight Story, Inland Empire, and television series Hotel Room. Stanton reprised the role in the 2017 series of Twin Peaks. He was seen in a teaser released on May 4, 2017.\nIn The Secret History of Twin Peaks, Carl graduated from high school in 1958, which would place his birth in or around 1940.\nPer writer and co-creator Mark Frost, Rodd was an original member of the Bookhouse Boys.\nGallery\n\nTwin Peaks (2017)\n"}