{"name": "Carrie_Page", "url": "https://twinpeaks.fandom.com/wiki/Carrie_Page", "text": "Carrie Page\n\"Odessa... I tried to keep a clean house. Keep everything organized. It's a long way... In those days, I was too young to know any better.\"\nCarrie Page was a waitress at Eat at Judy's, a diner in Odessa, Texas.\nBiography\nCarrie took three days off work at the diner. After obtaining her address from Carrie's coworker Kristi, Dale Cooper arrived at her home, noticing a particular telephone pole outside. He identified himself as an FBI agent through her closed door and Carrie opened it for him, immediately asking if Cooper had found \"him.\" Cooper, however, was stunned by her appearance and asked if she was Laura Palmer. Page, in turn, was baffled and insisted she had no idea who that was. Cooper explained that it was very important that she go with him to Laura's house in Twin Peaks. Considering, she said that she happened to need to \"get out of Dodge,\" and figured she would be safe with an FBI agent. Carrie let him inside and ran to pack some belongings. Cooper saw a dead man seated on the living room couch, shot in the head, and a small figurine of a white horse sitting on her mantelpiece. Carrie returned and, after verifying they would stop to get food on the way, left with Cooper, ignoring her ringing phone.\nOn the drive to Washington, Carrie was briefly concerned about a car behind them, but it passed them without incident. Half-awake, she rambled to Cooper about her regrets before falling asleep. Later, they stopped at a Valero station.\nAs they drove into Twin Peaks and down Laura's street, Cooper asked if anything was familiar to her, but she said it wasn't. At Laura's house, Cooper was surprised to find that Sarah Palmer no longer lived there, and that the new owner had never heard of her. After speaking with her, Cooper and Carrie walked back to the street, perplexed, and turned to look up at the house. Cooper wondered aloud what year it was, while Carrie grew increasingly distressed. She began to hear Sarah's voice calling Laura's name, and screamed in terror, just as the house's lights blew out.\nIn the \"Behind the Red Curtain\" documentary, while filming Sheryl Lee's appearance in the red room from \"Part 2,\" first assistant director Scott Cameron appears to refer to her as \"Carrie Page,\" despite a visible script page that refers to \"Laura.\""}