{"name": "Catherine_Martell", "url": "https://twinpeaks.fandom.com/wiki/Catherine_Martell", "text": "Catherine Martell\n\"If you was laying odds on the last person standing after an atomic war, I'd have bet on her.\"\n ―Pete Martell\nCatherine Martell (née Packard) ran the Packard Sawmill, owned by her sister-in-law Josie Packard. She had an affair with Benjamin Horne and the two planned the destruction of the mill to develop the land for their own profit.\nBiography\n\nEarly life\nCatherine attended Twin Peaks High School.\nIn a Romeo and Juliet-esque story of rivaling families, Catherine married Pete Martell in 1958, thus becoming part of the rivaling Martell family.\nIn September 1987, her older brother, Andrew was reported to be dead from an explosion at his boathouse.\nIn 1989, she began an affair with Benjamin Horne, who planned to take over her family's sawmill to develop the land into a country club. She was with Benjamin on the night of February 23, 1989.\nLaura Palmer murder\nThe next morning, Catherine read a newspaper as her husband left to go fishing. When Pete discovered a body wrapped in plastic, she watched nearby as it was revealed to be Laura Palmer.\nShe later argued with her sister-in-law Josie, who wanted to shut the mill down for the day because of Laura's murder and the disappearance of mill worker Janek Pulaski's daughter, Ronette. However, Catherine wanted the mill to keep running. Josie ended up getting her way when Pete ordered the workers to pull the plug.\nShe later attended a conference where FBI Special Agent Dale Cooper announced the bureau's takeover of the Laura Palmer case due to striking similarities to a murder from the previous year.\nIn the evening, she was on the phone with Benjamin Horne and noted that Sheriff Harry S. Truman had arrived to spend time with Josie. Horne responded, \"Let's get together and talk about it,\" and they hung up.\nShe called Josie in the morning, reprimanding her for her actions the previous day, having cost them $87,000. She hung up and shared a glass of wine with Horne. She later laid under the covers as Ben straightened his tie in front of the mirror. They discussed the plan to rid of the mill for Horne's Ghostwood project, Ben suggesting starting a fire at the mill before he kissed her feet.\nAs she got ready for bed the next evening, she commented to Pete that the house smelled like fish and questioned why Cooper had been there earlier. When he insulted her, she told him to go to his room.\nCatherine attended Laura Palmer's funeral the next day and later in the evening, she listened to Josie speak with Sheriff Truman about hers and Benjamin Horne's plans against her. When Josie found only one mill ledger, Catherine smiled and hid a fake one under a drawer's false bottom. When Pete came in asking if she had seen his tackle box, she said that she knew Pete and Josie had been in the safe where the ledger had previously been with the fake one.\nCatherine met with Ben at the Timber Falls Motel the next day and discussed Josie finding the fake ledger. They continued to discuss their plan to destroy the mill until they heard a gunshot outside. When Ben went to take a bath, he dropped a poker chip. Catherine picked it up and finds that it said \"One Eyed Jacks.\"\nThe next day, Catherine went with Pete to a party held for Ben's Icelandic potential business partners. She was told by Pete to \"go easy on the sauce\" but she immediately drank an entire glass. She then approached Ben, who was entertaining a group of Icelanders, and poured her drink on his shoe to get his attention. In his office, she presented to him the poker chip he dropped and smacked him. He brought her in for a kiss and they agreed to give Josie one last chance to sell the mill. They went back out to the guests, where Leland Palmer was in the middle of having a breakdown, tearfully dancing alone. Ben commanded her to join him. When Leland began just crying, Catherine imitated him in the form of dance, causing everyone to join in.\nThe next day, she met with a life insurance agent, Neff, regarding a policy regarding her brother's death. She noticed that the only beneficiary was Josie, which the agent noted as unusual and urged her to sign it, though Catherine said she wished to go over changes in the policy with her lawyer. She went to find the mill's ledger, but it was gone from where she had hidden it.\nLater, Catherine frantically searched for the ledger at the mill as Pete entered. She suspected he had taken it for Josie, but he denied this. She reflected on their relationship, asking him to tap into the feelings he still had for her as she declared her need for his help. He embraced her in tears and she reluctantly hugged him back.\nShe and Pete searched their library for the ledger. She received a phone call from someone who says the ledger was at the mill. She armed herself with a revolver and left for the mill. Upon arrival, she fiound Shelly Johnson tied up near a bomb, which went off, sparking a fire. She cut Shelly free with a hatchet as part of the roof fell in and took her by the hand.\n\"Mr. Tojamura\"\nCatherine was assumed dead in the fire, and she believed that her survival was because of a guardian angel, and she found herself in the woods, with no recollection of how she escaped.\nDays later, she began to don the disguise of a Japanese businessman named Mr. Tojamura and booked a room at the Great Northern Hotel. In this disguise, she made an offer of $5,000,000 to Ben for the Ghostwood Project.However, she later met with Ben and expressed the fact that she had received nothing in return for the $5,000,000 she paid and threatened to withdraw. Leland Palmer then interrupted by starting to sing \"Getting to Know You.\" She went to the bar where she ran into Pete who identified the song as being from The King and I. He asked her if she liked musicals, but she said no.\nThe next morning, Deputy Andy Brennan brought her to a one-armed man, who said, \"No.\" She later met with Ben, who approved of the proposal for the Ghostwood Project. However, they were interrupted by Sheriff Truman, who entered with Agent Cooper and Deputies Hawk and Andy to arrest Ben for the murder of Laura Palmer.\nStill under the guise of Mr. Tojamura, she went to the Blue Pine Lodge and gave a big kiss to Pete. She then revealed her identity to him. Overjoyed, he hugged her.\nShe made a tape for Pete to present to the incarcerated Benjamin to sign over Ghostwood to her in return for testifying his alibi for the night Laura was murdered.\nThe next day, as Tojamura, she went to the sheriff's station, where Ben was being held. She presented the papers to have the Ghostwood Estates signed over to her, but Horne said he could not due to complications and he plead his innocence. As he gave an impassioned speech, she stuck her bare foot through the bars and he recognizes it as hers. He agreed to sign Ghostwood over to her in return for the alibi.\nSeveral days later, Catherine sat in Sheriff Truman's office and asked him if she was under suspicion for anything. When Harry asked about her absence, she told him that her life was saved by a guardian angel, having found herself in the woods after the fire, with no idea how she escaped.\nAndrew's return\nJosie told her the following day her that Thomas Eckhardt killed Andrew, but Catherine said she was already aware of this. As a result of Josie also being linked to Eckhardt, Catherine told her that she would be working as her maid. After Josie left, Andrew, alive and well, came into the office, noting that everything was going as planned.\nThe next day, Pete expressed his feeling that Josie's treatment was unfair.\nThe following day, Catherine made her way to Ben's office, overhearing a conversation between Audrey Horne and Bobby Briggs concerning Ben's mental state. She entered the office to find him in the middle of a Civil War re-enactment. She said that despite her hatred for him, she still had an attraction to him.\nShe went to Pete the next day and asked him if he wondered how she survived the fire. When he was intrigued, she showed him to the next room, where Andrew stood, flabbergasting Pete. They explained his survival, as they foresaw Eckhardt's plan to kill Andrew, so they ultimately faked his death, but did not inform Pete.\nWhen Eckhardt called Josie the next day, Catherine hopped onto the line and welcomed him to Twin Peaks. Eckhardt later came to Blue Pine Lodge, where he and Catherine discussed his past with her family and they planned for Josie to end up under his authority.\nPete brought breakfast to Catherine in the morning, and she was not amused with Andrew's plate, arranged to look like a dog. She told Pete to bring her salt and pepper and he left. Josie then arrived and fainted after seeing Andrew.\nLater, she overheard Cooper asking Josie about any possible involvement in the murder of Jonathan Kumagai, but she insisted she had nothing to do with it. After Agent Cooper left, Catherine entered and told her that Eckhardt wished to meet with her in the evening. Before leaving, Catherine took a book off a nearby shelf, revealing a gun for Josie.\nIn the evening, Catherine read Great Expectations and there was a knock at the door. However, she left it up to Pete to answer. He let in Sheriff Truman, who was searching for Josie. She and Pete told him that she had gone to the Great Northern to see Eckhardt. She called Agent Cooper, telling him that Josie was at Thomas Eckhardt's suite.\nFollowing Eckhardt's death at the hands of Josie—who also died—his assistant, Jones, came to the Blue Pine Lodge to expedite the transport of Eckhardt's body back to Hong Kong. However, Catherine sensed ulterior motives to the visit and drew a gun. Jones slowly pulled out a black box \"from Thomas,\" then wished Catherine luck and left.\nIn the evening, Catherine went to the Stop Ghostwood campaign's fashion show, where she questioned Ben's sincerity, as he wished to stop her development plan in the name of conservation.\nA couple of days later, Catherine went to Pete—who was mourning Josie's death—and asked him to try and open the box left by Jones, as all of her attempts to do so had failed. Pete deemed that it is a sort of puzzle box and could take years to figure out.\nSheriff Truman came to visit, requesting any information on Josie. Catherine explained that she wore a facade for much of her life. She then brought Harry the box, and he could not open it. Pete then came back from the Miss Twin Peaks Contest tryouts and took the box, but dropped it, which caused part of the box to slide out - a smaller puzzle box with the phases of the moon on it.\nCatherine told Andrew about the puzzle box, and he told her that the investors for the Ghostwood project were on board. Andrew then managed to open the box with a combination, which revealed a smaller box. He busted open this box with a rolling pin, and contained was a metallic box.\nShe expressed her frustration with the final box, which her brother and husband could not open until Andrew decided, out of frustration to shoot it out with a revolver. Inside was a key, which Catherine placed it in their cake saver, in plain sight.\nThe next day, Andrew and Pete took the key to the Twin Peaks Savings and Loan, where they were killed by a bomb left by Thomas Eckhardt.\nLater life\nFollowing the deaths of her brother and husband, Catherine became reclusive. She closed the mill—devastating the town economy—and sold it to Ben Horne.\nAnother 1989\nOn the morning of February 24, Catherine read the newspaper with her coffee while Pete said he was going fishing.\nBehind the scenes\nCatherine was played by American actress Piper Laurie.\nLaurie agreed to play Catherine because she had seen all of David Lynch's work and wanted to have a chance to work with him. She thought the pilot would be a fun one-off film to do since she didn't know that it would be picked up to series.\nFor her performance as Catherine, Laurie won a Golden Globe for Best Supporting Actress in a Series, Miniseries or television film (for which Sherilyn Fenn was also nominated for her performance as Audrey Horne) and was nominated for an Emmy for Outstanding Lead Actress in a Drama Series.\nAt one point, Lynch considered asking Laurie to reprise her role in The Return, but he never did because he couldn't come up with a believable way for Catherine to be a part of the storyline. Nevertheless, Laurie would have been happy to return.\nTrivia\nHer name is spelled as Katherine in the pilot episode and its original script.\nIn the original script for Episode 29, she was present at the bank during the explosion, having arrived just before.\nGallery\n"}