{"name": "Chad_Broxford", "url": "https://twinpeaks.fandom.com/wiki/Chad_Broxford", "text": "Chad Broxford\nChad Broxford was an arrogant and corrupt deputy with the Twin Peaks Sheriff's Department who had an arrangement with the criminal Richard Horne. \nBiography\nWhen Sheriff Frank Truman returned from a fishing trip, Chad described to him a DUI call he responded to.\nDuring a meeting between Sheriff Truman and Deputy Chief Hawk, Chad expressed his skepticism when concerning a message allegedly received by Margaret Lanterman's log. Truman dismissed him after his comments.\nWhile off-duty, he took a bribe from Richard Horne, who had been smoking at the Roadhouse, where the activity was prohibited.\nAfter observing Hawk investigating a stall door, Broxford filled out paperwork. After witnessing an argument between Sheriff and Doris Truman, he made cruel remarks about the latter and their son who had committed suicide.\nWhile on his lunch break soon after, he was kicked out of the conference room by Hawk, Truman, and Deputy Bobby Briggs.\nHe was later contacted by Richard, who told him to intercept an incriminating letter from Miriam Sullivan. Chad went to Lucy's desk, commenting on the weather and awaiting the mail, which he went out to get, pocketing Miriam's letter on the way in. He then sent confirmation to Richard that he had done what he was told.\nChad was later arrested by the sheriff's department, who had been keeping tabs on his activities for several months. He was imprisoned at the station in a cell adjacent to a drunk and an eyeless woman, both of whom irritated Broxford.\nFollowing a brawl, James Hurley and Freddie Sykes were brought to the cell block.\nAfter the drunk fell asleep, Chad removed a key from his boot heel and used it to unlock his cell. He went to the armory, where he retrieved a revolver. He went back to the cell block and taunted Andy Brennan as he aimed the revolver at him. He slowly approached Andy until Freddie punched open his cell door, which hit Chad and knocked him out.\nAs of September 2017, Chad was awaiting trial on a variety of charges, in large part for his prominent role in an international drug-running operation."}