{"name": "Charlie", "url": "https://twinpeaks.fandom.com/wiki/Charlie", "text": "Charlie\n\"How can you be like this? I hate your fucking guts! I hate you! Do you know how much I fucking hate you?!\"\n ―Audrey Horne\nCharlie was Audrey Horne's husband.\nBiography\nAccording to research by Tamara Preston, Audrey Horne married her longtime personal accountant – possibly Charlie – in a private ceremony around 2000. Preston also found several accounts of the couple's loud public fights around town and verbal abuse on Audrey's part.\nAudrey's accountant husband is not named in Twin Peaks: The Final Dossier.\nAs of 2016, Audrey and Charlie were still wed, having made a contractual arrangement of some sort. Audrey was brazenly unfaithful and generally indifferent to her husband, carrying on an affair with Billy.\nOne day Billy went missing, and Audrey had a dream in which he was bleeding from his nose and mouth. She angrily tried to persuade Charlie to accompany her to the Roadhouse to search for him, but Charlie complained that he had a great amount of paperwork and was too sleepy to go that night. In response, she berated him for failing to call Tina like she had asked and for not signing the papers she had given him. He was cowed into going along when Audrey threatened to have Paul pay him a visit.\nWhen Audrey mentioned that Chuck had told her Tina was the last person to see Billy, Charlie, surprised, told her that Chuck had stolen Billy's truck the previous week, but it had apparently been recovered without incident. Charlie called Tina to follow up on what she knew about Billy, and received some startling news. Afterward, he refused to divulge what Tina had told him, infuriating Audrey even more.\nAudrey demanded to know what Tina had told Charlie and appeared to have an existential crisis. He assured her that she did indeed need to go to the Roadhouse and see if Billy was there, and then warned that he might need to end Audrey's story unless she did.\nCharlie soon put on his coat, ready to leave for the Roadhouse. However, Audrey delayed them further, saying that Charlie now seemed like an entirely different person to her. Fed up, Charlie took off his coat and went to the couch, where Audrey then attacked him.\nCharlie and Audrey eventually reached the Roadhouse, where he toasted a drink \"to us.\" The floor was then cleared for \"Audrey's Dance\" and Audrey danced in front of the crowd until a fight broke out. Audrey ran to Charlie, asking him to get her out."}