{"name": "Chester_Desmond", "url": "https://twinpeaks.fandom.com/wiki/Chester_Desmond", "text": "Chester Desmond\n\"Sam, you stick with Chet, he's got his own M.O. – modus operandi!\"\n ―Gordon Cole\nChester \"Chet\" Desmond was a Special Agent of the FBI who was called out by Regional Bureau Chief Gordon Cole to investigate the murder of a 17-year-old girl named Teresa Banks, who was found wrapped in plastic. \nBiography\n\nCareer\nDesmond was a founding member of the Blue Rose task force continuing the work of the late Project Blue Book, along with Phillip Jeffries, Dale Cooper, and Albert Rosenfield.\nTeresa Banks murder\n \nDesmond was in Fargo, North Dakota in February 1988 with other FBI personnel, where he was arresting two women outside a school bus full of children.\nFire Walk with Me's shooting script suggests that the two women were prostitutes being illegally transported by the school bus driver.\nHe received a phone call from Regional Bureau Chief Gordon Cole in Portland, Oregon. Cole informed Desmond that a girl named Teresa Banks had been murdered and wanted him on the case.\nDesmond arrived to meet Gordon, who introduced him to Sam Stanley, who \"cracked the Whiteman case.\" A woman called Lil came out and danced, Gordon saying she was his \"mother's sister's girl.\" Sam later asked about her dance. Chet said her sour face meant that the local authorities were not cooperative, her eyes blinking meant there was trouble higher up with the law enforcement, her hand in her pocket meant they are hiding something, her fist meant they were belligerent, her walking in place meant there would be a lot of legwork, her being Cole's \"mother's sister's girl\" meant the sheriff's uncle was in federal prison, her tailored dress meant drugs, and her blue rose meant something he could not tell Sam about.\nThey arrived at the Deer Meadow Sheriff's station, where Deputy Cliff Howard and the receptionist would not let them see Sheriff Cable. Chet then forced his way past the deputy and went to Cable's office. The sheriff insisted that they had the situation handled on their own and did not need the FBI's help, mockingly referring to Chet as \"J. Edgar.\" Desmond ordered the files on Teresa Banks, who was a drifter with no loved ones.\n \nHe went with Sam to the morgue, where they examined Teresa's body. They found that the cause of death was likely repeated blows to the head from a blunt object. She was also missing a ring. Under the fingernail, Stanley found a small piece of paper with the letter 'T' on it.\nDesmond and Stanley left the morgue at 3:30 AM. Stanley asked where they would sleep, and Desmond said that they would get something to eat first. Sam commented that Chet had his own modus operandi and they headed to Hap's Diner, where Teresa had worked as a waitress. They talked to a man named Jack and asked about Hap, who they discovered was dead. They asked about Teresa Banks and found out she did not have any friends or companions. He told them to ask Irene. They went inside and spoke to Irene, who said Banks only worked at the diner for a month and was always late. Irene believed she had a cocaine problem. She also said that for three days near the end of her life, her arm went completely numb.\nThey left the diner later in the morning and decided to go to Fat Trout Trailer Park, where Teresa had lived at the time of her death. Desmond saw Irene leave and thanked her, then said \"good morning.\"\nThey went to the trailer park, where they met the owner, Carl Rodd, who took them to Teresa's trailer. There they found a photo of her wearing the ring. Rodd brought them strong cups of coffee and an old woman came to the trailer but left when Chet asked if she knew Teresa Banks.\n \nDesmond and Stanley went back to the sheriff's station to get the body, but after Cable refused to hand over Teresa's body, he challenged Desmond, first displaying his ability to bend rebar. They fought, Desmond standing triumphant. Chet then bent rebar in front of the sheriff and taunted the deputy.\nChet told Sam to take the body back to the Portland while he went back to the trailer park for the \"blue rose.\" He asked Carl for directions to Deputy Cliff Howard's trailer, but instead went to a mysterious trailer and found Teresa's ring sitting beneath it on a mound of dirt. Desmond reached out to take it.\nDisappearance\n \nSoon thereafter, Desmond was reported missing. Special Agent Dale Cooper investigated the trailer park and found Desmond's car with the words \"Let's rock\" scrawled across the windshield.\nSpecial Agent Tammy Preston later found Desmond's name on a deleted list she found on a computer in the Philadelphia FBI offices, and made note of his name popping up a few times in the Archivist's files.\nBehind the scenes\nThe Teresa Banks case was originally to be given to Dale Cooper in Twin Peaks: Fire Walk with Me, as portrayed in The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes. However, due to Kyle MacLachlan wishing to have a smaller role in the film, Desmond and Stanley were written to take his place in the investigation.\nWhen asked about Desmond's absence from Twin Peaks (2017), Mark Frost stated that the character was discussed, but he and David Lynch could not find an easy way to \"bring him back from wherever he is.\"\nTrivia\nDesmond's initials \"C. D.\" are the opposite of the ones of Dale Cooper, probably done to show how different they are.\nGallery\n\nTwin Peaks: Fire Walk with Me\n"}