{"name": "Chief_Joseph", "url": "https://twinpeaks.fandom.com/wiki/Chief_Joseph", "text": "Chief Joseph\nIn-mut-too-yah-lat-lat, more commonly known as Chief Joseph, was a chief of the Wal-lam-wat-kin, a band of the Nez Perce tribe.\nBiography\nJoseph was chief by 1877, his position being that of a spiritual leader as opposed to a military tactician. when he refused to follow the United States government's order to relocate his people to a reservation. He then traveled to a \"place of smoke by the great falls\" to seek guidance from the \"Great Spirit Chief.\" When a cavalry was sent out to oust the tribe, Joseph led them toward Canada.\nDuring the retreat, the tribe engaged in battle thirteen times with American forces led by General Oliver Howard. Howard himself claimed to have seen Joseph and his people travel through Hart Mountain, despite the impossibility of such an event.\nJoseph and the tribe were ambushed in the Bear Paw Mountains and surrendered on October 5 after a five-day battle with Howard's forces. He and four-hundred of his followers were imprisoned for eight months in Fort Leavenworth, Kansas, then in Oklahoma the following summer.\nWhen Joseph permitted the escape of Chief White Bird from the prisoner camp, Howard decided this was a violation of Joseph's terms of surrender, thus absolving the government's responsibility to return Native Americans to their land.\nOver the subsequent thirty-one years, Joseph fought for the freedom of his people, assisted by Captain Charles Erskine Wood. On January 14, 1879, Joseph delivered a speech to cabinet members, diplomats, and congressman at the Lincoln Hall auditorium in Washington, D.C. In his speech, he pled for the American government to recognize his people as men, rather than treating them as outlaws or animals.\nSix years later, Joseph and his people were allowed to move from Oklahoma to a reservation in northeastern Washington, though were forced to live among the remains of other tribes.\nJoseph was photographed by Edward Curtis in Seattle in 1903. He died the following year, of what his doctor determined to be a broken heart.\nBehind the scenes\nHin-mah-too-yah-lat-kekt, popularly known as Chief Joseph, Young Joseph, or Joseph the Younger (March 3, 1840 – September 21, 1904) was a Nez Perce leader who led his people in a large-scale retreat, known as the Nez Perce War. In his later years, Joseph spoke against the injustice toward the Native American people.\nHis speeches were narrated by Michael Horse in the audiobook version of The Secret History of Twin Peaks."}