{"name": "Convenience_store", "url": "https://twinpeaks.fandom.com/wiki/Convenience_store", "text": "Convenience store\nA nondescript convenience store and the place \"above,\" known as the Dutchman's Lodge, were inhabited by a number of supernatural beings.\nProperties\nThe store itself was a generic, one-story shack labeled \"CONVENIENCE STORE\" and outfitted with a pair of gas pumps. Its exact location was indeterminate, as it could apparently appear and disappear in an erratic manner.\nThe stairs on the right side of the building did not lead to an upper floor; instead, those who mounted them traveled to an interior space described as being \"above\" the store. Several woodsmen appeared to act as guardians or chaperones for visitors to the convenience store.\nA tunnel in the sky over 2240 Sycamore in Buckhorn, South Dakota led directly to the area above the store, and several woodsmen were observed around the property.\nHistory\nImmediately following the Trinity nuclear test on July 16, 1945, woodsmen arrived and rushed about outside the convenience store. A number of cans were stacked behind its front windows. After the woodsmen disappeared, a bright light and explosion of some kind appeared in the interior.\n \nWhile he was trying to explain his disappearance to his FBI colleagues, Phillip Jeffries alluded to a room above a convenience store and a meeting he had witnessed there. At this gathering, many spirits were gathered to \"discuss\" garmonbozia, a green Formica table with chrome trimming, a green ring, and electricity. The room was dirty and spare, with three covered windows and disparate furniture. After the meeting, the room seemed to transform into the curtained waiting room of the Black Lodge, as BOB and the arm crossed through into a hallway, laughing. Before the meeting, the arm's whooping could be heard emanating from a telephone pole numbered six.\nWhen Mike, BOB's former partner, confronted Leland Palmer in a traffic stop, he accused him (or rather BOB) of having stolen \"the corn\" which he had canned and stored above the store.\nIn a dream, Laura Palmer passed into a framed picture of a doorway and found herself in a dingy passageway above the store, where Mrs. Tremond and her grandson beckoned her forward.\nMike stated to FBI Special Agent Dale Cooper in a dream that he and BOB – another spirit – had once lived among the people, above a convenience store. In the following days, following clues from this dream, Cooper determined that the twine used to bind Laura Palmer before her murder had been purchased at the Quik Stop convenience store in Twin Peaks.\nAccording to Diane Evans's tulpa, Dale Cooper's doppelganger visited Diane a few years after Dale's disappearance from Twin Peaks. By her account, the doppelganger asked about FBI business before proceeding to attack and rape her. Cooper then took Diane to what the tulpa called \"an old gas station\".\nIn October 2016, Cooper's doppelganger visited the convenience store, which at that time was situated off a wooded road in western Montana. Escorted by several woodsmen, Cooper traveled to the Dutchman's Lodge, a roadside motel on its \"upper level.\" He was abruptly returned to the store's exterior telephone booth after a meeting with Phillip Jeffries.\nThe original Cooper later entered the convenience store through a door in the Great Northern Hotel furnace room, where he was greeted by Mike. Cooper and Mike then traveled to the Dutchman's to meet Jeffries, mirroring his doppelganger's prior journey.\nBehind the scenes\nThe store's generic name and appearance in Twin Peaks: The Return, and its depiction in relation to the Trinity test, may be intended to evoke the fake towns used in some nuclear tests to simulate the effects of bombing a populated area. For the real Trinity test, no such structures were used."}