{"name": "Cooper%27s_mother", "url": "https://twinpeaks.fandom.com/wiki/Cooper%27s_mother", "text": "Cooper's mother\nThe mother of Emmet and Dale Cooper was a loving mother and had many vivid dreams, teaching her younger son that dreams show things \"that we can't see when we're awake,\" ultimately leading to the future FBI Special Agent's trust in dreams many years later during the murder investigation of Laura Palmer.\nBiography\nCooper first mentioned his mother on Christmas 1967, saying that he bought his mother a nonstick spatula set as a present.\nLate the next night, Dale had suffered an asthma attack. His mother put VapoRub on his chest and told him about a dream she had about thousands of birds in the sky and that \"we can see things in our dreams that we can't see when we're awake.\"\nA few weeks later, during breakfast one morning, Dale noticed that his mother was particularly quiet, and determined that she had another dream, but was bothered by it.\nA couple of months later, Cooper's paternal grandmother passed away from a stroke in the kitchen while she was visiting. Cooper's mother said she had dreamed something bad would happen. She called the doctor and her husband and told Dale to place his hand on his grandmother's forehead to teach him that death was nothing to fear.\nThe following December, Dale had another asthma attack and had a dream that a man was trying to break into his room and kept chanting his name before letting out a scream that turned into an animalistic roar. He told his mother about this dream and she said that she knew about the man her son dreamed of, and said to not let the man into his room.\nThe following Mother's Day, Cooper gave his mother coasters for the coffee table.\nDuring the summer of 1969, when Dale decided to walk all the way home instead of take the bus back home from a Boy Scouts jamboree, she reprimanded him, threatening to \"beat within an inch of life\" if he ever did anything like that again.\nThe following November, she suffered from another dream, and said to Dale that the man \"almost got in the door.\"\nTwo weeks later, on the 14th, she woke up one night at around 11:30 to take an aspirin. When her husband asked if she was okay, she said, \"Oh, you know,\" and suffered a brain aneurysm. The next morning, she began to have brain hemorrhaging and stopped breathing as the doctors operated. Her husband whispered something in her ear and held her hand with Dale as she died.\nShe was cremated and there was a service held for her two days later and then the following day, her husband and younger son scattered her ashes into a small river north of Philadelphia.\nThe following May, Cooper had a dream he was visited by his mother, though she was much younger in the dream. She seemed as though she was speaking, but Dale could not hear her. She touched his hand and disappeared. When her son awoke, a gold ring was in his hand.\nDale later found an old photograph of his mother, in which she had been wearing the ring that appeared in his hand. His father told him that she had worn it when they were dating, that it had belonged to her father before her, and she had not worn it since before they were married. Cooper then began to wear the ring on his pinky finger and it became essential to his 1989 investigation of the murder of Laura Palmer.\nBehind the scenes\nAlthough Cooper's mother is mentioned only in The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes, Cooper wears her ring throughout the series."}