{"name": "Cooper%27s_father", "url": "https://twinpeaks.fandom.com/wiki/Cooper%27s_father", "text": "Cooper's father\nThe father of Emmet and Dale Cooper was a free-thinking man who truly cared for his family, and was highly-supportive of his younger son's decision to join the FBI. \nBiography\nDale first mentioned his father on Christmas 1967, having been given a tape recorder by his father and his mother, the former encouraging his son to record tapes, for it was \"the future.\" Dale mentioned that his father was the owner of Cooper's Offset Printing and idolized Benjamin Franklin.\nCooper's paternal grandmother died of a stroke on March 8, 1968, and he asked his father where the electricity that kept people alive went when they died, and the response was that it was the \"big question\" and that he did not know the answer.\nThe first time Dale heard his father said the word \"shit\" just over a month later, upon hearing about the assassination of Martin Luther King, Jr. and they watched television coverage when they got home. While Dale did not state whether his father swore, he reacted similarly to the assassination of Bobby Kennedy two months later.\nDale's father went with him to visit the FBI just over a month later, where they met J. Edgar Hoover. Cooper also mentioned on that day that his father fought in the war, where he was stationed in France, presumably World War II.\nIn September of that year, Cooper mentioned his Uncle Al, who performed magic and sold Bibles, but he said that he does not think his father liked to see his brother that much, as he saw him as irresponsible and untrustworthy.\nCooper's father seemed to have an interest in Native Americans, as he brought a Native American man named Michael Bishop Tree to their Thanksgiving dinner, who left with pockets full of pie.\nIn the summer of 1969, he showed an extreme interest in the Apollo 11 mission, as Dale described him as being glued to the television set, eating peanuts the whole time. Sometime during the following months, he began to print maps of the moon.\nOn the night of November 14, 1969, his wife woke up around 11:30 to take an aspirin. He asked if she was okay, and she answered, \"Oh, you know,\" and subsequently became unconscious from an apparent brain aneurysm. The following morning, she began to hemorrhage in her brain and stopped breathing as she was being operated on. Cooper's father whispered something into her ear and held her hand with their younger son as she died. He had her cremated and held a service for her two days later, and then a day after that, he went north of Philadelphia with Dale to a river the couple had visited years before and spread her ashes into it.\nHe spent the next few months occupying his time with moon maps and spent each night on the roof with a telescope, drawing pictures of craters, and discovered a new one the following April.\nIn the summer, he took a break from moon maps to take Dale on a trip with the Schlurmans to the Poconos and went with them to watch fireworks without Dale and Marie on Independence Day.\nDays after they left, Marie accidentally drowned, and Dale was overcome by guilt. His father comforted him during this time and \"always seem to find the right words.\"\nDale met his graduation requirements in September and his father gave him $1000 so he could have a good start. Cooper left for an undisclosed location for the next three years and did not take his tape recorder. His father told him to look out for bad water and snakes. During these three years, Dale sent three very short letters about his condition.\nWhen Cooper returned, he noted that his father's moon map business was not as good as it used to be, but he seemed to be well.\nBefore Dale headed off to college, his father took him on a trip to Mount Rushmore, where he protested the monument, holding a sign that read \"GIVE IT BACK TO THE SIOUX.\" However, after being threatened by other tourists, he was convinced to protest in a different way.\nBy November, Cooper's father had begun to see a woman younger than him named Charlotte, who was a potter. Dale supposed that the relationship was a physical one. The two were later married in Las Vegas and honeymooned in Reno. Months later, Cooper's father announced Charlotte's pregnancy, but found out weeks later that he was sterile and Charlotte had run off with a photographer. The baby was born the day their divorce was finalized and apparently it was named after him.\nHe became bankrupt by 1976 and was forced to either give up the house or the print shop. He chose to let the former go and move into a small apartment above the print shop and sold the last of his moon maps to National Geographic by August 1977.\nAfter the murder and attempted murder of Caroline Earle and his son, respectively, he came to visit the latter in the hospital, where he got along well with Gordon Cole.\nDuring Dale's vacation time, he decided to take a vacation with his father, a road trip out to San Francisco, but his father met a tall blonde woman named Shamrock in Reno, Nevada and they married.\nBehind the scenes\nMr. Cooper appeared in the original script of Episode 29 as an old man, seen by Agent Cooper in the Black Lodge, but the entire sequence was later re-written without the inclusion of Cooper's father."}