{"name": "Crossing", "url": "https://twinpeaks.fandom.com/wiki/Crossing", "text": "Crossing\n\"Kiss me. Once we cross, it could all be different.\"\n ―Dale Cooper\nAfter his attempt to save Laura Palmer in 1989, Dale Cooper crossed with Diane Evans in order to find her.\nProcess\nSeemingly following an instruction given to him by the Fireman, Cooper and Diane drove 430 miles down a road from a particular point of origin, stopping near a row of power lines. Cooper exited the car and felt about, then confirmed to Diane that they had come to the right place. Diane asked if he was sure he wanted to do this, and Cooper asked her to kiss him, as after they crossed everything might be different.\nDale continued driving along the shoulder of the road. Suddenly, their surroundings began shifting rapidly, ending with the car speeding along at night at an accelerated rate. From this point on, both of them exhibited different personal traits than they previously had, although they seemed to remember their original names.\nAftermath\nDale and Diane checked into a roadside motel. As she was waiting in the car, Diane saw a duplicate of herself step out of the shadows, which disappeared as Dale returned. Inside their room, Dale directed Diane to turn off the lights and come towards him. They had sex, mechanically, while Diane, growing distressed, began covering Dale's face and looking away from him.\nThe next morning, Dale awoke to find Diane missing. A letter on the bedside table read:\n\"Dear Richard, when you read this, I'll be gone. Please don't try to find me. I don't recognize you anymore. Whatever it was we had together is over.\"\n ―Linda\nDale, confused by the different names, exited a different motel and found a different car waiting than they had arrived in the previous night.\nSearching for Laura Palmer\nTo be added\nBehind the Scenes\nWhen asked if the sex scene between Cooper and Diane was some sort of sex magick, such as used by Jack Parsons, Mark Frost admits the possibility without confirming or denying it."}