{"name": "Cynthia_Knox", "url": "https://twinpeaks.fandom.com/wiki/Cynthia_Knox", "text": "Cynthia Knox\nLieutenant Cynthia Knox was a member of the United States military assigned to investigate fingerprints from Major Garland Briggs found in Buckhorn, South Dakota.\nBiography\nAfter the Air Force received a report of a fingerprint match to Briggs found in South Dakota, Knox reported to USAF Colonel Davis, who assigned her to follow up on the find. However, Davis was doubtful that the lead would uncover much, as it was the sixteenth match since Briggs' reported death in 1989. Nevertheless, he told her that if the match uncovered anything, the FBI was to be contacted.\nUpon arrival in Buckhorn, South Dakota, she was shown to a body that the prints were lifted from. However, the corpse was headless and appeared to be in its 40s, despite the fact that Briggs should have been in his 70s.\nAfter Davis reported the findings to the FBI, Knox was met at the Buckhorn Police Department by Deputy Director Gordon Cole, Agent Albert Rosenfield, Agent Tammy Preston, and Diane Evans and showed Cole, Rosenfield, and Preston to the body.\nBehind the scenes\nKnox was portrayed by Adele René. In the original broadcast version of \"Part 5,\" the credits listed the character's surname as \"Cox.\" This mistake was corrected in the home video release.\nKnox wears a Navy dress blue uniform with a Surface Warfare Officer pin but mistakenly for a Navy officer she wears a US pin on her lapel.\nShe appears to have the following ribbons on her rack:\nNavy Marine Corps Commendation Ribbon\nNavy Marine Corps Achievement Ribbon\nNavy Meritorious Unit Commendation Ribbon (With 1 Bronze Star)\nLegion of Merit Ribbon\nNavy Expeditionary Ribbon\nNational Defense Service Ribbon\nArmed Forces Expeditionary Ribbon\nGlobal War on Terrorism Expeditionary Ribbon\nGlobal War Terrorism Service Ribbon\nHumanitarian Service Ribbon\nNavy Sea Service Deployment Ribbon (with 3 Bronze Stars)\nNavy Rifleman Ribbon (With Expert)\nNavy Pistol Ribbon (with Expert)"}