{"name": "Dale_Cooper_(doppelganger)", "url": "https://twinpeaks.fandom.com/wiki/Dale_Cooper_(doppelganger)", "text": "Dale Cooper (doppelganger)\nThe doppelganger of Dale Cooper was a being from the Black Lodge, created in March 1989 when Cooper entered the Lodge to rescue Annie Blackburn from Windom Earle. After leaving the lodge and assuming Cooper's identity, the doppelganger spent over two decades engaged in criminal activities, and later sought a set of coordinates for unclear purposes.\nBiography\n\nBirth\nIn March 1989, the doppelganger first emerged as BOB (in his words) took Windom Earle's soul, wrestling free of a curtain and gleefully laughing with BOB before pursuing the real Cooper. The night after Cooper first entered the Lodge, the doppelganger appeared in Glastonbury Grove alongside Annie Blackburn, where Sheriff Harry S. Truman found them.\n \n\"Cooper\" was taken back to Cooper's room at the Great Northern Hotel. He laid in bed and woke up, surrounded by Sheriff Harry S. Truman and Doctor Will Hayward. \"Cooper\" said he was not sleeping and asked about Annie, then excused himself to brush his teeth. He put toothpaste on his toothbrush, squeezed more around the sink, then slammed his head into the mirror, revealing his reflection to be BOB. He grinned and laughed, repeatedly asking, \"How's Annie?\"\nTruman and Hayward broke into the bathroom after hearing the mirror break, where they found \"Cooper\" lying on the floor with blood on his face and the mirror shattered. \"Cooper,\" smiling strangely, told Harry that he slipped and struck his head on the mirror, and that it struck him as funny.\nAfter Hayward took him to Calhoun Memorial Hospital to receive treatment for his head wound, he was seen exiting the intensive care unit where Audrey Horne was still comatose from the explosion at Twin Peaks Savings and Loan. The last time he saw him, Hayward noticed a strange look in Cooper's eyes. The next day, \"Cooper\" checked himself out of the hospital, without receiving medical clearance.\nLater that day, Major Garland Briggs met with \"Cooper\" at his home, intending to entrust him with the continuation of Project Blue Book. However, Briggs immediately realized something was not right, and left for the station to send a mayday signal. The following day, Briggs was apparently killed in an unexplained fire at the station, and Cooper left Twin Peaks soon after that.\n \nOff the grid\nThree to four years after he left Twin Peaks, the doppelganger visited Diane Evans in Philadelphia and questioned her on the FBI's activities since his disappearance. They kissed, though Cooper began to sense fear within Diane and raped her. He then took her to a convenience store and created a duplicate of her.\n \nCooper spent twenty-five years engaged in unknown activities, supposedly with Phillip Jeffries. Several years after leaving Twin Peaks, the two were linked to the murder of an FBI asset in Colombia, whose identity was divulged in good faith by Albert Rosenfield. Cooper was also photographed at one of his known residences in Rio de Janeiro, Brazil. He was also captured by cameras watching a glass box in a New York skyscraper.\nAfter escaping from the Black Lodge, the Cooper doppelganger was apparently destined to return there at 2:53 p.m. on a specific day about twenty-five years later. To prevent this, he somehow \"manufactured\" another version of Cooper, a Las Vegas insurance salesman named Dougie Jones. At the appointed time, Dougie would be drawn back into the Lodge instead.\nSouth Dakota\nTwenty-five years after his escape, Cooper was in Buckhorn, South Dakota, preoccupied with obtaining certain coordinates from William Hastings' secretary. He had an unclear involvement in the murder of Ruth Davenport, the librarian at Hastings' high school, which was pinned on Hastings due to the latter's fingerprints being found at the crime scene. Cooper was colluding with Phyllis Hastings in the matter, and later remarked that Phyllis had \"followed human nature perfectly.\"\nShortly before his time was up, Cooper drove to a house in rural South Dakota, incapacitating a guard on his way inside, where he greeted Otis and Buella. He asked the latter to call out Ray Monroe and Darya, who then left with him.\nHe later showed up at Hastings' home and executed Phyllis with a gun belonging to George Bautzer, the family's lawyer and Phyllis' lover.\n\"Cooper\" later ate with Jack, Ray, and Darya, discussing his concern about the following day and the information he was after, which Ray promised to get from Hastings' secretary.\nJack later stored \"Cooper's\" Mercedes and gave him the keys to a Lincoln sedan, only for \"Cooper\" to kill him after finding out that he wired the car.\n \nTwo hours later, he drove to a motel and went inside where Darya waited for him. She had just hung up the phone, saying that she had been talking to Jack. He told her that Ray never showed up to a meeting they planned and he \"borrowed\" Darya's gun before joining her on the bed. Holding her, he revealed to her that he had killed Jack two hours ago. She tried to escape from the doppelganger, but he restrained her and played a recording of the phone call she had just been having with Ray, in which Ray said he had been arrested and that she would have to be the one to kill Cooper. She repeatedly attempted to escape from his grasp, screaming, but he calmly restrained her and asked who was paying them to kill him. Darya said that she didn't know but they were going to split $500,000 between the two of them. Cooper mentioned that he was supposed to be pulled back into \"what they call the Black Lodge\" tomorrow, but that he had a plan for that one. He asked why Ray had really been imprisoned and whether he had found Betty's coordinates yet, but Darya said she didn't know.\nThe doppelganger then pulled out an ace card bearing a strange symbol and showed it to her, telling her it was what he wanted. Darya tried to escape once more, then he shot her in the head, suppressing the sound with a pillow. He then washed his hands and made a call to someone he believed was Phillip Jeffries. The person on the other end said he had missed Cooper in New York City and that he was aware of Cooper meeting with Major Garland Briggs. The voice then told the doppelganger that he would be \"going back in tomorrow,\" and that he, himself would be with BOB again, then disconnected. The doppelganger then logged into an FBI database and downloaded files for Yankton Federal Prison, where Ray allegedly was.\nCooper then went to the motel room next door and met with Chantal Hutchens, asking her to clean up Darya's body and requested her to meet him with her husband in a few days.\nArrest and escape\nAs he drove, Cooper began to experience discomfort as the cigarette lighter in his car began to exert electric activity, eventually losing control of his car and having a wreck. He began to gag, but held his hands firmly over his mouth, watching the cigarette lighter as red drapes faintly appeared to him in front of his car. When he saw Dougie Jones - a decoy of Cooper - in the red room, he vomited up garmonbozia and oil before passing out, later being retrieved by highway patrolmen.\nHe was taken to a federal prison in South Dakota in possession of cocaïne, a machinegun and a dog leg. When FBI Deputy Director Gordon Cole arrived with Agents Albert Rosenfield and Tamara Preston, he greeted them by saying \"yrev\" but immediately correcting himself and saying \"very pleased to see you again\". He then claimed to Cole that he had been working undercover with Phillip Jeffries since his disappearance and that he was on his way to debrief with Cole when he had his car accident.\nIn prison, after accurately predicting the arrival of his food to his cell, he went to the mirror and noted that BOB was still with him. Later, he was given his phone call. Aware that Warden Murphy was watching, he rhetorically asked if he should call \"Mr. Strawberry,\" a phrase that caused Murphy to react in horror. Then, Cooper dialed a long series of numbers that caused the prison's alarms to sound. He said \"The cow jumped over the moon,\" then hung up the phone, causing the alarms to cease. This call triggered a change in a device somewhere in Buenos Aires.\nCooper later received an expected, but short visit from Dale Cooper's former secretary, Diane Evans. They recalled the last time they had met in person, a night at Diane's house that they both remembered well. Diane asked him who he really was, but he claimed he didn't know what she meant.\nUsing the phrase \"Mr. Strawberry,\" Cooper gained a private meeting with the warden. Cooper told him that the other three dog legs matching the one in his trunk had been sent to certain people who would be very interested in the information Murphy wanted to keep quiet, and mentioned the name Joe McCluskey. Murphy demanded to know what he wanted in exchange for his silence. Cooper secured his and Ray Monroe's release at 1:00 a.m. that evening, along with a rental car and a gun.\nAs they drove away, the doppelganger noted that there were three tracking devices on the car and reprogrammed them to track a truck in front of them. As they discussed the information \"Cooper\" was after, he lied about Darya and they went to a secluded area. The doppelganger demands the information and tries shooting Ray, but found that his gun had been unloaded, and Ray shot him. Shadowy men then gathered around him, tearing at him, revealing a sac containing the face of BOB to Ray. Eventually, \"Cooper\" sat up, alive.\n \nIn the morning, he walked to the meeting place where Hutch and Chantal had been waiting for him since the previous night. They treated his wounds and gave him a new phone, which he used to send a text message – which read \"around the dinner table the conversation is lively\" – and call Duncan Todd to check on his progress with a job. He then gave Hutch and Chantal an assignment to kill Warden Murphy.\nThe doppelganger soon arrived at The Farm, where he was told that the present group's leader, Renzo, was decided by an arm wrestle. After toying with Renzo during their match – wagering Ray – \"Cooper\" beat him and killed him. He was declared the group's new leader and he was given alone time with Ray.\nAfter shooting Ray in the leg, he was informed that Ray and Darya had been hired by Phillip Jeffries to kill him, as the doppelganger \"had something\" inside him that \"they\" wanted. Ray showed him a ring that he was told to put on the doppelganger after killing him. He demanded Ray to put on the ring as well as give him the coordinates. The doppelganger then killed Ray after asking about Jeffries' whereabouts.\nHe soon reached a convenience store, where a woodsman led him up to a room above it. Another led him to a motel, where he met with Jeffries, who appeared to him as a machine emitting steam. \"Cooper\" asked him about sending Ray to kill him, but learned that it was not Jeffries, but the person who contacted him at the motel. He then recalled Jeffries' appearance at the FBI headquarters in 1989 and asked him about the identity of Judy, prompting Jeffries to insist that he had already met Judy.\nA phone began to ring and the doppelganger soon answered it, causing him to be transported outside the convenience store, in a phone booth. Richard Horne stood nearby, aiming a gun at the doppelganger, commenting that he knew his identity as an FBI agent, as his mother, Audrey Horne kept a photo of Cooper. The doppelganger disarmed him and took him along to his next destination.\nThey reached a field near the location of two sets of coordinates he had been given. The exact location was atop a rock, so the doppelganger – claiming to be too old – had Richard take a tracking device to the rock. Richard climbed onto the rock, following the device's beeps was electrocuted until he disintegrated. Cooper looked on, saying, \"goodbye, my son,\" before returning to the truck and sending a text that read, \": - ) ALL.\"\nHe soon arrived at an opening that took him to the Fireman's home. Inside, he was caged and then transferred outside the Twin Peaks Sheriff's Department, where he was welcomed by Deputy Andy Brennan, who took him to Sheriff Frank Truman.\nTruman then received a call and skeptically looked at the doppelganger, who then reacted, drawing his gun. He managed to fire a shot through Frank's hat as he himself was shot and killed by Lucy Brennan.\n \nBOB was removed from the doppelganger and was broken into pieces by Freddie Sykes. The real Cooper then placed the ring on the doppelganger's hand, transporting him back to the Lodge, where he burned.\nTrivia\nOn his fingerprint card filled at South Dakota Federal Penitentiary (which corresponds to a FD-258 one), the following information can be seen:\nPrison ID number: 75425\nLast name: Cooper\nFirst name: Dale\nResidence: 6147, Bend Dr. Harrisburg, PA\nDate the form was filled: 9/22\nEmployer and address: 1000 Appleton St. Philadelphia, PA\nReason fingerprinted: Suspect in multiple crimes\nAlias: N/A\nCitizenship: United States of America\nOCA number: 452788924\nFBI number: 10-7132-91076\nArmed Forces MNU number: N/A\nSocial security number: 520-722-406\nMiscellaneous number such as US Military Service or passport number: N/A\nOrigin: USA\nSex: M (Male)\nRace: W (White)\nHeight: 6 feet even\nWeight: 170 pounds\nEyes color: Brown\nHair color: Brown and Gray\nDate of Birth: 08/15/1973\nPlace of Birth: Buckhorn, SD\nThe left ring finger print or at least the corresponding text is horizontally flipped\nIt was also not filled according to the official code since the height should actually be written as \"600\" instead of 6\"0 and that the brown abbreviation should be \"BRO\" instead of BRN or BR.\nInterestingly, Cooper's middle name \"Bartholomew\" was not put despite the form having a corresponding box field. Surprisingly the eye color is described as brown while they are clearly black. According to this card, Cooper shares his birth date and place with William Hastings, meaning that he would be 16 during Laura's investigation, which is impossible (notably it would make him younger than Audrey and make him 12 when he had an affair with Caroline).\nBehind the scenes\nMacLachlan did not try to mimic Frank Silva's BOB character beyond doing the movements as him when he was mirroring his movements from the other side of the glass while filming Episode 29.\nThe shooting script for Twin Peaks (2017) lists the character's name as \"Cooper's Double,\" as seen on the Blu-ray special feature, Impressions: A Journey Behind the Scenes of Twin Peaks. David Lynch does not give a nickname to the character and merely calls him Cooper's doppelganger (written \"doppelgänger\" by the interviewer).\nThe black contact lenses were suggested by Kyle MacLachlan. The doppelganger's haircut was made to try to mimic Javier Bardem's character from No Country for Old Men. But the clothing was chosen by Lynch himself, discarding jewelry accessories.\nThe snakeskin shirt might be a reference to Sailor's (Nicolas Cage) jacket in Lynch's Wild at Heart which the character described as \"a symbol of individuality and belief in personal freedom\"."}