{"name": "Dale_Cooper", "url": "https://twinpeaks.fandom.com/wiki/Dale_Cooper", "text": "Dale Cooper\nThis article is about the original Dale Cooper. For his doppelganger, see Dale Cooper (doppelganger).\n\"Agent Cooper is the finest lawman I've ever known. I've had nothing but respect for him since he arrived in Twin Peaks.\"\n ―Sheriff Harry S. Truman\nDale Bartholomew Cooper was a special agent of the Federal Bureau of Investigation who in 1989 was assigned to investigate the brutal murder of the popular high school student, Laura Palmer in the town of Twin Peaks, Washington. He ended up falling in love with the town and gained a great deal of acceptance within the normally tight-knit community.\nWhile trying to rescue Annie Blackburn, Cooper became trapped in a bizarre alternate reality known in local Native American legends as the Black Lodge. Meanwhile, an identical, evil \"doppelganger\" of Cooper, associated with the malicious spirit \"BOB,\" was released into the world, passing itself off as Cooper to his friends and colleagues. The real Cooper spent several decades wandering the Lodge, unable to find a way out. Upon exiting via an electrical outlet, Cooper, in a severe catatonic state, was mistaken for his tulpa Dougie Jones and spent several days ushered about as \"Dougie\" by his oblivious family and colleagues.\nAfter awakening from his impaired state, Cooper flew back to Twin Peaks to help banish his doppelganger to the lodge once again, and then traveled back to the night of February 23, 1989, in a doomed effort to save Laura Palmer from her fate. He then crossed with Diane Evans, and found Carrie Page, a waitress whom he believed was Laura in another guise. Upon returning to Twin Peaks with her, however, Cooper found that nothing in the town was as he remembered.\nBiography\n\nEarly life\nDale Bartholomew Cooper was born on April 19, 1954 to Mr. and Mrs. Cooper of Philadelphia, Pennsylvania. He had one older brother, Emmet.\nAs a boy, Dale lived at 1127 Hillcrest Avenue in Philadelphia, Pennsylvania and attended Germantown Friends School, run by Quakers, though his father told him that if they belonged to a religion, they would not be Quakers, but Unitarians. An asthma sufferer, Dale was often confined to his bed after an attack while his mother rubbed VapoRub on his chest and told him of dreams she had, telling him \"we can see things in our dreams that we can't see when we're awake.\"\nOn Christmas 1967, Dale was given a Norelco B2000 tape recorder by his parents, with which he began to create audio recordings detailing his life.The first adventure he had with his tape recorder was in early 1968 when he investigated the 24th Street gang, who had stolen a bike belonging to Dale's friend and next-door-neighbor, Bradley Schlurman. The gang ended up stealing his tape recorder, but it was recovered by the police when a gang member was caught stealing a car. Nevertheless, he was unable to return Bradley's bike.\nDuring this time, Bradley's older sister, Marie began to dance in her window just across from Dale's room, causing him to begin to discover sexual feelings. Dale also became a member of the Boy Scouts of America, and Marie helped him earn a knot-tying merit badge by letting him tie her up in her room.\nOn March 8, 1968, Dale's paternal grandmother was visiting and had a fatal stroke in the kitchen whilst making a pie. His mother had him place his hand on his grandmother's forehead to show him that death was not to be feared.\nHis next excursion with his tape recorder occurred on April 2, 1968, when he decided to see why the girls are taken to health class every day at the same time. He climbed into an air vent and looked into the classroom from above; inside was a lesson on female anatomy. Dale was caught by the janitor, Mr. Brumley and was forced to hand over his tape of the class. His tape recorder was also banned from school unless he had written permission from a teacher.\nOn his fourteenth birthday, Dale received a Timex watch from his parents and was told that his brother had moved to Canada to become a lumberjack and would not be seen until all of the trees were cut down. However, he quickly determined that the truth is that Emmet was dodging the draft.\nHe began to express more of an interest in Marie, but she claimed she could no longer talk to him until he was older. After the assassination of Bobby Kennedy, Marie stood naked in her window, looking toward Dale's room. When Kennedy's body was transported by train through Philadelphia, Marie kissed Dale and tearfully ran away.\nThe following summer, Dale decided that he was going to become an agent of the Federal Bureau of Investigation and sent a letter to J. Edgar Hoover to tell him of his plan to join the FBI and tell him of his daring scientific expedition to record the girls' sex education class. Hoover responded, praising him and to not be discouraged about being caught. Hoover also gave Dale an invitation to tour the FBI headquarters.\nDale went to the FBI headquarters in Washington, D.C. with his father, where he met Hoover and was given a tour by a special agent and demonstrated his exceptional marksmanship, outscoring the agent.\nMarie returned from her family's summer vacation several weeks later. She voiced her distaste for Dale's wish to join the FBI, calling him an \"establishment pig.\" She began seeing a boy named Howard, shredding Dale's hopes of her being interested in him. However, when she was taken to the hospital after a drug overdose, Dale visited her, and she offered him sexual favors if he helped her escape, but he declined on the grounds of scout law. She later sent him a letter apologizing for her behavior and saying that she had shaved her head.\nAfter an asthma attack in December 1968, Dale had a dream of a man trying to break into his room while letting out an animalistic roar. He told his mother, who was aware of the man and told Dale to not let the man into his room. He continued to dream of the man throughout the following month while battling an illness, but never let him through the door.\nIn early 1969, Marie told Dale that she had found Jesus and wished to help him see the light. Dale noted that although he did not like everything about the \"new\" Marie, her legs were \"the most beautiful things\" he had ever seen in his life up to that point. On Valentine's Day, she sent him a card that contained a drawing of her holding a baby Jesus. Dale was not sure what to think.\nA girl named Anne Sweeny moved into town in 1969 and Cooper became infatuated with her. He blew up her mailbox to relieve his feelings. Anne moved away at the end of the school year.\nThe night of the Apollo 11 moon landing, Marie confirmed her interest in Dale but then began to pray, much to Dale's disappointment. The landing also had a profound effect on his father, who began to print maps of the moon for his business.\nThe following day, Dale went to a Boy Scout jamboree and decided to come home on foot, despite the jamboree having been 176 miles from home. During his journey, on July 30, 1969, Dale had his very first cup of coffee in the Post and Beam restaurant on Route 487. Shortly after, he met a couple named Star and April, traveling in a VW bus. He traveled with the couple, who were on their way to Washington, D.C. to chain themselves to the doors of the Pentagon. After parting ways with them, he hitchhiked his way back home.\nOn November 1, 1969, Dale's mother suffered a dream of the man, who she said almost got in the door. Just two weeks later, she was rushed to the hospital with a brain aneurysm and died the next morning with Dale and his father by her side. She was cremated and her ashes were taken to a small river north of Philadelphia.\nIn 1970, Dale met April again, as she was student teaching his English class. She had broken up with Star after a fight. April tried to teach Dale how to write poetry, but it was soon apparent that it was not his area of expertise. During the summer, April left for a commune in Colorado.\nOn May 25, Cooper had a dream of his mother, who reached out and touched his hand. When he awoke, a small gold ring was in his hand. His father told him that the ring belonged to Dale's mother, but he had not seen it since before they were married and it had once belonged to her father.\nIn July, Cooper and his father went on vacation with the Schlurmans to the Poconos. On the night of Independence Day, Dale and Marie went to the woods and as she began to pleasure him, a rocket landed near them and started a fire. He managed to save her sneakers and he and his father left the next morning.\nJust over a week later, Dale received news that Marie had drowned at Promised Land Lake, having hit her head while diving into the water. She was buried in a silver coffin.\nIn September, Dale had finished high school and his whereabouts for the following three years are unknown. However, as indicated by letters he sent to his father, he was in an area with water and snakes and needed to travel by ship at one point. Upon returning, he told Bradley Schlurman that his trip was \"damn good.\"\nIn the summer of 1973, Dale got a job digging holes with a man named Jim, whose home burned up one night and his body was not found. However, Cooper saw the shadow of a man in a nearby alley, where laughter also occurred.\nIn the fall, he enrolled at Haverford College, and his father gave him a new tape recorder. He became attracted to a girl named Andy from the nearby Bryn Mawr college. The two had a sexual encounter but were caught by students at their respective schools. Subsequently, he found out that she would be leaving for Holland with her husband.\nIn November of 1973, he pursued a man who he believed to be a predator of sorts and ended up finding a young woman who had been beaten and stabbed to death.\n \nDale returned home for Christmas and began to experiment how long he could function without sleep. During this time, he mused that he never liked the name Dale and wished he was an Apache named Ten Sticks, and also began to express doubt that Lee Harvey Oswald did not act alone in the assassination of John F. Kennedy and that his death was not unrelated to the death of Marilyn Monroe. He managed to not sleep for over a full day before drifting off to sleep, experiencing vivid dreams.\nAndy returned from Holland in January, without her husband. She and Dale spent a night in a motel room for a \"study on the limitations of the mind and body.\" Andy returned to Holland just weeks later, after her husband was injured.\nIn March of 1974, Dale took an internship at the county hospital to study mental patients. During this time, he connected with a patient named Betty. However, just over a day later, she held a knife to an orderly's throat and was shot by police. When she was wheeled out, Cooper recalled her saying, \"I'm free,\" and she later died from her wounds.\nThe following summer, Dale's father married a woman named Charlotte and she became pregnant. However, she subsequently left him for a photographer, who was biologically responsible for the child.The tapes documenting Cooper's life between September 11, 1974 and June 9, 1975 were destroyed in a fire that also destroyed some of his clothing.\nDale met a young woman named Lena in July 1975, who shared his love of coffee and had taken a vow of celibacy after her mother seduced her former boyfriend. They visited her family in Hershey, where Lena attempted to burn down the family home to come to terms with her mother. Following their trip, Lena underwent psychiatric evaluation and by December had married her high school sweetheart.\nThe following December, Cooper went to a job fair, where he met the highly-intelligent FBI Special Agent Windom Earle, renewing his interest in joining the agency. In early 1976, Dale's father became bankrupt and moved into the apartment above his print shop. Dale also completed his studies at Haverford. His whereabouts over the next year are unknown, but he did note in February 1977 that \"Evil does have a face.\"\nEarly career\nCooper was accepted into the FBI in the summer of 1977 and completed his training by December. He was given a new tape recorder by his father and was assigned a secretary named Diane Evans, who he described as a \"cross between a saint and a cabaret singer.\" He began to address his tapes—both personal and work-related—to her.\nIn January of 1978, he was given his first assignment to investigate the kidnapping of an eight-year-old girl named Chris Roe, who he found chained to a tree, having been kidnapped by a bookseller.\nDuring a triple homicide investigation the following month, he met forensics expert Special Agent Albert Rosenfield, whom he described as angry. He commented that whoever committed the murders could not have been entirely human.\nIn April, he met Agent Earle again, who had been following Cooper's progress, as he remembered him from the job fair.\nOn May 1, 1978, Cooper took the life of a bank robber who had killed a hostage. He was given a leave of absence to come to terms with the killing. During this time, Cooper began playing chess with Windom Earle and met his wife, Caroline, who wished that the death would not affect Cooper's life \"the way it did Windom's\" when he first took a life.\nUpon his return to work, Cooper was given desk duty, during which time he had a dream of a legless man saying that \"It\" is behind him and is \"sure to kill.\" After being released from desk work, he was assigned as Windom's partner.\nCooper was put on the investigation of a man who had been murdered, whose face was destroyed and his hands removed. He suspected it to have been the result of organized crime. Earle also began to act strangely and disappeared.\nAnother body was found under the same circumstances, and Dale began to bond with Caroline, bringing her comfort during Windom's absence. After the hands belonging to this body were found, Cooper was introduced to deputy director of the Criminal Investigation Division, Gordon Cole, who oversaw the case.\nCaroline received a call from Windom on August 3, during which he only said: \"I'm sinking.\" The next day, Earle showed up at his office and collapsed. Cooper visited him at the hospital to try and discern where he was during his disappearance. Earle only gave elusive answers, speaking of an \"abyss.\" Windom later claimed to have forgotten what occurred during his absence and no arrests were ever made in the case, despite four months of investigation.\nSometime around 1985, Cooper vacationed on an island in the Caribbean, where he met an old man who had taught Earle how to play chess. However, when Cooper tried to learn from him, the man refused, saying, \"There is death in your face.\" Following this, the old man disappeared. Dale tried to find the man, but found him dead, hanging by a rope. Cooper then fled the island, feeling that something bad had happened in Pittsburgh.\nHe arrived in Pittsburgh to find that Caroline had been kidnapped by three men as the Earles ate dinner. She was found in April after being arrested for prostitution in lower Manhattan, suffering from a heroin addiction.\nCaroline was moved to a safe house following an attempt on her life. Cooper put her under hypnosis and learned of her horrifying experiences, though she was unable to identify the persons responsible. Earle decided not to stay in the safe house, and thus began an affair between Dale and Caroline. However, only days later, the lovers were stabbed by Windom. Caroline's injuries proved to be fatal. Following the murder of Caroline, Windom was institutionalized and Dale took full responsibility.\nMonths after the murder, Cooper went on a road trip with his father to San Francisco. However, his father stayed in Reno, Nevada after meeting a woman named Shamrock and marrying her. In San Francisco, he was assigned to the case of a murdered 19-year-old male prostitute. In pursuit of a serial killer, Cooper followed a blue Dodge Dart that nearly ran over a prostitute, but this perpetrator was not the killer. The killer was soon identified as a man named Bush, who Cooper ambushed at his home and brought into custody.\nSometime around 1986, Cooper had a dream involving the plight of the Tibetan people and revealed to him the deductive technique of the Tibetan method. Deeply moved by what he saw in this dream, he formed the basis of his unconventional methods of investigation.\nIn the summer of 1987, Cooper worked with the DEA Agent Dennis Bryson on a sting operation in Tijuana. However, things went sour when Bryson's cover was blown and he was taken as a hostage. Cooper managed to rescue Bryson, and the newspapers stated the incident to have been caused by an argument over the Book of Job.\nTwo months later, Cooper worked one more case with the DEA task force, which concerned a dentist trafficking cocaine through his practice. The mission was a success; however, Dale discovered in the process that he had six cavities.\nIn early 1988, Cooper received a tape from Windom Earle, taunting him.\nMurder of Teresa Banks\nOn February 16, 1988, Cooper revealed to Cole of the portents of the strange dream he had about the Tibetan people two years prior, and that it made him worried about the current date.\n \nLater, he played a memory game with Diane: he had to figure out what changes Diane had made to the room in his absence. After considering it for a while, he realized that Diane had moved the clock on the wall twelve inches to the left.\nIn the meantime, Special Agent Chester Desmond disappeared while investigating a bizarre murder case of a teenage prostitute named Teresa Banks, whose body was found wrapped in plastic in Deer Meadow, Washington. Cooper picked up the case but was unable to find any evidence which could lead to the discovery of what happened to Desmond or the murder victim.\nHe later had a somewhat awkward and brief meeting with Sam Stanley, who had assisted Desmond in his investigation. They discussed the Deer Meadow investigation and Stanley's encounter with the missing Agent Desmond. Like Desmond, Cooper refused to divulge the meaning of Lil the Dancer's blue rose to Sam. Cooper learned about Teresa Banks' missing ring and a mysterious letter under her fingernail during this meeting.\nRoughly a year later, Cooper told Albert Rosenfield in the Philadelphia FBI offices of how he sensed Banks' killer would strike again soon, and that his victim would be a young woman, who had blonde hair, was sexually active, using drugs, and was crying out for help. Rosenfield was quick to dismiss Cooper's notion.\nAfter being missing for two years, Special Agent Phillip Jeffries re-appeared behind Cooper in the hallway outside Gordon Cole's office, which Cooper did not notice, as he was checking the security camera (in which he saw himself still standing in the hallway as Jeffries walked straight past him). Cooper followed him into Cole's office and bore witness to Jeffries' fragmented outburst. He briefly exited the room to check the hallway, as a result missing Jeffries' disappearance.\nMurder of Laura Palmer\nOn February 24, 1989, the body of the murdered Laura Palmer was found wrapped in plastic in the town of Twin Peaks, Washington. Shortly thereafter, Ronette Pulaski was reported missing.\nAfter Ronette was found across the state border in Idaho, the FBI was given jurisdiction over the investigation into her disappearance and Cooper was assigned to the case. He arrived in the town at 11:30 AM whilst addressing a tape to Diane, commenting on all of the trees he had seen, as well as the weather, his car's gas level, and his lunch. He noted that he would meet with Sheriff Harry S. Truman at the hospital to see Ronette.\nHe arrived at the hospital and met Sheriff Truman and while respectful of the sheriff, he made sure that Truman was aware that the FBI had taken control of the case and expected his full cooperation. After Truman confirmed his awareness, Cooper excitedly asked what kind of trees they had around the town, which Truman confirmed to be Douglas firs. Although no connection had been made between Ronette's disappearance and Laura's murder, Cooper asked for the coroner's report on Laura, but the autopsy had yet to be done. Truman took him to Ronette, who had been raped. Cooper tried to question her, but she was unresponsive. He requested to examine her fingers but did not find what he was looking for. As he did this, Ronette began saying \"don't go there.\"\nCooper and Truman later found themselves in an elevator with a one-armed man, who exited when they saw Doctor Lawrence Jacoby, who tried to run to them, but the elevator closed and continued to descend. Jacoby then showed up on the next floor where they stop and he introduced himself to Cooper. The psychiatrist asked to join them in the morgue, but they did not allow it. Jacoby also said that Laura's parents did not know that she had been seeing him.\nThey went to the morgue, where the lights were flickering. He examined Laura's body and found a small piece of paper under the nail on her left ring finger. Printed on the paper was the letter 'R.'\n \nAt the sheriff's station, Cooper went over the evidence retrieved from the Palmer home, including a videotape and Laura's diary, which he planned to view with Laura's boyfriend, Bobby Briggs. Since they had no key, Cooper broke the lock on Laura's diary and noted the last entry that said \"nervous about meeting J tonight.\" Inside, he also found a page where taped was a plastic bag containing a safety deposit box key and a white residue he suspected to be cocaine.\nBobby was brought in for questioning, Cooper's first question being whether he killed Laura, which was denied. Cooper then said that she had been at Bobby's house studying until about 9:30, which Bobby confirmed, as well as that she had driven herself home. He also brought up the fact that they had a fight, which angered Bobby even more, much to Cooper's amusement. He then played the videotape for Bobby of Laura and her best friend, Donna Hayward, which Bobby denied filming. He also brought up the fact that Laura was cheating on him, which he believed to be the subject of the fight. He then asked if Bobby has ever used cocaine with Laura, which he denied. Cooper then typed into a calculator, \"HE DID NOT DO IT,\" and showed it to Harry. He brought up a person with the initial 'J' as the person who filmed the video and asked if Bobby knows who it is, which Bobby denied.\nDonna was then brought in for questioning, but she insisted that the person who filmed the video was a female hiker that she did not know the name of. Cooper then released Donna. Lucy Moran, the receptionist at the sheriff's station then came in to tell him that she overheard Bobby and his friend Mike discussing a biker with the initial 'J,' but Cooper had already figured this out, as he noticed a bike reflected in Laura's eye on the videotape.\nDale then went to the scene of the murder with Truman, which happened to be a train car, where he found blood, a hammer, and bloody rag, a dirt pile with half a heart necklace, and a note reading in blood \"FIRE WALK WITH ME.\"\nCooper then went with Truman to open Laura's safety deposit box, where in the office, a taxidermy deer head had fallen. They opened the box and found a copy of Flesh World and over $10,000. Inside the magazine, they found a marked page, where a photo of Ronette was printed.\nCooper later gathered the town for a conference to announce the FBI's takeover of the Laura Palmer case. Truman filled him in on the identities of several people who attended. Mayor Dwayne Milford called the meeting to order and Cooper takes over. He announced to the citizens that Laura's murder has striking similarities to the murder of Teresa Banks a year prior and believes them to be killed by the same person, possibly a citizen of Twin Peaks. He suggested a curfew for those under the ages of 18, as the crimes occurred at night.\nIn the evening, he sat with Sheriff Truman at a stakeout at the Roadhouse when Lucy patched through a call from Doctor Will Hayward, who reported his daughter, Donna being absent. The sheriff put out an all-points bulletin. Cooper then whittles a whistle, saying, \"that's what you do in towns where a yellow light still means slow down, not speed up.\" They then saw Mike and Bobby arrive, followed by Donna. He suggested to Harry to call in backup and gave him a thumbs-up.\nHaving seen Donna leave with a biker named Joey Paulson, they pursue. Truman proposed that he could be 'J,\" but Cooper believed he is simply taking her elsewhere to perhaps meet with 'J.\" They followed at a \"discreet distance\" until they lost sight of them. Cooper breathed in the smell of trees until they heard motorcycle engines and head toward them. They gave chase when they saw James Hurley and Donna pass and stopped them with no trouble. When Donna insisted that James did not do anything, Cooper said that she was probably right.\nAfter arresting James, Cooper and Truman sat down and had donuts. He was recommended to the Great Northern Hotel during his stay in Twin Peaks, Truman saying he could get him a good rate.\n \nCooper awoke the next morning at 6:18 and addressed a tape to Diane about the exceptional conditions of his room at the Great Northern Hotel and two things that trouble him: what really went on between Marilyn Monroe and the Kennedys and who really pulled the trigger on JFK. He then had breakfast at the hotel, where he highly approved of the coffee and met Audrey Horne, who told him about her brother, Johnny, who had been tutored by Laura Palmer prior to her death.\nCooper went to the sheriff's station, where Doctor Hayward emotionally delivered the post-mortem report on Laura Palmer to him and Truman. They then questioned James Hurley on his connection to the murder, specifically, the secret relationship he had with Laura and their activities together on the night of the crime.\nCooper later met Ed Hurley and confirmed with him that his nephew James had been cleared as a suspect in the murder. He then received a call from Albert Rosenfield, who was coming up to Twin Peaks to assist in the investigation. He released Mike and Bobby, who had been arrested for brawling at the Roadhouse, but first warned them not to touch James.\nHe and Truman then headed to the Packard Sawmill, where he met Josie Packard—who had been tutored in English by Laura Palmer—and asked her about Laura's actions during the last time they met. Cooper then deduced that Truman and Josie are romantically involved, much to Harry's embarrassment.\nThe two lawmen later went to the Double R Diner, where Cooper tried a slice of their famed cherry pie. There, he met the owner, Norma Jennings and asked about Laura Palmer's activities with the Meals on Wheels program.\nCooper then went to his room at the Great Northern with his flute and received a phone call from Deputy Hawk, who informed him of Ronette's condition and what he learned from her parents: that she recently quit her job at the perfume counter at Horne's Department Store. He also told him about the One-Armed Man's presence at the intensive care unit, so Cooper told him to keep watch on Ronette. There was then a knock on the door, but nobody was there when Cooper answered it. However, they leave a note reading \"Jack with One Eye.\"\nThe next morning, he gathered Sheriff Truman, Deputy Hawk, Deputy Andy, and Lucy to eliminate suspects by throwing a stone at a bottle placed 60 feet and 6 inches away, which he called the \"Tibetan method,\" an idea he got from his dream a year prior. This narrowed down his suspicion to Dr. Lawrence Jacoby and Leo Johnson. Truman also informed him that the \"Jack with One Eye\" may refer to the casino up north called One Eyed Jacks.\nCooper and Truman then examined a bloody rag found by Hawk just as Albert Rosenfield arrived with his team. Albert immediately displayed his impatience and distaste with the Twin Peaks Sheriff's Department, which Cooper found to be entertaining, though Truman was not amused in the least.\n \nLater that night, Cooper went to bed and drifted off to sleep. He began dreaming and had visions of a red room, a small man, the One-Armed Man (who identified himself as Mike), and of a mysterious man called BOB. He saw himself 25 years older in a red room and a woman resembling Laura Palmer, who kissed him and whispered the name of her killer in his ear. Cooper suddenly woke up and called Harry to tell him knew who killed Laura.\nAs he strolled down the hall of the Great Northern the next morning at 7:15 AM, Cooper addressed a tape to Diane, telling her that he planned to go to the sheriff's office after breakfast, then to Laura Palmer's funeral. He encountered Audrey as he sat down for breakfast and confirmed through her handwriting that she wrote the \"Jack with One Eye\" note. She confirmed with him that she was referring to the casino and that \"men go there.\" She also told him that Laura worked the perfume counter at Horne's Department Store, the same place as Ronette.\nTruman and Lucy then showed up, curious of his statement that he knew who killed Laura Palmer. Cooper explained his dream as a code to solve the crime, and about Mike and BOB, though he did not remember the name Laura whispered into his ear.\nCooper and Truman then went to the morgue, where a fight had broken out between Rosenfield and Doc Hayward. The Sheriff became fed up with Albert and punched him. Coop then separated the two and ordered that the body of Laura Palmer be released to the family for the funeral.\nAfter being fascinated by a group of ducks near the Johnson home, Cooper was filled in on Leo by Truman. He questioned Leo about Laura and knew his criminal record, though Leo claimed that he was with Shelly on the night of the murder.\nThey went to the sheriff's office, where Albert waited with his post-mortem report on Laura Palmer, the details on her being bound consistent with the words spoken by the dream of Laura he had the night before. After Truman left, Albert requested Cooper to sign a report on the scuffle between him and the Sheriff, but Cooper refused on the grounds that the incident was caused by Rosenfield. Albert left and Cooper addressed a tape to Diane at 12:27 PM, requesting her to look into his pension plan options regarding outside real estate, expressing his desire to stay in Twin Peaks after the investigation.\nCooper later attended the funeral, observing the citizens, especially Bobby and James, the latter showing up late. The two young men charged at each other, but the fight was quickly broken up as Leland Palmer dove on top of the casket.\nLater that evening Cooper arrived at the Double R Diner, joining Ed, Hawk, and Truman, easily sensing that Ed was in love with Norma, much like he did with Truman and Josie before. Over a piece of huckleberry pie, he discussed the Sheriff's Department's operation to stop drug trafficking between Twin Peaks and Canada. Truman informed him of an evil that haunts Twin Peaks, and the secret society that defends the town against it: the Bookhouse Boys. They took him to their meeting place, the Bookhouse, where James and Joey Paulson were waiting with Bernard Renault and they questioned him about the drug operation and his brother Jacques Renault's actions.\nLater in the evening, Cooper went to the cemetery, where he saw Dr. Jacoby visiting Laura's grave. He noted that the doctor had not been at the funeral and questioned him, to which Jacoby explained his feeling of guilt over Laura's death.\nHe then joined Hawk at the Great Northern and they discussed their beliefs in souls and the presence of Laura's. They drank to her and witnessed Leland having a nervous breakdown on the dance floor. The lawmen then comforted him and took him home.\nThe next day, in the conference room at the sheriff's station, Dale questioned Dr. Jacoby on his involvement with Laura Palmer, though the psychiatrist was not very compliant. After he left, there was a call from Cole, who gave further information on Albert's results and troubles with Truman. Andy then came in and showed him the sketch of a man Laura's mother had a vision of, which happened to match the appearance of BOB in Cooper's dream.\nAfter Hawk tracked down the One-Armed Man, Phillip Gerard, to a motel, Truman and Cooper came and find him. They showed him the sketch of BOB, though he said he had never seen him before, but he did know a Bob Lydecker. He also said he is a shoe salesman and that he did have a tattoo on his lost arm, but it said \"Mom.\"\n \nCooper and Truman then visited the Lydecker Veterinary Clinic, but the receptionist said that the sketch was not of Bob Lydecker, though the special agent did not give up on this lead due to Lydecker's connection with the One-Armed Man. Determining that the bird that attacked Laura Palmer was a client at the clinic, they confiscated the clinic's files.\nDue to Andy dropping his gun at the motel, Cooper gathered the deputies for target practice, Hawk's aim being exceptional, though Andy was left with much room for improvement. The men then talked about women as the FBI agent and the Sheriff practiced.\nAndy, Truman, and Cooper looked through the clinic files to find the bird that attacked Laura. Cole called and informed them that the bird was a parrot or myna bird. The results on a plastic object in Laura's stomach determined it to be part of a poker chip with the letter 'J' on it. Andy then found a record for a myna bird named Waldo, owned by Jacques Renault.\nCooper, Hawk, and Truman then made their way to Renault's apartment. However, he was not home, though someone was seen running away from the apartment. They found a bloody shirt belonging to Leo Johnson.\nCooper is awakened the next morning at 4:28 AM, due to loud Icelandic businessmen on his floor. He recorded a tape, requesting Diane to send him ear plugs. Audrey then tried to join him for breakfast, but he was running late, so he left with his coffee.\nHe then went to join the investigation at Jacques's apartment, though Jacques had not been seen in two days. Doc Hayward informed him that the blood on the shirt is not Laura's, which then prompted Cooper to believe that the blood belonged to Jacques, somehow knowing his blood type, which Doctor Hayward confirmed moments later after making a phone call. Dale then found a copy of Flesh World hidden on the ceiling, in which he found letters to Ronette, a Polaroid photo of a man in drag and a picture of Leo's truck printed in the magazine.\n \nThe P.O. box listed on the letters was found by Hawk to belong to Jacques and that he also sent letters to Laura, which Cooper then connected to the red drapes he saw in his dream and a photo of a cabin in Jacques's apartment.\nHawk then lead Cooper, Truman, and Hayward to a cabin that they suspected to be the one in the photo. On the way, they stop at the Log Lady's cabin, where she had been waiting for them. She said that her log saw something significant and Cooper asked the log what it saw. The Log Lady then answered for it, saying it witnessed the murder of Laura Palmer and that there were three men present. The group continued through the woods and found the cabin Cooper saw in the photo. Inside was a record player, which was playing \"Into the Night.\" Waldo was also found in the cabin along with a camera, blood, and the rest of the poker chip that was partially in Laura's stomach.\nCooper walked back to his room at the end of the day as the Icelandic men became loud once again. He saw that his door was ajar, so he drew his gun and entered, telling whoever was inside to turn on the light. The intruder did so, revealing that they were Audrey, in Coop's bed and upset, requesting him to not make her leave.\nDale sat down on his bed, gently telling Audrey that he could become romantically involved with her, but that she needed a friend. He then left to get food so they can talk to each other.\nThe next morning, he entered the Sheriff's Department with his flute and made his way to the conference room where Doctor Hayward and Sheriff Truman were with Waldo, trying to get him to talk. Hawk then brought Cooper forensics results indicating that Laura, Ronette, and Leo were all in Jacques's cabin. Dale left his voice-activated tape recorder near the birdcage in case Waldo talked before they headed out.\nCooper later went with Truman to the Double R Diner, where they saw Hank Jennings, Norma's husband, freshly released from prison. Truman then wanted to leave, but Coop insisted they stay and treat themselves to cups of black coffee.\nLater, Coop walked through the Great Northern in a tuxedo, ready to go to One Eyed Jacks to investigate Jacques with Ed. Truman told him that Josie suspected that Catherine and Benjamin wished to burn down the sawmill. Cooper agreed to investigate it with him.\nDale and Ed then prepared to leave, getting into their disguises and wireless microphones. A gunshot rang out in the conference room and they went in to find Waldo dead. Cooper found a recording of the bird saying \"Laura, Laura, don't go there,\" \"Hurting me, hurting me,\" \"Stop it,\" and \"Leo, no!\"\n \nThey went to One Eyed Jacks, where they meet Blackie O'Reilly, identifying themselves as Barney and Fred. She pointed them to the casino, where Coop played blackjack and Jacques came to deal the cards.\nCooper played blackjack and wins as he rejected a working girl's advances. He gave Jacques the chip found in his apartment and identified himself as a friend of Leo's before offering to buy him a cocktail. They talked about the drug operation and Jacques's actions on the night Laura Palmer died, along with Waldo and Leo's involvement. Cooper arranged for Jacques to meet him in two hours so that the Sheriff's Department could ambush him and he noted to Hawk his suspicion of Jacques involvement in Laura's murder.\nAfter being shot by Andy, Jacques was taken to the hospital, where Cooper questioned him on his involvement with Laura Palmer and Leo Johnson on the night of the murder, though he said he knew nothing about the train car, where the murder occurred. Cooper and Truman then checked up on Dr. Jacoby, who was also in the hospital. Jacoby had been brought there after having a heart attack following an attack by an unknown assailant.\nThey then went to the sheriff's office, where Lucy informed them about a call from Leo Johnson, during which she could hear a bell from Easter Park. James then came in needing to talk to Harry, but Cooper had him investigate the call instead and talked to James, who gives him a tape of Laura's, pointing suspicion to someone with a red Corvette. Harry then brought in a bag of cocaine found in James' gas tank and Cooper questioned him about it.\nCooper returned to the Great Northern at 4:37 AM and addressed a tape to Diane about the events that had occurred over the course of his very busy day. On the way inside of his room, he found a note on the floor, addressed to \"My special agent\" and the phone rang; it was Andy. Cooper asked if it could wait till morning when there was a knock on the door. He opened the door and was shot in the abdomen three times, while on the phone, Andy said and repeated that Leo had been shot.\n \nCooper lay on the floor, bleeding as Andy's voice was heard through the phone. A senile room service waiter came in with a glass of warm milk. Cooper asked him to put it on the table and call a doctor, but the confused waiter hung up the phone, Cooper believing he made the call. The waiter had him sign the bill for the milk and thanked him before saying he had heard about him, giving him a thumbs-up and a wink before leaving and repeating the thumbs-up, this time Cooper giving one in return. The same thing happened once more and a Giant appeared to the special agent, saying he will tell him three things and to think of him as a friend. The Giant told him \"there's a man in a smiling bag,\" \"the owls are not what they seem,\" and \"without chemicals, he points.\" However, he could say what they mean. The Giant took Cooper's ring—the same one that once belonged to his mother—and said he will return it if the things he said come true. He then said \"Leo locked inside a hungry horse. There's a clue at Leo's house,\" before saying Cooper will require medical attention and disappearing.\nCooper began addressing to Diane, hoping his recorder had the voice-activation function on. He told her about his current condition, thankful he was wearing his bulletproof vest but was hit directly once due to his folding up the vest while chasing a wood tick. He noticed his ring was gone and began telling Diane about his regrets and things he wished he could have done. Truman, Hawk, and Andy then arrived at the hotel room.\nHe awoke at the hospital with Truman, Lucy, and Doc Hayward standing above him and told them what happened. Hayward showed him a bullet that hit him and even managed to kill the tick. Lucy then told him about the current conditions of Leo Johnson's shooting, Jacques' death, and the mill fire.\nAgainst Hayward's orders, Cooper got up and got dressed. While walking around the hospital, he saw Jacques' body bag being rolled out and commented, \"is that bag smiling?\"\nThe lawmen then went to the Johnson home to investigate the shooting of Leo. Cooper deduced exactly what happened, uncertain that Shelly was the one that pulled the trigger. Hawk then found a copy of Flesh World along with Leo's duster, which smelled of gasoline. Rosenfield then arrived and Andy tried to warn Truman, stepping on a loose board and being hit in the face. The board revealed a hidden pair of boots and a stash of cocaine.\nRosenfield examined Cooper's current condition after the shooting and reprimanded him for moving his vest to chase the tick. Andy then came in and told Cooper he has a solution for the \"Leo locked inside a hungry horse\" riddle, informing him that Leo was in a jail in Hungry Horse, Montana on February 9, 1988, the night Teresa Banks was murdered.\nIn the interview room where Truman is questioning James, who informed them that the missing half of Laura's necklace was found in a coconut in Jacoby's office, surprising Cooper, who believed James to have had it.\nCooper then had Andy and Lucy look through an archive of Flesh World to find a photo of Teresa Banks and left them on their own as he addressed a tape to Diane.\nThe special agent and Truman went back to the hospital to see Jacoby, to ask how he came into the possession of half of Laura's necklace, who tells them that the night after the murder, he followed Leo but then saw James and Donna bury the necklace. After they left, he dug it up and took it as a keepsake. He then told them about Laura's double life and that proposed that she had reached the point where she wanted to die and allowed herself to be killed. The lawmen then questioned him about what he knows about the death of Jacques Renault, noting a peculiar smell, but that it was not a typical post-mortem smell, but something like scorched engine oil.\nThey then walked through the hospital with Rosenfield and spot Bobby Briggs, questioning his presence, then they ran into Ed, who told them Nadine was in a coma after an attempted suicide. Truman and Albert left Cooper and Ed alone, who talked about the unhappy relationship between the Hurleys and their sudden marriage and honeymoon. He revealed that while they were hunting on their honeymoon, Ed accidentally shot Nadine's eye out with a buckshot. James was then released to Ed as Cooper walked away and saw Jacques' body bag drying out, which looked like it is smiling.\nThe Sheriff's Department later in the conference room, with Cooper delivering his thoughts on Laura's actions the night she was murdered, including her activities with Leo, Jacques, and an unknown third man.\nAt 11:55 PM, a tired Cooper addressed a tape to Diane in bed about his tiredness and his experience the night before of seeing the Giant, who soon appeared to him again after Dale signed off. Th Giant told him that he forgot to tell him something, that \"one person saw the third man. Three have seen him, yes, but not his body. One only known to you.\" He also told him that Cooper forgot something and he disappears.\n \nThe following morning, Dale ate breakfast with Albert, telling him about Tibet, though the latter much preferred to focus on work, especially the status of Ronette (who had awakened from her coma) and the whereabouts of \"BOB.\" Albert revealed the autopsy of Jacques, finding that he was not strangled. Cooper then noted that his ring as gone, proof to himself that the Giant was real. Much to Cooper's shock, Rosenfield then revealed to him that Windom Earle was unaccounted for.\nCooper and Truman then visited Ronette in the hospital, though she was unable to speak but otherwise conscious. They showed her the sketch of Leo, asking if he was the one who attacked her, but she indicated that he was not. Cooper then showed her the sketch of \"BOB,\" causing her to go into a panic and mention a train.\nThe two went to Truman's office, where Hank Jennings was waiting. After Hank left, Truman told Cooper a little bit about their history before Lucy interrupted, saying that Benjamin Horne was calling. Truman passed along Ben's message to Cooper that Audrey had gone missing.\nLater in the evening, Cooper addressed a tape to Diane about his worries over the whereabouts of both Earle and Audrey. There was then a knock at the door from Major Garland Briggs, who delivered to him a message from a top secret source about signals received from space, and that on the night Cooper was shot, one of the waves read 'THE OWLS ARE NOT WHAT THEY SEEM' and one the next morning said 'COOPER.'\nAt night, Cooper was woken up by a call from Audrey, who said she saw him in his tuxedo and that she planned to come home, but suddenly, Audrey's end of the line was hung up.\n \nThe next morning, Cooper arrived with Albert to Ronette's room. Ronette had just been sedated, and he extracted the letter 'B' from under her fingernail. He then told Harry and Albert about the dream that he had about the Giant and the signs he was told.\nCooper later made a diagram proposing that Mrs. Palmer, Maddy, Ronette, and himself were linked to the long-haired man called \"BOB.\" Albert then announced his forensic findings before insulting Sheriff Truman and getting in a heated confrontation with him.\nCooper then let James leave, telling him he knew the cocaine in his gas tank was planted and did not want to see him arrested again. He then checked on Lucy, who was tasked with finding as many words as she could that used the letters found under the fingernails.\nLeland Palmer then showed up at the Sheriff's Department and told the lawmen that he knew the man in the sketch and said that he had met him near his grandfather's summer home near Pearl Lakes when he was a boy and the man lived in a white house with the name \"Robertson.\" He also said that the man used to flick matches at him, saying \"you wanna play with fire, little boy?\"\nCooper and Truman then sat down with Shelly to get a statement from her concerning Leo, but she was reluctant, not wanting to say anything against him. The special agent passive-aggressively let her go and supposed that the reason she would not talk was that she was after insurance money from her husband's invalid state.\nHe then went to Benjamin Horne and asked him about whether he knew anything about Audrey's disappearance.\nThe FBI man and the sheriff then took a break and they discussed Josie's impending return the next day, Truman requesting to see her first, in private. Hawk then came in with his report over the white house in Pearl Lakes. He was then told by Truman that the one-armed man had been at the station and had to go to the bathroom to take his medication, which reminded Cooper of his dream in which the man knew \"BOB.\"\nThe lawmen then visited Dr. Jacoby, who was with his wife, Eolani, and Cooper hypnotized him. Jacoby revealed that he heard tape ripping and the sounds of Jacques dying and that he knew the face of the killer.\nThey then went to the Palmer home and arrested Leland for the murder of Jacques.\nCooper and Truman took Leland back to the station to interrogate him. He waived his right to an attorney and confirmed that he went to the hospital to search for the man who killed Laura and tearfully confessed that he murdered Jacques out of grief.\nLater, Truman told Cooper that the judge and the prosecutor were on the way into town. He also read off the report from Hawk about the white house, that nobody named Robertson lived near the Palmers. Dale then noticed Andy's boots, who said they were bought from Phillip Gerard, the One-Armed Man. They were the same brand as the boots that belonged to Leo.\nLater, Benjamin Horne showed to Cooper a video of Audrey in captivity and asked him to personally deliver $125,000 in ransom money.\nCooper later walked in on an argument with Andy and Lucy, but he excused the former in order to ask Lucy what had been clearly frustrating her. She told him about things she has noticed about Andy that she did not like and found the opposite in a man named Dick Tremayne. However, she tearfully said that she did not know what she wanted to do and walked away as Truman showed up. Cooper then informs him that he needed the services of the best Bookhouse Boy, but did not say for what purpose.\nJudge Clinton Sternwood later arrived at the Sheriff's Department and was introduced to Cooper. Truman stated that they should find that they have a lot in common. Leland then appeared before the judge, who expressed his condolences. However, he decided to wait for the prosecutor to make a ruling. They all then left Cooper and Truman, the latter confirming that the plan was set for the night with the Bookhouse Boy.\n \nThe Bookhouse Boy then met Cooper at the Roadhouse, revealed to be Truman himself, wearing street clothes rather than his Sheriff's uniform.\nCooper awoke at 6:42 AM the next morning and addressed a tape to Diane while beginning his morning with a headstand, which made him spot a note from Audrey under the bed and determined this to be what the Giant said he had forgotten. The note pointed to One Eyed Jacks.\nHe arrived at the station as Lucy left to visit her sister and he told Harry that he knows where Audrey is.\nLeland's hearing was then held in the Roadhouse, where it was decided that he be released on bail, but must remain in Twin Peaks until his trial. Following this, the hearing concerning Leo was held, where the extent of his brain damage was revealed. However, the judge did not come to a decision on whether Leo will face trial or not, and Cooper told him he did not believe Johnson is guilty, though he is confident that the right man will be found. The judge then told them that he saw Leo as unfit to stand trial and had Truman deliver this news to Shelly as he told Dale his thoughts of the woods in Twin Peaks.\nThe Special Agent later met with Ben Horne, who spoke to Jean Renault over the phone, the latter describing the spot for the exchange. Cooper took the money from Horne and left.\nCooper studied a layout of One Eyed Jacks when Truman showed up, followed by Hawk, who bought in drugs found in the One-Armed Man's hotel room. After Hawk left, the other two discussed their plan to rescue Audrey.\n \nLater that night, the two approached One Eyed Jacks and Cooper noticed a strange owl as Truman knocked out a security guard. They entered the building, searching for the room where Audrey was held. They split up when Truman looked into a room occupied by Jean Renault and Blackie O'Reilly. Cooper ran into Blackie's sister, Nancy, who he restrained and had her lead him to Audrey. When the woman attempted to stab him, he incapacitated her and took Audrey. He then met up with Truman and they started to make their way out but were held up by a man with a gun, who was hit with a blade seconds later, revealed to have been thrown by Hawk.\nCooper delivered Audrey to safety with Truman and Hawk. He determined that her captors had injected her with heroin as she began speaking and showing distress.\nHe and Harry later met in the latter's office, where Harry told Cooper about Jean Renault, who killed Blackie at One Eyed Jacks. Cooper then expressed that this is not the first time that his duties have endangered someone he cares about.\nIn the evening, Ben Horne met the special agent in the Great Northern's dining hall. Dale told him about Renault's killing of Blackie and the condition of Audrey, who was then recovering from a near-lethal amount of heroin.\nCooper then brought Horne to his daughter and they took her home, against Audrey's wishes for Cooper alone to take her.\n \nGordon Cole then arrived in Twin Peaks and stated to Cooper his admiration for the Sheriff's Department and that he reminded him of \"a small Mexican chihuahua.\" Cole warned him that he may be in over his head. Truman then entered and Gordon delivers a letter to Cooper of a chess deal, presumably from Windom Earle.\nCooper, Gordon, Hawk, and Truman later speak with Phillip Gerard, who wished to have his medication, and without it, he seemed to completely switch personalities and identified himself as \"Mike\" and that he was an inhabiting spirit. He said that \"BOB\" is a parasitic spirit feeds on fear and pleasure, and that the two were once partners and that he now wishes to stop \"BOB,\" who had been in the presence of Twin Peaks for nearly 40 years and was in the Great Northern.\nThe following morning, the lawmen joined \"Mike\" for coffee, Truman announcing that they were ready to begin their duties for the day. Gordon then left for Oregon. Cooper, Truman, and Andy then went with \"Mike\" to the Great Northern to find the host of \"BOB.\" When Ben Horne entered the room, \"Mike\" suffered a seizure.\nSubsequently, they went to the home of Harold Smith, who had a secret diary belonging to Laura in his possession. However, he had hanged himself and the diary was partially destroyed. Cooper pieced together some of the pages back at the station, noting the presence of a \"BOB\" being abusive to her over a large period of her life, and said that she will one day \"tell the world about Ben Horne.\" Audrey then came in and told him that her father had a physical relationship with Laura at One Eyed Jacks, of which he is the owner. Cooper told her to not mention this news to anyone else and then told Harry to get a warrant for Horne's arrest.\nCooper, Truman, Hawk, and Andy went to Horne's office while he was in a meeting with a Mr. Tojamura and told him he was wanted for questioning in the murder of Laura Palmer, but he was resistant and tried to leave, causing the deputies to apprehend him and take him into custody.\nBack at the Sheriff's Department, the Log Lady showed up, telling Cooper and Harry that \"there are owls in the Roadhouse\" and confirmed the former's suspicion that \"something is happening.\"\n \nThe three traveled to the Roadhouse and sat at a table as the blonde singer performed onstage. Cooper amusingly observed the Log Lady eating a lot of peanuts. Minutes later, he seemed to enter a dream and the musicians onstage disappeared and were replaced by the Giant, who said \"it is happening again... it is happening again,\" before he disappeared and the band returned. The elderly waiter came over to the table and said, \"I'm so sorry,\" and walked away, leaving Cooper deep in thought.\nThe next day, Cooper and Truman went to the Great Northern as the former addressed a tape to Diane, giving his thoughts on the One-Armed Man. They encountered a dancing Leland in the Timber Room and they informed him of the arrest of Ben Horne. Cooper requested Leland to inform him if he were to remember anything strange about Horne's behavior and then he left with the Sheriff, commenting that he was not sure whether everything is fine.\nAfter Doc Hayward received a blood sample from the Horne, the lawmen spoke to the suspect in the interrogation room, with Jerry Horne present. Cooper asked him if he knows anything about the secret diary of Laura Palmer and revealed to him that the lawmen know about One Eyed Jacks.\nWhen the One-Armed Man went missing, Cooper and Truman began to search for him, but they encountered Leland, who was swerving on the road in his convertible and apparently on his way to try out his new golf irons. He told them that he remembered that on the night Laura was murdered, Horne mentioned a \"dairy,\" which Cooper assumed to actually be \"diary.\" Leland then offered to show Cooper his new clubs, but the agent left, as Lucy informed Truman that Gerard had been located.\nThe One-Armed Man was brought to the interview room with Ben Horne and said that \"Bob\" is not present, but had been nearby. In spite of this, Truman charged Horne with the murder of Laura Palmer, and Cooper voiced his disagreement.\nCooper addressed a tape to Diane at 11:05 that night from his hotel room, noting the empty sky and the events of the day, stating his belief that they had yet to find the killer. Audrey showed up at his door and asked what he thought about whether her father was guilty of the crime or not. He then received a call. Another body wrapped in plastic had been found: Maddy Ferguson, Laura's nearly-identical cousin.\nThe following day, Rosenfield stated that his findings of Maddy's murder pointed to the same person who killed Laura. Cooper requested 24 hours to find the culprit.\nDonna Hayward then informed him about an elderly woman named Mrs. Tremond and her grandson who spoke to her the same words that appeared on Harold Smith's suicide note. She took him to the Tremond home, however, a different woman with no connection to the old woman Donna had met answered. She gave them an envelope from Harold, which happened to be a page from Laura's diary - entries from February 22 and 23. In the first entry, Laura described exactly Cooper's dream, except from her point of view. In the second, she described that it would be the night that she dies.\nCooper went to \"Mike's\" bedside for his help. \"Mike\" spoke of a ring, the one taken from Cooper by the Giant, who could help him find \"Bob.\" When he left the room, he saw the elderly waiter, speaking some of the same words he spoke the night of the shooting, in addition to the words \"getting warmer now.\"\nAgent Cooper then made his way to Horne's office, where the Sheriff's Department searched for evidence, which Truman determined to still point the finger at Horne. Rosenfield then presented Ben's blood test.\nBen, Leland, Leo, and Bobby were all then rounded up into the Roadhouse with Agent Cooper, Ed, Albert, and the Sheriff's Department. Cooper stated that he believed among them was the killer, based on the use of his methods, but said that he must then rely on what he calls \"magic.\" Major Briggs then showed up with the elderly waiter, who gave Cooper a pack of gum and said to Leland, \"that gum you like is going to come back in style.\" Cooper then remembered the words Laura spoke to him in his dream: \"my father killed me.\" The Giant appeared and gave back the ring. The special agent asked for Ben Horne to be brought to the Sheriff's Department, with Leland as his attorney. He followed them out but paused to give the old waiter a thumbs-up.\nUpon arriving at the station, Cooper told Leland that Ben would be charged and he whispered in Harry's ear. The group approached the interrogation room and as Ben was nearly escorted inside, Leland was shoved in. The lawmen subsequently entered the room, handcuffing a giggling and howling Leland, who confirmed that he killed Laura and Maddy.\n \nCooper told Truman all of the clues pointing toward \"BOB\" in the body of Leland. These clues included that Ben's blood test was negative, the man in the dream danced (which Leland did following the murder), Leland's hair turning gray (the color of \"BOB's\" hair). Leland began to chant a poem, followed by the sprinkler system being triggered. Leland ran head-first into the interrogation room door and in his dying words came to the realization that he had killed his daughter and asked for forgiveness, and spoke of when \"BOB\" took control of his actions. He also confessed to the murder of Teresa Banks. As Leland died, Cooper recited the last rights from the Tibetan Book of the Dead. Leland then saw a vision of Laura, an apparent sign of forgiveness from her, and he died.\nThe following morning, Agent Cooper, Albert, and Truman met Major Briggs and they discussed the mysterious nature of \"BOB.\" Albert supposes that \"BOB\" was the embodiment of evil and Truman questioned the current whereabouts of this being.\nSuspension from the FBI\nThree days later, Cooper sat with Sarah Palmer and Doc Hayward as they prepared for Leland's funeral. He comforted Sarah, assuring her that it was not truly Leland who committed the heinous acts BOB was responsible for and that her husband died at peace with Laura. He then offered to drive her to the funeral.\nAfter the funeral, Cooper gathered with the town at the Hayward household, where a reception was held. He made it known that he was considering using his available vacation time to spend more time in Twin Peaks. He then witnessed a scuffle between Mayor Dwayne Milford and his brother Dougie, and Pete Martell explained their sibling rivalry that had taken place over the years.\nLater, he folded his laundry in his room as Audrey came in. He said to her that he was going fishing with Major Briggs, but then will leave the town afterward. He once again explained his convictions that he could not be in a romantic relationship with her and told her about Caroline dying under his watch.\n \nCooper went to the Sheriff's Department to say his goodbyes before going on the fishing trip. Harry gave him a Green Butt Skunk fishing lure and a Bookhouse Boy patch, effectively making him an honorary member. However, as he went to leave, Special Agent Roger Hardy arrived with RCMP Officer Preston King, informing Cooper that he had been suspended from the FBI. Hardy told him that the suspension was in relation to the rescue of Audrey Horne and Cooper's suspected motivations behind it.\nHardy questioned Agent Cooper about his visits to One Eyed Jacks and the deaths that occurred during Audrey's rescue. He was informed that his actions compromised a sting operation to stop Jean Renault's drug operation and that they believed Cooper may be responsible for stolen cocaine. He was then asked to hand over his gun and badge.\nLater, he roasted marshmallows with Major Briggs and discussed his actions as well as the subject of BOB and darkness. Briggs mentioned something called the White Lodge, but before speaking any further on the subject, Cooper excused himself to urinate. Suddenly, a bright light appeared and Major Briggs was nowhere to be found.\n \nThe next day, Cooper and Truman spoke with Betty Briggs about her husband's disappearance and that it may have been related to what was classified information. When she left, the Special Agent said that the disappearance was not work-related. Gordon then called, informing Cooper that he had his back in the investigation and informed him that Dennis Bryson was being sent by the DEA. He then met with Hardy in the conference room, stating that he had no defense, as he believed his actions to be right.\nHe then spoke with Truman and Hawk, asking about the White Lodge, which took Hawk's interest. He described the Lodge as being a place where spirits reside. He also spoke of the Black Lodge, the shadow being of the White Lodge. Dennis Bryson then arrived, who Cooper is surprised to see wearing feminine clothes. Dennis then asked to be called Denise and filled them in on the allegations against Cooper. After Denise left, Hawk commented, \"That's a good color for him.\"\nLater, Cooper sorted through his mail, one envelope being from Windom Earle, containing a chess move and a cassette tape, taunting him. In the evening, he received a phone call from Denise, whom he agreed to meet with at the wedding reception for Dougie Milford and Lana Budding. Agent Bryson informed him that a trace of cocaine was found in his car, feeding the suspicion that Cooper was being framed. Cooper then had a dance with Audrey.\nThe next morning at the Sheriff's Department, Cooper flipped a coin to determine what property to consider in Twin Peaks. The coin landed on a photo of Dead Dog Farm.\nA realtor, Irene Littlehorse, took him to the farm, telling him that there is some kind of strange, spiritual connection to the farm and not many people stay. The door was found to be unlocked when they arrived, and Cooper believed there had been a meeting at the house. He then found baby laxative in the sink drain and cocaine on a chair.\n \nBack at the station, Cooper met Colonel C. Reilly of the Air Force, who was heading the investigation of Briggs' disappearance. He asked if he had seen any owls, which Cooper confirmed. Reilly revealed that the messages concerning Cooper supposedly having come from deep space actually came from the woods and that the Briggs disappearance was beyond an issue of national security.\nHe later addressed a tape to Diane concerning a newspaper, in which a chess move from Windom Earle was printed. He also caught her up on his status with real estate in the town and the continuing mysteries it held. There was a knock at his door from Audrey, who brought him pictures of Jean Renault and his dealings with Hank, King, and Ernie Niles. Denise subsequently arrived. Audrey gave him a kiss and left, Cooper subsequently showing Denise the photos.\nDenise and Cooper then questioned Niles in his involvement with Renault and the drug trafficking. He insisted that he did it all against his will and they told him that a major drug supplier would arrive from Seattle and that he was to set up a meeting at Dead Dog Farm.\nThe next morning, Briggs had been found alive and came to the station to discuss his absence. Briggs noted that he had seen an image of a giant owl and when questioned on the nature of his work, he said it is classified. He then brought up Project Blue Book, which still existed in an unofficial capacity and that they were searching for a place called the White Lodge. Air Force personnel then escorted Briggs out as Cooper observed a photograph of three triangles that had appeared behind the Major's ear.\nDale then went to Denise and Ernie, the latter having been convinced to call Renault and make the buy. Cooper then who to Lucy, who he assigned to check personal ads in newspapers for more messages from Earle.\nCooper, Hawk, and Truman then prepared Ernie for the operation and the sheriff made the agent a deputy of the Twin Peaks Sheriff's Department, so he could participate directly in the sting operation within the law. Denise then entered as Dennis.\nCooper watched the operation from afar with Hawk and Sheriff Truman, but Ernie's wire malfunctioned due to his excessive sweat, causing Renault and King to take Ernie and Denise as hostages. Dale gave himself up in exchange for them.\n \nThe Sheriff's Department and the state police soon surrounded Dead Dog Farm. Jean told Cooper that he held him responsible for the deaths of both of his brothers since everything in Twin Peaks seemed to change ever since the FBI Agent arrived in town. Denise then arrived in a Double R Diner waitress outfit, hiding a gun on her leg, which Cooper took and shot Jean Renault dead as Agent Bryson subdued King.\nCooper and Truman went back to the Sheriff's Department, which had its power off, due to an explosion, which Lucy says to have been from a bomb. Cooper then went to Truman's office, finding a dead man gagged in front of a chessboard.\nReturn of Windom Earle\nCooper examined the man's body with Dr. Hayward, finding a black pawn in his mouth. Cooper then correctly determined that they will find a stab wound. He and Truman then found a lodgepole pine needle as Hawk came in, having found one person's set of footprints to and from the station. Cooper knows this murder to be the work of Windom Earle.\nCooper was later informed that he had been cleared of all criminal charges, but he was still suspended, awaiting word from Gordon. Harry allowed him to take charge of the current murder case. Hawk then came in and informed them that Hank was in the hospital after being \"hit by a bus\" and that Leo was now mobile, having attacked Shelly before escaping into the woods.\n \nDale later stood over a chessboard in Harry's office, elaborating on his relationship with Windom, his affair with Caroline, and her subsequent murder.\nBriggs then arrived at the Sheriff's Department, dehydrated. The Major told them that he believed he was in the White Lodge during his absence and that trouble will come. He then left and Andy came in to show them to Dr. Jacoby, who explained his findings concerning Lana Milford and her condition that caused the death of her new husband. Mayor Milford then arrived with a shotgun, believing Lana to be responsible for his brother's death. The deputies, Truman, and Cooper managed to get the mayor to surrender and left in alone in the conference room with Lana as they waited. After they waited, they entered to find the Mayor with kiss marks on his face and announcing that the two of them had decided to adopt a child.\nHarry later showed Cooper a picture of a man named Jonathan, who Josie was involved with, but who had now been killed, and Harry asked him to determine whether she was involved in the death.\nThe next day, Cooper and Truman questioned Bobby and Shelly over the situation with Leo and the night that the mill burned down. Bobby noted a connection between Hank and Leo. Truman also informed Shelly that he would post deputies around the perimeter of the Johnson home.\nAlbert then returned with information about Windom Earle, on orders from Gordon, for he was \"worried about Coop.\" He presented locations where Earle had sent packages containing articles of clothing: a white veil, a garter, white slippers, a pearl necklace, and a wedding dress, all belonging to Caroline.\nCooper and Truman then confronted Josie about the death of Jonathan. Coop went to get some coffee and talked to Pete, who was struggling with a load of dry cleaning and handed it all to Cooper so he could answer the phone. The special agent used this opportunity to take some fibers off of some of Josie's clothing. Albert compared them to fibers found outside of Cooper's room and confirmed that Josie was the one who shot him and that she was also most likely responsible for Jonathan's death.\nCooper went to Truman's office, where Harry informed him that they had identified Earle's victim as a vagrant named Erik Powell. Dale noted that Powell was Caroline's maiden name and believed this to not be a coincidence. They then went to the Double R Diner where Cooper and Doc Hayward both lost against Pete at a game of chess. Cooper decided to bring him on board to help with the Windom Earle case.\nHe later looked at a photo of Caroline and he went back to his room, where a white mask waited on his pillow and a tape played from Windom to Dale.\nThe next morning, Coop listened to Earle's tape with Truman, who swore that he would protect him. They call over Pete Martell.\nAlbert showed him the findings that proved Josie to be the one who shot him and killed Jonathan, but Cooper delayed the arrest, saying that he would talk to her to see if she would confess. However, she insisted that she had nothing to do with the murder. He commanded her to be at the station house at 9:00 or else he would come find her himself.\nPete discussed chess moves with Cooper and Truman, trying to figure out the next move to make against Earle. Albert arrived, informing Cooper privately that the powder found on Josie's gloves matched the gun. Truman overheard this and left the sheriff's station.\nCooper later sat in his room and received a call from Catherine Martell, who told him to go to Thomas Eckhardt's suite, where there was some sort of commotion taking place, culminating in a gunshot. Dale burst into the room, where Eckhardt stood, having been shot, and he then died. Josie was on the bed, pointing a gun at Cooper and he questioned her on Jonathan and his own shooting. Harry then showed up and demanded her to put down the gun. She pointed it at her head and collapsed, then Harry rushed to her and said that she was dead. Cooper then saw a vision of BOB, who tauntingly asked \"what happened to Josie?\" then he disappeared and the little man from his dream appeared dancing before disappearing.\nHarry became devastated by Josie's death and Cooper unofficially took his place in his stead. Cooper noted that Hayward's autopsy on Josie found that her body only weighed 65 pounds.\nCooper then went to Harry at the Bookhouse and told him Josie's criminal history, that she was a wanted felon. Truman was angered by this and shouted at Cooper to leave.\nCooper went to Pete, who had several chess boards set up, trying to play every stalemate game ever played, with the least amount of pieces lost. The Log Lady then arrived, escorted by Major Briggs. Briggs spoke of the marking behind his ear and the Log Lady showed a mark of two mountains on the back of her knee.\nCooper then went to the Double R Diner, where he met Norma's sister, Annie Blackburn and was immediately smitten. He noticed a scar on her wrist as she poured a cup of coffee that he highly approves of. Hawk then came in to retrieve him to go see Harry.\n \nHarry was now angry and drunk, having thrown around all of the furniture in the Bookhouse. Cooper tried talking him into handing over his gun and that his life was not over now that Josie's was. As Truman broke down into tears, the two friends embraced. Truman later fell asleep and Cooper commanded Hawk to keep an eye on him.\nThe next day, Harry returned to work after Thomas Eckhardt's assistant, Jones, had tried to kill Harry. They had the woman in custody but she only wanted to speak with the South African consulate. As Cooper gave him a recipe for a hangover cure, Truman became sick.\nDoctor Hayward then came to inform them that Earle had been at his house and delivered a chess move. Gordon Cole then arrived with a portion of Earle's dossier for Dale. They learned that Earle was part of Project Blue Book in 1965. Gordon then reinstated Cooper into the FBI before they headed out for breakfast.\nThey arrived at the Double R Diner and Gordon immediately (and loudly) became smitten with Shelly. Cooper drew on a napkin and looks outside at some birds while Harry came over from the restroom. Annie then came over to serve coffee. Cooper began telling Annie a joke, which was interrupted and Harry completely picked up on Cooper's attraction to Annie, much like Dale noticed Harry and Josie's attraction weeks earlier. Cooper then finished the joke, which Annie found quite funny. She also recognized the drawing Cooper had made as looking like a design at Owl Cave.\n \nCooper, Truman, Hawk, and Andy then explored Owl Cave, searching for the symbol. Owls swooped overhead after they find it and Andy accidentally struck the symbol, causing it to partially open and reveal a petroglyph.\nLater at the Great Northern, Dale began addressing a tape to Diane, describing the day's events but stopped when he saw Annie at the bar and went to speak with her, continuing to be fascinated by her.\nThe lawmen went back to Owl Cave, noting that someone had been there before them. Hawk noticed the same tracks he saw at the power station: Windom Earle. Cooper told Andy to make a large-scale drawing of the glyph.\nDale arrived at the Double R Diner and asked Annie for coffee and donuts before inviting her to go on a nature study with him later that afternoon. Dale then heard Shelly Johnson reciting a poem that was given to her, Donna, and Audrey by Earle.\nHe took the poem to Harry and explained it to him as a poem he had once given to Caroline. Hawk then brought Donna's portion of the poem, and Cooper asked him to bring Leo's arrest report. He then went to the conference room, where Briggs waited with Andy. He then requested Briggs' help to discover the extent of Earle's involvement with Project Blue Book, but while Briggs was reluctant, he agreed to do what had been requested. Cooper then looked over Leo's file, comparing the handwriting with the poem, which he determined to have been transcribed by Johnson.\nLater, Coop sat in a canoe with Annie, enjoying nature and talking. The subject of one of her ex-boyfriends came up but proved to be a tough subject for her. Cooper then told her that he understands the kind of pain she has faced. They then shared a kiss and went back to shore, hand in hand.\nLater in the evening, Cooper sat by a fireside at the Great Northern with a glass of milk and was joined by John Justice Wheeler. The two discussed love and everything it brought as well as their respective romantic situations.\n \nAt the park, a wooden box suspected to be a bomb was found in the gazebo. He opened the box to reveal a large black pawn with a dead man inside. Attached was a note that read: \"next time it will be someone you know.\"\nAs the pawn was removed, a young man told the law enforcement about the victim — named Rusty Tomasky — and what had happened to him prior to his murder. Cooper noted that this move from Earle was without warning.\nCooper and Truman later met with Briggs, who had been going over Project Blue Book files and Earle's involvement with the project. Earle had been removed when he started to become obsessive and violent. They viewed a tape of Earle discussing an evil place called the Black Lodge. Dale supposed that the real reason his old partner came to Twin Peaks for the Lodge and not purely to terrorize him.\nCooper called a meeting with Shelly, Audrey, and Donna, asking them if they had any strange encounters prior to receiving their parts of the poems. Shelly also confirmed that the handwriting was Leo's and the special agent told the girls safety precautions to take, as they are in danger.\nHe later observed the glyph with Harry and Andy, trying to interpret it. As Andy went to check on the status of Briggs' impending arrival, Cooper looked out the window, thinking about Annie and talked about his feelings for her with Harry. Suddenly, his hand started shaking uncontrollably, but he managed to stop it.\nHe went to the Double R where he talked with Annie as she served him coffee. They discussed their respective thoughts about each other and then he offered to take her dancing before they share a kiss and accidentally knock over a plate.\n \nHe met her that evening at the Roadhouse, where she reluctantly decided to get up and dance with him, as she did not know how. He began to teach her and they shared another kiss, discussing perhaps more than that. However, they were interrupted by Mayor Milford trying to make an announcement with much microphone feedback. Cooper then saw the Giant, saying \"No,\" and seemingly trying to warn him.\nThe next day, Cooper and Truman observed the glyph with Andy again and discussed Windom Earle as well as thoughts about the death of Josie and his vision of BOB. He said that BOB may be attracted to fear and has his origins in the Black Lodge.\nHe later addressed a tape to Diane after meditating, updating her on the situation with the glyph and Windom Earle. He also brought up Annie to her, who then showed up at his door. She requested his input on her speech for the Miss Twin Peaks Contest. After discussing trees and forests as a metaphor for Annie's life, they became intimate.\nSubsequently, he went to the sheriff's station where Briggs had been brought in a strange state of mind. The Major answered his questions incoherently, so Cooper decided to keep him in their care. He also told Harry more of his thoughts on the Black Lodge, and the nature of its door and that it requires them to be in a precise place at a precise time.\nCooper noticed that alignment of certain planets have something to do with when the door is open. Briggs then said \"fear and love open the doors,\" Dale believing this to mean that fear opens the Black Lodge and love opens the White Lodge. Briggs also spoke of a queen, and Cooper related this to a chess move by Earle and that this must be whoever would win the crown of Miss Twin Peaks. Andy accidentally knocked over a bonsai plant in the conference room and Harry noticed that it had been bugged by Windom Earle the whole time.\nDale and Harry arrived at the Miss Twin Peaks pageant as Lana Budding Milford began her performance, capturing the attention of every man in attendance. The pageant went on and Cooper found particular resonance with Audrey's speech, declaring that when something one cares about is in danger, one must fight for it, or lose it. As expected, he also listened closely to Annie's speech just prior to the vote for the winner.\nThe winner of Miss Twin Peaks was announced as Annie, which stunned Cooper, knowing that this meant something to Earle. Suddenly, the lights went out and some turned back on as strobes while smoke bombs went off. Cooper saw Windom Earle dressed as the Log Lady, but a smoke bomb went off in front of him. He searched for Annie as the lights turned back on and she was nowhere to be seen. Andy came to him and announced that he believed the glyph to be a map.\nBack at the station, Cooper and Hawk observed the map as Harry entered, saying he had put out an all-points-bulletin for Earle, who was nowhere to be found. Dale noticed in the map the Giant, the little man, and a connection to \"fire walk with me.\" Pete then came in saying the Log Lady stole his truck, but Cooper insisted that she did not and that she would arrive soon. Truman then noticed twelve sycamore trees and knew Glastonbury Grove to have this attribute. The Log Lady then arrived with oil. She told them that her husband brought it to her before he died, saying it was the opening to a gateway. They connect this to Jacoby's earlier statement about \"scorched engine oil.\" Hawk then brought in Ronette Pulaski and she recognizes the smell of the oil from the night Laura was killed.\nCooper went with Truman to Glastonbury Grove, where Pete's truck had been abandoned. He insisted that he must go alone. He headed into the grove, where owls sat in the trees. He spotted footprints outside the apparent gateway, where a red curtain appeared and he went inside.\nOnce inside, he heard a man singing a song and saw a Venus de Milo statue at the end of what seemed to be a hallway. He entered a room, where the little man danced over to his chair and the light flickered as the man sang in a spotlight.\nHe sat in the red room from his dream with the little man, who called it the waiting room, offered him coffee, and said some of his friends are here. Laura came and sat down, greeting him and saying \"I'll see you again in 25 years\" and she disappeared. The senile waiter appeared in her place and served him a cup of coffee. He was then replaced by the Giant, who went and sat down, saying \"one and the same\" and disappearing. Cooper reached for his coffee, but it turned into a solid form when he tried to drink it, then back to liquid when he tried to pour it, then to a syrup-like state. The little man said \"fire walk with me\" and the lights began to flicker as Dale heard a scream. He entered the hallway again and went into a room identical to the waiting room. He went back into the hallway and through the entrance he had come from, back to the waiting room, where the little man told him \"wrong way\" and he went back to the identical room, where the little man appeared laughing, saying there is another friend. Maddy Ferguson appeared, saying \"watch out for my cousin\" and disappeared.\n \nCooper left the room and to another one, this being empty until a doppelganger of the little man and Laura appeared, the latter screaming as the light flickered again and Cooper saw a vision of Earle. He ran to another empty room and began to bleed. He followed a trail of his own blood to a room where he saw Caroline and himself. Caroline turned into Annie and disappeared, the light flickering again. He went to another room where he saw Annie again, who sais she saw the face of the man who killed her - her husband. She turned into Caroline, then back to Annie, then a screaming Laura, and then Windom Earle. Annie appeared near them and disappeared. Earle offered to let Annie live in exchange for Cooper's soul, which he accepted. Windom stabbed him, but he then saw BOB grappling Earle, telling him to be quiet, saying that he was wrong, and could not ask for Cooper's soul. BOB took Windom Earle's soul and laughed as Cooper left the room.\nHe walked through the hallway, where he encountered Leland Palmer's doppelganger, who insisted that he did not kill anybody, then saw his own doppelganger who began to chase him. Cooper's doppelganger escaped the Black Lodge while he remained trapped.\nAt one point while experiencing a strange dream involving the Black Lodge and its residents, in the non-linear realm, Laura encountered Cooper at a point after he had become trapped there. Cooper implored her not to take \"the ring\", a mysterious object that gives its wearer a sort of connection to the Black Lodge. This displayed that the Black Lodge does not exist on the same plane of time as everything else.\nIn the Red Room, sometime after he warned Laura in her dream not to take the ring, he noticed that it was no longer on the table shown to him by the little man. He asked the man where it was and he replied, \"someone else has it now.\" Cooper realized with horror that \"someone else\" is Annie.\n \nFollowing her death, Laura's spirit appeared in the Red Room and looked up at Cooper, whose hand rested on her shoulder and he smiled at her. Shortly thereafter, Laura's angel appeared before them both.\nDossier\nIn 2016, a dossier compiled by Major Briggs was found, containing many documents concerning the town of Twin Peaks, and Cole assigned Special Agent Tamara Preston to research it. Among the documents was limited information on Agent Cooper.\nHis favorite book was noted to be The Official Report of the President's Commission on the Assassination of President John F. Kennedy by The Warren Commission Report, despite Cooper's skepticism on the commission's findings.\nIncluded in the dossier was The Andrew Packard Case manuscript, retrieved from the Bookhouse and written by Cooper during his month in Twin Peaks. Agent Preston identified him as the author due to his frequent references in the manuscript to the pie and coffee at the Double R Diner.\nCooper was considered by Major Briggs to be the only natural successor to his role as archivist, however, Briggs was left discomforted for unspecified reasons when meeting with Cooper's doppelganger the day after he returned from the Black Lodge and continued his investigation alone.\nTwenty-five years later\nAfter spending twenty-five years in the Lodge, Cooper sat across from a man who resembled the Giant and pointed his attention to the sounds of a phonograph. The man said \"It is in our house now,\" and \"It all cannot be said aloud now.\" The man then told Cooper to remember \"430\" and \"Richard and Linda. Two birds with one stone.\" He told Cooper that he \"is far away,\" and Cooper disappeared.\nIn the red room, Mike asked Cooper \"is it future or is it past?\" and said that someone was there. Laura Palmer came and spoke to Cooper, telling him he could \"go out now,\" and asked if he recognized her. He asked her if she was Laura Palmer and she gave an identical answer to the one she gave in the dream he had many years ago: \"I feel like I know her, but sometimes my arms bend back.\" Cooper then asked if she was Laura Palmer, which she confirmed, and that she was both dead and living. She then removed her face, which revealed a bright light, then placed it back. Cooper then asked her when he could leave, and she walked over and kissed him before whispering in his ear, much like the dream from long ago. Suddenly, Laura screamed and a force pulled her out of the room. The red drapes blew back, revealing a pale horse and darkness. Mike appeared to Cooper again and asked the same question as before and lead him out of the room, showing him to an electric tree with a fleshy mass that the little man — or, the arm — had evolved into. The arm asked Cooper if he remembered his doppelganger, and explained that it must be returned in order for Cooper to be allowed to leave.\nThe arm said \"253. Time and time again,\" and repeatedly said BOB's name before telling Cooper to go. He followed Mike out of the room and soon found himself in a room with Leland Palmer, who told him to find Laura. Cooper exited the room and the red room began to distort. He went back out to the hallway and pulled back drapes to see his doppelganger driving. The room began to shake, with the chevron floor shifting. The arm's doppelganger said \"Non-exist-ent!\" and Cooper was dropped to the floor to a glass box in New York City. He was transported out of the box and through darkness.\nCooper descended through a void and was dropped into an area with a purple hue. He looked upon a body of water and went through a set of windows to find an eyeless woman sitting in front of a fireplace. He asked her where they were, but she would not speak, except with a sort of breathy noise. A loud pounding began to occur and the woman signaled Cooper to be quiet. When he approached a mechanism on the wall, the woman kept him away from it and led him up a ladder to the roof. The woman pulled a lever on a mechanism present on the roof and received an electric shock, causing her to fall into the void, where Cooper also saw Major Briggs' head floating and saying \"Blue Rose.\" He went back down the ladder to see a different woman sitting in front of the fireplace. The mechanism then began to hum.\nAgent Cooper approached the mechanism and the woman told him \"When you get there, you will already be there,\" and warned him of her mother coming. Cooper was taken inside the mechanism, leaving behind his shoes. He was then transported to Las Vegas through an electrical socket, materializing next to a pile of his tulpa Dougie Jones' vomit. He was found by Dougie's prostitute, Jade, who believed he indeed was Dougie.\nWith Cooper in a sort of low-functioning amnesiac state, Jade took him to the Silver Mustang Casino, giving him $5 to \"call for help,\" a phrase he repeated to a security guard who pointed him to get change for his $5 bill. With his change, he went out to the casino floor and witnessed a gambler with the jackpot, saying \"Hello!\" Agent Cooper repeated this phrase as he began playing slot machines, earning a jackpot at every one he played, having been drawn to them by an image of the red room floating above them.\nHis constant jackpots soon earned him the nickname \"Mr. Jackpots\" and he was approached by Bill and Candy Shaker, who believed he was Dougie. Their conversation revealed to Cooper where Dougie lived, information that he relayed in the casino office, where he was taken to be given his winnings and called a limo.\nWith the information he learned from Shaker, he directed the limo driver to Dougie's house and stood outside with him until Janey-E, Dougie's wife, approached him and slapped him, as she too believed he was Dougie, who had been away for several days with no contact. She took him inside, upset with him until discovering his casino winnings, which she figured could be used to pay off her and Dougie's debts.\nThe next morning, Cooper sat on Dougie's bed and Mike faintly appeared to him, saying that he was tricked and that either Cooper or his doppelganger must die. As Mike disappeared, Cooper felt the need to urinate, so Janey-E took him to the bathroom, where he relieved himself. He looked at himself in the mirror and Janey-E dressed him but left his tie up to him. Dougie's son, Sonny Jim saw Cooper and gave him a thumbs-up, which Cooper imitated.\n \nWith his tie over his head, he made his way down to breakfast, where Sonny Jim helped him sit down and eat his pancakes. He took a sip of his coffee, which he spat out due to the heat, then grinned, saying \"Hi!\"\nAs Cooper left the house with Dougie's family, he observed Sonny Jim sitting in the car and shed a tear.\nJaney-E took him to Dougie's work, Lucky 7 Insurance, where he wandered until he felt let by a statue aiming a revolver. He followed Dougie's co-worker, Phil Bisby, to a board meeting, getting a coffee from him in the elevator. At the meeting, Anthony Sinclair told Cooper that he had covered for Dougie's absence over the previous days. As Sinclair presented a report, Cooper blurted out an accusation that Sinclair was lying. Dougie's boss, Bushnell Mullins, met with him privately to discuss this matter and gave him case files to assess by the next day.\nAt the end of the workday, Cooper found himself drawn to the statue he had seen that morning and examined it for quite some time.\nHe was soon taken home by an officer and Janey-E took him inside. She fed him and planned an appointment for him to see a doctor, then had him say goodnight to Sonny Jim. Cooper played with Sonny Jim's clap-activated light with him until Janey-E angrily called him down, having received photos of Jade and Dougie in an unmarked envelope. She reprimanded him and received a call from the men Dougie owed money to and planned to meet them, then she told Cooper to work on Dougie's case files.\nMike appeared to Cooper, urging him to \"wake up\" and to \"not die.\" Cooper then began to see light on the case files and began drawing scribbles, zig-zags, and other lines where the light appeared.\nCooper went to Dougie's work the next morning and was called into Mullins' office. The boss was first confused by the seemingly childish scribbling on the case files, but soon appeared to understand them and tried to shake Cooper's hand, but \"Dougie\" did not seem to understand the gesture.\nLater, as Cooper worked, Sinclair tried getting his attention until police came to speak with him about his car. With Janey-E coming to his side, it was eventually revealed that Dougie's car had been involved in an explosion.\nAs they exited the building a hitman attacked Cooper, who quite capably disarmed the hitman as the arm appeared to him, telling him to squeeze the man's hand off.\nAs Mullins made a statement to the police, Cooper and Janey-E waited and Detective D. Fusco brought coffee to him. He soon observed the American flag in the room, as well as a woman's shoes, then focused on an electrical outlet.\nHe was taken to Dougie's doctor for a physical, during which, he was found to be in exceptional health, much to Janey-E's surprise, as Dougie was usually overweight.\nAfter going back home, Cooper ate cake as Janey-E tried to tempt him. Despite him giving little response, she took him to their room and they had sex.\nMullins later called Cooper to his office, speaking about his report, which revealed that Rodney and Bradley Mitchum's hotel was not burned by arson, but by accident. Mullins prepared a check for $30 million to reimburse the brothers.\nAs Mullins escorted him out of the building, Cooper saw a vision of Mike in a nearby bakery's doorway and walked toward him. He returned with a box and was taken to a limousine, which drove him to a meeting with the Mitchum brothers. Inside the box, Cooper brought a cherry pie, which, along with the check, was a token of peace, and they treated him to dinner.\nLater, Sonny Jim took Cooper outside to play catch, but Cooper ended up just being hit by Sonny Jim's throw.\nThe Mitchum brothers later brought Cooper to Mullins' office to bring him gifts. The brothers also brought Sonny Jim a gym set, which Cooper and Janey-E watched him play on as the latter told him how much she loved him.\nJaney-E took Cooper to work in the new convertible the Mitchums bought them and Sinclair took him out for coffee. After Cooper became distracted by pies, Sinclair became near-hysterical, apologizing to Cooper. They went to Mullins' office, where Sinclair confessed to his activities with Duncan Todd and thanked \"Dougie\" for saving his life.\nCooper appeared in one of Cole's \"Monica Bellucci\" dreams. However, Cole noted that he could not see Cooper's face.\nJaney-E later brought Cooper a slice of cake and as he ate it, he observed and experimented with objects on a table. He turned on a television with a remote, and on the television, Sunset Boulevard was being shown. In the film, the name \"Gordon Cole\" was spoken, startling Cooper. He focused his attention on a nearby electrical outlet and crawled toward it, sticking a fork inside and causing a blackout at the Jones home.\nCooper was hospitalized, having fallen into a coma. He soon woke with his mind fully restored as a strange noise occurred in the hospital. Mike appeared to him, commenting on his awakening and informing him that his doppelganger was still outside of the Lodge and gave Cooper the ring. Cooper then gave Mike a strand of his hair to make another duplicate of himself. Janey-E and Sonny Jim came, followed by Mullins and Cooper announced his leave from the hospital.\nCooper borrowed Mullins' handgun and had him contact the Mitchum brothers to arrange for him a plane to Spokane. He then gave Mullins a message to read to Cole before saying his farewells and leaving the hospital.\n \nHe brought Janey-E and Sonny Jim to the Silver Mustang Casino, telling them that he appreciated their time together and that he would be leaving. He told them that he would be back, but managed to first misspeak, indicating that Dougie would return to them. Although Janey-E realized he was not her husband, he did not acknowledge this to her and she thanked him for his help and gave him a kiss before he left.\nOn the way to the plane, Cooper revealed his identity to the Mitchum brothers and told them he needed to reach the Twin Peaks Sheriff's Department. The brothers became skeptical about visiting a law enforcement office, but Cooper assured them that he could vouch for them having \"hearts of gold.\"\nAs he reached Twin Peaks, Cooper called the sheriff's station, reaching Lucy, who transferred him to Sheriff Frank Truman, Harry's brother. Cooper heard a gunshot and Truman indicated to him that his doppelganger had been shot. He told Truman to not touch the body and soon arrived.\nHe witnessed woodsmen release BOB from the doppelganger. BOB attacked Cooper as well as Freddie Sykes, who was to fulfill his destiny, shattering BOB into pieces. Cooper placed the ring on the doppelganger's body, causing him to disappear.\nCooper asked Truman for the key to his room at the Great Northern Hotel, which Briggs told him would be in Truman's possession. Cooper then saw the eyeless woman before Deputy Bobby Briggs arrived. Cooper told Bobby that his father was aware of the events unfolding that day and told him of a meeting Briggs had with Gordon Cole, who arrived just then. He told all present that there were things that would change and that \"the past dictates the future.\"\nDale told Frank to give his regards to Harry and the eyeless woman approached Cooper, her appearance then changing to that of Diane. They kissed and Diane assured Cooper that she \"remembered everything.\" He told the others that he hoped to see them again and the room darkened as Cooper called out to Gordon.\nCooper, Diane, and Gordon went to the furnace room of the Great Northern, following a strange noise coming from a door, which Cooper used his room key to unlock. He told them \"see you at the curtain call\" and went through the door alone.\nHe met Mike, who recited the \"fire walk with me\" poem and led him to the Dutchman's to see Phillip Jeffries about February 23, 1989. Jeffries showed Cooper where to find Judy, showing him the symbol found inside Owl Cave, which then formed into two diamonds, then an 8. He told Cooper he could \"go in now\" and was transported back to February 23, 1989.\nHe watched Laura talk to James Hurley and was briefly spotted by her, causing her to scream. After she abandoned James, she ran into Cooper in the woods and recognized him from her dream.\nShe took his hand and he promised to take her home. As they approached an opening on Blue Pine Mountain, leading to the Fireman's home, Laura disappeared and a stunned Cooper could hear her screams over a billowing sound.\nIn the red room, Cooper sat near Mike, who asked \"is it future or is it past?\" Cooper observed the chair Laura had sat in before following Mike to the evolution of the arm, who asked if it was the \"story about the little girl who lives down the lane.\"\nLaura whispered into Cooper's ear before being pulled through the red room's ceiling, screaming. He then found Leland, who asked him to find Laura and he exited the room through billowing curtains, finding Diane on the other side, asking if he was really him and he asked the same of her.\nCooper and Diane drove 430 miles, Diane warning Cooper that their destination would not be what he expected. Upon arrival, he got out of the car and observed their surroundings before getting back in. Fearing that things would change before they crossed, he asked Diane to kiss him. They drove along the shoulder of the road and their surroundings changed.\nThey reached a roadside motel and Cooper went inside before going to a room with Diane. In the motel room, they had mechanical sex, a distressed Diane covering Cooper's face and looking away from him.\nCooper woke alone, finding a note from \"Linda\" to her partner, \"Richard\" saying that she had left him and told him not to find her. Cooper then exited a different motel than the night before and left in a different car.\nHe eventually reached Odessa and stopped at a coffee shop called Eat at Judy's, where he asked the working waitress, Kristi, if there was another who worked there and was told it was her day off. After coming to Kristi's aid against a group of men, she gave him the other waitress's address and he put the men's handguns in the coffee shop's deep fryer, warning the staff that the heat could set off the guns.\nCooper went to the waitress's house, spotting a telephone pole outside of it with a number \"6\" attached to it. He knocked on the door, stunned to find that the woman in the home – identifying herself as Carrie Page – strongly resembled an older Laura Palmer and believed she indeed was Laura. He told Carrie that is was important for her to go with him to Twin Peaks to the Palmer house. Already needing to leave town, Carrie agreed to go with him. As she packed, Cooper saw a dead man and a white horse figurine in her living room.\nOn the drive to Twin Peaks, Carrie became briefly concerned about a car driving behind them until it passed without incident. She then rambled to Cooper about her regrets before falling asleep. They later stopped at a Valero gas station.\nWhen they reached Twin Peaks, Cooper asked Carrie if she recognized anything, but she said she did not. Upon reaching the Palmer home, Cooper was surprised to see that Sarah Palmer was not there. Instead, there lived a woman named Alice Tremond, who had purchased the home from a Mrs. Chalfont. They walked away from the home, perplexed.\nCooper turned back around to look at the house and asked aloud what year it was as Carrie became increasingly distressed before screaming in terror as the house's lights went out.\nRelationships\n\nFamily\n\nFather\nDale maintained a healthy relationship with his father well into his adulthood, and it was he who inspired the 13-year-old Dale to begin transcribing tapes. Cooper's father also completely supported his decision to join the FBI.\nMother\nDale had a good relationship with his mother, who taught him that death was not something to be feared. She also instilled in him to trust dreams. Her death deeply affected Dale, and when he had a dream through which she gave him a ring she used to wear, he began to wear it on his pinky finger for many years.\nEmmet Cooper\nCooper's relationship with his brother prior to the latter leaving for college is unclear. However, it was presumably a good one since Dale wished he was able to come to their mother's funeral. However, after Emmet caught wind of Dale joining the FBI, he sent him a letter calling him a \"tool of the establishment\" and said that he would \"rot in hell.\" Despite this, Dale was glad to hear from him.\nAl Cooper\nDale seemed to have a good relationship with his uncle, and, years down the road, he put the gambling tips he was taught by him to good use.\nTwin Peaks Sheriff's Department\nMuch like how he relates to the town itself, Cooper gained an instant rapport with many of the townspeople on arrival to Twin Peaks — most particularly Sheriff Harry S. Truman and his deputies, Tommy \"Hawk\" Hill and Andy Brennan.\nHarry S. Truman\n \nWhile Truman was initially skeptical of Cooper's unconventional investigative methods and otherworldly ideas, he was most often willing to accept Cooper's judgment (even referring to Cooper as \"the finest lawman I have ever known\" to agents investigating Cooper's alleged drug-running to Canada). Over time, a deep bond emerged between the two, as displayed in various scenes: when Truman assists Cooper in rescuing Audrey Horne from One Eyed Jacks, Truman deputizing Cooper following Cooper's suspension from the Bureau, and Truman waiting patiently for two days at Glastonbury Grove for Cooper to emerge from the Black Lodge.\nHawk\nCooper had much respect for Hawk and his essential skill for the town's lawmen. Upon his originally-planned departure from Twin Peaks, Cooper said that if he ever became lost, he hoped Hawk would be the one who found him.\nAndy Brennan\nCooper formed a great respect in Andy and helped him whenever needed, particularly when it came to his marksmanship skill. He told Andy that he admired the deputy's bravery and his large heart.\nFederal Bureau of Investigation\n\nGordon Cole\nCooper seems to be very close with his superior, Gordon Cole, the two sharing the quirk of often giving a \"thumbs-up\" sign. When Cooper was suspended from the FBI, Cole expressed his support for him. When Windom Earle came to Twin Peaks, Cole sent Albert Rosenfield to help, as Cole was \"worried about Coop.\"\nAlbert Rosenfield\nCooper's strongest relationship outside of the townspeople was that of his friendship with his colleague, Agent Albert Rosenfield. Though he had strong respect and admiration for Rosenfield's medical skills and was seemingly undaunted by Rosenfield's sarcastic manner, he had little tolerance or patience for Rosenfield's treatment of the town's citizens — most particularly his animosity towards Sheriff Truman (which notably thawed over time).\nRomantic Relationships\n\nMarie Schlurman\nCooper's next-door-neighbor Marie was his first romantic interest, following an incident where he saw her in her underwear through her window. Their relationship confused Dale, as she would seem to go back and forth in having an interest in him, and kissed him while she grieved over the death of Bobby Kennedy. Following a drug overdose during a flower child stage, she became a born-again Christian and the two later had a sexual encounter, which was interrupted by a rocket.\nAndy\nAndy was a girl from Bryn Mawr College whom Cooper met while a student at Haverford. After the two had a sexual encounter in the woods, she revealed to him that she was married to a man named Tim, with whom she was to go on an exchange trip to Holland. After returning without her husband, Andy and Dale had a \"study on the limitations of the mind and body\" inside a hotel room. However, their affair was cut short when Tim was injured and she decided to return to him.\nLena Fraser\nDale became sexually-frustrated during his time with Lena Fraser, made more serious by her vow to celibacy that was in place until she came to terms with her mother, due to her mother sleeping with a former boyfriend of hers. During a trip to her home with Dale, Lena set the house on fire and on the way back, she and Dale had a sexual encounter in the car, which caused them to hurtle toward a group of cattle. Their relationship was cut off when Lena went to a psychiatric hospital and she later married her high school sweetheart.\nCaroline Earle\nPrior to his activity in the town of Twin Peaks, Cooper's strongest romantic relationship was his affair with Caroline Earle, the wife of his former partner, Windom Earle. Caroline had been under Cooper and Earle's protection for witnessing a federal crime Earle committed when he lost his mind, but on one night when Cooper's guard was down, Caroline was murdered by Windom. Caroline's death and his failure to protect her continued to haunt Cooper on his arrival to Twin Peaks, referring to a \"broken heart\" when discussing women with Truman and his deputies. He also related a version of the story of Caroline to the teenage Audrey Horne.\nAudrey Horne\n \nOn arrival to Twin Peaks, Cooper became quickly aware that 18-year-old Audrey Horne, the daughter of local businessman Benjamin Horne, harbored a crush on him. The attraction appeared to be mutual, as Cooper was clearly drawn to Audrey — but he was quick to rebuff her advances when Audrey turned up in his hotel bed. Cooper explained she was too young, but he did genuinely want to be her friend. However, following her disappearance orchestrated by Jean Renault, Cooper privately confessed to Diane that in Audrey's absence all he could think of was her smile. Following her rescue, there remained a close and affectionate friendship with the two, most notably when Audrey arrived at his hotel room for comfort following her father's arrest and her sad farewell when she believed Cooper was leaving Twin Peaks for good. Audrey later gave Cooper a surprising kiss on the cheek when she discovered evidence that cleared him of drug charges, and they later slow-danced at the Milford wedding.\nAnnie Blackburn\nFollowing his reinstatement to the FBI, Cooper met Annie Blackburn, the sister of Norma Jennings, whom he instantly fell in love with. Annie was established as being a kindred spirit, experiencing the world with curiosity and wonder. Much like Cooper's pain over Caroline Earle, Annie also nursed a broken heart from someone in her past, which was implied to have resulted in a suicide attempt, and affected her decision to later attend a convent. Cooper helped her to prepare for participation in the Miss Twin Peaks Contest and they slept together. However, during the contest, she was kidnapped by Windom Earle and taken to the Black Lodge to use her 'fear' to open the gateway.\nPersonality\nAgent Cooper displayed an array of quirky mannerisms such as giving a 'thumbs up' when satisfied, quoting sage-like sayings, a distinct sense of humor, and a passionate love for the Double R's cherry pie and a \"damn fine cup of coffee.\" One of his most popular habits was keeping a tape-recorded journal with his portable microcassette recorder and addressing all entries to his secretary, Diane Evans. These entries ranged from important observations or notes regarding a case to the often energetic, yet superfluous observations of everyday life.\nHighly intelligent, determined, and perceptive, Cooper was a capable investigator. He lacked skepticism, in direct contrast with fellow agent Albert Rosenfield, and trusted in his dreams to solve cases, in addition to employing unconventional techniques. Despite being in charge of the Laura Palmer investigation, he treated his fellow lawmen as equals and showed a deep concern for their well-being.\nAccording to Special Agent Tammy Preston, Cooper suffered from what she called \"white knight syndrome,\" which she defined as \"the irresistible urge to rescue every damsel in distress.\"\nDuring his catatonic state, during which he was known as \"Dougie Jones,\" he was largely unresponsive and only spoke words that he heard others say. Occasionally, aspects of his normal self could be seen. For example, his intuition was displayed when he correctly determined that Anthony Sinclair was lying on his insurance reports. Additionally, he retained his love of coffee and pie and displayed familiar reactions to each.\nFollowing his return to Twin Peaks and his new journey to \"find Laura,\" Cooper underwent an odd personality change. Upon arriving at the \"Eat at Judy's\" diner, he willingly waved a loaded gun around at the staff and innocent patrons and placed them in danger by putting the guns in a deep fryer knowing the heat could set them off. At the same time, however, the reason he acquired the gun was due to defending a waitress from being sexually harassed by some cowboys, suggesting he retained his strong moral values, and he warned the staff to stay away from the fryer. The full extent of what this means about Cooper's personality moving forward remains unknown.\nNon-canon appearances\n\nInternational Pilot\nThis section covers only the alternate ending presented in the International Pilot.\nCooper begins breathing heavily in his sleep until he receives a phone call from a man who claims to know who killed Teresa Banks and of the \"stitches with the red thread.\" He says he is at the hospital and hangs up. Cooper sits up and receives a phone call from Lucy, who says that Sarah Palmer saw Laura's killer, so Sheriff Truman and Deputy Hawk are on their way to the Palmer home to get a sketch. Cooper tells her to have Harry get the sketch and go to the hospital. He addresses a tape to Diane at 2:24 AM to tell her of the phone calls he just received.\nHe meets Sheriff Truman at the hospital, where the one-armed man from the elevator waits in the shadows of the room where Laura's body was examined. The man identifies himself as \"Mike\" and tells them that he lived above a convenience store with a man named \"BOB.\" Cooper brings up Mike's activity at the hospital earlier, and Mike says he was looking for BOB. He also says that he had a tattoo on his arm, but cut the arm off when he saw the face of God. Sheriff Truman shows a sketch of a long-haired man to Mike, who identifies it as BOB and says he is in the basement.\n \nCooper and Truman enter the basement, where BOB welcomes them to the \"killer's lair.\" They approach him and he asks if Mike is with them, wishing to \"sing with him again.\" Harry asks BOB what the letters under the victims' fingernails were going to spell and he answers \"Robert.\" BOB promises he will kill again and Mike appears with a gun, shooting BOB dead. Mike is overcome by pain and collapses to the ground. Cooper looks at the candles BOB had set up and says \"make a wish\" before they go out.\nTwenty-five years later, Cooper sits in a room with red drapes, a little man, and Laura Palmer. The little man tells him \"that gum you like is going to come back in style.\" Cooper looks at Laura and asks if that is who she is. Laura responds that she feels like she knows her, \"but sometimes arms bend back.\" The little man says she is filled with secrets and that the birds \"sing a pretty song\" where they are from. The man begins dancing and Laura comes over to Cooper and kisses him before whispering in his ear.\nSaturday Night Live sketch\nIn his room at the Great Northern at 11:31 PM, Cooper addresses a tape to Diane, telling her how long he showered and the details, including how many hairs he found and what kind of shampoo he used. He then tells her that he ate fifteen jelly doughnuts and that he will soon take an insulin shot, then details his plans to slide around his sheets in the nude to figure out what they are made of.\n \nSheriff Truman then enters, announcing that Leo has confessed to Laura's murder. However, Cooper does not listen, instead suggesting that they go to One Eyed Jacks disguised as Indians, using Hawk's buckskins. The sheriff tells him of Leo's confession again and Cooper says it to be another piece of the puzzle of figuring out Laura's killer. Harry tells him that they have evidence, including a videotape of Leo murdering Laura, but Cooper again dismisses this as it is too obvious. He then tells of a dream he had of a hairless mouse with a pitchfork singing a song about caves and surmises the caves to be the same ones at the Packard Sawmill.\nDeputy Andy brings a handcuffed Leo into the room, who says he is ready to do his time. Cooper determines Leo's actions to make him a prime suspect. Leland Palmer then enters, thanking him for finding the man who killed Laura. However, Cooper tells him that Laura's killer is still at large, which causes Leland to have a breakdown and he leaves.\nAudrey then enters. Cooper asks her if she has found any leads at the perfume counter, but she say she quit the job after Leo confessed. Leo interrupts and shows pictures of him about to kill Laura, killing Laura, and wrapping Laura in plastic. However, Cooper is still unconvinced. Audrey gives him a present, tying the bow with her tongue, and she leaves.\nCooper turns to Harry, telling him of his plan to stake out the graveyard, disguised as altar boys. The sheriff shoots this plan down and continues trying to convince him that Leo is guilty of the crime. Cooper suggests that he throw a rock at a window, suggesting that if it breaks, Leo is innocent. He throws the rock, breaking the window, and tells Leo he is free to go. This irritates Leo, who says he sent several notes to Cooper, confessing to the crime.\nNadine Hurley then enters and asks him to take her silent drape runner to the patent office in Washington, D.C. then leaves. Harry says he is about to head out as well, but Cooper stops him, as they have not yet heard from the Log Lady. However, Harry says they will not hear from her, as they have already used both female Saturday Night Live cast members. Nevertheless, she comes in to tell him that her log points to Leo being the murderer and she leaves.\nSheriff Truman prepares to leave with Andy and Leo, but Cooper then says that they still have to figure out who shot him, which Leo also confesses to. They leave Cooper alone and he addresses another tape to Diane, telling her of his impending return. He says that he feels alone in Twin Peaks for the first time. The little man from his dream then enters. Cooper says he is off to get a pie from the diner, but then decides to go to bed as the man dances.\nGeorgia Coffee Commercials\n\nLost\nKen comes to Cooper, searching for his missing wife, Asami, who had sent a postcard from the Great Northern prior to her disappearance. In her room, investigators found a deer head and a photo of Asami. Cooper suggests they think about this over coffee. Andy and Lucy began to bring in coffee, but he rejects this in favor of Georgia Coffee, which he highly praises. Ken asks about the deer head, and Cooper notices a symbol that resembles the sign at Big Ed's Gas Farm.\nCherry Pie\nCooper and Ken find Asami's car, a rare Von Singer Vibel, and in the front seat is a triangle of red snooker balls. They go to the Double R Diner, where Cooper rejects Shelly's coffee for a can of Georgia Coffee. Shelly then gives Ken an origami swan, left by \"a beautiful woman.\"\nA Mystery of \"G\"\nCooper tries to figure out the meaning of the swan and finds the letter 'G' on it, which makes him suggest they think it over with some Georgia Coffee. When Andy connects pins on a map, Hawk identifies the location as Glastonbury Grove.\nThe Rescue\nCooper travels with Ken to the grove and enters the Black Lodge and rescues Asami. They celebrate with Georgia Coffee.\nBehind the scenes\nCooper is portrayed by Kyle MacLachlan, who had previously starred in the David Lynch films Dune and Blue Velvet. MacLachlan considers Cooper to be an older version of his character from the latter film, Jeffrey Beaumont.\nDuring the series' original run, MacLachlan won a Golden Globe for Best Actor in a Drama Series and was nominated for an Emmy for Outstanding Lead Actor in a Drama Series. He was also nominated for a Grammy for his performance in \"Diane...\" - The Twin Peaks Tapes of Agent Cooper, which was mostly comprised of audio taken from the series.\nMacLachlan reprised the role in the revival series, which earned him another Golden Globe nomination, this time for Best Performance by an Actor in a Limited Series or Motion Picture Made for Television.\nTrivia\nAccording to Mark Frost, Cooper's personality and characteristic quirks are based on Lynch. He was also conceptualized as a modern Sherlock Holmes.\nCooper's car (seen only in the pilot episode) is a 1981 Dodge Diplomat.\nIn Cooper's dream, he wears several lapel pins. The pins, ordered from top to bottom, are: a masonic logo, a Shell and Flame, and a 25 Years Of Service Red Citation Bar.\nFollowing the close of the Laura Palmer case, the show was to focus on the relationship between Agent Cooper and Audrey Horne. However, MacLachlan refused this on the grounds that Cooper would not allow himself to be romantically involved with a high school student. As a result, the characters of John Justice Wheeler and Annie Blackburn were introduced and the show further focused on the supporting characters. It was later rumored that Lara Flynn Boyle had some influence on this, as she was dating MacLachlan at the time and allegedly did not get along with Sherilyn Fenn.\nAs intended by Lynch and Frost, the Collectible CardArt and Twin Peaks: Access Guide to the Town establish Cooper's middle name to be Bartholomew, making him share initials with D.B. Cooper, the media's name for a 1971 plane hijacker who identified himself only as Dan Cooper.\nIn Episode 6, Blackie O'Reilly tells Cooper that he looks like Cary Grant. Coincidentally, Kyle MacLachlan went on the portray the spirit of Cary Grant in the 2004 film, Touch of Pink.\nThe idea of Cooper being without his suit for a time was pushed by MacLachlan.\nCooper was originally to have investigated the Teresa Banks murder and this was portrayed as such in The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes. However, in Twin Peaks: Fire Walk with Me, Chester Desmond and Sam Stanley are given the case. This was a result of MacLachlan's wish to have a smaller role in the film.\n \nUnrealized plans for the original series' third season would have seen Cooper retire from the FBI following his release from BOB's possession. He would have then become the local pharmacist in Twin Peaks.\nIn 2007, artist Matt Haley was offered to collaborate with Twin Peaks writer Robert Engels to create a graphic novel that would have been adapted from the third season's plans. It was to have been released with Twin Peaks: Definitive Gold Box Edition, but Lynch vetoed the idea.\nThe way MacLachlan delivers \"Hello\" in the Silver Mustang Casino was specifically chosen by Lynch.\nPart 8 is the only episode to date where Agent Cooper does not appear, though his doppelganger is prominently featured during the episode's first act.\nWhen asked about what Cooper would love and hate about the 21st century, Mark Frost jokingly answered: Smartphones and people who constantly use them.\nReferences in other media\nA character resembling Cooper makes an appearance in the video game Blair Witch Volume 1: Rustin Parr. He is sitting in the Burkettsville diner eating pie and later in the game drinking \"a damn fine cup of coffee.\" His name is given as \"Hale\" when communicated with.\nThe 2010 video game Deadly Premonition (titled Red Seeds Profile in Japan) is heavily influenced by Twin Peaks. This is mostly apparent with its protagonist, FBI Special Agent Francis York Morgan. Agent Morgan is an FBI Agent assigned to a case in which a teenage girl was murdered in the small Washington town of Greenvale. Much like Cooper, York enjoys a hot cup of coffee and often speaks to a mysterious unseen person - in this case, named Zach.\nA character from Marvel Comics named Valerie Cooper once implied that she was the sister of Dale Cooper. Her exact words were: \"Oh I am. I have a brother who's an FBI agent. And I am so tired of him telling me about these exciting cases he gets.....Like for instance, this girl they found. She was dead....Wrapped in plastic.....\"\nOther Lynch Projects\nIn David Lynch's project, Psychogenic Fugue, actor John Malkovich plays various roles from Lynch projects, including Cooper and the Log Lady.\nJohn Malkovich as Dale CooperJohn Malkovich as Dale Cooper"}