{"name": "Dave_Macklay", "url": "https://twinpeaks.fandom.com/wiki/Dave_Macklay", "text": "Dave Macklay\nDetective Dave Macklay was a detective with the Buckhorn Police Department.\nBiography\nMacklay arrived at the apartment of Ruth Davenport, who had been found dead. Constance Talbot investigated the scene and they pulled off the bedsheet supposedly covering Ruth's body to find that her head had been severed and a man's headless body was placed on the bed.\nTalbot informed Dave that the head was confirmed as Ruth Davenport's and that fingerprints were found at the scene, matching those of William Hastings, Macklay's fishing buddy and friend since high school. He went to Hastings' home and arrested him.\nDave questioned Bill, whose story lined up until there was a 45 to 50-minute gap between his leaving a meeting on the night of the murder and his arrival at home. Macklay found this strange and Hastings eventually blamed it on taking his assistant a ride home. The detective then escorted Bill to a jail cell.\nWith a search warrant, Macklay, Harrison, and other officers went to the Hastings home. In Bill's car, they found a piece of flesh.\nMacklay allowed Phyllis to briefly speak with her husband, which became a bitter conversation between the couple.\nTalbot later showed Macklay and Chief Boyd that the identity of the John Doe found in Davenport's apartment required military authorization.\nTalbot later confirmed the John Doe's cause of death to be decapitation and revealed to Macklay and Harrison a ring found inside the body, inscribed, \"To Dougie, with love, Janey-E.\"\nLieutenant Cynthia Knox of the United States Air Force later came to observe the John Doe. Soon after, the body was identified as Major Garland Briggs and was examined by the FBI's Deputy Director Gordon Cole and Agents Albert Rosenfield and Tammy Preston, whom Macklay told the circumstances of the body's discovery and that Hastings had an interest in alternate dimensions prior to the murder of Ruth Davenport.\nHastings led Macklay and the FBI to where he claimed to have entered \"the zone,\" an alternate dimension. As the FBI investigated, Macklay remained in his car until Hasting's head suddenly exploded and he called for backup.\nGordon and Albert discovered the body of Ruth Davenport, which Macklay confirmed. Both Albert, Gordon, and Diane Evans all three claimed to have seen \"dirty, bearded men\" in the vicinity."}