{"name": "Deer_Meadow", "url": "https://twinpeaks.fandom.com/wiki/Deer_Meadow", "text": "Deer Meadow\nDeer Meadow was a town in rural Washington State, located near Wind River and the community of Red Diamond City.\nIn the pilot episode, Deer Meadow is, by implication, stated to be in the \"southwest corner of the state,\" corroborated by the real-life location of Wind River. In The Secret History of Twin Peaks, the town is described as a \"nearby community\" to Twin Peaks, located \"one county to the west.\"\nHistory\nDeer Meadow was served by its own sheriff's department.\n \nIn February 1988, the body of murdered local prostitute Teresa Banks was discovered in Wind River. Determining Banks' death to be a Blue Rose case, FBI deputy director Gordon Cole assigned agents Chet Desmond and Sam Stanley to conduct an investigation. Despite aggressive resistance from the local sheriffs, Desmond and Stanley conducted their own autopsy on Banks' remains, and subsequently visited her last place of employment, Hap's Diner, and the Fat Trout Trailer Park, where she had been living.\nIn The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes, Banks is said to have worked at the Cross River Cafe and lived in a tourist rental cabin.\nAfter engaging in fisticuffs with Sheriff Cable, Desmond arranged for Banks to be transported to Portland, where Stanley would run further tests. Before leaving, Desmond returned to the trailer park, where he found the Chalfonts' trailer and a ring beneath it that had gone missing from Banks' finger. Soon afterward, Desmond was reported missing. His colleague Dale Cooper visited town to search for clues to Desmond's whereabouts, but was unsuccessful.\nEstablishments\nCross River Cafe\nDeer Meadow Sheriff's Department\nFat Trout Trailer Park\nHap's Diner\nNotable residents\nTeresa Banks (January – February 9, 1988)\nCable\nCurious woman\nForeign girl\nGiggling secretary\nCliff Howard (1988)\nIrene\nJack\nMargaret\nMillie\nOld man\nCarl Rodd (1980s)\nSam\nBehind the scenes\nThe establishing shot of the mountain was captured in Olallie State Park just outside of North Bend, Washington.The driving scenes were shot on SE Homestead Valley Road outside of the North Bend area.\nSome commentaries have observed that Deer Meadow and many of its inhabitants can be interpreted as direct counterparts to Twin Peaks and its residents; for instance, Teresa Banks as a counterpart to Laura Palmer, Sheriff Cable as a counterpart to Harry S. Truman, and so on."}