{"name": "Denise_Bryson", "url": "https://twinpeaks.fandom.com/wiki/Denise_Bryson", "text": "Denise Bryson\n\"Coop... I may wear a dress, but I still put my panties on one leg at a time, if you know what I mean.\"\nDenise Bryson was a former Drug Enforcement Administration Special Agent who investigated drug allegations against Dale Cooper. She later became the Federal Bureau of Investigation Chief of Staff.\nBryson began wearing feminine-coded clothing during an undercover operation and found that presenting as a woman made her feel comfortable, realising in the process that she was a transgender woman.\nBiography\n\nEarly career\nBryson worked undercover at the DEA on orders of Gordon Cole. Cole knew of many sexual affairs of Bryson at the time.\nIn the summer of 1987, Agent Bryson worked with FBI Special Agent Dale Cooper on a sting operation in Tijuana. However, things went sour when Bryson's cover was blown and they were taken as a hostage. Cooper managed to rescue Bryson, and the newspapers stated the incident to have been caused by an argument over the Book of Job.\nBryson and Cooper worked with each other again in Oakland.\nIn 1988, Bryson worked undercover at the DEA on an operation concerning a drug dealer who would only sell to transvestites. Thus, Bryson played the part of the buyer and dressed in feminine-coded clothes, discovering that it was relaxing, then subsequently began going by Denise.\nCole was very vocal with Bryson's colleagues and expected that they accept her change.\nCooper's Suspension from the FBI\nIn March, 1989, Bryson arrived in Twin Peaks, telling the Agent Cooper that she now preferred to be called Denise. She was then introduced to Sheriff Harry S. Truman and Deputy Hawk. She then explained to Cooper that the accusations of him being involved in the drug operation stemmed from an RCMP officer named Preston King. She left to get to work on the case.\nShe later attended the wedding reception for Dougie Milford and his new bride Lana Milford and invited Cooper to the bar to tell him that traces of cocaine were found in his car and guessed it would match drugs stolen from King and supposed that Cooper had been framed. Cooper also asked about her identity as a woman and she explained to him how this came to be.\nDenise went to Cooper's room and was introduced to Audrey Horne, who expressed her surprise that the DEA would have female agents, to which Denise replied, \"more or less.\" Audrey gave Dale a big kiss and left. He showed Denise photos of Hank Jennings, Ernie Niles, Preston King, and Jean Renault in the middle of a drug deal.\nShe went to the Double R Diner, where she presented to Ernie Niles a photograph of the drug deal.\nDenise and Cooper interrogated him, and he confessed his guilt. She told him of a sting operation, during which she would pose as a buyer from Seattle.\nDenise tried to urge Ernie into calling Jean Renault to set the buy, which he was nervous to do so. Cooper came in and when Denise called Ernie \"gun-shy,\" he made the call.\n \nAs the sheriff's department prepared for the buy, Denise entered Sheriff Truman's office as Dennis, finding it more appropriate to act as a male during the buy.\nDuring the buy, their cover was blown when Ernie's sweat caused his microphone to malfunction and begin to bellow smoke. They were held at gunpoint until Cooper offered himself in exchange for Denise and Ernie.\nLater, she approached the farm, dressed as a waitress. She gained entry and pulled up her skirt to reveal a gun to Cooper, who took it to shoot Renault as she subdued Officer King.\nFBI Chief of Staff\nBy 2016, Denise had become the FBI Chief of Staff, with Bill Kennedy as her secretary. She was informed by Deputy Director Gordon Cole that Cooper had been found in a South Dakota federal prison after being reported missing for 25 years. After Cole cleared up Bryson's doubt about him bringing Agent Tammy Preston, she voiced her support for this operation.\nBehind the scenes\nDenise is played by David Duchovny, best known for his role as FBI Special Agent Fox Mulder in The X-Files. According to Duchovny, the role was originally written with James Spader in mind.\nDuchovny reprised the role in the 2017 revival.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}