{"name": "Diane_Evans_(tulpa)", "url": "https://twinpeaks.fandom.com/wiki/Diane_Evans_(tulpa)", "text": "Diane Evans (tulpa)\nA tulpa of Diane Evans, former secretary to FBI Special Agent Dale Cooper, was manufactured by Cooper's doppelganger in the early 1990s.\nBiography\n\nCreation\nThree to four years after Dale Cooper's stay in Twin Peaks and disappearance, he apparently showed up at the real Diane Evans' home in Philadelphia, and questioned Diane about FBI activities since he had been gone. They kissed, but Diane, initially happy to see him, immediately sensed he was not himself. The doppelganger, sensing her fear, then raped her, after which she was taken to a \"gas station.\" An exact duplicate of Diane was created, which assumed her identity.\nThis Diane, bearing all of the real Diane's memories, later retired from the FBI and developed a bitter, hostile persona. During her remaining tenure, she was suspected to have altered or omitted certain transcripts of Cooper's tape recordings during Caroline Earle's abduction and eventual murder by her husband.\nPresumably referring to the relevant chapters of The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes.\n2010s\nAs of September 2016, Diane frequented Max Von's Bar in Philadelphia most nights and had a regular stream of male suitors. One evening, Albert Rosenfield found her at her usual haunt. She bluntly refused to assist him in a case that involved Cooper, but reluctantly agreed when Deputy Director Gordon Cole accompanied him to her home the next morning.\nShe went with them and Agent Tammy Preston to South Dakota, where she briefly met with Cooper, with whom she recalled a night they both clearly remembered. Shaken by the meeting with Cooper, she told Cole that this was not the Cooper she knew, for he lacked the heart that she knew Dale had.\nOn the way back to Philadelphia, Cole had the plane re-routed to Buckhorn, South Dakota to investigate the body of Major Garland Briggs, an associate of Cooper from his time in Twin Peaks. Upon arrival at the police station, Diane decided to stay in the lobby, where she read a text that read, \"AROUND THE DINNER TABLE, THE CONVERSATION IS LIVELY.\" Albert told Cole that Diane sent the following heavily encrypted message in response: \"They have Hastings. He is going to take them to the site.\"\nDiane and the FBI were later led to where William Hastings claimed to have entered an alternate dimension he referred to as \"the zone.\" As Albert and Gordon investigated, Diane spotted bearded men, particularly one that exited Detective Dave Macklay's car after Hastings' head suddenly exploded. Diane brought this up to the group later, but was not entirely sure of what she saw. She also studied a photo Albert took of Ruth Davenport's arm, which contained a set of coordinates written on it.\nDiane was soon brought into the investigation in an official capacity. At the bar, she responded to the text \"Las Vegas?\" with \"THEY HAVEN'T ASKED YET.\" Later, she searched the coordinates from the photo of Ruth's arm, finding that they led to Twin Peaks.\nDiane was later asked by Cole, Preston, and Albert if Cooper had mentioned Major Garland Briggs during their last meeting. Albert explained Briggs' relation to Cooper's work and Diane claimed to recognize the inscription on a ring found in Briggs' stomach, telling them it belonged to her half-sister Janey-E's husband, Dougie.\nShe later sat at the hotel bar and received an unnerving text that read: \": - ) ALL.\" She then \"remembered,\" responding with \"48551420117163956,\" hoping it would work. She checked her handbag, which held a revolver, then left the bar.\nShe went to Gordon, Tammy, and Albert and revealed to them the events of the night she saw Cooper some years before. After telling them that she was taken to the \"gas station,\" she recalled the text she previously received and said, \"I'm in the sheriff's station,\" and that she sent him the coordinates. Becoming upset, she said \"I'm not me,\" and drew her revolver. Tammy and Albert drew their guns and shot her.\n \nDiane then appeared in a red room, where Mike told her she was manufactured, which she already knew. She stated her last words, \"fuck you,\" and disintegrated.\nBehind the scenes\nDiane's duplicate appeared in the 2017 revival, played by Laura Dern, who has appeared in several David Lynch projects, including his films Blue Velvet, Wild at Heart, and Inland Empire.\nAll of Diane's appearances were designed by David Lynch and Laura Dern alone."}