{"name": "Diane_Evans", "url": "https://twinpeaks.fandom.com/wiki/Diane_Evans", "text": "Diane Evans\nFor the impostor, see Diane Evans (tulpa).\n\"I have been assigned a secretary. Her name is Diane. She seems an interesting cross between a saint and a cabaret singer.\"\n ―Dale Cooper\nDiane Evans was an FBI employee who served for over a decade as Special Agent Dale Cooper's secretary and confidante. While on cases, Cooper routinely dictated and mailed cassette tapes for Diane, both to request special items or information and as a record of his findings.\nBiography\n\nCareer\nDiane was assigned as Cooper's secretary on his first day working for the Pittsburgh FBI field office, December 19, 1977. He described her as an \"interesting cross between a saint and a cabaret singer,\" and addressed most of his tapes to her from that moment on, even ones where he appeared to be talking to himself.\nDiane sent Cooper a bouquet of flowers shortly after Cooper first took a life while responding to a bank robbery at Eastern Savings and Loan.\nIn the mid-1980s, Cooper and Diane were reassigned to the San Francisco field office. During the manhunt for a serial killer of local male prostitutes, Diane, on Cooper's orders, compiled reports on similar murders around the country to plot the killer's travel history.\n \nOne day in early 1988, Cooper stood outside of Diane's office and mentioned that she had not changed her hair and was wearing a dress she had worn before, but he noticed that she had indeed changed something in the room. He took a moment to figure it out and excitedly noted that she moved a clock twelve inches to the left. Before leaving, he requested a \"damn great pot of coffee\" made from Sally's ground coffee.\nDiane joined Cooper for a Chinese food dinner on June 10, 1988, and he noted the next day that despite having known her for over ten years, he did not know her last name.\n\"Special Agent Cooper . . . Dale and I had dinner once. We ate Chinese. We had wonton soup, egg rolls, and Peking duck. That's the one where they inflate the bird with air, swelling it to over double its original size. Without a doubt the most delicious skin I've ever eaten, firm and at the same time delicate. And the meat itself takes on a flavor when slid into the mouth. . . . Well, I couldn't get enough of it.\"\n ―Diane\nDuring Cooper's investigation in Twin Peaks of the murder of Laura Palmer, Diane fulfilled Cooper's requests for a pair of earplugs and back issues of Flesh World.\nWhile filming scenes for \"Part 17,\" David Lynch suggested to Laura Dern and Kyle MacLachlan that Dale and Diane had once had a secret romantic relationship, known to Gordon Cole but not Albert Rosenfield.\nDisappearance\nSoon after the Laura Palmer case was resolved, Cooper disappeared. Three to four years later, his doppelganger showed up at Diane's home in Philadelphia, and questioned Diane about FBI activities since he had been gone. They kissed, but Diane, initially happy to see him, immediately sensed he was not himself. The doppelganger, sensing her fear, then raped her, after which she was taken to a \"gas station.\" An exact duplicate of Diane was created, which assumed her identity.\nReturn\nAfter BOB and the doppelganger were defeated at the Twin Peaks Sheriff's Department, Cooper linked hands with the eyeless woman he had met on the purple sea. Her face opened onto the red room and a fleshy mass containing Diane's face appeared in its place. The real Diane, who now had bright red hair and black-and-white nail polish, appeared in Naido's place, wearing the bathrobe Lucy Brennan had given her. Cooper kissed her, and she said that she remembered everything. She then looked past him at the clock on the wall, which was stuck on 2:53. Cooper told all those assembled that he hoped to see them all again, just before the room fell into shadow.\nCooper, Diane, and Gordon Cole walked through the basement of the Great Northern Hotel towards a locked door, from which a ringing tone was issuing. Cooper unlocked it with his old key to room 315 and said he needed to continue alone. He promised Diane and Gordon that he would see them at the curtain call, and stepped through.\nCooper exited the curtained opening at Glastonbury Grove and found Diane waiting for him. She asked if it was truly him, and he asked the same, kissing her once again.\nCrossing\nCooper was now determined to cross to fulfill a personal mission, and Diane accompanied him. They drove 430 miles down a road into the desert to a spot near some power lines, where Cooper determined that they had come to the right place. He kissed her one last time, saying that after they went through everything could be different. Cooper drove forward and their surroundings began shifting rapidly. Suddenly, they were silently driving at high speed down a road in the middle of the night.\nStill silent, Cooper stopped at a motel and bought a room for the two of them. Meanwhile, Diane, sitting in the car, saw what appeared to be her twin step out from behind a pillar, staring at her. The other Diane disappeared as Dale returned with their room key. Inside, Cooper sternly directed her to turn off the lights and come over next to him. They had sex, mechanically, while Diane grew distressed, alternately looking away from Dale's face and covering it with her hands.\nThe next morning, Diane was gone. Cooper found a letter from Linda, addressed to Richard, which read:\n\"Dear Richard, when you read this, I'll be gone. Please don't try to find me. I don't recognize you anymore. Whatever it was we had together is over.\"\n \nBehind the scenes\n \nDuring the first season, it was reported by several outlets that Carol Lynley had been cast as Diane. Mark Frost stated in 2014 that this report was false.\nDiane appeared in the 2017 revival, played by Laura Dern, who has appeared in several David Lynch projects, including his films Blue Velvet, Wild at Heart, and Inland Empire. In his MasterClass, Lynch compared Dern's portrayal of Diane to an older version of Sandy Williams, her character from Blue Velvet.\nDiane's designs were made entirely by David Lynch and Laura Dern."}