{"name": "Dick_Tremayne", "url": "https://twinpeaks.fandom.com/wiki/Dick_Tremayne", "text": "Dick Tremayne\nRichard \"Dick\" Tremayne was an employee at Horne's Department Store who briefly dated Lucy Moran in 1989, possibly resulting in her pregnancy.\nBiography\nTremayne was born in Twin Peaks, delivered by Doctor Will Hayward.\nHe attended Eton College in England.\nBy February 1989, Dick began seeing Lucy Moran while she and Andy Brennan were on a break.\nIn early March, Dick went to the sheriff's station to pick up Lucy, as they had planned a lunch date. Deputy Hawk broke Dick's cigarette and refused to acknowledge his introduction, then Dick and Lucy went to lunch at the Double R Diner.\nAt the diner, Dick talked a lot about his work at the department store and the way he used his fork. She then asked him why he had not called her in weeks and he made the excuse that he lost her number. He explained a way he could make it up to her before she suggested a maternity dress, for she was pregnant.\nThe next day, he went to the sheriff's station to speak with Lucy, saying that he had been miserable thinking about his own behavior. He gave her $650 for an abortion, which upset her. She kicked him out of the station with his money and wished to never speak to him again.\nSeveral days later, he went back to the sheriff's station and was taken by Lucy to a room with Andy, also possibly the father of her child. She told them that she wanted full cooperation with both of them throughout her pregnancy.\nHe announced to Lucy the next day that he has quit smoking and was completely open to the idea of fatherhood. Andy came and said that they should not fight and Dick shook hands with him.\nThe next day, Dick returned to the sheriff's station with Nicky Needleman, an orphan who he had temporarily adopted from the Happy Helping Hand program. He wished to take Lucy for a malted with him and Nicky, but Andy told him that she was at the Great Northern Hotel helping prepare for the wedding of Dougie Milford and Lana Budding. Instead, Andy offered to go with them.\n \nThey went to the diner, where Dick and Andy ordered pie and Nicky got the malted he was promised. However, Nicky blew whipped cream off of the top into Dick's face. When Andy stood to get a napkin for Dick, Nicky spun his stool, causing him to fall when he sat back down, much to Dick's amusement.\nHe entered the sheriff's station the following day and was introduced to Judy Swain, Nicky's case manager from the Happy Helping Hands organization. She told Dick and Andy that Nicky may perhaps carry trauma by various events in his life such as the death of his parents under mysterious circumstances.\nAs Dick tried to figure out what was wrong with one of the wheels on his car, Nicky tampered with the car, disturbing Dick's work. After Nicky turned on the windshield sprayers, Dick told him to get out of the car. After Nicky walked away, the wheel fell off the car, frightening him.\nDick returned to the sheriff's station to speak with Andy, telling him that Nicky was the devil and may have killed his parents. He then spotted Lana Milford and was taken by her charms enough to quote Romeo and Juliet.\nDick met Andy at the station the next morning, the latter being late due to getting a cat out of a tree. Dick revealed to him that Nicky's records were sealed, but he had a plan to retrieve them.\nThey broke into the Happy Helping Hand's files and Dick found the one belonging to Nicky. A couple identifying themselves as the Brunstons came in, eager to see a little boy named Donnie.\nDoctor Hayward forced he and Andy together the next day for a meeting to dismiss their accusations about Nicky murdering his parents. Hayward told them that Nicky was conceived by a rape, his mother died in childbirth, and his adoptive parents were killed in a car accident.\nA few days later, Dick admired two women at the Great Northern until Audrey Horne approaches him, concerned about Tim Pinkle's presentation about the endangered pine weasel for the Stop Ghostwood campaign to take place that evening.\nAt the campaign meeting, Dick hosted the fashion show, in which Lucy and Andy were models. After the fashion show, he called out Pinkle, who introduced the audience to the pine weasel. Pinkle convinced Dick to give the weasel a kiss and it bit his nose. The weasel became loose and caused a panic among the crowd.\nWith his nose bandaged, Dick approached Benjamin Horne a couple of days later, concerned about the upcoming wine-tasting event he was hosting, as Audrey was not present. Horne told him to get the concierge's help. He later hosted the wine-tasting event, where he displayed his expertise on fine wine.\nTwo days later, alongside fellow judges of the Miss Twin Peaks Contest, Norma Jennings and Mayor Dwayne Milford, he observed Pinkle teach choreography to the contestants. Norma turned away his attention to ask what qualities they should be looking for in Miss Twin Peaks and he suggested poise, sophistication, and breeding. Norma left and when the contestants took a break, Lana approached him, requesting to help her \"find something in the storage room.\"\nAfter the speeches at the contest, Lucy pulled Dick and Andy aside to announce to them that she had chosen Andy to be the father of her baby. He congratulated Andy and went to cast his vote for the winner. He voted for Annie Blackburn, having been moved by her speech. She won and chaos ensued.\nIn a Q&A, Mark Frost indicated that Tremayne was a real estate salesman in Bellingham, Washington as of the 2010s, adding: \"He once tried to get in touch with Wally Brando . Wally ignored him.\"\nBehind the scenes\nDick was played by Ian Buchanan, who later starred as Lester Guy in Mark Frost and David Lynch's short-lived television series On the Air, alongside Miguel Ferrer and David L. Lander.\nAt one point, Buchanan was considered to reprise his role in The Return, but plans changed for unknown reasons; possibly because of his unavailability.\nTrivia\nIn Twin Peaks: Access Guide to the Town, one of the players on the 1968 Twin Peaks High School football team is identified as David Tremayne. It is unknown if he is related to Dick."}