{"name": "Donna_Hayward", "url": "https://twinpeaks.fandom.com/wiki/Donna_Hayward", "text": "Donna Hayward\nDonna Marie Hayward was the best friend of Laura Palmer, and after her death she was obsessed with finding out who killed her and why, employing the help of James Hurley and Maddy Ferguson.\nBiography\n\nEarly life\nDonna was born on September 2, 1971 to Doctor Will Hayward and his wife, Eileen. Her birth was guided by Dr. R. Robinson. However, no father was listed on the birth certificate.\nWhen she and Laura were in their early teens, they went skinny dipping with several older Canadian boys, who introduced them to marijuana. One of the boys was named Tim, and Donna later said that this was the first time she ever fell in love.\nIn 1986, Donna began dating Mike Nelson, and during the following months, her friendship with Laura began to deteriorate. However, they eventually reconciled somewhat, though there existed strain from Donna's worry for Laura due to her wild lifestyle that consisted of cocaine and promiscuity.\nLaura's final days\n \nDonna went on a picnic on February 12, 1989, with Laura and Laura's secret boyfriend, James Hurley, who filmed them.\nDonna left her home one morning later in the month to walk to school with Laura. They passed by their boyfriends on the way, the boys declaring Mike to be \"the man.\"\nWhen they reached school, Laura was pulled aside by James, and on their way to class, she excused herself to the bathroom as Donna went on ahead.\n \nAs they left school in the afternoon, Bobby stopped Donna and Laura, wondering where the latter was for the previous hour. However, she avoided the question, as she was seeing James. Despite his anger, Laura managed to brighten his mood and she left with Donna.\nThey went to Donna's home, where they discussed James and Bobby, the former being \"the one.\"\nThe next day, Laura came to her home, clearly distressed, and asked Donna if she was her best friend and Donna comforted her.\nDonna told Laura that she was afraid that she did not always want to be around her because of her being uptight, but wished she was not. They went inside and Donna got her opinion on whether she should sleep with Mike, but Laura doubted whether she actually had feelings for Mike. Donna called to her mother, asking for a muffin. Her father then came in, trying to perform a magic trick. Her mother then brought out huckleberry muffins for the girls. Doctor Hayward found a \"secret message for Laura,\" which he read to her. Laura's father then called and Donna walked her out of the house.\nThe next night, Donna went to Laura's house, who was ready to go out, but not with Donna. Nevertheless, Donna followed her to the Roadhouse, where two men were sitting with Laura, interested in her prostitution services. The men asked if Donna was \"part of the deal,\" and she kissed one of them, guaranteeing her involvement, despite Laura's initial protests.\nDonna and Laura traveled with the men up to Canada. She was offered cocaine when they arrive, but she refused it.\nThe group went up to Canada. where they met Jacques Renault at the Power and the Glory. She danced with one of the men, watching Laura with the other, who called himself \"Buck.\" Donna became disoriented and picked up Laura's shirt, tying it around her waist, then continued dancing with the man, kissing him. Laura eventually saw them and charges at her, apparently upset about her wearing Laura's shirt.\nThe next morning, Laura and Donna were at the latter's home, Donna questioning why Laura lived the way she did. Laura's father then came to pick up Laura for breakfast.\nLaura's murder\n \nOn the morning of February 24, 1989, Donna walked to her locker at school, amused at Audrey Horne changing into a pair of heels and smoking a few lockers away. James came to her and asked if she had seen Laura yet that day, to which she said no, and he commented that it was a nice day for a picnic. She then went to class and saw a deputy show up during roll call, asking for Bobby. She then observed a girl outside the classroom window, screaming. She looked at Laura's empty desk, then at James, becoming worried. Suspecting the worst, she said Laura's name and began crying.\nShe was surrounded by friends for comfort as the principal made an announcement to the school about Laura's death. She cried as the announcement ended and she looked over to James.\nLater, Donna went to James' uncle, \"Big\" Ed Hurley's gas station and went to him. He pulled her into a hug and comforted her. She asked if he had seen James and Ed gave her a message he had left for her, saying to meet him at the Roadhouse after 9:30. Just then, her boyfriend, arrived and angrily asked where she had been, saying she should be with him, supporting Bobby. Ed came to her defense and Mike commanded her to go to the sheriff's station, then left. Ed's wife, Nadine then yelled at him to hang her drapes and Donna left.\nShe was brought in for questioning before Sheriff Harry S. Truman and FBI Special Agent Dale Cooper, where she was asked about the picnic with Laura that was filmed by James, but she insisted that it was recorded by a female hiker, despite Cooper revealing that he knew Laura had a secret boyfriend. He then let her go.\nIn the evening, Donna overheard her parents talking about the events that occurred over the course of the day, including the discovery of Laura's necklace, which was not a detail that had been released to the public. She learned that the authorities believe the killer may have been in possession of the other half of the heart, and she knew that James had it. She snuck into her sister, Harriet's bedroom and told her that she would be leaving through the window, despite a curfew put into effect, and wanted Harriet to cover for her. She then left to go meet James, borrowing Harriet's bike.\nShe arrived at the Roadhouse, where Mike waited for her with Bobby, the former angrily grabbed her, though Ed and other bar patrons intervened and Joey Paulson escorted her out of the Roadhouse. Joey took her to James in the woods.\n \nDonna told him that the authorities were looking for him, but he said that he would be cooperative, despite his belief that they would lock him up because he was with Laura the previous night. James also described Laura the previous night, saying she was a completely different person and that it made sense for her to have been killed. When he began expressing guilt, the two kissed and heard sirens. They buried the necklace and they drove off but were stopped by the sheriff and Agent Cooper and were taken to the sheriff's station.\nShe was released to her father, though Truman asked for her to be back in the morning for questioning. Her father took her home after a short talk.\nDonna went downstairs the next morning to her living room, where her mother was, asking why she was not taken back to the sheriff's station for questioning that morning but was told that the authorities postponed her questioning to the next day and that she had cried in her sleep overnight. She also revealed her current feelings, including her budding romance with James.\nShe went to the Palmer home, told by Leland to try to not upset his wife. She sat down next to Mrs. Palmer and held her hand, but she then thought Donna was Laura and hugged her before screaming and Leland came back to console her.\nBack at home, the doorbell rang. It was James, who had come to have dinner with her family.\nAfter dinner, she sat with James as her parents went to bed. James told her that he believed their relationship was not wrong and would have happened even if Laura had not died.\nFor lunch the next day after church, she went to the Double R Diner with her family and they saw Audrey Horne come in. Donna went to speak to her and they talked about Laura as well as Audrey's apparent crush on Agent Cooper.\n \nThe following day, Donna attended Laura's funeral.\nDonna sat at the Palmer home the next morning as Sarah Palmer described to Deputy Andy Brennan a man she saw in a vision. When Leland came in, he mentioned another vision Sarah claimed to have, in which a gloved hand picked up James' half of the necklace.\nShe did her makeup at school later when Audrey came in and told her the secrets Laura had, including that she had been seeing Doctor Lawrence Jacoby, which had not been known to Donna. Audrey also supposed that Laura had worked at the brothel, One Eyed Jacks.\nAt home, Donna received a call from James and she said they needed to talk about Laura.\nThat night, she went with James to the woods to find the half of Laura's necklace they buried but did not find it.\nShe met with James at the gazebo in the park the next day, after he had left her a note. He revealed to her that his father was still alive and had abandoned he and his mother, who was an alcoholic.\nDonna went to the diner with him, where she met Laura's nearly identical cousin, Maddy Ferguson. She swore Maddy to the secrecy of their investigation into Laura's murder and said they had heard of Laura having a hiding place in her home and wished for Maddy to find it. They then left the diner together.\nLater that night, she received a call from Maddy, who told her she has found a tape in Laura's hiding place.\nDonna listened to the tape found by Maddy. It had been made for Doctor Jacoby and in it, Laura expressed the ease of recording the tape and mentioned a coconut in relation to secrets. They found that a tape recorded the night Laura died was now missing and James supposed that Jacoby must have still had it. He then suggested they go to Jacoby's office to look for the tape, and they could lure him out with a \"phone call from Laura.\"\nAt night, she met James and Maddy in the park, the latter wearing a blonde wig to make her look exactly like Laura.\nShe stood by as James called Jacoby and handed over the phone to Maddy, who lured Jacoby by speaking as Laura. She and James went on their way to the office, leaving Maddy in the park.\nAfter watching Jacoby leave, they infiltrated his office.\nIn the office, Donna found a coconut, remembering Laura's tape. Inside she found the missing tape and half of Laura's necklace. She then left with James on his motorcycle.\nThey went back to Donna's house, where they listened to the tape, in which Laura noted James to be sweet, but dumb, and mentioned a \"mystery man\" who drove a red corvette. James then said that Jacoby did not kill Laura and that he had been trying to help her, but Donna questioned how he came into possession of the necklace.\nShe went to the Double R Diner the next day and met with Maddy, who gave her a pair of Laura's sunglasses. Maddy broke her own pair of glasses as Donna lit a cigarette. Maddy asked about James being arrested and if they were responsible for a heart attack suffered by Doctor Jacoby. Maddy then informed her that Leland's hair had turned white, just before Norma delivered a note saying 'LOOK INTO THE MEALS ON WHEELS.'\nShe went to the sheriff's station to see James and asked what he told them and. He said he did not give up her or Maddy.\nShe called Norma about the Meals on Wheels, offering to pick up Laura's route. She then joined her family and the Palmers to watch her sisters, Gersten and Harriet play piano and read a poem about Laura, respectively. Donna told Maddy about the Meals on Wheels and that she was to start the next day.\nStarting on the route, Donna went to the home of an elderly woman named Mrs. Tremond, whose grandson sat in a chair in the bedroom. The old woman complained about the creamed corn, which soon disappeared from her plate and into the hands of her grandson, who had apparently performed a magic trick. Mrs. Tremond told her about the neighbor, Mr. Smith and that he was friends with Laura. Donna went next door to Smith's house, but he did not answer, so she left him a note.\n \nDonna later sat in her living room with Maddy, singing \"Just You\" along with Maddy and James, the latter also playing guitar. During the song, she stared longingly at him and noticed that Maddy did the same and seemed to receive all of James' attention. This upset Donna and she ran out of the room. She was pursued by James and she insisted there is nothing wrong and she kissed him.\nHer father then called down saying there was a phone call for her from Harold Smith, Mrs. Tremond's neighbor. She answered the phone and they arranged to meet the next day. Maddy screamed and Donna went with James to her aid.\nThe next morning, she went to Harold's home and they discussed Laura briefly. As Harold went to get a flower from his greenhouse for Laura's grave, Donna found an envelope, but could not see what it was before he came back in.\nDonna went to the Double R Diner, where she saw Maddy with her hand on James' hand. This angered her and she told James about Harold, who she saw as much better than he. She then stormed out of the diner.\nShe went to Laura's grave with Harold's flower and expressed her feelings about what had occurred since her death and was upset with her for dying.\nShe went to the Palmer home, where she caught Maddy and James in an embrace, then left.\nShe went back to Harold to talk to him about her situation with James. She looked at a flower as Harold got her something to drink, but also discovered Laura's diary.\nDonna went to the diner the next day and told Hank that she had plans to have lunch with Harold. She took her Meals on Wheels delivery and left for Harold's house. There, they drank to Laura's memory and he shared some of Laura's diary with her. She suggested he turn it in to the authorities, but he saw no reason to, as Laura had given it to him and it contained no solutions.\nShe later met Maddy at the diner to discuss what was going on between them and James. She quickly changed the subject to Laura's diary in Harold's possession.\nDonna brings lunch to Harold the following day and offered to tell her life story to him in exchange for reading Laura's diary, but he said he would read it to her and that it could not leave the room. He retrieved a notebook from a secret compartment of his shelf and she began telling him about her life, but soon made the conversation about him instead, distracting him. She snatched the diary and backed up out the door. Harold stepped outside and collapsed, prompting her to apologize and return the diary.\nShe and Maddy later planned to retrieve the diary from Harold.\nShe met with Harold again to put the plan in motion that evening. She told him about an experience with Laura when she was 13 or 14 where young men took them to the woods and they went skinny-dipping. She said that this event was the first time she fell in love, this having been with one of the boys who was named Tim.\nHarold showed her his flowers and they kissed. Harold excused himself and from the greenhouse, Donna signaled Maddy inside and to where she could find the diary. She was startled when Harold returned. She tried to distract him while Maddy searched for the diary, but she was caught. Upset, Harold cornered them.\nHarold expressed his utmost disappointment in Donna for betraying his trust. He tried to take the diary, but James burst in to save the girls, and Harold managed to grab the diary back.\nShe went to meet with Sheriff Truman, who was skeptical of her claim that Harold had a diary by Laura, as they had previously found one at the Palmer home. He suspected that the teenagers were getting into trouble again, but said he would try to send someone to Smith's home. A loud man, FBI Regional Bureau Chief Gordon Cole interrupted them and, much to Donna's annoyance, he and Truman spoke privately, leaving her to wait on the sheriff. However, she was soon forgotten about.\nShe met with James at the Roadhouse the next night, where they discussed Harold's apparent suicide and her guilt over it. James also told her that Maddy would be leaving. She then lip-synced with the singer, who performed \"Rockin' Back Inside My Heart.\" Donna was then overcome with emotion during the next song, \"The World Spins.\"\nDonna went to the Palmer home with James the next day to say goodbye to Maddy, but Leland told them he had dropped her off at the bus station 20 minutes prior. They then left after observing that the living room was strewn with golf balls.\nDonna sat with James the following day and he gave her a ring, wishing to be with her all the time. She approved and they shared a kiss.\nThey went to the diner, where she heard Deputy Andy saying, \"J'ai une âme solitaire,\" and she questioned him about Mrs. Tremond, as her grandson had spoken these words, but he said this was actually Harold Smith's suicide note and that it meant, \"I am a lonely soul.\" She hurriedly went to get Agent Cooper.\nShe told Cooper about Mrs. Tremond and they went to her house, but a different, middle-aged Mrs. Tremond answered the door, claiming to know nothing of the older woman. This Mrs. Tremond then delivered an envelope to Donna from Harold, containing a page from Laura's diary, where she described a dream of being in a red room with a little man and an old man. It also said that \"BOB\" must be stopped and that she knew she would die the following night.\nShe went to the Palmer home to deliver a tape for Maddy of the song they recorded with James. She gave it to Leland and asked him about Laura's secret diary, which he was unaware of. He then received a call from Maddy's mother and Donna fearfully listened to him speak on the phone, as Maddy apparently did not return home. He told her she had nothing to worry about.\nLeland then brought Donna some lemonade and put on a record after assuring her that Maddy was okay. He offered for them to dance and she accepted. He soon violently pulled her to him, letting her go when the doorbell rang. Leland let in Sheriff Truman, who said there had been another murder.\nMaking the connection to Maddy's absence, she met James by the lake. She informed him that Maddy was dead and he says they could have helped her and left without Donna whilst upset.\nJames' departure and mystery of parentage\nAfter Leland died in custody after being arrested for Laura and Maddy's murders, Donna attends the reception following his funeral. She confided in Ed about James believing the chaos in the town to be caused by him.\nNadine Hurley—believing herself to be a teenager following a suicide attempt—approached Donna at her locker the next day and Donna asked if she had seen James, to which she denied. Nadine then asked Donna if she was still dating Mike and became excited when she said she was not.\nThe next day, Donna was approached by Mike, who had lost a wrestling match to Nadine and asked her to pretend they were still dating to end Nadine's wishes to go out with him.\nShe went to Ed's house the next day, still looking for James. He told her that he requested money be delivered to a specific bar and Donna offered to deliver it to him.\nDonna went to Wallies Hideout, the bar James requested his money be delivered to. There, she met a woman who told her that James possibly went to Mexico and told Donna to go home.\nIn the evening, she went to the woman's home, from which James left. He finds Donna and they left together.\nShe goes back to Wallies Hideout with James, who said he was being framed for the murder of the woman's husband, Jeffrey Marsh. James insisted that he go back and talk to the woman—Evelyn—as he believed she would tell the truth to the police. Donna called Ed and filled him in on the details as a deputy named Frank entered the bar.\nLater, she returned to the bar where she met Evelyn again. She resisted telling Donna the reasoning she had helped frame James, and a man came to get Evelyn. Donna tried to follow, but the man threatened to kill her. As the man left with Evelyn, Donna pleaded on James' behalf.\nShe went back to the Marsh house, where she saw the man try to convince Evelyn to leave her fingerprints on his gun so he could then kill James, who was at their feet, unconscious. She then burst into the house and pleaded for his life. Malcolm commanded Evelyn to give him the gun, but she shot him instead.\nDonna and James had a picnic the next day, where she said that she knew about his relationship with Evelyn, but forgave him as she knew how he felt. She asked him to come home to Twin Peaks with her, but he refused, feeling it was not right. She understood and wished him luck on his travels.\nShe went to the Roadhouse after receiving a note requesting her to be there, along with a torn piece of paper. There, she met Shelly Johnson, who had a similar message and an adjoining paper. Audrey Horne also arrived, who had the last piece of the torn poem.\nDonna answered the door of her home the next day, where a colleague of her father's, Gerald Craig, had arrived for a visit on his way to a convention in Spokane. She invited him in and he reminisced about his friendship with her father and his time in high school. He gave her a gift for her father and left.\nDonna's parents later arrived home with groceries and she told them about Craig's visit. However, her father said that this was impossible, as Craig had drowned many years before. Donna gave them the gift left by \"Craig\" and her mother called the phone number he left, which was actually for a cemetery. Her father opened the gift, finding a knight chess piece with a chess move.\nLater, the doorbell rang at her home and she went to answer but saw that her mother had reached the door first. She watched Benjamin Horne step into the house and whisper to her mother.\nThe next morning, Donna followed her mother to the Great Northern Hotel, seeing that she had gone to meet with Ben Horne. She went to the reception desk and asked to see Audrey, also seeing Mike with Nadine, checking out of the hotel, arm in arm. Audrey came and Donna asked if she knew why her mother and Audrey's father were visiting one another. Audrey did not know, so she showed Donna to a hole in the wall of Ben's office, where the girls spied on her mother and Horne.\nLater, she received a San Francisco postcard from James, who later planned to go to Mexico. Her father assured her that James would be back. Donna then asked him if he knew how her mother knows Horne, to which he responded that she probably did not. She then told him about Ben's visit to their home and her mother's to the hotel, but he dismissed both as charity meetings. Donna then went to answer the door, which was a delivery flowers for her mother.\nThe following day, she went to the Roadhouse to try out for the Miss Twin Peaks Contest.\nAt dinner, she asked her mother how she knew Ben Horne. Her father then brought up his excuse, which she agreed with. However, Donna did not believe them due to the flowers sent to her.\nThe next day, in the attic of her home, Donna found her birth certificate, discovering that it did not list a father. Her mother then called up to her, as Deputy Hawk had called for her.\nShe was called to the sheriff's station, where Cooper went over the poem Donna, Shelly, and Audrey received. Donna told him about the visit from \"Gerald Craig.\" Shelly then pointed out that the poem was in her husband Leo's handwriting and Cooper advised the girls to check in with the Sheriff's Department twice a day.\nDonna went to her living room the next day, dressed up for Miss Twin Peaks. Her mother asked to hear her speech, but she instead wanted to know the truth about her involvement with Benjamin Horne. Her parents did not budge on the subject, so she left.\nDuring a musical interlude at the contest, she saw Ben Horne and approached him for an explanation, but he said it was neither the time or the place. He began to talk to her and she realized that he may indeed be her father, so she ran away with tears in her eyes.\nAfter Annie Blackburn won the title of Miss Twin Peaks, chaos ensued.\nShe packed her bags the next day and came down the stairs of her home, ready to leave. Ben was present, imploring her to stay, saying the situation was his fault and that he was now trying to make it right. Donna's father then came, angered by Ben's presence. Sylvia Horne then arrived, upset with Ben, and Donna hugged Doctor Hayward, crying and declaring him to be her father. Will then punched Ben, causing him to slam his head into the fireplace.\nLater life\nDonna graduated from high school with honors and moved to New York City after turning eighteen, cutting herself off from everyone in Twin Peaks, except for her younger sisters and Audrey Horne, with whom she exchanged two letters.\nShe began studying at Hunter College, but dropped out after her freshman year to focus on her modeling career, having signed with the Ford Modeling Agency. Her career was very successful in the 1990s, during which time, gossip and society newspaper columns linked her romantically with several men until her marriage to a prominent venture capitalist, nearly twenty years her senior.\nIn the late 1990s, she encountered Lana Budding Milford at a charity event and the two were photographed together. The photo was subsequently published in the Twin Peaks Post.\nMeanwhile, Donna was suffering from drug and alcohol dependence and entered rehabilitation four times over the following five years. Her final rehabilitation came after Donna was found at a Lower East Side crack house after being reported missing by her husband two days prior. This episode was believed to have been triggered by the sudden death of her mother in 2009, whom Donna had not spoken to since leaving home.\nShe became sober after her stay at McLean Psychiatric Hospital and her marriage ended in divorce. She moved to New Haven, Connecticut, where she religiously attended twelve-step meetings to maintain her sobriety.\nDonna soon reconciled with her father Will and moved in with him in Middlebury, Vermont, working as his assistant in his medical practice. As of late 2016, she was studying to become a nurse practitioner. Donna politely turned down requests for an interview from Tamara Preston, and also declined to say what she had written in her letters to Audrey.\nBehind the scenes\nLara Flynn Boyle played Donna in the series. Due to scheduling conflicts, the role was recast with Moira Kelly in Twin Peaks: Fire Walk with Me.\nBoyle was approached to appear in the 2017 series of Twin Peaks but declined the offer to return.\nTrivia\nIn the original script for the pilot episode, James' reflection in the video tape is seen in Donna's eye rather than Laura's.\nGallery\n"}