{"name": "Dougie_Milford", "url": "https://twinpeaks.fandom.com/wiki/Dougie_Milford", "text": "Dougie Milford\nLieutenant Colonel Douglas \"Dougie\" Milford was a United States Air Force officer, specifically assigned to investigations concerning UFOs. In his later years, he was the publisher of the local newspaper, the Twin Peaks Gazette. He was known to marry often, lastly to Lana Budding Milford.\nBiography\n\nEarly life\nDouglas was born into the Milford family, the long-standing owners of Twin Peaks' oldest pharmacy, on August 11, 1909. Douglas grew up in the shadow of his older brother, Dwayne Milford, who stood to inherit the family business. During school, he was a classmate and friend of Emil Jennings, then flunked out of a pharmacy school in Yakima. In his youth, Douglas was often in conflict with both his brother and his family at large, due to his impulsivity and unpredictable temper, which contrasted him with his older brother's reliability and trustworthiness. As a result, his family would regard him as a black sheep, and the community of Twin Peaks viewed him as a somewhat of a trouble maker.\nAt some point, he and Dwayne began a feud over something concerning \"an old flame and a rumble seat.\" The feud lasted for the rest of Dougie's life.\nLike Dwayne, Douglas joined the Twin Peaks chapter of the Boy Scouts of America, and was, again like his brother, a scoutmaster for a time. During a camping trip at Pearl Lakes in 1927, he claimed to have seen a \"giant\" as well as a \"walking owl.\" He stated that he had photographed both, but when the film ended up prematurely exposed, he blamed his brother for improperly mixing chemicals in the family's pharmacy darkroom. Despite this, Milford had a photographic memory that his brother could attest to.\nThe following month, Milford demanded an investigation into the incident from the Regional Scoutmaster Council in Spokane, lest he bring it to the attention of the National Scoutmaster Council. His brother tried to calm him, only for Douglas to become violent and forcibly removed from the meeting. He subsequently was asked to resign from the scouts and began \"living in sin\" with Pauline Cuyo, the estranged daughter of Twin Peaks Gazette owner Dayton Cuyo. He became the town drunk until becoming a drifter in 1929, leaving Twin Peaks at the outset of the Great Depression.\nMilitary years\nDougie eventually reached San Francisco and worked as a logger. He enlisted in the United States Army Air Corps on December 8, 1941, the day after the attack on Pearl Harbor. During wartime, he was a quartermaster's brigade.\nHe was stationed in Guam and was promoted to sergeant by November 1944, when he was charged with black market trafficking of Army liquor and cigarettes. Despite the charges being dropped, he was demoted to Private and was stationed at the Alamogordo, New Mexico White Sands Missile Range in 1945.\nBy 1947, he was a Corporal and had been transferred to an air base in Roswell, New Mexico. On the morning of July 5, he heard rumors that an air crash had occurred that morning and snuck away from his post to see the wreckage thirty-five miles away. There, he saw a large field of metallic debris. In the field, he saw military personnel extracting a large, plane-like craft from the wreckage to be loaded onto a truck and others loading smaller objects into ambulances. He then saw General Nathan F. Twining arrive at the field to investigate, but shortly after, Milford was arrested by military police. He was interviewed about the incident on July 8 by an Army Lieutenant, though eventually requested to speak to the Lieutenant's superior officer to discuss a similar experience he had previously had.\nFollowing this incident, Corporal Milford was promoted to the grade of Major and was assigned to Project Sign by the United States Air Force, with General Twining as his commander. On July 12, he and FBI agent Frederic Nathan interviewed Kenneth Arnold, who claimed to have seen UFOs on June 24.\nOn July 14, Milford flew to Seattle and purchased a black 1947 Buick Roadmaster from Bob J. Hart. Subsequent alleged sightings of a \"man in black\" driving a Buick Roadmaster have been suggested to have been of Milford.\nFollowing the September 4 sighting by Einer Jennings of Twin Peaks, Milford traveled to the town to speak to Jennings on September 7, ostensibly as a friend to Einer's son Emil, rather than an Air Force officer. After hearing Jennings' account, Milford advised him of the potential dangers of continuing to tell his story, citing Kenneth Arnold's plane being sabotaged. When Jennings went pale and quiet upon hearing this, Milford took it as a sign that he had succeeded.\nThe following day, Milford traveled to the site where Jennings claimed to have seen the UFO and was greeted by a vision of an area in Ghostwood National Forest, near Pearl Lakes. He ventured to this location, where he claimed to have heard a hum, followed by bright, multi-colored lights, all coming from a large, round object twenty-five feet in the air. Underneath the object, within the clearing, he saw three children looking up at the object. Soon after, the object and the children disappeared. Milford searched the area, finding no evidence of the object or children, but took photographs of the area before fleeing.\nMonths later, Milford had been promoted to the rank of Major and was present for Project Sign's first official meeting, held at the Wright-Patterson Air Force Base in Ohio. The meeting discussed and analyzed eighteen UFO sightings reported between May and September 1947, including Milford's own.\nHe also investigated other alleged UFO sightings, such as the abductions of Margaret Coulson, Carl Rodd, and Alan Traherne in his hometown of Twin Peaks. His assignment concerning these sightings was to effectively debunk them.\nBy 1949, Project Sign was succeeded by Project Grudge. Milford's first assignment for Grudge arrived in November, when he was dispatched to Pasadena, California to investigate Jack Parsons.\nMilford met with Parsons in the facade of a freelance journalist writing an article for a left-wing magazine to \"set the record straight\" about his termination from Jet Propulsion Laboratory. Parsons spoke of his relationship with science fiction writer L. Ron Hubbard and vaguely referring to the Working of Babalon, a ritual he and Hubbard worked on, with the goal of summoning Zeta Reticulans. During the interview, Milford also noticed that Parsons was wearing a \"jade green ring\" on his right hand. The interview abruptly ended when Parsons' wife came to pick him up.\nAfterward, Milford met with a former colleague of Parsons who took him to the Arroyo Seco, a canyon where Parsons used to test rockets and explore \"the explosive sciences, of both the literal and metaphorical varieties,\" believing they would \"open up the gate.\" The colleague disclosed that Parsons would also use the area for Thelema rituals, attempting to summon the goddess Babalon. Inquiring about Parsons' ritual in New Mexico, he learned that Parsons had been attempting to bring across the \"Moonchild\" and that this incident occurred the weekend before the Roswell incident in 1947. From his findings, Milford concluded that any association between Parsons and the United States military be terminated.\nOn June 15, 1952, Milford was dispatched to investigate Parsons once more, still in the guise of a journalist. While Parsons discussed his separation from the Church of Thelema, Milford took note of his home, noticing evidence of occult activities, drug use, and work on explosives. He concluded that Parsons was a potential security threat, and reaffirmed his position that Parsons not be given back his military security clearance. Parsons died two days later in an explosion at his lab.\nHe later joined Project Blue Book and had a renowned reputation for his investigative skill.\nIn 1958, Milford recorded a journal entry in which he recounted correspondence with his White House informant, \"M,\" who informed him of the secretive Wise Men. In this entry, Milford also mused on an incident from 1955 that M tipped him on, which was rumored to have filmed evidence. He also recounted the truth (according to M) of a secretive trip by President Eisenhower, during which he traveled to Holloman Air Force Base. Sources claimed that Eisenhower's alleged visit to the base was to meet with extraterrestrials, who made an offer involving the US giving up nuclear warheads. A second visit was said to involve \"grays\" who offered their technology in exchange for genetic material, an offer that was purportedly accepted.\nIn 1962, he wrote an editorial against his brother, who was running for mayor of Twin Peaks. However, Dwayne won the position, as he was running unopposed.\nBy 1966, he was promoted to Lieutenant Colonel and began working under President Richard M. Nixon, who possibly was his informant, M. He secretly continued Project Blue Book for Nixon by gathering allies for 4 years, keeping it secret from other agencies such as the CIA who refuse to convey information to the president's office. Nixon eventually showed him a facility with many UFO related objects and even the survivor from a UFO crash which occurred in 1958.\nOn the evening of July 24, 1974, Nixon called Milford at his home over a secure line, and the two had what would be their last conversation. At this time, Nixon was facing almost certain impeachment for his involvement in the Watergate scandal and his attempts to cover said involvement, but he relayed to Milford that he believed that it was really a conspiracy orchestrated by his enemies inside the government to remove him from office because he knew too much. He warned Milford to keep a low profile, and informed him that he would not contact him directly again, telling him to instead seek his new allies in the FBI, where he had a contact who would help him.\nWhen Nixon resigned on August 9, 1974, Milford decided to follow his advice, and aside from writing an op-ed to the Twin Peaks Gazette, where he praised Nixon as a great statesman and lambasted those he believed had pressured him into his resignation, he refrained from doing to attract attention to himself for a year. He then sought out the man from the FBI who was recommended by Nixon: Gordon Cole. Cole would prove his only trustful ally to continue his activities in Twin Peaks.\nRetirement\nAt age 60, he returned to Twin Peaks, where he took over the Twin Peaks Gazette and renamed it the Twin Peaks Post after the death of then editor/publisher Robert Jacoby. He used his newspaper to prevent any news about the construction of the base to leak. When the Mayor investigated, Douglas sent in the FBI agents Gordon Cole and Phillip Jeffries to falsely report it to be part of Reagan's Strategic Defense Initiative.\nIn public life, Milford's return to his home town was markedly undramatic. His sordid reputation from his youth had long since been forgotten, and instead, due to his newfound wealth, the townspeople came to view him as just a rather harmless, rich old eccentric. This general opinion of him solidified over the years, as Milford, in stark contrast to his frugal brother, often engaged in spendthrift behavior, and, even more scandalously, got into a series of marriages with younger women, all of which would be very short-lived and end in divorce.\nMilford later handpicked Major Garland Briggs—who he transferred from Fairchild Air Base—to be his successor in Listening Post Alpha until his next \"controller\" arrived.\nAt the reception following the funeral for Leland Palmer, Dougie got into a fight with his brother, Dwayne.\nDougie was married to Lana Budding at the Great Northern Hotel on March 17, 1989. However, his brother insisted that Lana only married him for his money and newspaper.\n \nIn bed with Lana, Milford died of a heart attack, wearing a gold ring with a green stone or gem on his right little finger, which he had already been wearing before the marriage.\nAfter his mentor's death, Major Briggs privately suspected that Lana might have been an assassin sent by someone from Milford's past, who wanted him to take his secrets with to the grave. Briggs, however, also noted that he had no evidence to support this suspicion.\nBehind the scenes\nAccording to Harley Peyton, there was consideration of casting writer William S. Burroughs – a fan of the show – as Dougie Milford. However, this idea was ultimately scrapped when it was deemed too expensive.\nIn the show, he is always wearing a gold ring with a green stone or gem on his right ring finger. It is unknown if it is related to the ring introduced in Twin Peaks: Fire Walk with Me.\nThe Secret History of Twin Peaks contains a minor continuity error for Milford's middle name. Early in the book, his middle name is stated to be James, but his obituary states it to be Raymond.\nHis enlistment form states that he had no distinctive marks although he should have already had the three triangle marking from his scout years' abduction.\nGallery\nThe receipt from Milford's 1947 Buick Roadmaster, dated July 14, 1947Milford's USAF enlistment form"}