{"name": "Dougie_Jones", "url": "https://twinpeaks.fandom.com/wiki/Dougie_Jones", "text": "Dougie Jones\nFor other uses, see Doug (disambiguation).\n\"Dougie is Cooper?! How the hell is this?\"\n ―Gordon Cole\nDouglas \"Dougie\" Jones was a tulpa of FBI agent Dale Cooper, created by Cooper's doppelganger as a ploy to avoid returning to the Black Lodge.\nBiography\n\nCreation\nAfter escaping from the red room, Dale Cooper's doppelganger was destined to return there at 2:53 p.m. around twenty-five years later. Dougie Jones, a tulpa of Cooper, was manufactured from a gold seed, ensuring that he would be the one to return in the doppelganger's place. Dougie was in possession of the ring, which he wore on his left arm. His earliest records dated to 1997.\nDuring Dougie's existence, he was married to Janey-E, with whom he had a son named Sonny Jim, and worked as an insurance agent at Lucky 7 Insurance in Las Vegas, Nevada from 2004. Dougie lived in the house with a red door at 25140 Lancelot Court, near Merlin's Market. It also seemed that he frequently had \"episodes\" in which he seemed almost catatonic, possibly caused by a car accident he was involved in prior to being hired at Lucky 7 Insurance.\nDeath\nOn the appointed day, Dougie had been away from his family for several days with no contact, and he owed $52,000 to Jimmy and Tommy for a football bet. During this time, he was with a prostitute named Jade at an unoccupied house in the Rancho Rosa development. After finishing their tryst, Jade went to shower, while Dougie's left arm became numb and he grew violently ill. He crawled to the living room, where he vomited on the floor. He was then violently yanked backwards, disappearing.\nDougie sat in an armchair in the red room, where Mike told him that he had been manufactured by someone for a purpose that had now been fulfilled. Dougie began shrinking and the ring fell off his hand. He suddenly transformed into a cloud black smoke, a golden orb-shaped seed rising out of the depths. Dougie then appeared to turn into a vomiting skull and vanished in a flash of light, leaving behind only the gold seed in his seat. Mike picked up both the ring and the seed, placing the ring on its table.\nThe real Dale Cooper then was transported out the Black Lodge through a wall outlet, materializing in the house from which Dougie had disappeared. Dougie's family and friends mistook Cooper for Dougie and continued to treat him as such. Over the next several days, several individuals working for Dale Cooper's doppelganger attempted to kill Cooper but failed.\nDougie's wedding ring was discovered inside a man's decapitated body in Buckhorn, South Dakota. The body had been found in the apartment of Ruth Davenport along with Davenport's severed head.\nReturn\n \nWhen the real Cooper awoke from a coma with his full capacities, he was visited by Mike in a vision. Cooper removed a tuft of his own hair and gave it to Mike, telling him to \"make another one\". Soon, another tulpa of Cooper appeared in the Red Room before Mike and went to Las Vegas, taking on the name of Dougie Jones. He knocked on the door of Jones' home and embraced Janey-E and Sonny Jim, who were overjoyed that he had returned to them.\nBehind the scenes\nHis Nevada car license plate sticker's yellow color and design (text to the left, bottom and right of the month of expiration number and nothing above) indicate that the expiration year is either 2013 or 2016 (though it should be noted that in Nevada, registrations may be renewed online up to 18 months after expiration).\nDougie's changing into a gold nugget is very similar to Lynch short film Dream #7 and a scene from his unproduced Ronnie Rocket script in which a character becomes a golden egg.\nTrivia\nHis \"Sunset\" Nevada car plate serial number is DUGE LV, and the license plate sticker reads that it expires in March but its year of expiration, its serial number and its state are not visible though the latter are presumably \"DUGE LV\" and \"Nevada.\" The tags are 2003."}