{"name": "Dwayne_Milford", "url": "https://twinpeaks.fandom.com/wiki/Dwayne_Milford", "text": "Dwayne Milford\nDwayne Milford, Sr., a pharmacist by trade, was the mayor of Twin Peaks from 1962 to 1990. He was well known for his ongoing feud with his brother Dougie.\nBiography\n\nEarly life and career\nDuring his freshman year of high school, Dwayne threw the great northwest's very first forward pass. It flew for over four yards to his brother, Dougie, who fell over.\nIn 1927, Milford was a scoutmaster and had an ongoing feud with his brother which had been sparked by an event concerning \"an old flame and a rumble seat.\" He also worked at a pharmacy owned by his family, which he took over after World War II following the death of his father.\nHe became mayor of Twin Peaks in 1962, after running unopposed. At some point, he had a son named after himself.\nMilford was married for about fifty years until his wife's death. The marriage produced at least one child, Dwayne Milford, Jr.\nMurder of Laura Palmer\nOn February 24, 1989, Milford called to order a conference held by Special Agent Dale Cooper to announce the FBI's takeover of the murder investigation of Laura Palmer, who had been murdered the night before. The mayor struggled with his announcement, wondering if the microphone was on.\nDougie's death and Miss Twin Peaks\nA few weeks later, at the reception following the funeral for Leland Palmer, Milford instigated a fight with his brother. The next day, he attended his brother's wedding to the young Lana Budding, to which he objected on the grounds that the bride was only interested in Dougie's money and newspaper.\nThe following morning, Dwayne went to the Great Northern Hotel, where his brother had died in bed of an apparent heart attack. He cried over him and blamed Lana's sexual appetite for his death. After he was escorted out by Deputy Andy Brennan, he saw Lana and chided her, saying that she was a \"sexual adventuress\" and would \"burn in hell.\"\nLater, in Sheriff Harry S. Truman's office, Doctor Will Hayward presented the autopsy report for Dougie, finding that he indeed died from a heart attack. However, Dwayne asked the doctor if he checked for witchcraft and wanted to press charges, claiming Lana killed him with sex.\nDays later, armed with a shotgun, Dwayne confronted Lana, who was at the sheriff's station with Doctor Lawrence Jacoby. Agent Cooper then ordered Dwayne and Lana to settle matters privately in the conference room. Meanwhile, the rest of the men stood outside until they opened the door to find the mayor being kissed by Lana and announcing that they planned to adopt a child.\nDwayne and Lana soon became engaged; and days later, at the Double R Diner, Lana requested Dwayne to pull some strings to make her win the Miss Twin Peaks Contest, for which he was a judge.\nHe later met with the other members of the Judging and Rules Committee, Will Hayward and Pete Martell, where he commented that the year's contest would be exciting. Benjamin Horne addressed the committee, first congratulating Milford on his engagement to Lana, then suggested the contest's speech topic be over ideas on how to save the forests. Lana then was called up as the first candidate for the contest.\nDwayne went to Lana the next day to tell her that Norma Jennings and Richard Tremayne had been confirmed as the other judges for the contest and they plotted a way for her to definitely win.\nWith feedback from the microphone, he later addressed the dancing couples at the Roadhouse.\nThe next morning, alongside the two fellow judges, Milford observed Tim Pinkle teach choreography to the contestants and he commented that he loved a chorus line. Norma turned his attention away to ask what qualities they would be looking for in Miss Twin Peaks, and he suggested beauty and power - the way he liked his women. After Norma left, Lana approached Dick and requested for him to help her \"find something in the storage room\" - all part of their plan to have her win the contest.\nAt the contest that night, the winner was announced as Annie Blackburn as Dwayne looked at Lana in disappointment. He was outraged at the win.\nSix months later, Lana left Twin Peaks after receiving insurance money for Dougie's death and Milford completed his final term as mayor in 1990 after fourteen consecutive two-year terms."}