{"name": "Ed_Hurley", "url": "https://twinpeaks.fandom.com/wiki/Ed_Hurley", "text": "Ed Hurley\n\"Big\" Ed Hurley, Jr. was the owner of Big Ed's Gas Farm, the local gas station in Twin Peaks. He was married to Nadine – a relationship that was held together merely by Ed's guilt – but was secretly seeing Norma Jennings, his high school sweetheart.\nHe also looked after his nephew, James Hurley.\nHe was one of the Bookhouse Boys and as such was an \"unofficial deputy\" to Sheriff Harry S. Truman.\nBiography\n\nEarly life\nA member of the Bookhouse Boys, Big Ed was a tight end on the starting lineup of the Twin Peaks High School's football team in 1968 with Frank Truman, Harry S. Truman, Tommy \"Hawk\" Hill, Hank Jennings, Thad \"Toad\" Barker and Jerry Horne.\nContrary to the rest of his family he never worked at the Packard Sawmill and instead became a very skilled mechanic, then took over Ed's Gas Farm from his father and changed its name to Big Ed's Gas Farm. After Frank Truman became sheriff of Twin Peaks, Ed turned down his offer to become a deputy.\nThe spring after high school, Ed was married to Nadine Butler in the immediate aftermath of his sweetheart Norma Lindstrom cheating with Hank Jennings while she and Ed had been dating. Frustrated, Ed encountered Nadine and in a state of frustration and half-drunkenness, and he suddenly proposed to marry Nadine and the marriage took place immediately afterwards. On their honeymoon hunting trip, he fired a buckshot and a piece of it ricocheted off of a rock and hit Nadine in the eye.\n\"The Andrew Packard Case\" and \"The Ballad of Big Ed and Norma and Nadine,\" attributed to Dale Cooper and Hawk Hill, respectively, provide a different background to Ed's post-high school life and relationships with Norma and Nadine:\nImmediately after graduating high school, at the height of the Vietnam War, Ed enlisted the Army and was sent to Fort Dix for basic training. In the fall, Ed was deployed in Saigon to work at a motor pool.\nDuring his deployment, Ed wrote letters to Norma every day, but eventually stopped receiving them. Assuming Norma was no longer interested in their relationship, he canceled a trip back home while on Christmas furlough. Unknown to both Ed and Norma, Hank Jennings had been intercepting Ed's letters before they reached Norma. Three weeks later, Ed received a Dear John letter from Norma and declined to write back. He later learned of her marriage to Hank through a letter from Harry S. Truman.\nIn the fall of 1973, Ed drank with Hawk while on shore leave. Despite Hawk urging Ed to get over Norma, Ed became emotional when a Frankie Valli song began playing on the bar's jukebox, prompting Hawk to leave.\nOver the next two years, Ed and Hawk exchanged letters. Ed nearly decided to have a career with the Army, but decided to return home in 1975 to help his father at the family gas station, Ed's Gas Farm, and take care of his nephew, James. He declined an offer from Frank Truman to become a deputy for the Twin Peaks Sheriff's Department.\nA year later, Ed visited the Double R Diner, striking up an awkward conversation with Norma until Hawk decided to intervene. He began going to the diner at the beginning and end of every day.\nIn 1983, Ed took over the gas station following his father's death, renaming it Big Ed's Gas Farm.\nIn late 1984, Ed met Nadine Gertz after backing his tow truck into her father's tractor that Nadine had brought to the Gas Farm for repairs. Going to Nadine's aid, she fainted in Ed's arms. Once she came to, Nadine hugged him. After Ed profusely asked if she was alright, Nadine kissed him, the two quickly becoming enamored.\nEd and Nadine were married three weeks later at the Chapel-in-the-Woods, with all of the Bookhouse Boys in attendance, the reception being held at the Grange Hall. However, Nadine soon learned of Ed's previous relationship with Norma, resulting in jealous questions and outbursts from Nadine, along with being followed by her whenever he went to the Double R.\nThe next fall, Ed went bird hunting with Harry Truman. Unknown to him, Nadine had followed him. She disturbed a group of ducks and Ed shot at them, with a buckshot pellet hitting Nadine in the eye. Overwhelmed with guilt, Ed nursed her back to health.\nOne evening, three days before Christmas, Ed went to the Double R and spoke with Norma over coffee. Realizing they were still in love, Ed began visiting the Double R every night to talk to Norma.\nAffair with Norma\nEd and Norma soon became unhappy in their respective marriages and began to secretly resume their relationship. In February 1989, Ed and Nadine came to the Double R Diner—which Norma owned—for coffee, but the latter became upset upon seeing Norma and stormed out. Ed apologized to Norma and followed Nadine. He soon came back in to find Norma crying. He went to her and apologized again. They planned to get together and he says he would call her. They shared a smile and he left.\nLater, Ed and Norma relaxed in his truck, drinking beer. He blew into a breathalyzer test given to him by Harry, finding that he had drank too much. He commented that they would be there \"for a long time,\" so Norma searched for something on the radio and they discussed their relationship.\nEd was at his gas station on February 24, the day Laura Palmer was found murdered. His nephew, James Hurley—who had been secretly seeing Laura—arrived and commented that Laura was \"the one.\" James left a message for Laura's best friend Donna Hayward before driving away. Nadine, then yelled at Ed to go pick up the drapes she ordered. He then got in his truck and left.\nHe later came back to the gas station, where Donna was waiting for him. He gave her a hug and said he was sorry about Laura's death. He gave her James' message when she asked about him and they were interrupted by Donna's boyfriend, Mike, who angrily asked where she had been and insisted that she should have been with him to support his best friend, Bobby Briggs. This angered Ed, who defended Donna. Mike told her to go to the sheriff's station and he left. Nadine then yelled at him again, this time to hang the drapes. Donna then left.\nLater in the evening, he received a call from Norma and agreed to meet with her at the Roadhouse. When there, they discussed their relationship as well as Norma's intention to leave Hank, who was in prison for manslaughter. Donna arrived and gets into an altercation with Mike, so Ed came to her aid, but he was beaten down by Bobby.\nHe went to the sheriff's department the next day, with a bandage over his left eye. He encountered Harry S. Truman—who was by then the sheriff—and was introduced to FBI Special Agent Dale Cooper. He asked about James, who had been brought in for questioning about the murder. Cooper said that James would be free to go, but should be careful around Mike and Bobby. When Cooper went to take a call from Albert Rosenfield, Ed and Harry discussed the events that occurred in the Roadhouse, suspecting that his beer had been drugged by Jacques Renault, who had been working the bar.\nJames was released to him, saying that he needed the Bookhouse Boys watching his back and Ed told him that he was covered.\nThe following day, with greasy hands, Ed entered his house, where Nadine was exercising when he tripped over drape runners she had left in the middle of the floor and dripped grease on them. This upset her, as she was working on a silent drape runner.\nHe went to the diner and ordered a coffee from Norma, telling her about his trouble with Nadine.\nWhen he came home that night, his wife immediately tackled and hugs him, then presented her now-silent drape runners, which had been achieved by the grease he had accidentally dripped on the cotton balls earlier.\nEd was kissed by Nadine as he observed her nick-nacks before Laura's funeral the next day. James then arrived but said that he would not go to the funeral.\nWhen James came to the funeral and charged at Bobby—who declared the whole town of killing Laura—Ed helped Agent Cooper restrain him.\nEd later went to the diner with Harry and Hawk. They were joined by Cooper, who ordered huckleberry pie, ice cream, and coffee from Norma. When she walked away, the special agent immediately asked Ed how long he had been in love with her. They told him about their operation to stop drugs from entering Twin Peaks, officially introducing him to the Bookhouse Boys when they took him to the Bookhouse.\nA couple of days later, Ed worked on a car at his gas station when Norma showed up, telling him that Hank made parole and would be coming home. Ed told her that he had not told Nadine about his plans to leave her, as she was not well, but Norma insisted that they both have the same problem - they did not want to hurt anyone. They then agreed to not call each other for a while.\nHe went to his home the next day, where Nadine was upset over her drape runner patent being rejected.\nEd met Harry and Cooper at the Great Northern Hotel to discuss a plan to go to One Eyed Jacks, a casino and brothel across the Canadian border, for which Cooper had acquired $10,000 of the FBI's money to gamble with. There they would lure Jacques Renault into Twin Peaks to bring him in for questioning in the Laura Palmer case. Ed was given $300 to start off with and he left the other two men alone.\nEd got ready for the operation with Cooper, putting on a wig and a mustache. They heard a gunshot, finding that Jacques's bird, Waldo, had been shot.\nHe went with Cooper to One Eyed Jacks and was given the alias Fred when they met Blackie, the brothel's madame. When asked his line of work, Ed said he owns a gas station but quickly stated he was an oral surgeon. They were pointed to the casino and Ed went to the craps table while Cooper played blackjack.\nHe later observed Cooper playing blackjack but said that it was not his game. When he saw Jacques begin his shift as the card dealer, he gave Cooper the Bookhouse Boys gesture and left him alone.\nEd lost at roulette and wandered past Cooper. He left and goes back to the van with Hawk as they listened in on Cooper's conversation with Jacques.\nLater at the sheriff's station with Deputy Andy Brennan and Hawk, he told a few other lawmen about Andy saving the life of Sheriff Truman during Jacques's arrest.\nHe went home, where he found Nadine unconscious from overdosing on pills and he called emergency services.\nEd sat in the hospital the next day and was visited by Truman, Cooper, and Albert Rosenfield. They asked about Nadine's condition and he said she is in a coma. Cooper took him aside and Ed told him about his and Nadine's relationship. James was then brought to the hospital by Hawk and the two hugged. He returned to Nadine's room, where he held her hand.\nA few days later, he went to visit Nadine, who had been restrained due to an exceptionally large production of adrenaline. Doctor Will Hayward suggested he sing her favorite song to her and left. Ed sang \"On Top of Old Smoky\" to her, which caused her to wake, crushing his hand and breaking through her restraints, then clapping as she said a cheer. She seemed as if her mind had reverted to the age of 18.\nEd brought Nadine home from the hospital a couple of days later and she did not recognize James. James suggested taking her to Doctor Lawrence Jacoby, but Ed said he was in Hawaii, recovering from a heart attack. After going to the kitchen to get herself something to drink, Nadine came back, having torn off a cabinet door.\nNadine happily came home after shopping the next day. Suggesting they act like they were married, she punched Ed in the gut and tackled him on the couch.\nHe took Nadine to the diner, showing Norma the current state of mind Nadine was in. When Nadine was brought a milkshake, she broke the glass and gave Ed a big kiss.\nEd went to the roadhouse days later, where he was requested to be by Agent Cooper. He helped clear the floor and Cooper determined the killer of Laura Palmer to be her father Leland Palmer, who later died in custody.\nAfter Leland Palmer's funeral, Ed attended the reception. Donna confided in him that James believed the deaths in Twin Peaks to be his fault and left. Ed assured her that he would be back.\nNadine came and asked him if one could see her underwear reflected in her shoes. Ed then helped break up a fight between Mayor Dwayne Milford and his brother, Dougie.\nWith Doctor Jacoby, he convinced the staff at Twin Peaks High School to admit Nadine into the student body since she believed she was a teenager.\nEd picks at a slice of pie at the diner the following day. He and Norma then reminisced about their time together when they were young.\nHe sat at the diner again the next day and Norma refilled his coffee. He gave her a tip along with a note saying \"We need to talk.\"\nEd received a call from James, who had still not returned to Twin Peaks, requesting all of the money James had in his savings.\nNorma came to his home later and expressed her love for him and her wish for them to be together all the time. Instead of talking about what Ed had called her there for, they gave in to their undeniable attraction to each other.\nLater, Donna knocked on his front door, still searching for James. He told her about James' money request and she offered to deliver it to him. Norma then left his home and he turned around to see Hank, who punched him. However, as he was being beaten, Nadine came to his rescue.\nEd met with Doctor Hayward the next day at the diner to discuss Nadine, concerned about her wish to begin dating boys. The doctor suggested he gave her a curfew of 9:00 on school nights and Norma brought him potatoes. Will asked him about Donna's activities looking for James, which Ed explained. Will then left and Norma came over and tells him that Hank was in the hospital, claiming to have had a tree fall on him, though Ed told her the truth about Nadine beating him up. She also said that Hank would be charged with parole violations, a fact that Ed felt should be celebrated and not caring who would find out about their relationship.\nHe lied awake in bed with Norma the following day, talking about the twenty years that had passed since they separated. Nadine came in, taking the door off of its hinges on her way. She got into bed with them, telling them about her disqualification from the wrestling tournament and apologizing for beating up Hank. She got up to leave and told them that she knew about their relationship and was okay with it, as she was seeing Mike Nelson.\nNadine came home early from school the next day to tell him that she and Mike were in love and she \"breaks up\" with Ed.\nHe went to the diner and embraced Norma, asking her to marry him.\nEd sat down with Nadine and Doctor Jacoby the next day to tell her he wanted a divorce, though she was confused as she believed they were only dating.\nA few days later, Nadine showed some if her wrestling highlights to Ed, Norma, Mike, and Dr. Jacoby. Jacoby said he had gathered them all together, as he believed divorces were easier when all parties involved could talk about their feelings. Ed told Nadine that he planned on marrying Norma. This caused her to say that she and Mike would be doing the same.\nAfter a bout of chaos that ensued at the Miss Twin Peaks Contest the following night, Doctor Hayward patched up Nadine and Mike, the former having been hit in the head by sandbags. Nadine came to and apparently returned to her adult mental state, telling Mike to leave, and asking Ed why Norma was there.\nEd would eventually learn that James had got into trouble in Oregon, having fled from a trial he was a key witness in, resulting in him getting a sentence of six months in a minimum security prison and two years of probation during which time he was forbidden to leave the state. To keep an eye on his nephew and make sure he followed the conditions of his probation, Ed rented an apartment in Portland where he would spend every other weekend, until the end of James' probation.\nLater life\nAs of late 2016, Ed was still married to Nadine. He was on good terms with Norma, but clearly still harbored feelings for her. He had dinner with her one evening, joined by Bobby Briggs until Norma's boyfriend and business partner, Walter Lawford, arrived. On another evening, Ed had a slow, lonely night at the gas station eating Double R takeout food.\nLater, during the day, Nadine marched to Ed at the gas station, to tell Ed that she had changed and despite the love she has for him, she had been a \"selfish bitch\" to him all these years and kept he and Norma apart due to her own jealousy. Nadine had now come to realize that the only reason Ed had stayed with her was out of guilt. Defining \"true love\" as giving the other person what makes them happy, Nadine freed Ed from their obligatory matrimonial bonds, giving him her blessing to be with Norma.\nHe made his way to the diner and told Norma that their circumstances had changed and they could be together, but she apologized as Walter joined her. Crushed, he sat down and ordered a coffee from Shelly, adding \"and a cyanide pill.\" However, in a moment of perfect timing, Norma – after breaking off her business deal with Walter – joined him and he asked her to marry him. They embraced with a kiss and Norma accepted his proposal.\nNot long after, Ed and Norma got married. Ed's nephew, James, played a song he wrote on his guitar during a civil ceremony conducted by the Big Log near the old train station. All of their friends – half the town, including Andy and Hawk – were in attendance.\nBehind the scenes\nHurley was played by Everett McGill, reprised the role in the 2017 series. He was seen in a teaser released on May 4, 2017.\nPrior to the official announcement of the show's return, Lynch put out a call to his Twitter followers to help him find McGill, who he had lost track of over the years. A Welcome to Twin Peaks reader gave him a phone number that Lynch used to subsequently contact McGill to reveal his plans. McGill related to Entertainment Weekly that the phone number actually went to a house he rarely used, and that if Lynch had called him on any other day, he very well might not have participated in the new series.\nTrivia\nIn a photo of the 1968 high school football team in Twin Peaks: Access Guide to the Town, one of the players is identified as Jeff Hurley. It is unknown if he has any relation to Ed and his family.\nIt is also noted in The Secret History of Twin Peaks that his favorite book is Zen and the Art of Motorcycle Maintenance by Robert M. Pirsig, which he read five times and thought that he would figure it out the next time.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}