{"name": "Eileen_Hayward", "url": "https://twinpeaks.fandom.com/wiki/Eileen_Hayward", "text": "Eileen Hayward\nEileen Hayward was the wife of Will Hayward and mother of Donna, Harriet, and Gersten. She was a wheelchair user. \nBiography\nAt some point in the 1960s or 1970s, Eileen was involved in a car accident, necessitating the use of a wheelchair.\nEileen married Will Hayward in the 1960s, then at some point in the early 1970s, she had an affair with Benjamin Horne, possibly resulting in the birth of her oldest daughter, Donna.\nOn a day in February 1989, Eileen brought out muffins to Donna and her best friend Laura Palmer in the living room.\nOn February 24, the night after Laura was killed, Eileen sat with her husband in their living room, listening to him go over the events that occurred previously in the day, including the discovery of Laura's necklace at the murder scene, which was not a detail that had been released to the public. He also said that they believed the killer may have been in possession of the necklace's other half.\nIn the morning, Donna came downstairs, asking why she had not been woken for questioning as FBI Special Agent Dale Cooper had ordered the night before. She told her daughter that the sheriff's office had called saying they could wait until the next day. Donna then told her what she was feeling, including her budding romance with Laura's secret boyfriend, James Hurley, whom she had gone out to meet with the night before. James later came over for dinner and met Eileen and her husband. After dinner, she went to bed with her husband, leaving Donna and James alone.\nAfter church the next day, she had lunch at the Double R Diner with her family and she saw Audrey Horne come in.\nA few days later, she sat with her family and Leland and Sarah Palmer as her youngest daughter, Gersten played the piano and her middle daughter, Harriet recited a poem about Laura.\nOver a week later, Eileen attended the reception after the funeral of Leland Palmer, who was arrested for his daughter's murder and died in custody three days prior. She helped comfort his widow.\nA few days later, Eileen and Will arrived home from a trip to the grocery store, and Donna told them they had a visit from Gerald Craig, an old colleague of Will's. However, he said that this was impossible due to Craig dying many years before. Eileen called the phone number left by Craig and found that it was the number for a cemetery.\nLater, the doorbell rang at her home and she went to answer. Benjamin Horne entered and whispered to her, concerning their former affair. She went to his office at the Great Northern Hotel the next day to give back love letters he had once written to her.\nAt dinner the next day, Donna asked her how she knew Ben Horne. Will mentioned the \"Heal the Planet\" charity, to which she said was the reason for Horne's visit.\nA couple of days later, Donna came down to the living room, dressed up for the Miss Twin Peaks Contest. Eileen requested to hear her speech, but Donna wished to talk about the truth of Eileen's involvement with Ben Horne. Eileen and Will refused to reveal any information to her, so she left.\nAfter Donna confronted Horne at the contest, she came home and started packing her bags. She came down the stairs of their home, ready to leave, Ben declaring that he wanted to tell the truth, but Will arrived and was angered by Ben's presence. Horne's wife, Sylvia then arrived, upset with Ben, then Will then punched him, causing him to hit his head on the fireplace.\nWithin the next three months, Will left the family and town for Middlebury, Vermont and was divorced from Eileen, leaving her a single mother. She was financially supported by a monthly payment of $7,500 traced back to the Horne Foundation until her death due to heart failure brought on by pneumonia in 2009.\nBehind the scenes\nEileen's actress, Mary Jo Deschanel, is married to Caleb Deschanel, who directed several episodes on Twin Peaks."}