{"name": "Einer_Jennings", "url": "https://twinpeaks.fandom.com/wiki/Einer_Jennings", "text": "Einer Jennings\nEiner Jennings was the father of Emil Jennings, and the grandfather of Hank Jennings.\nBiography\nBorn ca. 1884, Jennings went to school alongside the father of Dwayne and Douglas Milford. He later had a career as a worker at one of Twin Peak's lumber mills. In 1947, at the age of 63, he had retired, and spent most of his days either going on hikes in forest near Twin Peaks with his dog, Rover, or getting drunk in the town's bars. Jennings was in fact rather infamous in the town for the latter, being a \"leading candidate for town drunk,\" and often being short on money as a result.\nUFO encounter\nAt around dusk on September 4, 1947, Jennings was out walking with his dog along the hiking trail near Sparkwood and Highway 21, when he spotted a strange, silvery object in the sky, being chased by a USAF fighter jet for about thirty seconds, before the object quickly flew straight upwards and disappeared into the clouds, and the fighter jet withdrew to the south, towards the nearby Fairchild Air Force Base. Shortly thereafter, Jennings relayed his experience to Robert Jacoby, a local reporter for the Twin Peaks Gazette. Though Jacoby questioned the trustworthiness of the story during the interview, pointing out Jennings' reputation as a drunk, Jennings swore on his mother's life that he was completely sober at the time he had witnessed the event. The story of Jennings' encounter was then published in the newspaper on September 6.\nJennings was shortly thereafter contacted by Douglas Milford, who arranged a meeting with him on September 7 at a local bar to discuss his unusual experience. Unbeknownst to Jennings, who only knew Milford an old friend of his son Emil, Milford was in reality a secret agent acting on behalf of the US government and his true agenda was to make him keep quiet about the experience. After questioning Jennings about the details of his experience, Milford, expressing \"friendly\" concern, cautioned Jennings about what had happened to other people who had publicly shared stories about their sightings of UFOs, namely that they had been shadowed and threatened by \"mysterious visitors\" and that attempts had even been made on their lives. When Jennings turned pale and quiet after hearing this, Milford took it as a sign that he had accomplished his mission."}