{"name": "Emil_J._Smith", "url": "https://twinpeaks.fandom.com/wiki/Emil_J._Smith", "text": "Emil J. Smith\nEmil J. Smith was a United Airlines pilot who reported a UFO sighting in 1947.\nBiography\nOn July 5, 1947, during a commercial flight from Boise to Seattle, Smith reported seeing \"nine silvery discs\" flying in formation and managed to monitor them for ten minutes.\nOn July 31, Smith's friend and fellow UFO spotter Kenneth Arnold retrieved Smith from Seattle and flew him to Tacoma, where they met with other UFO witness Fred Crisman and Military Intelligence investigators Captain Davidson and Lieutenant Brown.\nDavidson and Brown were given metallic fragments that had fallen from a UFO spotted by Harold Dahl and boarded a B-25. Soon after takeoff, the B-25 crashed due to supposed sabotage or attack, according to an anonymous source through Tacoma Times reporter Paul Lantz. Further, United Press stringer Ted Morello, called the group to confirm details about the investigators, adding that an anonymous source stated that the \"same thing could happen\" to Smith and Arnold.\nCrisman soon fled the hotel, leaving behind Smith and Arnold, who learned that the hotel's services would be suspended due to a strike. Paranoid that they were being surveilled, the two turned on all of the room's faucets, sealed the doors, and turned up the radio to maximum volume whilst they spoke quietly to each other.\nMorello later called them again with more information, but Smith and Arnold resolved to meet with him in person rather than continuing to speak over the phone. They met him at the KMO radio station, where he told them that Crisman had been taken into custody by the military and was en route to Alaska in an Air Force transport. While Smith attempted to confirm this information, Morello advised that they leave Tacoma until the situation settled. After leaving the radio station, Smith and Arnold stopped by an address given by Dahl, but found it to be deserted.\nWhile being followed by a black Buick sedan, they drove to McChord Airfield, where they met with a Major and provided him with the remainder of the fragments found by Dahl. Arnold then flew Smith back to Seattle with no problems.\nBehind the scenes\nCaptain Emil J. Smith was a United Airlines pilot. Smith was initially a skeptic about UFOs, remarking, \"I'll believe in those discs when I see them.\"\nDespite his doubts, during a flight on the evening of July 4, 1947, Smith reported seeing five disc-like objects and managed to track them for forty-five minutes."}