{"name": "Emory_Battis", "url": "https://twinpeaks.fandom.com/wiki/Emory_Battis", "text": "Emory Battis\nEmory Battis was the store manager of Horne's Department Store. He recruited girls from the perfume counter to work at One Eyed Jacks.\nBiography\nIn early March 1989, Battis met with Audrey Horne, who had come in for a job at the department store. Battis said Audrey's father suggested she work in the wrapping department, but she refused. She then insisted she be put in the perfume department and she threatened him, making a deal that she would officially be in the wrapping department, but would be put on the perfume counter.\nThe next day, Emory approached Jenny, an employee at the perfume counter, and asked to see her in his office. They met there and he gave her a unicorn trinket before offering her a full-time job at One Eyed Jacks. He then left his office with Jenny.\nA few days later, he made a visit to One Eyed Jacks. He was tied up in a room, blindfolded as a girl ran a vacuum cleaner, which was then shut off as another girl entered with ice for him. She removed his blindfold and he discovered that she was Audrey. She threatened to have him arrested unless he told her everything about the connection between the perfume counter and One Eyed Jacks. He confirmed the owner of the brothel to be her father and that Laura Palmer had been to the brothel prior to her death.\nHaving informed Blackie O'Reilly about Audrey's presence at the brothel, the two later confronted Audrey.\nEmory filmed Audrey in captivity as Blackie sedated her with heroin.\nHe then looked over security footage with Blackie and recognized a man as Special Agent Dale Cooper. Battis was then introduced to Jacques Renault's brother, Jean Renault and Blackie's sister Nancy O'Reilly. Jean told him that he wanted the FBI agent for his actions leading to the deaths of Jean's brothers. He said this could possibly be done through Ben Horne, so he retrieved the tape of Audrey.\n \nThe following day, Battis took Audrey to Renault. He said that Audrey resisted taking her \"medicine\" and she said he hit her. Jean warned him to never do this again and explained to Audrey that he spoke to her father. Battis tried to simplify what was going on for Audrey but was shot and killed by Renault."}