{"name": "Episode_15", "url": "https://twinpeaks.fandom.com/wiki/Episode_15", "text": "Episode 15\nNot to be confused with Part 15.\n\"Episode 15\", or, \"Drive With a Dead Girl\" is the eighth episode of the second season of Twin Peaks and the sixteenth episode overall.\nPlot\n\"Food is interesting; For instance, why do we need to eat? Why are we never satisfied with just the right amount of food to maintain good health and proper energy? We always seem to want more and more. When eating too much the proper balance is disturbed, and ill health follows. Of course, eating too little food throws the balance off in the opposite direction, and there is the ill health coming at us again.Balance is the key. Balance is the key to many things. Do we understand balance? The word 'balance' has seven letters. Seven is difficult to balance, but not impossible – we are able to divide. There are, of course, the pros and cons of division.\"\n ―Margaret Lanterman\nLeland putts balls off a green in the living room and Donna and James come over to say goodbye to Maddy, but Leland tells them they just missed her. Sarah calls him up and when Leland returns, he tells James and Donna they can write Maddy. He adjusts his tie in the mirror, and BOB stares back at him. Leland packs his club into his golf bag with Maddy's body, which he places in his convertible's trunk. He puts the top down and drives away.\nBen brushes his teeth in jail and Jerry enters, saying he will be handling Ben's case personally, as Leland is under suspicion of murder himself. Ben says he was with Catherine the night of Laura's death and the brothers reminisce about Louise Dombrowski dancing in their room with a flashlight when they were kids.\nLucy returns with her sister, Gwen, and Gwen's baby.\nCooper makes a voice note about the one armed man as Leland dances around the lobby with his golf club. Harry tells him that they have arrested Ben. Leland leaves to cry and laugh in the hallway and Cooper asks him to let him know if he remembers anything unusual about Ben's behavior the night of Laura's death. As soon as Harry and Cooper are out of sight, Leland resumes his dancing.\nDoctor Hayward prepares to administer a blood test to Ben and Jerry protests Ben's treatment. Cooper recites Jerry's shoddy history of his law practice and shows Laura's secret diary to Ben, specifically the page where she says she will expose him. Ben tells Cooper he's way out of line. Ben and Jerry talk privately, and Jerry recommends he get a better lawyer.\nBobby listens to the tape found in Leo's boot and finds evidence of Ben's deal with Leo to set fire to the mill. He makes a copy of the tape to take to Ben. Leo breaks something and Bobby tells Shelly he has business ambitions.\nNorma's mother, Vivian, visits her at the diner and eats a bite off of Toad's plate. She introduces Norma to her new husband, Ernie Niles, who leaves her a betting tip when they leave for the Great Northern Hotel.\nGerard shakes himself awake and asks his nurse for water. An officer walks in to check on him, and Gerard beats him over the head, then escapes out a window.\nHank enters the diner and Norma says he is 48 hours late. Vivian helps in the back and Hank tries to explain his business and Norma softens. Vivian greets Hank and they all agree to have dinner together.\nPete visits Harry at the office while Harry watches a woodpecker through his binoculars. Pete tells Harry that Josie is gone and that he loved her. Harry tells Pete about her assistant, Mr. Lee, whom Pete supposes to be Jonathan, who was introduced to Pete as Josie's cousin. Cooper reports that Gerard is missing, and had knocked the deputy out. Andy enters to find Lucy watering the plants and carrying a baby, causing him to faint.\nPete visits Ben in his cell and plays a tape of Catherine's voice. She says she will testify on his behalf in exchange for his signing over the Ghostwood Estates. Ben throws around the furniture in his cell.\nLeland drives in his convertible, singing and swerving. Cooper and Harry pull him over. Leland says he remembers that he and Ben were working late the night Laura died and that Ben stepped out of the room to have an angry phone conversation about a \"dairy.\" Cooper surmises he must mean a diary. Harry answers Lucy on the police radio. Leland offers to show Cooper his new clubs, but Harry says that they have found Gerard, so Cooper leaves. Leland adjusts his rear view mirror and BOB smiles at him.\nGwen tells Andy about her history with fainting while he tries to tell Lucy about his new sperm test. However, Lucy does not confirm that Andy is the father.\nThe officers have Gerard in the same room as Ben and he says that Ben is not BOB. Jerry insists that they either charge Ben or let him go, so the sheriff charges him with the murder. Cooper pulls Harry aside and tells him that he does not believe Ben killed Laura.\nNorma, Hank, Vivian, and Ernie finish dinner. Norma and Vivian leave for the restroom and Hank and Ernie catch up, having previously met in prison, unbeknownst to their wives. Ernie says he met Vivian at a Republican fundraiser, and that she wants him to handle all her investments. Ernie says he is clean now, and that Vivian does not know his history. Hank asks to meet with Ernie later. The women come back and Hank toasts the success of the newlyweds.\nCooper makes a voice note saying he is close to cracking the case. He grabs his gun to answer a knock at the door: it's Audrey, who asks if Ben did it, saying that her father is ashamed of her. Cooper stops her from saying something about One Eyed Jacks and answers the phone. He leaves and tells Audrey to go to her room and lock the door.\nCooper arrives at a crime scene with Sheriff Truman as a forensic team pulls Maddy's body out of a plastic bag.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Tojamura & Catherine Martell (voice)\nAlso Starring\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nChris Mulkey as Hank Jennings\nDavid Patrick Kelly as Jerry Horne\nJames Booth as Ernie Niles\nKathleen Wilhoite as Gwen\nJane Greer as Vivian Smythe Niles\nCo-Starring\nAl Strobel as Phillip Michael Gerard\nEmily Fincher as Louise Dombrowski\nUtility Stunts\nMichael Allen Lerner\nJohn Moio\nMario Roberts\nUncredited\nDave Bean as Sheriff's Deputy \nFrank Silva as BOB"}