{"name": "Episode_5", "url": "https://twinpeaks.fandom.com/wiki/Episode_5", "text": "Episode 5\nNot to be confused with Part 5.\n\"Episode 5,\" also known as \"Cooper's Dreams,\" is the sixth episode of the first season of Twin Peaks.\nPlot\n\"I play my part on life's stage. I tell what I can to form the perfect answer. But that answer cannot come before all are ready to hear, so I tell what I can to form the perfect answer. Sometimes my anger at the fire is evident. Sometimes it is not anger, really – it may appear as such, but could it be a clue? The fire I speak of is not a kind fire.\"\n ―Margaret Lanterman\nMen sing and clap, disturbing the sleep of Agent Cooper, who makes a voice note to Diane that he has been awakened at 4 AM and asks her to send him earplugs.\nCooper enters the dining room as the singing continues and the waitress tells him the men are a business junket from Iceland. Audrey offers to help Cooper with his case, but he tells her to go to school, then asks how old she is, learning that she is eighteen. Cooper leaves as Jerry hugs a loud man.\nBenjamin smokes a cigar in his office and Jerry enters. Benjamin says all the guests have complained about the men from Iceland, and Jerry says they are excited about the Ghostwood Development Project. Ben says he is throwing a gala reception for the Icelandic investors and suggests a visit to One Eyed Jacks. Leland enters and offers his help with the new investment group and breaks down crying.\nThe police search Jacques' apartment. Jacques had worked at the lumber mill until he gained weight, then he started tending bar. Harry reports that no one has seen Jacques for two days and that it looks like Bernie jumped bail. Doctor Will Hayward reports that the blood on the shirt is the wrong type to be Laura Palmer's, but it might be Jacques'. There is a copy of Flesh World attached to the ceiling. The magazine is a clearinghouse, a middle man between readers and advertisers. Jacques had represented a transvestite, and there was a picture of Leo Johnson's truck on a bookmarked page.\nShelly and Bobby sit down for breakfast and joke about how they will stand up to Leo. Bobby hides as Andy comes to the door. Shelly talks with Andy about Leo, Laura, and Jacques, and promises to call as soon as Leo gets back home. Bobby praises her performance, then Leo calls to ask if anyone has looked for him. Bobby slips the gun into her hands, and she looks at it as she tells Leo she misses him.\nBig Ed meets Norma at his gas station while Nadine is meeting a patent attorney for her silent drape runners. Norma says that Hank will be returning, Big Ed says that Nadine is not well, and Norma tells Ed not to call her.\nAudrey has an interview with Emory Battis, the manager of Horne's Department Store. She refuses to start in the wrapping department and instead asks to start in perfumes. She blackmails Battis into consenting.\nDonna meets James in a gazebo. James says that his father did not die when he was 10, but was a musician and ran away. He says that his mom is an alcoholic and promiscuous writer. He tells Donna that he does not want any secrets between them.\nThe officers and a forensic team go through Jacques' apartment and discover that he managed correspondence for another advertiser in the magazine: Laura. Her photograph is in front of red drapes, much like those in the cabin in Jacques' photograph. Cooper says to pack up to look through the woods.\nMaddy enters the diner and meets James and Donna. Donna swears Maddy to secrecy and they ask her to look for Laura's secret hiding place. She agrees, and they leave. Hank sits at the next table, having heard their conversation.\nNorma and Shelly enter the diner with their hair and make-up done. Hank greets Norma and says he will try to earn his way back into Norma's heart and she tells him to start by washing dishes. Invitation to Love is on television: Montana beats up Chet as Jared watches.\nBobby's parents talk about his behavior problems with Doctor Jacoby. He asks Bobby if he has been using drugs. He says no, but he has been drinking. Bobby says that his father has killed people. Jacoby asks Bobby's parents to leave so that he can talk to him privately. Jacoby asks Bobby if he cried the first time he and Laura made love and if Laura laughed at him. Bobby says that Laura wanted to die, that she told him so. She told him that people were sick and rotten. Jacoby asks if Laura had a terrible secret, and says that she wanted to corrupt people. Bobby admits that Laura made him sell drugs.\nThe officers walk through the woods and a raven watches them. Hawk tracks a path to a cabin, but Cooper says it is the wrong cabin. Harry advises Doctor Hayward to hang back. The Log Lady greets them on the porch and she offers them tea and cookies. She says the owls will not see them inside. She says her log saw something significant. She says that her husband was a lumberman and that he had met the devil and Harry says this occurred the day after the wedding. She interprets the log: it saw two men and two girls and heard some screaming.\nThe men go farther through the woods and find the cabin from the picture. They sneak up on it: a record player is playing \"Into the Night\" on vinyl, making Cooper remark that \"there is always music in the air\" and they find Waldo in a bird cage. Some twine is on the floor along with a bloodstain. A poker chip rolls out of the cuckoo clock: it is missing a piece of the same shape as was found in Laura's stomach.\nThe Martells enter the gala for the men from Iceland. Major Briggs chats and Jerry flirts with Heba. Leland looks around. As Benjamin tells jokes, Catherine pours her champagne on his foot and he tells her to meet him in his office.\nAudrey enters her secret passage and eavesdrops. Catherine confronts Ben about the poker chip and she slaps him, then they kiss. He says he will give Josie one more chance to sell, but he has retained the services of a professional.\nJerry gives a speech and is interrupted by some music. Leland cries out and starts dancing, Catherine joining him by Ben's command and Ben tells Jerry to get Leland out of his life. Everyone starts dancing, imitating Leland's breakdown. Audrey watches and cries.\nJosie smokes in Ben's office.\nMadeleine creeps through the house and calls Donna. She says she has found a tape in a secret hiding place.\nBenjamin enters his office and turns on a light. Josie says no one saw her come in. Josie found the second book in Catherine's desk where he said it would be. Ben tells Josie they can proceed tomorrow night.\nShelly lights a cigarette at the stove and Leo drives up in an old truck. He pulls two cans of gasoline out of a shed, then Hank attacks him and warns him not to compete. Leo walks in his house, dirty and bloody, and pushes Shelly to the ground, telling her to get him a beer. She pulls the gun on him, but he doubts that she would pull the trigger. She shoots him and the ceiling light swings back and forth as he retreats.\nCooper walks down the hallway to the sound of men singing and notices the door to his room is ajar. He enters with his gun drawn and finds Audrey naked in his bed, crying. She asks him to not make her leave.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson\nRuss Tamblyn as Dr. Jacoby\nGuest Starring\nChris Mulkey as Hank Jennings\nDavid Patrick Kelly as Jerry Horne\nDon Davis as Maj. Garland Briggs\nCharlotte Stewart as Betty Briggs\nDon Amendolia as Emory Battis\nFeaturing\nCatherine E. Coulson as The Log Lady\nJill Rogosheske as Trudy\nBrian Straub as Einar Thorson\nMary Stavin as Heba\n\"INVITATION TO LOVE\"\nLance Davis as Chet Weems\nRick Giolito as Montana\nPeter Michael Goetz as Jared\nStunt Player\nMichael Allen Lerner\nUncredited\nJulee Cruise as the Roadhouse Singer (voice)\nGrace Zabriskie as Sarah Palmer (voice)\nScott Frost as Icelandic businessman\nUnknown performer as \"no Georgia peach\"\nUnknown performer as Gary\nUnknown performer as Scott\nNotes\nTimeline: March 1, Wednesday\nA fly can be seen on Cooper's tea cup in the whole shot of the Log Lady's testimony\nShooting script differences\nThe script states the Invitation to Love section to be silent, but in the video releases of the episode, it is not. There, Montana's line to Chet can be clearly heard: \"Chester, you little Froot Loop, you’re done – done!\""}