{"name": "Episode_17", "url": "https://twinpeaks.fandom.com/wiki/Episode_17", "text": "Episode 17\nNot to be confused with Part 17.\n\"Episode 17\", or, \"Dispute Between Brothers\" is the tenth episode of the second season of Twin Peaks and the eighteenth episode overall.\nPlot\n\"Complications set in--yes, complications. How many times have we heard: 'it's simple'. Nothing is simple. We live in a world where nothing is simple. Each day, just when we think we have a handle on things, suddenly some new element is introduced and everything is complicated once again.What is the secret? What is the secret to simplicity, to the pure and simple life? Are our appetites, our desires undermining us? Is the cart in front of the horse?\"\n ―Margaret Lanterman\nDoctor Hayward checks on Sarah, who refuses a sedative, saying she needs to be present at the funeral. Cooper tells Sarah that Leland fell prey to dark forces, that he did not commit the crimes. Sarah remembers her vision of BOB. Cooper says that Leland had drugged Sarah to keep his secrecy and tells Sarah about Leland's death. Cooper offers to drive her to Leland's funeral.\nPeople spread a potluck on a table. Many have gathered for Leland's wake. Nadine wears a shiny dress and buckled shoes. Hank hands Sarah a plate as she chats with Eileen Hayward and Audrey. Donna tells Big Ed that James thinks the town's devastation is his fault, though Ed tells her James will return. Doctor Jacoby greets the police officers and Cooper notes that he might take a few weeks' vacation. Nadine asks Ed if people can see her underwear in the reflection from her shoes and Sarah tells of Donna and Laura's childhood pledge to be best friends forever. Harry and Ed break up a fight between Dwayne and Dougie Milford. Pete explains to Cooper about the ongoing feud between the two brothers and that Dougie is engaged to a beautiful teenage girl.\nEd and Jacoby ask the high school assistant principal to let Nadine attend classes.\nCooper packs his bags and Audrey asks whether he is leaving and about his romantic history. He confesses that he hurt someone who was a witness to a federal crime, and he and his partner, Windom Earle, let her die and Windom lost his mind. Audrey warns him that one day she will be grown up, and then he will have to watch out.\nBobby tries on one of Leo's suits as he gets ready to meet with Benjamin Horne. Shelly asks for Bobby to take her out of the house and he reassures her that if he gets the job, he will take good care of her.\nCatherine meets Harry in his office and says she believes an angel saved her life. She says the night of the fire, she was afraid for the first time in her life and she stumbled upon her old summer cabin in the woods in the dark: only a guardian angel could have led her there. She ate canned food and waited for her assassin.\nDick Tremayne visits Lucy, wanting someone more important than himself to care for and looks forward to fatherhood. Andy says they should all be friends, and Lucy tries to kiss him. Hawk berates him for the action he took in the situation. Cooper bids Harry a farewell and Harry gives him a special lure and a Bookhouse Boys badge. Cooper bids farewell to Hawk, Andy, and Lucy. Royal Canadian Mounted Police Officer Preston King escorts Special Agent Roger Hardy into the stationhouse. Hardy tells Cooper that he is suspended from the FBI. \nRoger explains that he is in Internal Affairs and that there are allegations against Cooper's behavior in Canada and his methods.\nBobby waits outside Ben's office and Audrey taunts his suit, then gets him in the office. Two bodyguards drag Bobby out of the office.\nRoger interrogates Cooper about the arrest and death of Jacques Renault, then about the rescue of Audrey Horne. King reveals that he had been setting up a sting operation for six months, and that cocaine is missing. Roger says that the DEA has been brought in to investigate, and that Cooper has 24 hours to assemble a defense. Roger has Cooper surrender his gun and badge and they ask Harry for his cooperation. However, he refuses, stating that Cooper is the finest lawman he has ever known.\nNadine tries out for the cheerleading squad and throws a male cheerleader into the air.\nShelly brushes Leo's teeth and Bobby says that the meeting with Horne went well. Shelly asks to put Leo in a nursing home. Leo moves.\nAfter Norma reads a bad review for the Double R Diner in the paper, her mother reveals herself to be the enigmatic critic. She says the diner is not a good restaurant and Norma asks her to leave.\nHank and Ernie horse around in One Eyed Jacks, Ernie saying he will not steal his wife's money. Jean interrupts their argument and explains that he needs $125,000 immediately. Ernie brags that he is hard-wired into the drug industry and King enters with a briefcase full of cocaine. Ernie says he will take care of it, but is reluctant to gamble. King takes a package of the cocaine to plant in Cooper's car.\nHarry sleeps and awakens to see a shadow creeping outside his window. Josie falls into his door when he opens it. She is dirty and sobbing.\nCooper talks with Major Briggs about the morality of his actions and the presence of BOB. Briggs asks if Cooper has heard of the White Lodge. Cooper excuses himself to urinate in the woods. An owl hoots and stares down at Cooper. A bright light flashes, and Major Briggs disappears.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nChris Mulkey as Hank Jennings\nIan Buchanan as Dick Tremayne\nJames Booth as Ernie Niles\nJane Greer as Vivian Smythe Niles\nClarence Williams III as FBI Agent Roger Hardy\nGavan O'Herlihy as RCMP Officer Preston King\nWendy Robie as Nadine Hurley\nTony Jay as Dougie Milford\nDon Davis as Maj. Garland Briggs\nMary Jo Deschanel as Eileen Hayward\nDon Calfa as Vice Principal Greege\nMichael Parks as Jean Renault\nFeaturing\nJohn Boylan as Mayor Dwayne Milford\nLisa Cloud as P. E. Teacher\nTiffany Muxlow as Cheerleader\nSusan Sundholm as Samantha\nUtility Stunts\nRichie Giona\nRobert Keller\nRandy Lamb\nBirgit K. Scheir\nBob Yerkes\nNotes\n\nShooting script differences\nIn the script, during their discussion in the woods, Briggs talks in length about fear and love. While not stated in the script, this might be relevant to the fact that these emotions are the key to the Lodges."}