{"name": "Episode_14", "url": "https://twinpeaks.fandom.com/wiki/Episode_14", "text": "Episode 14\nNot to be confused with Part 14.\n\"Episode 14\", or, \"Lonely Souls\" is the seventh episode of the second season of Twin Peaks, and the fifteenth episode overall.\nPlot\n\"A poem as lovely as a tree.As the night wind blows, the boughs move to and fro; the rustling, the magic rustling that brings on the dark dream. The dream of suffering and pain; pain for the victim, pain for the inflicter of pain – a circle of pain, a circle of suffering.Woe to ones who behold the pale horse.\"\n ―Margaret Lanterman\nHarry tells the officers that everything is set to go at the Great Northern. The one-armed man repeats his description of the large house, made of wood, surrounded by trees, the house is filled with many rooms, each alike, but occupied by different souls night after night. Cooper sends Hawk to investigate the pages from the diary found near the train tracks and the diary that Donna told him about. Gordon is leaving for secret business in Oregon.\nMike looks at each hotel guest and employee and says \"No.\" He has a seizure as Ben interrupts them.\nA police car with the siren blaring speeds down a road. Harold's home is trashed. Hawk enters after knocking and receiving no answer. Harold's body is dangling from his greenhouse rafters.\n \nLouis Armstrong introduces \"Wonderful World\" on a record in the Palmers' home. Maddy sits with Leland and Sarah and tells them she feels it's time to go back to her job and apartment.\nThe police forensic team and officers investigate Harold's home. He left a suicide note saying, in French, \"I am a lonely soul.\" Hawk finds Laura Palmer's secret diary ripped to shreds.\nBobby, Shelly, and Leo sit at the table going over the bills. After all of the payments are made they have $42 left over from Leo's insurance. Shelly tells Bobby to take the necklace back. The police have seized the truck. Leo cries out, and Shelly and Bobby scream. Leo says \"new shoes.\" Bobby sends Shelly to find a receipt for a pair of Leo's shoes she took to get cleaned.\nAudrey tells Ben that she knows about One Eyed Jacks. She reminds him about Prudence and the white mask. He confesses he's owned One Eyed Jacks for five years, knew that Laura worked there, and that he slept with her. When Audrey asks if he killed her, he says he loved her.\nShelly returns to the diner and cries when she tells Norma she has to quit. Nadine and Big Ed enter. Nadine still believes she is in high school, and accidentally crushes a glass in her hands.\nBobby and his friend Mike enter the Johnson home. Bobby has Leo's old boots and tries to get Leo to react. Bobby finds a tape hidden in the heel of the boot.\nCooper makes a note for Diane while examining Laura Palmer's secret diary, which has been reconstructed. There are repeated references to BOB, with descriptions of abuse and molestation. He is referred to as a friend of her father's. An entry says she will tell the world about Ben Horne one day. Audrey enters and tells Cooper that Ben was sleeping with Laura, and that Ben owns One Eyed Jacks. Cooper asks Audrey not to repeat this to anyone. Cooper tells Harry they need a warrant for the arrest of Benjamin Horne.\nBen tells Tojamura that Jerry has investigated his company and that they have approved his proposal. He is about to sign Tojamura's contract when the police officers enter and request that Ben accompany them for questioning regarding the murder of Laura Palmer. Ben tells them to leave, and Hawk and Andy grab and cuff him.\nA record spins blankly at the Palmers' home. Sarah crawls down the stairs, moaning for Leland.\nThe officers take Ben to a holding cell. The Log Lady is waiting for them. She says there are owls in The Road House.\nPete turns toward a sound in his house. Tojamura stalks in the hallway and kisses Pete. He takes off his disguise: it's Catherine.\n \nSarah crawls through the living room. She has a vision of a white horse in the living room before passing out. Behind her, Leland adjusts his tie in the mirror.\nA blonde performs on stage at the roadhouse. Donna and James sit at a booth. James says the death of Harold Smith was not anybody's fault. The log lady leads Cooper and Harry into the roadhouse. James tells Donna that Maddy is leaving. Sailors drink at the bar, as does Bobby. Cooper has a vision of the performing band disappearing, replaced by the Giant, who says, \"It is happening again.\"\nLeland smiles at himself in the mirror. BOB smiles back. Leland puts on a pair of latex gloves. Maddy shouts that something smells like it's burning. She enters the living room, sees Sarah on the floor, and flees at the sight of Leland. BOB/Leland pulls her back into the room, chokes her, and beats her unconscious. Then he picks her up and spins her around while continually changing form, kissing her face and sobbing Laura's name. He suddenly smashes her head against a picture frame and then pushes a letter under her fingernail.\nCooper and The Giant stare at each other. The Giant disappears and the band re-appears. The senile room service man walks over to Cooper and then to Bobby, saying he is sorry to either. Bobby visibly despairs; so does James, holding Donna as she bursts into tears. Cooper looks around thoughtfully.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran (credit only)\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nSheryl Lee as Maddy Ferguson\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nWendy Robie as Nadine Hurley\nAl Strobel as Phillip Michael Gerard\nDavid Lynch as FBI Regional Bureau Chief Gordon Cole\nFumio Yamaguchi as Mr. Tojamura\nGary Hershberger as Mike Nelson\nCo-Starring\nCatherine E. Coulson as The Log Lady\nJulee Cruise as Singer\nCarel Struycken as Giant\nHank Worden as Waiter\nUncredited\nDave Bean as Sheriff's Deputy \nKellie Lumb as USO Girl \nChris Morrissey as Barfly \nFrank Silva as BOB\nunknown performer as Lady with the Shaking Hand\nNotes\nOriginally, the spot on the carpet Maddy saw turn bloody in \"Episode 8\" was to appear in this episode and turn into a vision of BOB laughing. However, the idea was vetoed by Mark Frost, who felt it was \"too dumb.\"\nLenny von Dohlen suggested the night before the discovery of Harold's body was to shoot that instead of seeing him hanging, viewers would hear the sound of hissing gas and the camera would reveal all of his orchids were slumped over, with Harold's body lying nearby. David Lynch, knowing they had already built the rafter from which Harold was supposed to hang, left a message on Dohlen's voicemail: \"Lenny, never come up with a great idea the night before a shoot!\"\nWhen Twin Peaks was rerun on the Bravo cable network in 1993, at the exact moment the killer begins strangling Maddy, the \"Bravo\" logo appeared on the screen as if applauding Maddy's murder.\nDavid Patrick Kelly has confirmed that a person who resembles Jerry that appears during Julee Cruise's concert is not him.\nProduction errors\nWhen Nadine and Ed enter the Double R, the camera bumps into something on its right and bounces left.\nDeleted scenes\nThe scene with Leland/BOB killing Maddy was alternatively filmed with Ben Horne as the murderer. This was done in order to disseminate rumors to the public that Horne indeed was the killer. However, this footage has never been released."}