{"name": "Episode_11", "url": "https://twinpeaks.fandom.com/wiki/Episode_11", "text": "Episode 11\nNot to be confused with Part 11.\n\"Episode 11\", or, \"Laura's Secret Diary\" is the fourth episode of the second season of Twin Peaks, and the twelfth episode of the series as a whole. It originally aired October 20, 1990.\nPlot\n\"Miscommunication sometimes leads to arguments, and arguments sometimes lead to fights. Anger is usually present in arguments and fights. Anger is an emotion, usually classified as a negative emotion. Negative emotions can cause severe problems in our environment and to the health of our body.Happiness, usually classified as a positive emotion, can bring good health to our body, and spread positive vibrations into our environment. Sometimes when we are ill, we are not on our best behavior. By ill, I mean any of the following: physically ill, emotionally ill, mentally ill, and/or spiritually ill.\"\n ―Margaret Lanterman\nHarry shakes Leland out of a daze and interrogates him about his visit to the hospital. Leland believed that Jacques killed Laura because he had been arrested and confesses that he killed Jacques.\nWalking down the hallway, Doctor Hayward tells Cooper that no parent should bury their child and Cooper asks if he approves of Leland's actions. Andy asks Doctor Hayward about his sperm and Hayward gives him a vial to fill. On his way, Andy bumps into Lucy while carrying a copy of Flesh World.\nHarry tells Cooper that the judge will arrive that day and reports that the county records show no one by the name of Robertson living in the white house, but they have a current address for the last occupants. Andy drops his sperm vial and when he bends over to pick it up. Cooper asks about his boots, which he bought from the one-armed man.\nA hotel employee tells Ben that the travel writer M. T. Wentz will be visiting Twin Peaks, so Ben tells her that he wants hourly updates from registration. Jean waits in Ben's office, then shows the video of the bound Audrey. Jean explains that he is just the messenger and that the business is being run by pickpockets and fools, then he offers his assistance. He explains that he wants Cooper to bring the ransom in cash and tells Ben to expect a call at noon the next day. Ben orders an assistant to find Agent Cooper for him.\nDonna picks up a tray from the Double R Diner and Hank compliments her. Norma tells Hank about M. T. Wentz. This news excites Hank, who leaves to pick up flowers, tablecloths, and candles and tells her to ask Big Ed to recommend their diner to any unfamiliar motorists.\nDonna and Harold drink white wine and toast to Laura. Harold reads from Laura's diary. Donna suggests they give the diary to the sheriff, but Harold insists that there are no solutions in it and that Laura gave it to him. Harold then says that people from the outside tell him their stories.\nCooper watches Audrey's video in Ben's office. Ben says that Cooper and Audrey had a special relationship, and asks Cooper to deliver the $125k.\nJosie returns home with many shopping bags and apologizes for disappearing. Pete informs her that Catherine died in the fire, but although they have yet to find the body, he says they will have the service in a few days.\nEmory drags the drugged Audrey into Blackie's office, where Jean waits. She tells him that Emory hit her and Jean tells her that she will be fine as long as she is with Jean. He shoots Emory and hugs the sobbing Audrey.\nAndy approaches Lucy, who yells at him about the magazine, so Cooper dismisses Andy and asks Lucy to tell him what has been upsetting her. She explains her history with Andy and Dick, but she has no idea what she wants. After Lucy leaves, Harry says they have been down this road before. Cooper then asks Harry confidentially for a Bookhouse Boy.\nA stranger enters the Double R Diner after Norma has tried to make the restaurant seem fancy. When the man goes to the bathroom, Hank steals his wallet.\nMaddy and Donna meet in a booth and Donna insists that she is not angry over Maddy's relationship with James and asks for her help retrieving Laura's diary from Harold.\nHank searches the stranger's wallet to find that he is not M.T. Wentz, but District Attorney Daryl Lodwick.\nHarry meets Josie at her living room and she shows him a scandalous new dress. She says she left town because she was afraid and rebukes Harry for his suspicions. She has Harry tear her shawl and make love to her. An Asian man watches through the window.\nJudge Sternwood enters the stationhouse and gives Lucy a hug. Harry enters, and the judge asks what his lady trouble is. Harry introduces Cooper to the judge and Dick offers Lucy enough cash to get an abortion. Upset by this, she tells him to leave and Andy hears her crying.\nThe judge talks to Leland and tells him that they will raise a glass together in Valhalla. The prosecutor has not arrived, so Leland will spend the night in jail. Sternwood's beautiful law clerk picks him up to take him to the Winnebago.\nBen greets contestants for a beauty contest and the hotel clerk checks in a mysterious stranger.\nJosie introduces the Asian man to Pete as her cousin Jonathan. When Pete leaves, Jonathan tells Josie that her business is almost done, and she is expected back in Hong Kong.\nCooper meets Harry at the roadhouse. Harry says he is the Bookhouse Boy Cooper was expecting.\nThere is a knock on the diner door. Hank answers, but no one is there. The lights go out, and Jonathan is standing in the middle of the room. He fights Hank and holds his hand as a blood brother. He says next time, he will take Hank's head off, then smashes Hank's flashlight.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson (credit only)\nDana Ashbrook as Bobby Briggs (credit only)\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nAlso Starring\nHarry Goaz as Deputy Andy Brennan\nSheryl Lee as Maddy Ferguson\nGuest Starring\nChris Mulkey as Hank Jennings\nIan Buchanan as Dick Tremayne\nLenny Von Dohlen as Harold Smith\nRoyal Dano as Judge Clinton Sternwood\nDon Amendolia as Emory Battis\nFumio Yamaguchi as Mr. Tojamura\nRitch Brinkley as D.A. Daryl Lodwick\nMichael Parks as Jean Renault\nFeaturing\nBellina Logan as Desk Clerk\nClaire Stansfield as Sid\nMak Takano as Jonathan\nMichael Allen Lerner as Stunt Double\nUncredited\nKevin Young as Toad\nUnknown performer as Deputy Bob\nNotes\nTimeline: March 6, Monday"}