{"name": "Episode_26", "url": "https://twinpeaks.fandom.com/wiki/Episode_26", "text": "Episode 26\n\"Episode 26\", or, \"Variations on Relations\" is the nineteenth episode of the second season of Twin Peaks, and the twenty-seventh episode of the series as a whole. It originally aired April 11, 1991.\nPlot\n\"Pie. Whoever invented the pie? Here was a great person. In Twin Peaks, we specialize in cherry pie and huckleberry pie. We do have many other types of pie, and at the Double R Diner, Norma knows how to make them all better than anyone I have ever known.I hope Norma likes me. I know I like her and respect her. I have spit my pitch gum out of my mouth onto her walls and floors and sometimes onto her booths. Sometimes I get angry and do things I'm not proud of. I do love Norma's pies. I love pie with coffee.\"\n ―Margaret Lanterman\nThe lawmen enter Owl Cave and notice that someone had been there since their last visit and determine that it was Windom Earle. Cooper has Andy draw the petroglyph and Harry call Major Briggs.\nEarle tells a story of the Black and White Lodges to Leo and Rusty Tomasky, a youth to whom he promised beer and a party.\nPete makes a poem about Josie as he figures out the next chess move. Catherine requests his help to open the box from Thomas Eckhardt. Pete figures that it is a puzzle box.\nBobby tries to convince Shelly to enter the Miss Twin Peaks Contest, saying that beautiful people have easier lives. Dwayne and Lana have breakfast and Lana tells him she wants to win the contest and requests him to guarantee this. Cooper enters the diner and puts in an order for him and the lawmen, then invites Annie to go on a nature study with him. Shelly then recites the poem given to her, Donna, and Audrey, and Cooper takes the paper copy. Annie serves his order and he leaves.\nCooper has Hawk receive the section of the poem given to Donna, then Leo's arrest report.\nBriggs observes Andy drawing the petroglyph on the conference room blackboard, correcting some lines. Cooper requests the assistance of Briggs with the case at hand, asking for information on Earle's activity with Project Blue Book. Briggs agrees on the grounds that the information will prevent future loss of life, and says that he has seen the petroglyph before. Hawk brings Leo's arrest report, matching his handwriting with the poem.\nDick, with his nose bandaged, approaches Ben, wishing to see Audrey to discuss his wine-tasting event, but is directed to the concierge. Ben then says the business will pay medical expenses for Dick's nose.\nAfter constructing a papier-mâché pawn around Rusty, Earle gives Rusty a beer. Earle gets out a crossbow and commands Leo to give him an arrow, which he uses to kill Rusty.\nThe Miss Twin Peaks Judging and Rules Committee (Will Hayward, Dwayne Milford, and Pete Martell) are addressed by Ben, who wishes to have the year's speeches be on the subject of conservation of the forests. Lana enters the contest, with Shelly, Donna, and Nadine in line. Bobby expresses his worried thoughts about Mike's interest in Nadine. Mike whispers the secret of Nadine's sexual maturity and superhuman strength, which profoundly impresses Bobby.\nHarry speaks with Catherine, requesting to know Josie's reasons for the things she did, wishing to understand. Catherine tells him her beliefs that Josie never really showed her true self to anyone. She asks for Harry's help with the puzzle box, but he too is unsure how it opens. Pete enters and drops the box, which opens it, but it is found to contain a smaller puzzle box.\nDale and Annie go on their nature study and talk about their respective troubled pasts. He told her that he could understand her pain and they share a kiss. Windom Earle spies on them, disguised as a fisherman.\nDick hosts a wine-tasting event for the Stop Ghostwood campaign. Lucy and Lana help him pour the wine. Andy displays his knowledge of white wines and sparkling wines and also swallows some of the wine when told to spit.\nGordon tells a \"war story\" to Shelly at the diner. They have pie with Dale and Annie and he shares a kiss with Shelly before he leaves town, just before Bobby enters, confused with the situation.\nBack at the wine tasting, Lana displays her expertise in wine. Lucy becomes offended with Dick's behavior and spits some wine on him.\nCooper has a drink by the Great Northern's fireplace. Jack joins him and they talk about their respective romances. Jack is brought a telegram that makes him decide to check out of the hotel.\nAt the Haywards, Donna asks her mother about her association with Ben Horne, which she says is because of charities. Donna's parents try to drop the subject.\nAt the park's gazebo, a wooden box is found, apparently from Windom Earle. It is believed to be a bomb, but when the box is pulled open, the pawn containing Rusty Tomasky is revealed.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne (credit only)\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings (credit only)\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nKenneth Welsh as Windom Earle\nGuest Starring\nBilly Zane as John Justice Wheeler\nIan Buchanan as Dick Tremayne\nHeather Graham as Annie Blackburn\nRobyn Lively as Lana Budding Milford\nDavid Lynch as FBI Regional Bureau Chief Gordon Cole\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nGary Hershberger as Mike Nelson\nMary Jo Deschanel as Eileen Hayward\nFeaturing\nJohn Boylan as Mayor Dwayne Milford\nTed Raimi as Heavy Metal Youth\nJohn Charles Sheehan as Bellman\nBehind the scenes\nThis the last episode with unit publicist Paula K. Shimatsu-U, leaving further episodes with very little official photography."}