{"name": "Episode_19", "url": "https://twinpeaks.fandom.com/wiki/Episode_19", "text": "Episode 19\n\"Episode 19\", or, \"The Black Widow\" is the twelfth episode of the second season of Twin Peaks and the twentieth episode overall.\nPlot\n\"Is a dog man’s best friend? I had a dog. The dog was large. It ate my garden, all the plants, and much earth. The dog ate so much earth it died. Its body went back to the earth. I have a memory of this dog. The memory is all that I have left of my dog. He was black and white.\"\n ―Margaret Lanterman\nBobby enters Ben's office to find the furniture stacked in a bizarre pile as Ben sits in a corner. Bobby asks for a job and Ben tells him to follow and photograph Hank Jennings. Lana Milford runs shrieking down the hallway.\nAt the stationhouse, Cooper meets with Irene Littlehorse, a realtor, about cottages on the lake and he says he wants to visit Dead Dog Farm. Dick visits Lucy and meets with Andy and a case worker about Nicky. The case worker says that Nicky has been surrounded by trouble his whole life, that he has been in several homes, and that his parents died under mysterious circumstances. Harry takes Andy to the Great Northern.\nDougie is dead. Hayward says it looks like a heart attack. Milford is surrounded by books on sexual performance and a box of toys and Dwayne enters and weeps. He scolds Lana on his way out and Lana tells Hawk about her history with men having tragic accidents when she was intimate with them.\nThe wrestling coach delivers a rallying speech to his wrestling team about accepting different players and introduces Nadine. She and Mike Nelson fight as she begs him to go out with her.\nMike complains to Donna about Nadine and her crush on him.\nMalcolm introduces himself to James as Evelyn's brother, saying that he works for her and her husband. He says that Jeffrey beats Evelyn once every week or two, and no one can stop him.\nCooper and Irene visit the lake house and she shares a legend that the best people and the worst people are drawn to a dead dog because they can feel its pain. She says no one has looked at the property in the last year, but Cooper finds tracks from three vehicles. The door is open: Cooper believes there has been a meeting there in the past few hours. There is baby laxative in the sink, and cocaine on a chair. Cooper says they will notify the sheriff.\nDick sits on the road reading directions for changing a flat tire as Nicky plays with the controls. The car falls off the jack, and Nicky runs to hug Dick and asks him not to die.\nHarry introduces Cooper to Colonel Reilly, who is heading the investigation into Major Briggs' disappearance. Cooper says that he heard an owl before Briggs disappeared and Reilly explains that the message for Cooper that Briggs delivered originated in nearby woods, not in deep space. He is not sure where the message was sent to and says that Briggs' disappearance has major implications for national security.\nJames starts the Jaguar's engine and Evelyn gets in the car with him. James asks if she is afraid of her husband, and kisses her. Jeffrey arrives home.\nAt the hotel, Audrey teases Bobby about his new job and suggests they do business together and enters her secret hallway. Ben sets up a model of Gettysburg and is pleased with Bobby's compromising pictures of Hank.\nPete and Catherine pop a bottle of champagne and Pete quotes a poem. Catherine instructs Josie on her duties as their maid.\nCooper has his chess response to Earle printed in the personal column of the paper. Earle responded a day before the paper went out, anticipating Cooper's move. Audrey visits him in his room with Bobby's envelope and Denise enters. Audrey kisses Cooper on her way out. Cooper shows Denise the photographs of Jean, Hank, Ernie, and King. Cooper gives Denise a sample of the cocaine he found in Dead Dog Farm.\nAt the Double R Diner, Big Ed tells Norma he feels like life happened in spite of his plans, and he does not like the way it turned out. Hank sees them holding hands.\nDick returns to the stationhouse and tells Andy that he thinks Nicky is the devil.\nHarry meets with Dwayne and Hayward tells Dwayne that Dougie died of natural causes: no foul play. However, Dwayne says he wants to press charges, that Lana killed Dougie with sex. Dwayne insists that she will not get any of Dougie's money. Hawk tries to comfort Lana, and the men gather around to admire her and recite a line from Romeo and Juliet. Lucy answers the phone for Harry, but he does not respond, because he, like the other men present at the station, are transfixed by Lana, who tells them titillating stories and drinks milk.\nErnie eats wings in the diner and Denise joins him and shows him the photos along with her DEA badge. Ernie delivers a confession to Cooper and Denise, pleading his love for his wife.\nJames lies awake listening to Jeffrey shouting and glass crashing. Malcolm tells him they have been living like that for four years, and that one day he will kill Jeffrey.\nBetty Briggs sits alone in the dark waiting for Bobby. The room is lit by a large white ceramic owl lamp and intermittent lightning strikes. Bobby reassures her that the Major will return. Bobby tells Betty about the Major's dream and Briggs returns after being missing for two days, wearing an aviator cap, and asks for a strong cocktail.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson (credit only)\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nGuest Starring\nIan Buchanan as Dick Tremayne\nJames Booth as Ernie Niles\nDavid Duchovny as DEA Agent Dennis / Denise Bryson\nRobyn Lively as Lana Budding Milford\nTony Burton as Colonel Calvin Reilly\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nCharlotte Stewart as Betty Briggs\nTony Jay as Dougie Milford\nGary Hershberger as Mike Nelson\nAnnette McCarthy as Evelyn Marsh\nNicholas Love as Malcolm Sloan\nRon Taylor as Coach Buck Wingate\nCo-Starring\nJohn Apicella as Jeffrey Marsh\nJohn Boylan as Mayor Milford\nJoshua Harris as Nicky\nGeraldine Keams as Irene Littlehorse\nMolly Shannon as Judy Swain\nJohn Epstein as Utility Stunt\nCrew\nCreated by Mark Frost & David Lynch\nMusic Composed & Conducted by Angelo Badalamenti\nProducer: Harley Peyton\nSupervising Producer: Gregg Fienberg\nWritten by Harley Peyton & Robert Engels\nDirected by Caleb Deschanel\nExecutive Producers\nMark Frost\nDavid Lynch\nCo-Producer: Robert Engels\nCo-Producer: Robert D. Simon\nAssociate Producer: Philip Neel\nDirector of Photography: Frank Byers\nProduction Designer: Richard Hoover\nEditor: Paul Trejo\nCoordinating Producer: Tim Harbert\nPost Production Supervisor: John Wentworth\nOriginal & Series Casting by Johanna Ray, C. S. A.\nProduction Manager: Gregg Fienberg\nUnit Production Manager: Robert D. Simon\nFirst Assistant Director: Christopher T. Gerrity\n2nd Assistant Director: Deepak Nayar\n2nd 2nd Assistant Director: Randy Barbee\nProduction Controller: Nowell B. Grossman\nProduction Accountant: Connie Dolph\nSupervising Coordinator: Joseph Montrone\nProduction Coordinator: Sabrina S. Nathanson\nProduction Secretary: Lauren McAuliffe\nScript Supervisor: Cori Glazer\nCamera Operator: Lex Du Pont\n1st Assistant Camera: Billy Brao\n2nd Assistant Camera: Rick Drapkin\nSet Decorator: Kerry Oaksmith\nConstruction Coordinator: Keith Cox\nProperty Master: Jeffery Moore\nProperty Assistant: Richard Robinson\nLead Painter: Dave Robinson\nCostume Designer: Sara Markowitz\nCostume Supervisor: Laurie L. Hudson\nMake-up: Carla Roseto Fabrizi\nHair: Annette E. Fabrizi\nMake-up/Hair Assistant: Linda A. Vallejo\nGaffer: Robert Ferrara\nKey Grip: Irv Katz\nSound Mixer: Don Summer, C.A.S.\nArt Department Coordinator: Jula Bell\nTransportation Coordinator: Steve Boyd\nTransportation Captain: Greg Van Dyke\nLocation Liaison: Barry Gremillion\nCasting Associate: Elaine J. Huzzar\nUnit Publicist: Paula K. Shimatsu-U.\nAssistant to David Lynch: Debby Trutnik\nAssistant to Mark Frost: Kim L. Wilson\nAssistant to Gregg Fienberg: Emily Fincher\nWriters Assistant: Lori Tulli-Mitchell\nMusic Editor: Lori L. Eschler\nSupervising Sound Editor: Richard Taylor\nSound Editors\nPatrick McCormick\nRichard F. Davis\nTom de Gorter\nRe-recording Mixers\nGary Alexander\nAdam Jenkins\nOrchestrations: Angelo Badalamenti\nSynthesizer: Kinny Landrum\nAssistant Film Editor: Terilyn Shropshire\nAssistant Music Editor: Rick Woods\nPost Production Coordinator: Elizabeth Fox\nPost Production Associate: Chris Brown\nApprentice Film Editors\nBambi Sickafoose\nBob Allen\nLogging Vehicles provided by WHITEGMC Trucks & Whit-Log Trailers\nExtras Casting: Superior Casting, Inc.\nTitles & Opticals by Pacific Title\nColor by de luxe (R)\nTelecine and Electronic Post Production: Encore Video\nTelecine Colorist: Drew Marsh\nPost Production Sound & Sound Effects by TODD-AO/Glen Glenn Studios \nLenses and Panaflex (R) Camera by Panavision (R)\nDolby Surround (TM)\nNotes\n\nProduction errors\nDougie Milford's corpse is seen blinking its eyes.\nWhen Dick reads the car manual for his BMW, the Volvo \"V\" logo can be seen on the hubcap on the leftmost image."}