{"name": "Episode_2", "url": "https://twinpeaks.fandom.com/wiki/Episode_2", "text": "Episode 2\nNot to be confused with Part 2.\n\"Episode 2\" or \"Zen, or the Skill to Catch a Killer\" is the third episode of the first season of Twin Peaks. It originally aired April 19, 1990.\nPlot\n\"Sometimes ideas, like men, jump up and say, 'Hello!' They introduce themselves, these ideas, with words – are they words? These ideas speak so strangely.All that we see in this world is based on someone's ideas. Some ideas are destructive, some are constructive. Some ideas can arrive in the form of a dream. I can say it again: Some ideas arrive in the form of a dream.\"\n ―Margaret Lanterman\nThe Horne family sits at the dinner table in silence until Jerry enters, returning from his trip to Paris, bringing brie and butter baguettes to share with Ben. After quite enjoying the sandwich, Ben takes Jerry aside to tell him about Laura's murder and the Norwegian businessmen leaving the hotel. He also notes that there is a new girl at One Eyed Jacks, and that one of the brothers was \"first in line,\" so they take a boat to the brothel.\nDonna's parents go to bed, leaving her and James alone.\nBen and Jerry arrive at One Eyed Jacks and order drinks. The madame, Blackie O'Reilly, brings out the girls and the Horne brothers toss a coin for the new girl. Ben wins, so Jerry has a drink with Blackie.\nJames insists to Donna that their relationship is not wrong, believing that they would have still ended up together if Laura had not died, citing that he had feelings for her before.\nCooper returns to his room at the Great Northern and receives a phone call from Deputy Hawk, who informs him that Ronette has recently quit her job at Horne's Department Store and that he saw a one-armed man at the hospital. After he hangs up, Cooper is delivered a note that reads, \"Jack with One Eye.\"\nBobby and Mike go out to the woods to pick up a supply of cocaine from Leo. However, not all of the expected supply is there and Leo is present along with another man. They discuss the money situation, and Leo states his suspicion that Shelly is cheating on him. He tells them to \"go out for a pass\" and throws the football onto the hood of the car Bobby and Mike took to the woods.\nWith greasy hands, Ed goes inside his home as Nadine exercises. He accidentally trips on one of her drape runners, upsetting her to the point where she bends her exercise machine.\nCooper has the Twin Peaks Sheriff's Department set up a bottle 60 feet and 6 inches away from Lucy. Hawk questions why, but Sheriff Truman does not know.\nShelly turns off her television that is playing Invitation to Love, then there is a knock on her door. She is hesitant to let Bobby inside, as she had clearly been beaten by Leo. However, he gets inside and upon seeing her, he promises that he will kill Leo if he abuses her again.\nEd goes to the Double R Diner and orders a cup of coffee from Norma, telling her about his trouble with Nadine earlier.\nLucy serves the lawmen some coffee and Cooper presented them the \"Tibetan method,\" which entailed him throwing stones at a bottle for each name starting with a 'J.' This narrowed down his suspicion to Leo Johnson and Lawrence Jacoby. He was also informed that the \"Jack with One Eye\" probably referred to One Eyed Jacks.\nAudrey goes to the Double R Diner, where she talks to Donna, revealing the crush she has on Agent Cooper. She also asks if Laura ever spoke of her father, then begins to dance.\nCooper and Truman examine a bloodied rag found near the crime scene as Agent Albert Rosenfield arrives with his team. Immediately, there is friction between Rosenfield and Truman due to the former's dissatisfaction with the small town's investigation abilities.\nEd returns home and an overjoyed Nadine tells him that he had gotten grease on her cotton balls, creating the silent drape runner she had been trying to achieve.\nAt the Blue Pine Lodge, Pete and Catherine discuss Agent Cooper's presence at their home earlier in the day. When Catherine is briefly away, Pete slips to Josie a key to the safe containing the mill's ledger. Josie gets into the safe and finds that there are two ledger books.\nA distressed Leland puts on a record and picks up a photo of Laura. He turns around in circles with it, screaming until Sarah comes in, distressed. She tries to take the picture from him and they end up breaking the frame. Leland smears his blood on the photograph.\nCooper goes to bed and has a dream of the One-Armed Man (who identifies himself as Mike), and a long-haired man called BOB. He then appears older, sat inside a red room with a dancing little man and Laura Palmer. While the dwarf dances, Laura whispers the name of her killer into Cooper's ear. He wakes up and calls Sheriff Truman, telling him that he knows who killed Laura Palmer, but that the information could wait until morning.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Laura Palmer\nRuss Tamblyn as Dr. Jacoby (credit only)\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nDavid Patrick Kelly as Jerry Horne\nMiguel Ferrer as FBI Agent Albert Rosenfield\nVictoria Catlin as Blackie O'Reilly\nWendy Robie as Nadine Hurley\nKimmy Robertson as Lucy Moran\nJan D'Arcy as Sylvia Horne\nMary Jo Deschanel as Eileen Hayward\nGary Hershberger as Mike Nelson\nFeaturing\nMichael J. Anderson as Man From Another Place\nRobert Bauer as Johnny Horne\nKim Lentz as Bartender\nFrank Silva as Killer Bob\nCharlie Spradling as Swabbie\nAl Strobel as One Armed Man\nUncredited\nJill Engels as Trudy Chelgren\nDon LaFontaine as Invitation to Love's announcer \nClay Wilcox as Bernard Renault\nConnie Woods as \"New Girl\"\nunknown performer as Albert's assistant #1\nunknown performer as Albert's assistant #2\nProduction staff\nCreated by Mark Frost and David Lynch\nMusic Composed and Conducted by Angelo Badalamenti\nProduced by Gregg Fienberg\nWritten by Mark Frost and David Lynch\nDirected by David Lynch\nExecutive Producers\nMark Frost\nDavid Lynch\nAssociate Producer Phillip Neel\nDirector of Photography Frank Byers\nProduction Designer Richard Hoover\nEditor Jonathon P. Shaw\nOriginal & Series Casting by Johanna Ray, C. S. A.\nDream Sequence\nDirector of Photography Ron Garcia\nProduction Designer and Costume Designer Patricia Norris\nProduction Manager Gregg Fienberg\nUnit Production Manager Robert D. Simon\n1st Assistant Director Scott Cameron\n2nd Assistant Directors\nChristopher T. Gerrity\nDeepak Nayar\nProduction Supervisor Tim Harbert\n1st Assistant Camera Rudy Fenenga, Jr.\n2nd Assistant Camera Beth Cotter\nArt Director Okowita\nSet Decorator Brian Kasch\nConstruction Coordinator Keith Cox\nProperty Master Dave Robinson\nCostume Designer Sara Markowitz\nCostume Supervisor Laurie L. Hudson\nMake-up Carla Roseto Fabrizi\nHair Annette E. Fabrizi\nMake-up/Hair Assistant Linda A. Vallejo\nGaffer Robert Ferrara\nKey Grip Joseph A. Kelly\nSound Mixer Walter Hoylman\nBoom Operator Walter Charles Gorey\nTransportation Coordinator Steve Boyd\nTransportation Captain Gregg van Dyke\nLocation Manager Steve Share\nCasting Assistant Elaine J. Huzzar\nProduction Controller Nowell B. Grossman\nProduction Coordinator Joseph Montrone\nProduction Secretary Lori Tulli-Mitchell\nScript Supervisor Jane Goldsmith\nOrchestrations Angelo Badalamenti\nAssistant to Mark Frost: Paula K. Shimatsu-U.\nAssistant to David Lynch: Debby Trutnik\nAssistant to Gregg Fienberg: Suzanne Hargrove\nPost-Production Assistant Chris Brown\nPost-Production Coordinator John Wentworth\nMusic Editor Lori L. Eschler\nAssistant Music Editor Alexis Seymour\nAssistant Editor\nKen Blackwell\nPamela Reisenleiter\nSupervising Sound Editor Matthew Sawelson\nSound Effects Editor John Haeny\nRe-recording Mixers\nGary Alexander\nAdam Jenkins\nAssorted Wardrobe provided by\nThe Greif Companies\nSheplers\nExtras Casting Superior Casting, Inc.\nMarine Coordination by Motion Picture Marine\nTitles and Opticals by Pacific Title\nColor by de luxe (R)\nTelecine and Electronic Post Production: Encore Video\nTelecine Colorist: Drew Marsh\nPost Production Sound and Sound Effects provided by TODD-AO/Glen Glenn Studios\nNotes\nThis episode opens on the night of Saturday, February 25 and goes through the night of Sunday, February 26.\nShooting script differences\nDeleted the scene with Jerry doing an Indian dance to Audrey to Johnny\nThe script uses \"Emerald\" as the name of Invitation to Love's Jade"}