{"name": "Episode_3", "url": "https://twinpeaks.fandom.com/wiki/Episode_3", "text": "Episode 3\nNot to be confused with Part 3.\n\"Episode 3\", also known as \"Rest in Pain,\" is the fourth episode of the first season of Twin Peaks.\nPlot\n\"There is a sadness in this world, for we are ignorant of many things. Yes – we are ignorant of many beautiful things. Things like the truth. So sadness in our ignorance is very real. The tears are real. What is this thing called a tear? There are even tiny ducts – tear ducts – to produce these tears should the sadness occur.Then the day when the sadness comes. Then we ask, 'Will the sadness that makes me cry, will the sadness that makes me cry my heart out, will it ever end?' The answer, of course, is yes. One day, the sadness will end.\"\n ―Margaret Lanterman\nAt the Great Northern, Audrey watches Cooper walk down the hallway towards her. She greets him by the fireplace. He asks her to join him for breakfast and he asks her to write her name on a piece of paper, then compares her handwriting to the note he received under his door. She says she wanted to help him, for Laura. He asks what One Eyed Jacks is, and she explains it vaguely. He does some handwriting analysis, then dismisses Audrey when he sees Sheriff Harry Truman and Lucy.\nThey sit down, and Cooper orders breakfast. When the waitress leaves, Cooper shares his dream with them and admits that he forgot who killed Laura Palmer. \"Break the code, solve the crime.\" The \"Fire, walk with me\" slogan is part of the dream. Harry gets a radio message that there is a fight at the morgue.\nAlbert and Doctor Hayward argue over whether to release Laura Palmer's body for the funeral. Albert insults everyone and Harry punches him, causing him to land on top of the body. Cooper orders Albert to release the body, and the men leave. Cooper stays behind and arranges the body.\nLeland watches Invitation to Love as a nurse gives him a shot. The doorbell rings. A young woman—who is identical to Laura, aside for her glasses and hair color—calls him \"Uncle Leland.\" He asks \"Madeleine?\" and then walks to her. She gives her condolences, and they hug.\nAt the Double R, Norma discusses her husband's good behavior in prison and that he might be released soon. Hank's parole officer, Wilson Mooney asks how she fends off potential suitors, and she says that she explains that her husband is homicidally jealous.\nCooper and the sheriff visit Leo Johnson at his home. Harry explains that they have not caught Leo in anything illegal and they question him about his relationship with Laura Palmer. Cooper lists off Leo's criminal record and asks where he was the night of the murder. He says he called his wife, Shelly, from Butte, Montana.\nBobby, in a suit, stretches in front of a crucifix. His father asks to talk. The major lectures about funerals and responsibility while Bobby plays with his lighter. The major says Bobby does not need to be afraid, and Bobby shouts until his mother, Betty Briggs, enters and asks if everyone is ready to go.\nAt the station, Deputy Hawk reports that he has been unable to find the one-armed man and Cooper tells him to keep trying. Cooper and Harry meet with Albert to receive his report. Laura Palmer had cocaine in her system and in her diary, she had been tied up on two separate occasions that night, and it looks like the killer kissed Laura after she was dead. There were also claw marks on her shoulder and something in her stomach. Harry excuses himself to attend the funeral. Albert hands Cooper a report concerning the assault on his person and Cooper lectures Albert on the locals' value of life, and refuses to sign Albert's report. Cooper makes a voice note to Diane about purchasing property in Twin Peaks.\nEd inspects the tchotchkes on his shelf. His wife, Nadine, runs up and embraces him and she gushes about the previous night and talks about their time in high school. James comes in and says he will not attend the funeral.\nAudrey eavesdrops briefly at the office, then enters a secret passage to spy on her brother and Doctor Jacoby.\nReverend Clarence Brocklehurst reads a passage of scripture at the funeral. Cooper watches all the people there, especially Bobby. James walks over and watches from a distance. Johnny Horne shouts \"Amen!\" then Bobby yells the same. Bobby says that the town is full of hypocrites and they knew she was in trouble but did not interfere, so everyone is responsible for her death. James and Bobby fight. Bobby points at James and says \"You're a dead man.\" Leland jumps onto the coffin, and the crane raises and lowers him. Sarah tells him not to ruin this too.\nAt the diner, Shelly entertains customers by telling them about Leland's outburst. Big Ed warns Harry and Deputy Hawk that he is skeptical about trusting him, as he is not one of them. Cooper enters the diner and joins them and orders a slice of pie. Upon seeing Ed and Norma interact, he asks how long Ed has been in love with her. Harry then tells Cooper about a drug-running operation they are trying to bust. Harry tells Cooper that there is an evil in the woods and the men are part of a secret society to fight that evil.\nThe men go to the Bookhouse, and Harry says they have been meeting there for 20 years. James and another young man, Joey Paulson, have Bernard Renault — janitor at the Roadhouse — bound and gagged. They captured him after he came across the border that morning with an ounce of cocaine. He denies being a mule and says the cocaine was for personal use. His brother, Jacques, is a bartender at the Roadhouse and Bernard tells them to talk to his brother, and Cooper says he does not believe that Bernard would tell them where and when to find Jacques.\nJacques walks toward the roadhouse, sees a red beacon flashing on the roof, and runs away.\nLeo is in his kitchen scraping at a shoe with a knife and the phone rings. Jacques is on the other end, demanding that Leo get him out. Shelly walks in and Leo leaves. Shelly pulls a gun out of her purse and hides it with the bloody shirt.\nHarry visits Josie, who says something horrible is going to happen, that Catherine and Benjamin want to hurt her. Catherine eavesdrops over the intercom. Josie shows Harry the hidden safe, with the two ledgers with different numbers, but one is missing. Catherine holds the second book and hides it in a drawer with a hidden compartment. Pete walks in to ask about his tackle box. Catherine tells Pete to ask to her face to look in her safe.\nCooper watches the new grave and Doctor Jacoby, wearing a hat and cloak, approaches with a garland of flowers. Cooper says he did not see Doctor Jacoby at the funeral. The psychiatrist admits that he does not actually care about the problems of the townspeople, but Laura changed all that.\nJosie asks Harry if it is possible that someone killed her husband so that Benjamin could have the land and asks if they will kill her too. Harry reassures her.\nCooper and Deputy Hawk sit in the hotel while people dance, discussing the existence of the soul. Leland stands among the dancers, smelling the air. Leland tries to get someone to dance with him and has a breakdown. Cooper and Hawk pull him up and take him home.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson / Laura Palmer\nRuss Tamblyn as Dr. Jacoby\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nMiguel Ferrer as FBI Agent Albert Rosenfield\nWalter Oklewicz as Jacques Renault\nRoyce D. Applegate as Rev. Clarence Brocklehurst\nJed Mills as Wilson Mooney\nWendy Robie as Nadine Hurley\nKimmy Robertson as Lucy Moran\nGary Hershberger as Mike Nelson\nDon Davis as Maj. Garland Briggs\nCharlotte Stewart as Betty Briggs\nFeaturing\nRobert Bauer as Johnny Horne\nCatherine E. Coulson as The Log Lady\nJill Rogosheske as Trudy\nBrett Vadset as Joey Paulson\nClay Wilcox as Bernard Renault\n\"INVITATION TO LOVE\"\nErika Anderson as Emerald / Jade\nLance Davis as Chet Weems\nPeter Michael Goetz as Jared\nUncredited\nJan D'Arcy as Sylvia Horne (voice)\nRick Giolito as Montana (segment 'Invitation To Love')\nDon LaFontaine as Invitation to Love's announcer \nunknown performer as Leland Palmer's nurse\nNotes\nTimeline: February 27, Monday\nThe episode was to originally to feature a scene in which Cooper visits the graveyard and meets an elderly groundskeeper, who recites a long speech telling Cooper that if he puts his ear to the ground, he can hear those who are buried singing, due to their coffins expanding. The scene was cut due to problems casting the groundskeeper.\nProduction errors\nA shot of Audrey at the funeral is mirrored, showing her mole on a different side.\nMartin Padley's name is wrongly subtitled \"Martin Hadley\""}