{"name": "Episode_22", "url": "https://twinpeaks.fandom.com/wiki/Episode_22", "text": "Episode 22\n\"Episode 22\", or, \"Slaves and Masters\" is the fifteenth episode of the second season of Twin Peaks, and the twenty-third episode of the series as a whole. It originally aired February 9, 1991.\nPlot\n\"A death mask. Is there a reason for a death mask? It is barely a physical resemblance--in death, the muscles so relaxed, the face so without the animating spark. A death mask is almost an intrusion on a beautiful memory. And yet, who could throw away the casting of a loved one? Who would not want to study it longingly, as the distance freight train blows its mournful tone?\"\n ―Margaret Lanterman\nMalcolm Sloan and Evelyn Marsh speak to the police about James Hurley, pointing the finger at him for the murder of Evelyn's husband, Jeffrey.\nDonna Hayward and James arrive at Wallies Hideout, the latter insisting his innocence. Donna suggests they stay on the move to avoid the police, though James believes Evelyn would help them. Donna calls Ed for advice.\nBobby Briggs and Shelly Johnson speak to Sheriff Truman and Agent Cooper about an attack by Leo Johnson the previous night. Bobby confirms to them that he and Shelly are having an affair and Hank Jennings had shot Leo just weeks prior. Albert Rosenfield arrives as the couple leaves, on direct orders from Gordon Cole, who is \"worried about Coop\" with the present danger of Windom Earle. He presents a map of where Earle has sent packages containing articles of clothing Caroline Earle wore on hers and Windom's wedding night.\nLeo wakes to Windom playing a bamboo flute and Earle reads off Johnson's criminal record. Leo tries to leave, but Earle takes him as a pawn, placing a shock collar on him and feeding him gruel.\nEd Hurley and Norma Jennings lay in bed, discussing their troubled relationship with each other, particularly regretting the Christmases where they could not be together. However, they also discuss their hopeful future. Nadine then enters with a trophy for second place at the wrestling district finals. Nadine apologizes to Norma for beating up Hank, then starts to leave, but stops and tells the couple that it is fine with her that they are together, as she has also been seeing Mike Nelson.\nCooper and Truman question Josie Packard about the murder of Jonathan Kumagai. However, she will not speak of her involvement. As Cooper gets more coffee, Pete Martell arrives with Josie's dry cleaning. He hands it over to Cooper to answer the phone, and Cooper takes a fiber sample from one of Josie's coats. Josie answers the phone, Thomas Eckhardt on the other end. Catherine interrupts, welcoming Eckhardt to Twin Peaks.\nBelieving himself to be General Lee, Benjamin Horne muses about his experiences to Johnny and his employees. Doctor Jacoby had believed that his exposure to the public would help him return to normal, but finds that it does not. Jerry tells Audrey that they should take advantage of Ben's situation for business purposes. Audrey requests Jacoby \"bring back\" her father.\nDonna approaches Evelyn at Wallies Hideout, asking why she has framed James for murder. Malcolm shows up and threatens Donna to stay uninvolved.\nAlbert compares fibers found outside Cooper's room after his shooting and the ones Cooper extracted from Josie's coat and presents the likelihood of her guilt in Jonathan's murder. Cooper requests Albert to say nothing to Harry until they are sure of her guilt.\nHarry tells Cooper that the murder victim was Erik Powell, whose surname was that of Caroline. Cooper tells Harry about Earle's method of using chess, explaining that whenever he takes a piece from the board, somebody is killed. They decide to employ a local expert at chess.\nAt the Double R Diner, Pete wins three concurrent chess games against Toad, Cooper, and Doctor Hayward. He agrees to help out with the investigation. Shelly comes to the diner and asks Norma for her job back, which Norma approves with no hesitation, happy to have her back. Harry then speaks privately with Norma, telling her that Hank will be in prison for a long time due to his various parole violations.\nThomas Eckhardt arrives at the Blue Pine Lodge to dine with Catherine, discussing his rivalry with Andrew Packard. He reveals that he arranged to have him killed because of his obsession with Josie.\nJames returns to the Marsh home, asking Evelyn why she had him framed. She says that she did it for money and out of fear, but says that she also had a genuine attraction for James, which appears to be mutual. However, Malcolm incapacitates James, planning to kill James, making up a story to go along with it.\nBen, Audrey, Jerry, Bobby, and Jacoby re-enact the surrender at Appomattox. However, in their version of the re-enactment, General Grant—played by Jacoby—surrenders. Ben collapses, and when he comes to, he believes that the Civil War re-enactment was a dream.\nEarle puts on a disguise as he has Leo transcribe a message to be given to Donna, Shelly, and Audrey.\nMalcolm tries to convince Evelyn to get her prints on the gun he plans to kill James with. Donna then arrives, pleading for James' life. As Malcolm demands the gun from her, Evelyn shoots him, then mutters the true story behind his and Jeffrey's deaths.\nCooper looks at a photo of Caroline as Earle passes behind him, delivering a message for Audrey to the hotel's front desk. Dale goes to his room, where he finds a death mask of Caroline along with a tape-recorded message from Windom.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran (credit only)\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nKenneth Welsh as Windom Earle\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nDavid Patrick Kelly as Jerry Horne\nMiguel Ferrer as FBI Agent Albert Rosenfield\nWendy Robie as Nadine Hurley\nAnnette McCarthy as Evelyn Marsh\nNicholas Love as Malcolm Sloan\nDavid Warner as Thomas Eckhardt\nCo-Starring\nBrenda Strong as Jones\nRobert Bauer as Johnny\nMatt Battaglia as Cop\nGerald L'Ecuyer as Bartender\nUncredited\nKevin Young as Toad"}