{"name": "Episode_7", "url": "https://twinpeaks.fandom.com/wiki/Episode_7", "text": "Episode 7\nNot to be confused with Part 7.\n\"Episode 7\", also known as \"The Last Evening\", is the first season finale of Twin Peaks.\nPlot\n\"A drunken man walks in a way that is quite impossible for a sober man to imitate, and vice versa. An evil man has a way, no matter how clever. To the trained eye, his way will show itself.Am I being too secretive? No. One can never answer questions at the wrong moment. Life, like music, has a rhythm. This particular song will end with three sharp sounds, like deathly drumbeats.\"\n ―Margaret Lanterman\nDonna and James enter Jacoby's home. They ask each other where to start looking and find a box full of margarita umbrellas, all labeled. Donna finds the controls for the ambient noise and James quickly turns it off. Donna finds the coconut that Laura mentioned in her tape, and it contains a tape and half a heart necklace. Bobby watches James and Donna pull away.\nJacoby creeps around the bushes towards Maddy. A man in a balaclava and a trenchcoat beats him mercilessly. Jacoby cannot move or cry out and suffers a heart attack.\nA wheel spins on a craps table. Big Ed has lost another bet and Cooper wins again, and a woman whispers in his ear. Cooper tips Jacques the poker chip missing a corner.\nAudrey, dressed in lingerie by a hunchbacked seamstress, visits Blackie's office. Blackie says the owner will visit that night, and asks her to pick a card spread across the table. Audrey picks the Queen of Diamonds card and Blackie puts her hand over Audrey's hand.\nCooper talks to Jacques about his business with Leo and instructs Jacques to meet him at the water processing plant in two hours. Jacques then tells how the bit of the poker chip got into Laura's stomach: Leo had made her bite down on it when the bird was attacking her, telling her: \"Bite the bullet, baby! Bite the bullet!\"\nAudrey waits alone in a room.\nShelly washes her hair in the sink with the gun next to her. Leo sneaks up behind her and grabs her mouth.\nOn their stake-out, Andy tells Harry that Lucy still has not talked to him. Jacques pulls into the plant and is surrounded by cops. Jacques steals Deputy Fred's gun and attempts to escape but Andy shoots him in the shoulder.\nJames, Donna, and Maddy listen to the tape from Jacoby's coconut. Laura insults James and talks about how Leo is trying to kill her, but that gets her off. Doctor Hayward leaves and tells Donna to check on her mother. James and Donna embrace and James tells Madeleine that Jacoby was trying to help Laura, and Donna asks how he got the necklace.\nAt the lumbermill, Leo unloads his gas after tying Shelly up inside. He winds up a bomb and tells Shelly she has one hour to think about her behavior, and that he will kill Bobby.\nNadine wears a beautiful silk dress and puts a note on a tray before pouring a lot of pills into a bowl.\nHank counts money into a suitcase. He thanks Josie for the $90k, and tells her it seems light. Hank talks about how his time is now worth more than $90k. Josie insists that they had an agreement. Hank surprises her with a blood handshake.\nCatherine looks through the accounting office for the ledger and workers watch her and Pete fight through the blinds. Catherine asks Pete to have pity on her.\nAt the stationhouse, the officers tell stories about the arrest. Lucy is impressed, and Andy kisses her before she confesses that she is pregnant. Andy walks away in silence. Lucy answers the phone: Bobby, impersonating Leo, tells her to tell Harry to check out James.\nAt the hospital, Cooper and Harry interrogate Jacques. He says that Leo had hit him with a whiskey bottle, and he had passed out. When he came to, Leo and the girls were gone.\nDoctor Hayward says that Doctor Jacoby is stable.\nCooper says that Leo must have taken both of the girls to the train car himself and Hayward reports that Jacoby saw Laura Palmer at the park.\nCatherine and Pete look through the shelves, but cannot find the book. Over the phone, Hank anonymously tells Catherine that the book is in the shed. Catherine gets ready to meet him, and packs a gun.\nHank talks to Norma about his time in the joint, trying to charm her. He reminds her that they have been together 20 years.\nBig Ed returns home and finds Nadine on the living room floor and he phones an ambulance.\nLucy gives Harry the message from \"Leo.\" She says she heard a clock striking in the background, like the clock at the park and Cooper instructs Hawk to set up a perimeter around Easter park. James approaches Harry and Cooper asks to talk to James instead. Leland enters and asks Harry if he has found the killer. Hayward tells Leland to go home to Sarah. James gives Cooper a copy of the tape and Cooper asks James about Jacoby seeing Laura. Cooper shows James the ziplock bag of cocaine and asks why it was in his bike.\nThe Icelandic investor Einar Thorson prepares to sign Ben's contract in Blackie's office. Hank calls Ben to tell him that Leo Johnson will get a house call, and to black flag the firebug.\nBobby enters the Johnson house. Leo goes after Bobby with an ax. Just as he is about to strike the final blow, Hank shoots him. Bobby leaves, as Jared and Chet embrace each other on Invitation to Love while Montana dies.\nShelly struggles in her bonds and Catherine approaches her with a gun. The bomb explodes, and a fire spreads. Catherine releases Shelly, and they run out.\nA fire alarm goes off in the hospital and Leland tapes Jacques to his bed and smothers him to death with a pillow.\nPete asks Decker if anyone is in the mill and says he will check inside for Catherine.\nBenjamin signs the contract redacted by the Honorable M.J. Kaffee Esquire. The Icelandic investor leaves with two girls and Ben says he will celebrate with \"the new girl.\"\nBen enters Audrey's room, where she is dressed as the Queen of Diamonds and is shocked to see her father.\nCooper walks down the hallway to his room while making a recording for Diane, noting that the Icelanders were gone. He phones the hotel staff for a glass of milk and finds Audrey's note on the floor. Cooper answers the door and is shot three times.\nDeleted scene\nIn a deleted scene entitled \"Jerry's Wandering Eye,\" Jerry sits with Heba, who accuses him of infidelity. A girl at the brothel who passes by catches his eye.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson / Laura Palmer\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nChris Mulkey as Hank Jennings\nWalter Olkewicz as Jacques Renault\nVictoria Catlin as Blackie O'Reilly\nWendy Robie as Nadine Hurley\nKimmy Robertson as Lucy Moran\nFeaturing\nCharles Hoyes as Decker\nBrian Straub as Einar Thorson\n\"INVITATION TO LOVE\"\nLance Davis as Chet Weems\nRick Giolito as Montana\nPeter Michael Goetz as Jared\nStunt Utility\nFred Lerner\nStunt Players\nLinda Fetters\nDonna Keegan\nMichael Allen Lerner\nRock Walker\nUncredited\nLesli Linka Glatter as Seamstress\nMark Frost as Cooper's shooter\nUnknown performer as Deputy Fred\nUnknown performer as Lawrence Jacoby's attacker\nNotes\nThis episode opens immediately after the end of Episode 6 still on the night of Thursday, March 2 and proceeds through the night into the wee hours of Friday, March 3.\nWhile never identified onscreen, Mark Frost stated Jacoby's attacker to be Leland Palmer while possessed by BOB.\nProduction errors\nAfter Jacques drinks one of his two beer, a shot still shows him having his two untouched.\nShooting script differences\nEileen Hayward appears in the original script."}