{"name": "Episode_24", "url": "https://twinpeaks.fandom.com/wiki/Episode_24", "text": "Episode 24\n\"Episode 24\", or, \"Wounds and Scars\" is the seventeenth episode of the second season of Twin Peaks, and the twenty-fifth episode of the series as a whole. It originally aired March 28, 1991.\nPlot\n\"Sometimes, well let’s say all times, things are changing.We are judged as human beings on how we treat our fellow human beings. How do you treat your fellow human beings?At night, just before sleep, as you lay by yourself in the dark, how do you feel about yourself? Are you proud of your behavior? Are you ashamed of your behavior?You know in your heart if you have hurt someone, you know. If you have hurt someone, don’t wait another day before making things right. The world could break apart with sadness in the meantime.\"\n ―Margaret Lanterman\nHarry drinks in the Bookhouse, reflecting on memories of Josie. Hawk brings him a special breakfast from Norma. Harry asks how things are at the station, where Cooper and the other lawmen have taken charge and given full attention to the chess game. Hawk leaves and Harry pours another drink.\nAnnie Blackburn arrives at the Double R Diner and is introduced by her sister to Shelly Johnson. She requests no charity from her sister. Major Briggs calls his pie \"compelling\" as Shelly gives him his bill. The Log Lady notices the marking on his neck.\nHawk reports Harry's condition to Cooper and they discuss the unusual circumstances of Josie Packard's death, her body only weighing 65 pounds.\nLeo brings Earle a pair of slippers, a pipe, and a newspaper as Earle comments on life out in the country. He examines the newspaper for Cooper's next move in their game, which he interprets as a trick, finding that he is going for a stalemate and is receiving help. This infuriates Earle and he plays his bamboo flute.\nAudrey and Dick discuss the Stop Ghostwood campaign's fashion show as well as Tim Pinkle's association with the event. Audrey and Jack then plan to go on a picnic together.\nCooper goes to Harry and tells him about Josie's criminal past. The sheriff commands him to leave the Bookhouse.\nEckhardt's assistant, Jones visits Catherine. They discuss the burial plans for Eckhardt and Jones gives Catherine a puzzle box from Eckhardt.\nEarle visits Donna in disguise as her father's friend Doctor Gerald Craig. She welcomes him inside and he soon leaves her with a gift for her father.\nPete uses various chessboards to figure out the stalemate game to lose no pieces, but has found no way without losing at least six. Andy and Lucy also play a game of chess and have a small argument over Andy not realizing that the knight must move with the \"hook thing.\" Major Briggs and the Log Lady arrive at the station.\nThey discuss with Cooper their respective markings they received from their respective disappearances, Margaret's having occurred when she was seven years old. She notes that she heard the call of an owl during this experience, and heard the same when her husband died.\nJack sings to Audrey on their picnic and she expresses the belief that nobody truly knows her, but he expresses his interest in her.\nDoctor and Eileen Hayward arrive home from the grocery store. Donna tells them about Craig's visit, which they say to be impossible, as Craig had died years ago. Eileen calls the number that Earle left, learning that it was for a cemetery. Doctor Hayward opens the gift, finding Earle's next chess move, which he leaves to go deliver to Cooper.\nDoctor Jacoby, Ed, and Nadine discuss a divorce, which is not clear to Nadine, as she does not understand that they are legally married. She then realizes that she is blind in her left eye.\nBen comes to visit Eileen, with Donna watching their quiet discussion, but cannot hear them.\nNorma examines a flyer for the Miss Twin Peaks Contest and urges Shelly to compete in it, but she dismisses the notion. Earle, disguised as a biker, compliments her, also urging her to enter in the competition. He spots Cooper, who then first meets Annie, finding an immediate interest in her. Annie pours Cooper a cup of coffee, during which he notices a scar on her wrist. He tries the coffee, telling her she made it \"just right.\" Earle then leaves as Hawk arrives, telling Cooper that there is a problem at the Bookhouse.\nCooper and Hawk go to the Bookhouse, where Andy is waiting after Harry has thrown around nearly every piece of furniture in a drunken rage. Cooper urges Harry to hand over his gun. Harry refuses and begins to speak about how Josie managed to improve everything in his life and his regrets in not taking her away. Dale embraces Harry, bringing him to a calmness. Dale and Hawk then put Harry to bed.\nNadine and Mike then book a room at the Great Northern Hotel as \"Mr. and Mrs. Hinkman\" as the Stop Ghostwood fashion show begins. Dick hosts as Lucy and Andy model clothing. Catherine visits Ben at the bar, amused at his attempt against the Ghostwood campaign, not convinced that he has made a change in his values. Tim Pinkle then presents the pine weasel, which bites Dick on the nose. This causes chaos, ending up with Audrey falling into Jack's arms and they share a kiss.\nJones goes to the Bookhouse, where she incapacitates a Bookhouse Boy and joins Harry in bed.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs (credit only)\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nKenneth Welsh as Windom Earle\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nBilly Zane as John Justice Wheeler\nIan Buchanan as Dick Tremayne\nHeather Graham as Annie Blackburn\nDavid L. Lander as Tim Pinkle\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nGary Hershberger as Mike Nelson\nCatherine E. Coulson as The Log Lady\nMary Jo Deschanel as Eileen Hayward\nCo-Starring\nBrenda Strong as Jones\nRon Blair as Randy St. Croix\nJulie Hayek as Model\nBetsy Lynn George as Teen Model\nShooting script differences\nThe script implies even more than the episode that Tim made the pine weasel bite Dick on purpose."}