{"name": "Episode_6", "url": "https://twinpeaks.fandom.com/wiki/Episode_6", "text": "Episode 6\nNot to be confused with Part 6.\n\"Episode 6\", also known as \"Realization Time,\" is the seventh episode of the first season of Twin Peaks.\nPlot\n\"Beauty is in the eye of the beholder. Yet there are those who open many eyes. 'Eyes are the mirror of the soul,' someone has said, so we look closely at the eyes to see the nature of the soul. Sometimes when we see the eyes – those horrible times when we see the eyes – eyes that have no soul, then we know a darkness. Then we wonder: where is the beauty? There is none, if the eyes are soulless.\"\n ―Margaret Lanterman\nCooper gently rejects Audrey's advances, stating that while she is very desirable, she needs a friend more than anything. He says he will get food, she will put on her clothes, and then she will tell him all her troubles. She says that Laura had a lot of secrets.\nAndy enters the station house. He tries to talk to Lucy, but she brushes him off to talk privately on the phone with her doctor.\nCooper enters, blowing the whistle he whittled, and speaks to Lucy, who was out sick the previous day. Doctor Hayward and Harry study Waldo the bird and Hayward says it will start talking once it is healthy. Hawk hands a file to Cooper. The forensics report states that Laura Palmer, Ronette Pulaski, and Leo Johnson all visited Jacques' cabin and there is a picture of Waldo on Laura's shoulder. Cooper leaves his voice recorder near the bird and wants to visit One Eyed Jacks, but it is over the border, so he suggests sending the Bookhouse Boys.\nBobby walks toward the Johnsons' house. In his truck, Leo watches him through binoculars and sees him embracing Shelly. He takes out his rifle, but not in time to get a shot. Shelly cries to Bobby about shooting Leo, and says that she knows he is out there watching her. Bobby pledges to take care of Leo and James and to protect her from now on. Leo gets back in his car to listen to a police broadcast of Lucy talking about Waldo and drives away.\nJames, Donna, and Maddy listen to Laura's tape recorded for Jacoby, which is very flirtatious. There is an empty case labeled with the date of Laura's death and James says they will find the tape that night in Jacoby's office.\nAt Horne's Department Store, Audrey fails to sell perfume to the customer Theodora Ridgely, mostly due to her patronizing attitude. The boss Emory Battis tells her colleague, Jenny, to meet him in his office. Audrey enters Battis' office through the stock room after telling a lie to the stockroom boy to make him go. She hides in the closet to watch the meeting. Battis tells Jenny that the people at One Eyed Jacks wanted her there, perhaps to be a hospitality coordinator. After they leave, Audrey looks through the boss's little black book and finds the names of many women, rated with hearts, Ronette's name being among them. Audrey takes the silver unicorn that Battis gave to Jenny.\nAt the Double R Diner, Hank tells Shelly about his time in the joint and gets information about who has been around. Harry and Cooper warn Hank that he is on parole, and he must be careful. Shelly offers the officers coffee and Cooper tells Harry to give himself a present once a day, every day, in this case the present being coffee.\nAudrey convinces Jenny to give her the number for \"Black Rose.\"\nOn Invitation to Love, Chet shoots Montana and Nadine cheers him on. Ed enters, and Nadine offers him chocolates then starts to cry since her patent was denied. She lists all the things she was going to get for them and Ed tells her not to give up.\nPete tells Harry about his fish from Tim and Tom's Taxi-dermy and Josie gives him a kiss. Harry asks what she was doing at the Timber Falls Motel and she confesses she was spying on Catherine and Ben and that she took pictures as proof for Harry. She says she heard Catherine talking about an accidental fire at the mill, and that she will not let it happen.\nCooper walks down the hallway in a tuxedo. He meets Harry and Ed and shows them $10,000 of the bureau's money for gambling. Ed leaves and Harry tells Cooper about what Josie told him. Cooper agrees to look into it and Audrey enters just after Cooper leaves, leaving him a message at the station house.\nInsurance agent Neff talks to Catherine about signing an updated policy, warning her about the changes that would take effect tonight. He says that was approached by Ben and Josie. Catherine says that she will discuss the policy with her lawyer and return it later. She discovers that her second book is missing.\nAudrey slips a note under the door of Cooper's room as a new guest checks in.\nAt the stationhouse, the boys play with bugs and disguises. Alone in the conference room, Waldo says \"Laura?\" and a gun fires and breaks a picture. Leo runs through the rain to his truck. The bird bleeds all over a pile of donuts and Cooper listens to the recorded voice of the bird saying \"hurting me, stop it, Leo, no.\"\nThe officers enter One Eyed Jacks and Cooper suggests that Jacques is dealing in the back. Blackie introduces herself and says that Ed looks like a cop. They go toward the casino.\nMadeleine sneaks down the stairs with a paper bag and Leland watches her leave. Maddy—wearing a blonde wig—and Donna pick up James.\nThe Icelandic investors sing to Ben, who suggests that Jerry take the guests to the dining room. He asks when they will sign the contract and Jerry says they want a signing party. Ben calls Josie to ask where Catherine is and she says she will get Catherine to the mill. Hank sits with Josie.\nAudrey walks into Blackie's office and hands her a resume, using the alias Hester Prynne. Blackie quickly determines that it is a fake. Audrey ties a cherry stem in a knot in her mouth, and Blackie agrees to keep her around.\nAs Cooper cleans up the blackjack table, Jacques begins to deal.\nDoctor Jacoby watches Invitation to Love and James, Maddy, and Donna call him. Maddy tells him to go to the door and he brings a Derringer. An envelope with a video cassette waits for him. The video shows Maddy disguised as Laura, purporting to actually be her. She instructs Jacoby to meet her in 10 minutes at the gazebo. Bobby spies on them through the bushes while someone else spies on Bobby.\nWhen Jacoby leaves, James and Donna enter his house. Bobby watches and puts a white package in James' bike.\nSomeone watches Maddy by the gazebo.\nDeleted scene\nIn a deleted scene entitled \"Something About Johnny,\" Sylvia and Jacoby try to deal with Johnny, Sylvia being abusive. Audrey intervenes and blames her mother for Johnny's condition. Sylvia then turns the blame on Audrey, who pushed Johnny down the stairs when they were younger. Audrey leaves and Jacoby explains that Audrey is not to blame, but an early emotional trauma.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson / Laura Palmer\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nChris Mulkey as Hank Jennings\nDavid Patrick Kelly as Jerry Horne\nWalter Olkewicz as Jacques Renault\nKimmy Robertson as Lucy Moran\nWendy Robie as Nadine Hurley\nDon Amendolia as Emory Battis\nVictoria Catlin as Blackie O'Reilly\nMark Lowenthal as Neff\nFeaturing\nEve Brent as Theodora Ridgely\nLisa Ann Cabasa as Jenny\nMary Stavin as Heba\nBrian Straub as Einar Thorson\n\"Invitation to Love\"\nErika Anderson as Jade\nLance Davis as Chet Weems\nRick Giolito as Montana\nUncredited\nDon LaFontaine as Invitation to Love's announcer \nDerick Shimatsu as Valet\nBob Stephenson as Burger Cook\nConnie Woods as New Girl at One Eyed Jacks\nUnknown performer as Stockroom Boy\nUnknown performer as Lawrence\nNotes\nThis episode opens on the night of Wednesday, March 1 almost immediately after the end of Episode 5 but most of the episode takes place on Thursday, March 2.\nAudrey tying a knot in a cherry stem was inspired by a friend of Harley Peyton's ability to do so.\nProduction errors\nWhen Audrey skims trough Emory Battis' book, the following dates can be seen:\n3/27/89 Steva ❤❤\n3/31/89 Sara ❤❤❤\n4/01/89 Barb. ❤\n4/08/89 Sandra ❤❤\n(unseen)/89 Paula ❤\n(unseen) ❤❤❤\n(unseen)-y ❤\n(unseen) Prina ❤\n6/10/89 Lois ❤❤❤❤\n6/11/89 Phonela ❤\n6/21/89 Denise ❤\n6/25/89 Blanche ❤\n6/29/89 Ashley ❤❤\n7/1/89 Robin\n1/26/90 Lois ❤❤\n2/3/90 Ronette ❤❤❤❤\n2/11/90 Deborah ❤❤❤\n2/14/90 Jemma ❤\n2/25/90 Jenny\nThese dates in Battis' book are inconsistent with the setting of the show, since the action takes place on March 2, 1989.\nThe scene of Audrey in Cooper's bed has a different lamp than in \"Episode 5.\""}