{"name": "Episode_29", "url": "https://twinpeaks.fandom.com/wiki/Episode_29", "text": "Episode 29\n\"Episode 29\", or, \"Beyond Life and Death\" is the thirtieth episode of Twin Peaks and final episode of the second season. It originally aired on television on June 10, 1991.\nPlot\n\"And now, an ending. Where there was once one, there are now two. Or were there always two?What is a reflection? A chance to see two? When there are chances for reflections, there can always be two--or more. Only when we are everywhere will there be just one.It has been a pleasure speaking to you.\"\n ―Margaret Lanterman\nAndy and Lucy console each other after the chaotic Miss Twin Peaks contest where Annie was kidnapped by Windom Earle. Cooper, Harry, and Hawk stare at the map, as Cooper mumbles \"Fire, walk with me.\" Pete Martell enters the police station and says the Log Lady stole his truck and drove off toward the woods. Cooper informs Pete that was Windom Earle in disguise. The Log Lady arrives, and says her husband gave her a bottle of oil from a gateway in the woods. The jar smells like scorched engine oil. Hawk brings in Ronette Pulaski, who recognizes the smell from the night of Laura Palmer's murder.\nWindom Earle arrives in a dark, wooded grove with Annie, who begins reciting Psalm 51 NIV (Psalm 50 LXX). They reach a circle of trees and vanish behind a red curtain.\nAt the Hurley house, Ed, Norma, and Doc Hayward bandage Nadine Hurley and Mike Nelson for their injuries. Nadine suddenly regains her memory, and is horrified to see Ed with Norma. She hollers about the missing drape runners and bursts into tears, very upset over Ed and Norma, while Mike apologies to Ed for letting his tryst with Nadine go too far.\nAt the Hayward house, Donna is distraught, having learned of the likely possibility that Ben is her blood father. Ben and Eileen try to console her. Doctor Hayward arrives and orders Ben out of his house. Ben's wife, Sylvia arrives and begins arguing with him. Angered, Doc Hayward punches Ben. Ben slams his head on the fireplace and he falls down to the floor unconscious.\nAt the Blue Pine Lodge, Andrew grabs the safe deposit box key and sneaks off, while Pete finds him and wants in on what he plans to do.\nCooper and Harry find Pete's truck in the woods. They walk partly into the forest when Cooper says he must continue alone, leaving Harry behind. Cooper hears an owl and sees the pool of oil ringed by rocks in a circle of small trees. Harry watches Cooper disappear behind a red curtain which magically appears and then disappears.\nCooper walks into the mysterious red-curtained room from his dream. There are couches, a zig-zag pattern on the floor, and some statues. The Man from Another Place dances into the room and sits in an old chair. A man sings a sad jazz tune as a strobe light flickers.\nAndy arrives in the forest to join Harry. They wait all night, and after over 10 hours, Cooper does not emerge.\nMeanwhile, Audrey walks into the Twin Peaks Savings & Loan bank, passes before the sleeping New Accounts clerk and chains herself to the bank vault, in protest of the Ghostwood Development Project and its environmental effect on the forest weasel. The old, senile, and slow-moving bank president, Dell Mibbler, fetches Audrey a glass of water but is slow to understand what Audrey is doing. She asks him to inform the Twin Peaks Gazette editor Dwayne Milford, Jr. Just then, Andrew and Pete arrive with the safe deposit key, intending to open the box left by Thomas Eckhart. Andrew asks the bank president for help in identifying the proper box in the bank vault. The elderly bank president walks away as Andrew opens the box to find a bomb, which is triggered by the safe deposit box opening. Along with the bomb is a taunting note reading: \"Got you, Andrew! Love, Thomas.\" It explodes, blowing out the bank windows. The clerk's glasses and some money fall on a nearby pine branch.\nAt the Double R Diner, Bobby and Shelly smile at each other. Bobby proposes marriage to Shelly, while she asks to think about it considering she is still married to Leo, who at that moment is still holding out in Windom Earle's spider trap. Nearby, Major Briggs and his wife are at a table, happy to be back together. Jacoby arrives with a dazed-looking Sarah Palmer, who delivers a message to Major Briggs, recanting in a garbled voice: \"I'm in the Black Lodge with Dale Cooper. I'm waiting for you.\"\nIn the Black Lodge, the red-suited, backwards-talking Man from Another Place tells Cooper they are in a waiting room and offers Cooper some coffee. The Man from Another Place tells Cooper, \"when you see me again, it won't be me.\" Laura Palmer appears, saying she will see Cooper again in 25 years and then says \"meanwhile\" while making a strange gesture with both of her hands. The elderly and senile waiter appears and brings coffee to Cooper. He is replaced by the Giant who sits down next to the Man from Another Place, saying, \"one and the same.\" The Man from Another Place rubs his hands, with the Giant gone. Cooper starts to drink the coffee only to find it frozen solid, tipping it to show the Man. He tips the cup a second time, and some of it pours out, now liquid. He tips it a third time and it is burnt oil. The Man from Another Place says \"Wow, Bob, wow. Fire walk with me.\" The room erupts into flame and begins to flicker between light and darkness. Cooper leaves the room, entering another one that looks exactly the same. He returns to the first room, where The Man from Another Place says \"wrong way.\" Cooper goes back to the second room. He sees The Man from Another Place laughing saying, \"another friend\". Maddy appears, says \"watch out for my cousin,\" then disappears.\nCooper returns to the first room to find it completely empty. An evil-looking Man from Another Place appears, with his eyes carracted white, says \"doppelganger\" and twitches. An evil-looking Laura doppelganger appears and says \"meanwhile\" with the strange hand gesture again before screaming. Scared, Cooper runs out of the room, returning to the other one. He is bleeding from the chest and has trailed blood on the floor. He stumbles back to the first room, and sees a woman lying on the floor with his own body. The woman is Annie with her throat cut.\nA little later, Cooper walks into a room with a shrine-like table to see Annie. She says she saw the face of the man who killed her: it was her husband. She does not respond to the name Annie and her appearance changes to Caroline.\nCaroline is replaced by Laura, and then Windom Earle. Annie watches as Windom and Cooper face off and then disappears. Windom laughs, and says if Cooper gives him his soul, he will let Annie live. Cooper says 'yes', and Earle stabs Cooper. There is a burst of flame and the stabbing rewinds. BOB takes control of Windom Earle, saying he cannot ask for Cooper's soul, and will take Windom's soul instead. After a burst of flame, Windom Earle goes silent, apparently dead. Cooper leaves the room and an evil doppelganger of Cooper appears from behind the curtain.\nThe doppelganger of Leland Palmer, with brown hair, appears in the hall between the two rooms and says \"I did not kill anybody.\" Cooper's doppelganger comes into the hall and laughs with Leland. The real Cooper runs back and forth between rooms it seems he cannot get out. The doppelganger Cooper catches up to Cooper, and BOB's face briefly appears and laughs.\nAt nightfall, Harry finds Cooper and Annie lying in the forest by the circle of trees as the red curtained gateway to the Black Lodge disappears.\nCooper wakes up in his bed at the Great Northern Hotel. Cooper asks about Annie, and Harry tells him that Annie is at the hospital and will be all right. Cooper gets up out of bed and tells Harry and Doc Hayward that he needs to brush his teeth. Once in the bathroom, he begins to put toothpaste on a brush, but then squeezes the tube's contents into the sink. He slowly raises his head, looks into the mirror and smashes his head into it, bloodying the glass. BOB's face appears in the mirror, revealing that this is actually the doppelganger. As Harry and Doc knock on the door in concern, \"Cooper\" maniacally repeats, \"How's Annie?\" and laughs uncontrollably.\nExtended scene\nAn extended version of the episode's first scene is entitled \"Lucy and Deputy Andy.\" After they say \"I love you,\" Andy abruptly tells Lucy that the petroglyph was not a puzzle, but a map.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Catherine Martell (credit only)\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nSheryl Lee as Maddy Ferguson / Laura Palmer\nKenneth Welsh as Windom Earle\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nHeather Graham as Annie Blackburn\nGrace Zabriskie as Sarah Palmer\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nCharlotte Stewart as Betty Briggs\nGary Hershberger as Mike Nelson\nMary Jo Deschanel as Eileen Hayward\nCatherine E. Coulson as The Log Lady\nJames V. Scott as Singer\nDan O'Herlihy as Andrew Packard\nCo-Starring\nCarel Struycken as Giant\nHank Worden as Waiter\nEd Wright as Dell Mibbler\nMichael J. Anderson as Man From Another Place\nFrank Silva as Bob\nFeaturing\nPhoebe Augustine as Ronette Pulaski\nJan D'Arcy as Sylvia Horne\nAndrea Hays as Heidi\nArvo O. Katajisto as \nSecurity Guard\nBrenda E. Mathers as Caroline\nUncredited\nDavid Chadwick as Daniel Brenton \nunknown performer as Dorothy Doak\nNotes\nThis final episode takes place between Sunday, March 26 and Monday, March 27.\nOriginally edited together with Episode 28 to form a two-hour series finale on ABC Monday Night at the Movies.\nInstead of the usual closing credits, this episode features a shot of a coffee cup sitting on the table in the red room. Slowly, the smiling face of Laura Palmer appears in the coffee.\nIn this episode, Jimmy Scott performs \"Sycamore Trees\".\nThe scene in which Cooper's doppelganger sees BOB in the mirror was shot by having MacLachlan and Silva on each sides of a glass.\nRatings\nNielsen Rating: 6.7/12 (With Episode 28), Number 59 for the week.\nShooting script differences\nThe credited writers for this episode are Mark Frost, Harley Peyton and Robert Engels. However, David Lynch revised their script significantly sans credit, maintaining the episode's general structure but altering much of the dialogue and many scenes (most notably in the Red Room/Black Lodge sequences, making them more akin to the dream sequences in the first season). Lynch also added more characters to the episode (probably in deference to the fact that this would be the final episode), some of whom had not been seen in the series for some time. The major differences between the episode as originally scripted and as actually filmed are as follows:\nThe Log Lady and Ronette Pulaski are added.\nThe confrontation between Benjamin Horne and the Haywards is generally the same, although there is more dialogue in the script. Also, in the original script, Doc Hayward shoves Ben, who strikes his head against a coffee table; a distraught Doc Hayward rushes to Ben's aid and apologises to him. In the filmed episode, Doc Hayward punches Ben, who splits his head against the fireplace; Doc Hayward reacts with terror and does not rush to Ben's aid.\nIn the script, Hawk and Major Briggs find Leo Johnson in Windom Earle's cabin. Leo instinctively begins to speak when he sees them, setting off the spider-trap set by Earle. Lynch replaced this with the scene in the Double R Diner featuring Bobby, Shelly, Major Briggs, Mrs Briggs, Dr Jacoby, Sarah Palmer, and Heidi the German waitress. With the exception of Major Briggs, none of these characters appear in the original script. In the filmed episode, Leo is only seen very briefly, via footage from the previous episode; his ultimate fate is left unresolved.\nIn the script, Pete Martell does not accompany Andrew Packard into the bank. Instead, Catherine Martell rushes into the bank just before Andrew accidentally sets off the bomb. Catherine does not appear at all in the filmed episode, and in the original script, Pete's only appearance is in the Sheriff's station at the beginning of the episode.\nIn the script, at the Lodge's entrance, Sheriff Truman sees a vision of a dark woman wearing chain mail, holding a sword and a shield.\nThe sequences in the Black Lodge are almost totally different in the original script: Windom Earle has much more dialogue; there is no backwards-talking; Laura Palmer appears only for an instant and does not speak. The Black Lodge Singer, The Man from Another Place, the Giant, the Waiter, Maddy Ferguson and Leland Palmer are not scripted. Windom Earle's fate is less abrupt; he ends up shackled to a dentist's chair with BOB as the torturer.\nThe revelation at episode's end that Cooper is now inhabited by BOB is more subtle in the original script. In the bathroom scene, Cooper squeezes toothpaste onto his toothbrush, looks to the mirror and smiles, with BOB's reflection smiling back; the episode ends at this point. In the filmed episode, Cooper squeezes the toothpaste into the sink, sees BOB's reflection in the mirror, smashes his head into the mirror, says \"How’s Annie?\" repeatedly, and laughs uncontrollably.\nProduction errors\nBefore Windom stabs Cooper, two tables are in the shot but after the stab there is only one.\nDeleted scenes\n \nAn unscripted scene which was shot and never used depicted Josie's body in the curtains when Cooper enters and experiences the \"Rooms\" of the Black Lodge. Frank Silva, unaware it had been cut, related the scene in an interview at the first fan Twin Peaks Fest, with further investigation prompted by the crowd's confused reactions.\nQuotes\nBoth Cooper And Truman: \"Jacoby! Scorched Engine Oil!\"\nAndy Brennan: Harry? Harry? Harry?\nThe Man From Another Place: Wow, Bob, Wow. Fire Walk With Me!.\nLaura Palmer: Hello Agent Cooper. I will see you again in 25 years Meanwhile...\"\nBob \"He is wrong. He can't ask for your soul. I will take his!\"\nCooper: How's Annie? How's Annie? How's Annie?"}