{"name": "Episode_28", "url": "https://twinpeaks.fandom.com/wiki/Episode_28", "text": "Episode 28\n\"Miss Twin Peaks\" redirects here. For the beauty pageant, see Miss Twin Peaks Contest.\n\"Episode 28\", \"The Night of Decision\", or \"Miss Twin Peaks\", is the twenty-first episode of the second season of Twin Peaks, and the twenty-ninth episode of the series as a whole. It originally aired June 10, 1991.\nPlot\n\"A log is a portion of a tree. At the end of a crosscut log -- many of you know this -- there are rings. Each ring represents one year in the life of the tree. How long it takes to a grow a tree!I don't mind telling you some things. Many things I, I musn't say. Just notice that my fireplace is boarded up. There will never be a fire there.On the mantelpiece, in that jar, are some of the ashes of my husband.My log hears things I cannot hear. But my log tells me about the sounds, about the new words. Even though it has stopped growing larger, my log is aware.\"\n ―Margaret Lanterman\nLeo and Briggs lay chained up in the cabin. Leo finds a key that undoes Briggs' restraints and requests him to save Shelly. Earle later comes and finds that Briggs is gone. He holds up a bag to Leo, saying that he has a \"new game\" for him.\nNorma states her expectations to see either Shelly or Annie as the winner of the Miss Twin Peaks Contest.\nAudrey sits by the fireplace in her father's office as he enters with various religious texts, wishing to find the true meaning of \"good.\" Concerning Jack, he assures her that \"time heals all wounds\" and that if Jack promised to return, he would. About her trip to Seattle, she tells him that the Packards are using the Twin Peaks Savings and Loan to funnel cash for the Ghostwood Development Project. Ben asks her again about Miss Twin Peaks, wanting her to enter. She refuses, but he urges her to still make a speech.\nAndy studies the Owl Cave petroglyph. Cooper tells Harry that he believes Earle has targeted Briggs. Cooper then admits to Truman that he saw BOB following Josie's death, believing him to have been feeding off of Josie's fear, leading to her death. Having listened to this, Earle has an epiphany, learning that fear is the key to the Black Lodge. He departs, leaving a cage of tarantulas above Leo's head, set to drop if he lets go of a rope between his teeth.\nTim Pinkle teaches a \"dance of nature\" to the Miss Twin Peaks contestants whilst admiring the cleavage of one of the women. Lucy questions the dance. The judges discuss the qualities that exemplify Miss Twin Peaks. Mayor Milford states \"beauty and power,\" Dick states \"poise, sophistication, and breeding,\" and Norma states \"originality.\" She goes to make the scoresheets and Lana takes Dick to the storage room to help her \"find something\", then seduces him.\nCooper records a tape for Diane after meditating, updating her on the progress in the case. Annie then comes, requesting help on her speech for the contest. Their discussion of trees ends in them making love.\nNadine shows her wrestling slides to Mike, Ed, Norma, and Doctor Jacoby. Jacoby then takes control of the meeting, gathered to discuss the divorce, or, \"breakup,\" asking for each of their feelings on the separation. Ed reveals to Nadine that he and Norma plan on marrying, which causes Nadine to say that she and Mike are doing the same, crushing Mike's hand.\nMajor Briggs staggers back towards civilization, encountering Deputy Hawk, who takes him back to the station.\nStill under the influence of haloperidol, the Major speaks incoherently to Cooper and Truman. Andy comes back to observe the petroglyph.\nAndrew, Pete, and Catherine continue to struggle in opening the metal box. Frustrated, Andrew takes out a revolver and shoots the box, which successfully blows holes in it, revealing a safety deposit box key. Catherine takes the key and places it in the cake saver.\nDressed for Miss Twin Peaks, Donna comes down and demands to know her mother's association with Horne. Her parents do not budge on the subject and she leaves.\nCooper points out planetary positions on the petroglyph, as the conjunction between Jupiter and Saturn is key to the opening of the Lodge. Briggs says that \"fear and love open the doors,\" and mentions a queen. Cooper finds this to mean the winner of Miss Twin Peaks, and that Earle will take her to the Black Lodge. Andy has an epiphany about the petroglyph but is ignored and he knocks over the bonsai plant, leading them to discover that Windom Earle had been spying on them. Cooper and Truman leave, ignoring Andy's plea to listen.\nThe Miss Twin Peaks contestants dance. Lucy commences the show's talent section with a dance performance of her own. Bobby looks out into the crowd and sees the Log Lady, but sees another Log Lady backstage. He looks out again to see that the Log Lady has disappeared. He goes to the one backstage and is knocked out by \"her,\" revealing that she is actually Windom Earle.\nLucy finishes her dance as Cooper and Truman arrive just before Lana does a dance of \"contortionistic jazz exotica.\" Andy arrives to speak to Agent Cooper, but is distracted by Lana's performance - as are most of the men in attendance.\nAudrey delivers her speech and Donna approaches Ben backstage, asking him about his association with her mother. He states a better course of action and place to bring information to light, wishing to do the \"right thing.\" She runs upon realizing the likelihood of him being her father.\nAnnie delivers her speech, which moves the audience and judges (except Milford), while Earle lurks above the stage. Voting commences and Lucy pulls Andy and Dick aside to tell them that she has chosen Andy to act as the father of her child, regardless of who is biologically responsible. Dick congratulates them and leaves to make his vote, and Andy goes to find Agent Cooper, much to Lucy's irritation.\nAfter the votes are in Doctor Hayward announced Annie as the contest winner. Earle shuts out the lights, then turns on a strobe effect, all while activating smoke bombs. In the chaos, Nadine is hit in the head by a sandbag and Earle manages to kidnap Annie. When the lights are turned back on, Andy finally finds Cooper and tells him that the petroglyph is a map.\nEpisode credits\nNote: This episode was originally broadcasted with Episode 29 as one television movie, thus sharing their original on-screen credits\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMädchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson Lucy Moran\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nKenneth Welsh as Windom Earle\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nIan Buchanan as Dick Tremayne\nHeather Graham as Annie Blackburn\nDavid L. Lander as Tim Pinkle\nRobyn Lively as Lana Budding Milford\nWendy Robie as Nadine Hurley\nDon S. Davis as Maj. Garland Briggs\nGary Hershberger as Mike Nelson\nMary Jo Deschanel as Eileen Hayward\nCatherine E. Coulson as The Log Lady\nDan O'Herlihy as Andrew Packard\nFeaturing\nJohn Boylan as Mayor Milford\nJill Engels as Trudy\nUncredited\nLorna MacMillan as Miss Twin Peaks Beauty Contestant\nJC Motes as Double R Diner Cook \nNotes\nThe episode was not given a title during the original 1991 German broadcast although titled \"The Night of Decision\" when re-broadcasted in 1996. The fan name \"Miss Twin Peaks\" became famous enough to be used instead in official capacity such as on CBS website.\nShooting script differences\nDeleted many scenes between Annie and Cooper: shortened the dialogue at the diner where Cooper tells Annie that to him she's the only person in the room, the love scene dialogue is shortened and finally the one at the sheriff's station.\nProduction errors\nAgent Cooper states that the next Jupiter-Saturn conjunction will be \"January to June\"; an actual Great Conjunction happens every 18–20 years, for a single day. There was no conjunction in 1989.\nThe room across Cooper's 315 is numbered 323 but episodes 5, 6 and 8 previously depicted it as 314."}