{"name": "Episode_20", "url": "https://twinpeaks.fandom.com/wiki/Episode_20", "text": "Episode 20\n\"Episode 20\", or, \"Checkmate\" is the thirteenth episode of the second season of Twin Peaks, and the twenty-first episode of the series as a whole.\nPlot\n\"My husband died in a fire. No one can know my sorrow. My love is gone. Yet, I feel him near me. Sometimes I can almost see him. At night when the wind blows, I think of what he might have been. Again I wonder: why?When I see a fire, I feel my anger rising. This was not a friendly fire. This was not a forest fire. It was a fire in the woods. This is all I am permitted to say.\"\n ―Margaret Lanterman\nA mysterious object rotates out of a star field, flames appear and Major Briggs sits on a stone seat in the woods. He says he remembers stepping from the flames, a vague shape in the dark, then nothing else until he found himself at the two-day-old campsite. The Major sits in the sheriff's conference room with Truman and Cooper. Doctor Hayward photographs the back of Briggs' neck. The Major also recalls seeing the image of a giant owl. Hayward displays the photograph - three triangular scars behind the major's right ear. Major Briggs becomes very upset and wonders if his experience was meant for his soul.\nWhen Cooper suggests he start at the beginning, the Major asks if they're familiar with Project Blue Book, the Air Force investigation into UFOs that ended in 1969. The Major says some continued the effort, unofficially, both to examine the heavens and, as in Twin Peaks, the earth below. He says they are searching for a place called the White Lodge. They are interrupted by two MPs who, on orders from Col. Reilly, take the Major. As Cooper examines the photograph, a few drops of water drip on to it from the overhead sprinkler. In the sheriff's office, Denise urges Ernie to make a phone call. Cooper enters and after his pride is challenged, Ernie calls Jean Renault and tells him he has the out-of-town buyer. Andy enters the sheriff's station, walks past Lucy, and encounters Dick, who tells him about visiting the Happy Helping Hand Adoption Agency to find that Nicky's records were sealed and returned to the orphanage. Andy and Dick plan a visit to the orphanage and they leave. Lucy tells Cooper she has checked all the personal columns in national newspapers and found nothing that looked like a chess deal and no name like Windom Earle.\nEd drinks coffee at the Double R Diner. He passes a note to Norma, saying, \"We need to talk.\"\nAs Shelly feeds Leo, the introduction to Invitation to Love is heard and Shelly complains that it was Bobby's turn to feed Leo and Bobby claims he had baseball practice. He tells her he is not coming back, that he has better things to do than bathing Leo. Shelly slaps him and Bobby leaves. Leo drools.\nJames phones Ed and asks that the money from his savings account be sent to him at Wallies Hideout, the bar on the 96. Evelyn enters the garage and asks if he is homesick. James tells her about Laura and his wanting to run away from Twin Peaks and Evelyn kisses him. They hear Jeffrey leaving and she tells James she needs his help.\nAt 9:25 AM, Nadine sits next to Mike Nelson at the counter of the Double R. Mike tells her he does not want to know her, but she tells him she wants to go out with him, kisses him, and pushes him off his stool. Norma puts on a coat and leaves after telling a clearly-suspicious Hank that she is going to run some errands.\nTruman visits Josie at Blue Pine Lodge and asks why she is not moving into his place and Josie says she is safe there and that she is no good for him. Truman kisses her and holds her.\nAudrey watches Ben's secretary run from his office in tears. She enters and finds Ben deep in his reenactment of Gettysburg. She tells him he needs help and uses the phone to call for her uncle.\nNorma visits Ed and they declare their love for each other with embraces and kisses.\nIn Truman's office, Hawk tapes a transmitter to Ernie's abdomen. Ernie, visibly nervous, claims he suffers from hyperhidrosis when Hawk complains about Ernie's sweating. Ernie starts to recall Korean War experiences. Cooper makes Ernie review his plan to take Denise to Dead Dog Farm to meet Renault. Truman deputizes Cooper so he can go with them. Cooper pins deputy badge no. 13 on as Denise enters, dressed as a man and calling herself Dennis.\nWind blows through the trees as Dick and Andy enter the office of Dorritt Home For Boys while everyone is at lunch. Dick searches the files and finds the file on Nicky. He starts to read the file as a couple enter and introduce themselves as the Brunstons, and have come to see Donny. Dick tells them little Donny is not feeling well.\nDonna visits Ed and asks about James. Ed tells her about James' phone call and gives her the money to take to the bar on 96. After she leaves, Ed turns to Norma, who kisses him and leaves. Ed closes the door and turns around to see Hank, who begins to beat him. Nadine enters and thoroughly pummels Hank before comforting Ed.\nIn his office, Ben tells Bobby about a Civil War battle. Audrey opens the door and peeks in as Ben addresses Bobby as General Meade. Bobby says he has to talk to President Lincoln and leaves. Outside, Bobby tells Audrey that Ben has flipped. Audrey says Uncle Jerry will be home on the next plane and Doctor Jacoby will come over tomorrow. As they leave, Catherine enters and goes into Ben's office. Ben tells her to go ahead and gloat, but Catherine says she did come to gloat, refers to Ben as \"Slimy Rat Bastard Americanus - do not feed,\" then she tells him she wants him and embraces him. \"You make my body hum,' she says. They kiss and hug.\nJames leads a blindfolded Evelyn to the car and lets her look at it. She says Jeffrey will be home at midnight and they drink champagne. She asks him not to leave. He starts to remove her clothes and presses her onto the fender while he kisses her. Malcolm watches and laughs to himself.\nTruman and Cooper watch Ernie, Jean, Denise, and Officer King through binoculars at Dead Dog Farm while Hawk listens to their conversation over the radio. Ernie rambles about hyperhidrosis and yellow fever as Denise tries to hurry them. King tells Jean that Ernie's shirt is smoking and Hawk tells Truman and Cooper that the wire's dead. King and Renault emerge using Ernie and Denise as shields. Cooper exchanges himself for the hostages and Truman tells Hawk to call the state police.\nAt night under a half moon, Evelyn leaves James' bedroom and meets Malcolm, who asks about \"their boy.\" She says he is \"sound asleep, dreaming of love.\" Malcolm and Evelyn kiss and embrace, though Evelyn is visibly uneasy.\nThe state police arrive at Dead Dog Farm. Inside, King suggests they deal or run. Jean asks Cooper if they will deal and Cooper tells him his only option is to surrender. Jean debates whether to give up quietly or to kill Cooper. When asked why, Jean says Twin Peaks was a quiet, innocuous bed of drug dealing before Cooper arrived. His presence threw everything into a nightmare state that resulted in both of Jean's brothers being killed. He tells Cooper that if he should die, \"maybe the nightmare will die with you.\" Denise approaches with a tray of food and Jean, not recognizing her, decides to let her in. She lifts her skirt to reveal a gun, which Cooper grabs and uses to shoot Jean as Denise jumps King. Truman and the troopers break for the house as Jean collapses, dead. Denise credits Truman with the idea of her bringing food.\nA record player plays Shelly's house as the lights dim and Shelly wakes up. She gets off the couch and looks for Bobby. She finds a clown doll on the pillow of Leo's empty bed. The lights dim again and she sees Leo standing, wearing a party hat. He says, \"Shelly\" and she screams. The lights go out.\nOutside the darkened sheriff's station, Truman asks Lucy about a bomb report. Lucy tells him there was a voice on the phone that said there was a bomb planted in the woods. There was a huge explosion and the lights went out. Lucy called the fire department. There were two fires, one being at the power station. Hawk goes to check the generator. Cooper enters the station and calls to Harry from his office. Harry enters and sees a body with long hair tied to a chair with one hand pointing to a chess board. Cooper says it is Windom Earle's next move.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell (credit only)\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nGuest Starring\nChris Mulkey as Hank Jennings\nIan Buchanan as Dick Tremayne\nJames Booth as Ernie Niles\nDavid Duchovny as DEA Agent Dennis / Denise Bryson\nGavan O'Herlihy as RCMP Officer Preston King\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nGary Hershberger as Mike Nelson\nAnnette McCarthy as Evelyn Marsh\nNicholas Love as Malcolm Sloan\nMichael Parks as Jean Renault\nFeaturing\nJ. Marvin Campbell as M. P. #1\nWill Seltzer as Mr. Brunston\nCraig MacLachlan as The Dead Man\nJohn Epstein as Utility Stunts\nUncredited\nBeverly Gordon as Mrs. Brunston \nDon LaFontaine as Invitation to Love's Announcer (voice) \nLance Davis as Chet Weems (voice)\nErika Anderson as Emerald (voice)"}