{"name": "Episode_23", "url": "https://twinpeaks.fandom.com/wiki/Episode_23", "text": "Episode 23\n\"Episode 23\", or, \"The Condemned Woman\" is the sixteenth episode of the second season of Twin Peaks, and the twenty-fourth episode of the series as a whole. It originally aired February 16, 1991.\nPlot\n\"A hotel. A nightstand. A drawer pull on the drawer. A drawer pull of a nightstand in the room of a hotel. What could possibly be happening on or in this drawer pull? How many drawer pulls exist in this world? Thousands, maybe millions? What is a drawer pull?This drawer pull - why is it featured so prominently in a life or in a death of one woman who was caught in a web of power? Can a victim of power end, in any way, connected to a drawer pull? How can this be?\"\n ―Margaret Lanterman\nDale Cooper and Harry S. Truman listen to a message from Windom Earle, who recorded it for the former. He challenges Dale to a deadly chess game, asking him to place his next move in the newspaper.\nPete Martell is called to the station to assist them, but first, he brings breakfast to Andrew Packard. They have a laugh due to Pete arranging the food to look like a dog, much to Catherine's annoyance. Pete leaves and the siblings discuss Ghostwood before Josie enters, fainting upon seeing Andrew, whom she believed to be dead.\nHank Jennings goes to Sheriff Truman's office escorted by Deputy Hawk. He is charged with the attempted murder of Leo Johnson. Hank proposes a trade, offering information on the murderer of Andrew Packard, who he not-so-subtly states to be Josie. Harry angrily has Hawk remove Hank from the office.\nAlbert presents ballistics evidence to Cooper that point the finger to Josie Packard as the person who shot him. Albert wishes to arrest her, but Cooper delays this.\nAudrey goes to the concierge desk at the Great Northern Hotel. John Justice \"Jack\" Wheeler arrives and goes to the desk, where Audrey is not cooperative with him until she finally looks at him. He requests she have someone retrieve his luggage, then mentions to her that he has a photo of her from when she was young. Audrey opens Earle's envelope for her, containing a section of a poem and requesting her to be at the Roadhouse at a certain time.\nNadine admits to Ed that she and Mike are in love and that they are \"breaking up.\"\nCooper questions Josie about Jonathan's murder, which she insists to have no involvement with. Catherine eavesdrops. Cooper requests that Josie be at the sheriff's station at 9:00, then leaves before Catherine reveals herself to Josie. They discuss Josie meeting with Thomas Eckhardt and Catherine reveals a pistol for her.\nBen, Bobby, Jerry, Audrey, and Jack have a meeting where Ben reveals the Stop Ghostwood campaign, with which he plans to stop the Ghostwood Development Project in the name of the endangered pine weasel.\nAt the Double R Diner, Earle leaves an envelope for Shelly as Norma talks on the phone with her sister, Annie, who is coming to Twin Peaks after leaving a convent. Norma finds the envelope and gives it to Shelly. It contains a portion of the poem and a request to meet at the roadhouse. Ed then comes in and embraces Norma.\nLeo carves arrows for Earle, who comes to check on his progress.\nHank lays in his prison cell at the sheriff's station as Norma comes in requesting a divorce. However, he agrees on the condition that she give him an alibi for the night Leo Johnson was shot. She refuses this, declaring that she would rather be Ed's whore than Hank's wife.\nPete tries to figure out the next move to make against Earle, trying to keep all of their pieces on the board. Albert speaks to Cooper privately, revealing even more evidence of Josie's involvement in the shooting of Cooper and the death of Jonathan. However, Harry overhears this.\nJosie applies makeup as she welcomes Andrew into her room. He states that despite her involvement in the original plan to murder him, he no longer harbors any hard feelings toward her, and implores her to see Eckhardt.\nDonna and James have a picnic together. She forgives him for his involvement with Evelyn Marsh and requests that he return to Twin Peaks with her, but he refuses. She tells him to take whatever time he needs before he returns.\nHarry goes to the Blue Pine Lodge and asks Pete and Catherine where Josie went. They tell him she was going to see a Thomas Eckhardt at the Great Northern. Harry then leaves.\nEckhardt enters an elevator, where Andrew is waiting for him. Packard stops the elevator and explains how he managed to survive the attempt on his life. He warns Eckhardt about Josie before he leaves.\nBen, Audrey, and Jack have dinner, where they discuss business dealings before Ben excuses himself after the chef tries to stab Jerry. Audrey states to Jack that he seems like an intrusion to her family, but asks him where he had been in the intervening years since he last saw Ben. She then excuses herself for her appointment at the roadhouse.\nDonna, Shelly, and Audrey meet at the roadhouse and piece together the poem they were given by Earle.\nCatherine calls Cooper, telling him that Josie is in Eckhardt's suite. He goes, but before he arrives, Josie shoots Thomas, who rises from bed and dies in front of Cooper. Josie aims her gun at Cooper until Harry arrives, imploring her to put the gun down. However, Josie suddenly dies and Harry cradles her body in his arms. BOB tauntingly appears to Cooper, followed by The Man from Another Place dancing. Josie's face then appears in the knob to a drawer next to the bed.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward (credit only)\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nMichael Horse as Deputy Tommy 'Hawk' Hill\nKenneth Welsh as Windom Earle\nGuest Starring\nBilly Zane as John Justice Wheeler\nMiguel Ferrer as FBI Agent Albert Rosenfield\nDavid Patrick Kelly as Jerry Horne\nChris Mulkey as Hank Jennings\nWendy Robie as Nadine Hurley\nDavid Warner as Thomas Eckhardt\nDan O'Herlihy as Andrew Packard\nCo-Starring\nMichael J. Anderson as Man From Another Place\nRon Blair as Randy St. Croix\nFrank Silva as Bob"}