{"name": "Episode_25", "url": "https://twinpeaks.fandom.com/wiki/Episode_25", "text": "Episode 25\n\"Episode 25\", or, \"On the Wings of Love\" is the eighteenth episode of the second season of Twin Peaks, and the twenty-sixth episode of the series as a whole. It originally aired April 4, 1991.\nPlot\n\"The beautiful thing about treasure is that it exists. It exists to be found. How beautiful it is to find treasure. Where is the treasure, that when found, leaves one eternally happy? I think we all know it exists. Some say it is inside us--inside us one and all. That would be strange. It would be so near. Then why is it so hard to find, and so difficult to attain?\"\n ―Margaret Lanterman\nMiss Jones caresses and kisses Harry, then puts a substance on his lips, then on her own and kisses him. In a trance, he sees and hears her as Josie until Jones reveals a garrote and begins to strangle him. He is unable to reach his gun but manages to overpower and subdue her.\nAudrey goes to Jack's room with breakfast he ordered. They have a flirtatious encounter and plan a flight with dinner before she leaves.\nHarry returns to the station, where he has incarcerated Jones, who wishes to speak with the South African consul. He wonders why Thomas Eckhardt would want him dead and Cooper answers with \"sexual jealousy.\" Cooper then tells Harry a remedy for a hangover, the thought of which causes Harry to become sick.\nDoctor Hayward observes a bonsai tree in Harry's office and Cooper gives Harry a digestive aid. The bonsai tree is found to have been allegedly from Josie. Hayward tells the lawmen about Windom Earle's visit to his home with his next move. Gordon Cole then returns from Bend as Earle and Leo listens in through the bonsai plant. Cole presents files that say Earle was on haloperidol, possibly to fake his mental illness. It also makes note of Earle's involvement with Project Blue Book in 1967. When Cooper says the word \"linkage,\" Cole is reminded of sausage and decides to go to breakfast. But first, he reinstates Cooper into the Federal Bureau of Investigation and gives him a Smith & Wesson 10mm Model 1076. After they leave for breakfast, Earle has Leo choose three cards from his hand, which reveal \"Queens\" Donna, Audrey, and Shelly. Leo then correctly chooses the \"King,\" Dale. Earle pulls one more \"Queen\" from behind Leo's ear and says that the identity of this queen will be the winner of the Miss Twin Peaks Contest and that he will kill her with Cooper watching.\nDonna goes to the Great Northern Hotel, having followed her mother there, who meets with Benjamin Horne. Randy St. Croix asks \"Mr. and Mrs. Hinkman\" about their stay, which they say to be \"unbelievable.\" Donna asks for Audrey and asks her about the meeting between her mother and Audrey's father. Eileen and Ben argue over love letters written to her decades before, Eileen wishing to let their affair stay dead, but Ben wishes to \"make things right.\" Donna and Audrey spy on them through Audrey's peephole to hear Eileen tell Ben to stay away from \"her.\"\nCooper, Truman, and Cole arrive at the Double R Diner with Gordon telling Harry his own hangover cure, which again causes Harry to be sick. When they sit, Gordon takes notice of Shelly Johnson, expressing a profound attraction to her. He excuses himself to speak to her and finds that despite his hearing loss, he can hear her perfectly. Cooper draws on his napkin, combining the markings found on Major Briggs and the Log Lady. When Harry returns, Dale sees through the window what he believes to be a chickadee on a Dodge Dart, but Harry thinks it is a finch. Annie comes over and confirms that it is a chickadee. She pours the lawmen some coffee, with Harry noticing Cooper's attraction to Annie, especially when he begins to tell her a joke. Annie then notices Cooper's drawing, noting that it looks like it's from Owl Cave, so Cooper wishes to go there.\nDonna sorts through the mail and finds a San Francisco postcard from James, who plans to go to Mexico but still promises to return to Twin Peaks. She then asks her father why her mother would be meeting with Ben, but he dismisses it as a meeting regarding a charity fundraiser. Flowers are then delivered to the house for Eileen.\nAt the library, Audrey encounters Earle, who is disguised as poetry teacher Edward Perkins. She asks him for help with the poem he had written her and he has her read it. He comments that she looks like a queen and she leaves.\nAt the diner, Annie examines a flyer for Miss Twin Peaks and explains to Shelly the difference between convent life and life back home at Twin Peaks, particularly the presence of men, specifically Dale Cooper.\nAt the sheriff's station, Andy descends from the ceiling in front of Lucy's desk and tells her that he will be going spelunking. He promises her that he will be careful. Pete calls in the next chess move against Earle and the men prepare to go to Owl Cave.\nJohnny Horne hollers as he fires arrows at targets. Ben then speaks to Audrey about his change in values, discovering the importance of his family and admitting that he was a poor father before, wishing to change this. He makes her his business partner and has her go on a business assignment in Seattle, which effectively cancels her plans with Jack, who enters. She leaves and Ben asks Jack how to \"be good,\" which Jack finds to be in truth and honesty. Jack then admits that he is falling in love with Audrey, which Ben appears to approve of.\nThe lawmen arrive at Owl Cave, where they indeed find the symbol Cooper had drawn. When an owl swoops over the men, Andy swings his pickaxe into a wall, causing part of the wall to fall out, revealing a petroglyph.\nAnnie goes to the bar at the Great Northern, where she has a rum and tonic. Cooper joins her and she discusses her past failure and her fear that it would happen again. Dale offers to help her if she is willing, and she accepts.\nEarle goes to Owl Cave, where he finds the petroglyph, inverting it, which causes the cave to rumble.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs (credit only)\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings (credit only)\nJames Marshall as James Hurley (voice)\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell (credit only)\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell (credit only)\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nKenneth Welsh as Windom Earle\nGuest Starring\nBilly Zane as John Justice Wheeler\nHeather Graham as Annie Blackburn\nDavid Lynch as FBI Regional Bureau Chief Gordon Cole\nWendy Robie as Nadine Hurley\nGary Hershberger as Mike Nelson\nMary Jo Deschanel as Eileen Hayward\nCatherine E. Coulson as The Log Lady\nCo-Starring\nBrenda Strong as Jones\nRobert Bauer as Johnny Horne\nRon Blair as Randy St. Croix\nJack McGee as Bartender\nUncredited\nKevin Young as Toad\nNotes\n\nProduction errors\nBetween shots of Donna spying on her mother and Ben, her earring appears and disappears.\nCole gives to Cooper a new 10mm which he identifies as a Smith & Wesson 1076 but the prop is actually a Smith & Wesson 4506 given the barrel length, slide mounted decocking/safety lever and double stack step on the frame."}