{"name": "Episode_21", "url": "https://twinpeaks.fandom.com/wiki/Episode_21", "text": "Episode 21\n\"Episode 21\", or, \"Double Play\" is the fourteenth episode of the second season of Twin Peaks and the twenty-second episode overall.\nPlot\n\"The heart -- it is a physical organ, we all know. But how much more an emotional organ -- this we also know. Love, like blood, flows from the heart. Are blood and love related? Does a heart pump blood as it pumps love? Is love the blood of the universe?\"\n ―Margaret Lanterman\nA chess pawn is found in the mouth of the dead man. Cooper accurately predicts that a stab wound would be found on the body. Hawk announces that he found one set of footprints leading to and away from the sheriff's station. Cooper explains his undoubting belief that Windom Earle is responsible for the crime.\nAudrey explains business dealings with her father to Bobby, especially concerning Horne's current mental state.\nShelly calls for Leo as the lights in their home pulsate. She tries to escape from him, but cannot open the front door. She makes a dash for the back door, but is hit by Leo's wheelchair. Unable to open the door, she finds a kitchen knife, She cuts a hole in the home's unfinished wall and calls for help, but Leo throws her to the floor. Bobby soon arrives as Leo approaches Shelly with an ax. Hearing her screams, Bobby goes inside and just as Leo prepares to kill Shelly, he tries to disarm him, but is pinned to the wall. Shelly finds the kitchen knife again and stabs Leo, who then escapes.\nHarry confirms to Cooper his mutual belief that Earle was responsible for the murder, and offers to let Cooper investigate the case, as he was still considered a deputy. Hawk announces that Hank Jennings was not at the buy due to being in the hospital, claiming to have been hit by a bus, and that he had been charged with several parole violations. He also informs them of Leo coming to and attacking Shelly.\nAndy tells Lucy that they needed to talk about Nicky due to his and Dick's belief that he murdered his own parents. This upsets Lucy, saying that neither he nor Dick were capable fathers.\nJames is introduced to Evelyn's husband, Jeffrey Marsh. Evelyn offers to let James continue to stay and Jeffrey takes his car for a fatal drive.\nAt the Double R Diner, Ed talks to Doctor Hayward about Nadine's wish to start dating boys. Hayward suggests giving her a curfew. Norma then brings Ed an extra serving of potatoes, and the doctor asks why Donna took the car to see James, and Ed explains she was taking him money. Doc leaves and Norma tells Ed that Hank was in the hospital after having a tree fall on him. Ed clarifies that this tree was actually Nadine beating him up, and the two then discuss their plans for finally being together.\nEvelyn goes to James' room to find that he has been packing, though she attempts to make him stay.\nCooper observes a chessboard, explaining to Harry that he and Windom played chess every day for three years, Earle winning every game. Cooper then explains his affair with Earle's wife Caroline and his belief that it was Windom himself who murdered her.\nDonna arrives at Wallies Hideout and orders a coffee. Evelyn sits nearby and hears Donna ask the bartender about James. Evelyn explains to him the work he did for her, but tells Donna that he left the previous day for Mexico.\nBen toys with his miniature Civil War re-enactment with Doctor Jacoby as Jerry arrives to see his brother's current state for the first time. Jacoby explains that Ben must reach a victory for the Confederacy to return to a normal state. Ben raises a flag and begins singing \"Dixie\" with Jacoby.\nMajor Briggs stumbles into the sheriff's station, asks to see the sheriff, and collapses. He is given water and meets with Truman and Cooper, and confides in them that he did not believe the Air Force's search for the White Lodge was pure, and that he believes he had been there during his disappearance. After predicting a \"great trouble,\" he leaves and said that he would be \"in the shadows,\" he left. Andy then came to retrieve the other lawmen to show them to Lana so that Jacoby could explain her high sexual drive, rather than a curse. As Jacoby and Lana leave to go bowling, they are ambushed by Mayor Dwayne Milford, still seeking to avenge his brother. Cooper has Milford and Lana talk alone in the conference room. The rest of the men wait outside for a moment and go back inside to find Milford's face covered in lip prints, announcing his and Lana's plans to adopt a child.\nCatherine Martell shows Pete to the still-living Andrew Packard, which surprises him. They tell him that they predicted the attempt on Andrew's life by Thomas Eckhardt and faked his death, feeling that Pete did not need to know.\nMiss Jones rings for Randy St. Croix at the Great Northern Hotel to check in Eckhardt.\nHayward forces a meeting with Andy, Dick, and Lucy to discuss Nicky. Truman asks Cooper to investigate whether Josie had anything to do with the murder of Jonathan Kumagai.\nHayward explains to Andy and Dick that Nicky was conceived by an assault on his immigrant mother, who died in childbirth and that the orphaned Nicky went on to lose his loving foster parents in a car accident. This story moves Andy and Dick to tears.\nAs James prepares to leave, Evelyn comes to beg for him to stay, though James believes it is wrong. She tells him she loves him, then law enforcement show up at the home, Evelyn saying that Jeffrey died in an accident. James realizes that he was being framed for this murder, which Evelyn says was planned by Malcolm. James escapes the home and finds Donna.\nLeo walks through the woods until he stumbles upon a cabin. Upon going inside, a man introduces himself to Leo as Windom Earle.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nKenneth Welsh as Windom Earle\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nDavid Patrick Kelly as Jerry Horne\nIan Buchanan as Dick Tremayne\nRobyn Lively as Lana Budding Milford\nDon Davis as Maj. Garland Briggs\nAnnette McCarthy as Evelyn Marsh\nDavid Warner as Thomas Eckhardt\nDan O'Herlihy as Andrew Packard\nCo-Starring\nBrenda Strong as Jones\nJohn Apicella as Jeffrey Marsh\nJohn Boylan as Mayor Dwayne Milford\nFeaturing\nRon Blair as Randy St. Croix\nCraig MacLachlan as The Dead Man\nHannah Kozak as Utility Stunt (Shelly Johnson)\nJon Epstein as Utility Stunt\nUncredited\nGérald L'Ecuyer as Bartender\nBrenda E. Mathers as Caroline Powell Earle"}