{"name": "Episode_8", "url": "https://twinpeaks.fandom.com/wiki/Episode_8", "text": "Episode 8\nNot to be confused with Part 8.\n\"Episode 8\", or, \"May the Giant Be With You\" is the first episode of the second season of Twin Peaks, and the ninth episode of the series as a whole. It originally aired September 30, 1990.\nPlot\n\"Hello again. Can you see through a wall? Can you see through human skin? X-rays see through solid, or so-called solid objects. There are things in life that exist, yet our eyes cannot see them. Have you ever seen something startling that others cannot see? Why are some things kept from our vision? Is life a puzzle?I am filled with questions. Sometimes my questions are answered. In my heart, I can tell the answer is correct. I am my own judge. In a dream, are all the characters really you? Different aspects of you? Do answers come in dreams?One more thing. I grew up in the woods. I understand many things because of the woods. Trees standing together, growing alongside one another, providing so much. I chew pitch gum. On the outside – let's say, of the Ponderosa pine – sometimes pitch oozes out. Runny pitch is no good to chew. Hard, brittle pitch is no good. But in between these exists a firm, slightly crusted pitch with such a flavor. This is the pitch I chew.\"\n ―Margaret Lanterman\nAndy is on the phone in the hotel room where Cooper lies bleeding. A waiter comes in with a glass of milk and asks Cooper how he's doing. Cooper asks the waiter to put the milk on the table and call a doctor. The senile waiter hangs up on Andy and Cooper thanks him, believing he called the doctor. The waiter has Cooper sign the bill, which includes a gratuity. He warns Cooper that the milk will get cool.\nCooper has a vision of a giant. The man says he will tell Cooper three things, and asks him to believe him if they come true. (1) There is a man in a smiling bag. (2) The owls are not what they seem. (3) Without chemicals, he points. He asks Cooper to give him his ring and says he will return it when Cooper finds these things to be true. The giant also says: Leo locked inside hungry horse: there's a clue locked inside Leo's house.\nAt One Eyed Jacks, Ben tries to get in Audrey's closed bed, not knowing it is Audrey and believing she is playing hard-to-get. Jerry asks Blackie what room Ben is in, Blackie asks why Ben is holding out on her, and Jerry gives her heroin. Audrey puts on a mask before her father enters her bed and Jerry calls Ben away.\nCooper, lying on the floor bleeding, calls for Diane. He had been wearing his bullet-proof vest but had folded it up to get a wood tick. \"Being shot isn't so bad as long as you can keep the fear from your mind,\" he tells Diane. His ring is missing from his finger and he lists his ambitions. The officers soon arrive, guns drawn.\nCooper comes to in the hospital. The wood tick had been found on one of his bullets and Cooper says the gunman's face had been masked. Lucy updated him on the events of the previous night and he insists on leaving the hospital, against Doctor Hayward's wishes.\nOn the television in Shelly's hospital room, Cyril Pons reports on the fire at the sawmill. Shelly lies in the hospital bed on a respirator. Jacques Renault's corpse is wheeled in front of Cooper.\nRonette Pulaski stirs in her coma. Maddy drinks coffee at the Palmers' house and talks to Sarah about a dream she had about the rug. Leland enters starts singing, with his hair having turned completely white. Madeleine has a vision of a body-shaped stain on the rug.\nBen and Jerry discuss the failures of their plans. Leland enters, singing, and he says he is back.\nThe officers inspect Leo's home and Cooper analyzes the living room while Hawk finds Leo's duster in the truck. Albert arrives and Andy hits himself on the head with a loose board, causing Albert to taunt him. Cooper finds a pair of boots and a lot of cocaine under the board.\nHank clears a table at the diner. Maddy and Donna meet, the former handing over a pair of sunglasses that had belonged to Laura. Madeleine breaks her glasses, saying she hates them. Donna says that James spent the night in jail and urges Madeleine to keep quiet. Norma delivers a letter to Donna, reading, \"Look into the meals on wheels.\" The Log Lady sits at a booth in the corner and spits out pitch gum on the wall.\nAlbert dresses Cooper's wound and says that Gordon Cole ordered him to return. Andy reports that Leo Johnson was locked in a jail in Hungry Horse, Montana, so he has an alibi for the Teresa Banks murder.\nThe one-armed man enters the stationhouse carrying a large suitcase and asks for Sheriff Truman, saying he is there to sell him some shoes.\nHarry finishes listening to Laura's tape with James, who says that Mike and Bobby put the cocaine in his gas tank. He tells Harry about a poem Laura said in the woods about fire: \"would you like to play with fire, little boy? Would you like to play with Bob?\" Cooper enters and demands the other half of Laura's necklace. James hands it over and says it was inside a coconut in Doctor Jacoby's office.\nDonna enters the station house, wearing the sunglasses. Lucy recognizes her and Donna says she wants to see James. She visits him in his cell and James rebuffs her kisses.\nCooper asks Lucy and Andy to look through a pile of Flesh World for ads from Teresa.\nDoctor Hayward inspects Jacoby and Cooper and Harry come to visit the psychiatrist. Cooper demands that Jacoby tell him where he got the necklace. Jacoby admits he followed a red corvette, then followed James and Donna through the woods. He says they buried something under a rock, and he took it. Jacoby says that Laura was a divided heart, leading a double life and he believes Laura had decided to end her life, that she allowed herself to be killed. Cooper asks Jacoby about Jacques' death and he says there was a smell like scorched engine oil.\nBobby visits Shelly and brings her flowers and after his visit, the officers see him leaving the room. Big Ed sits in the hallway and Cooper talks to him privately. Ed tells his history with Norma and Nadine, including the detail that he shot out Nadine's eye on their honeymoon. James is released to Ed. Cooper sees the body bag hanging, and notices that it is shaped like a smile.\nPete inspects the hospital food and rejects it.\nCooper says he is ready to lay out everything. Norma promises to bring Shelly some food and on her way out of the hospital, she sees Ed sitting with Nadine. \nBobby enters the diner and his father calls him over. Major Briggs tells his son of a vision he had, of being in an old family house, and embracing Bobby. Norma returns to the diner and tells Hank she cannot talk. Bobby then realizes that Hank shot Leo.\nCooper discusses Laura's diary, and that she made two appointments. They summarize their knowledge of what happened to Laura that night.\nPete and Harry return to Pete's house and Harry asks where Josie is. She left a note stating that she had to leave for emergency business in Seattle. Pete explains that she leaves for Seattle regularly, and comes back with a lot of clothes. Harry then says they have not found Catherine, and advises him to prepare for the worst. The phone rings and a strange man asks to talk to Josie. The man hangs up and calls Hong Kong next.\nBen and Jerry talk about European delicacies and Ben asks if Jerry has seen Audrey, but he has not. They enter the office, where Hank is waiting. They ask him where Josie is and he says she left. He explains that he could not enter Leo's house because he had to pass patrol cars on the way there and says Leo was chopping wood inside and defends the statement with Leo's craziness. Hank says that his phone call made Catherine hide and that she is dead. Hank asks what to do with the ledger.\nAudrey enters Blackie's office and asks about the locked door and bodyguard. Blackie warns her that she does not want to hear any more complaints.\nDonna calls Norma about Meals on Wheels and offers to take over Laura's route.\nThe youngest daughter of Will and Eileen Hayward, Gersten, addresses her parents, Leland and Sarah Palmer, Maddy, Harriet and Donna, welcoming them to the Hayward supper club. She says she will be playing music, and brags about her test scores; but first, the Haywards' middle child, Harriet, reads a poem about Laura. Leland and Sarah are moved and Gersten plays a piece by Mendelssohn. The Palmers and Haywards discuss recent events. Leland sings \"Get Happy,\" and Sarah cries. Leland falls over, but recovers quickly and says he feels happy.\nCooper makes a voice note to Diane about the necessity of sleep.\nAudrey lies in bed praying to \"Special Agent.\"\nA shadow passes over Cooper in his sleep. The Giant is back. \"Don't search for all the answers at once. A path is formed by laying one stone at a time. One person saw the third man; three have seen him, yes, but not his body. One only known to you, ready now to talk.\" The giant then flashes a globe of light into Cooper's head.\nFluorescent lights flicker in the hospital. Ronette raises her arms and she thrashes around, having nightmares of Laura's final moments. The man with long gray hair screams at the sky.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nChris Mulkey as Hank Jennings\nMiguel Ferrer as FBI Agent Albert Rosenfield\nDavid Patrick Kelly as Jerry Horne\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nVictoria Catlin as Blackie O'Reilly\nMary Jo Deschanel as Eileen Hayward\nCo-Starring\nCatherine E. Coulson as The Log Lady\nGaylyn Görg as Nancy (credit only)\nAl Strobel as Philip Michael Gerard\nCarel Struycken as The Giant\nFeaturing\nPhoebe Augustine as Ronette Pulaski\nStephen C. MacLaughlin as Pie Eater\nCharles Miller as Doctor\nMak Takano as Asian Man\nJessica Wallenfels as Harriet Hayward\nSandra Kaye Wetzel as Nurse\nAlicia Witt as Gersten Hayward\nHank Worden as Waiter\nUncredited\nMark Frost as Cyril Pons\nFrank Silva as BOB\nNotes\nTimeline: March 3, Friday\nDirector Steven Spielberg was interested in directing this episode before David Lynch decided to direct it himself.\nShooting script differences\nThe script establishes Mak Takano's character, Jonathan Kumagai, as being the Asian Man from Episode 6, although the latter was portrayed by Derick Shimatsu. Since Derick Shimatsu later portrayed Mr. Tojamura's valet in episode 12, they are considered as being two different characters in the released cuts of the episodes instead of a recast.\nProduction errors\nThe corridor of the Great Northern has a blue wallpaper while it was only wood paneling in episode 7.\nCooper' room has a fish on the wall near the entrance but it was not there in episode 7.\nCooper signs the waiter's paper with the tip of his pen retracted.\nA boom mike is seen in the shot above Norma as she leaves Shelly's room with Peggy Lipton even looking at it. In the Blu-ray release, the mic was removed but Lipton is still looking at it.\nThe killer's blood is said to be AB- and incompatible with Jacques' but episode 5 stated that Jacques' blood is AB-. It could be that other tests than just the blood type were carried on.\nA still image of Cyril Pons is seen at the bottom right corner of a scene.\nWhen Leland falls on the floor, electrical equipment can be seen.\nWhen he arrives, Albert can be seen taking off his sunglasses three times.\nIn the previous episode, Cooper read that the envelope was addressed to \"my special agent\". When seen on the table, it is simply for \"Agent Cooper\". Furthermore, in the previous episode, he put on the table but it was then discovered under the bed.\nCooper was shot right by the door to his room, but is on the ground by his bed.\nDonna's hair is visibly longer than in the previous episode."}