{"name": "Episode_12", "url": "https://twinpeaks.fandom.com/wiki/Episode_12", "text": "Episode 12\nNot to be confused with Part 12.\n\"Episode 12\", or, \"The Orchid's Curse\" is the fifth episode of the second season of Twin Peaks, and is the thirteenth episode overall.\nPlot\n\"Sometimes nature plays tricks on us and we imagine we are something other than what we truly are. Is this a key to life in general? Or the case of the two-headed schizophrenic? Both heads thought the other was following itself. Finally, when one head wasn't looking, the other shot the other right between the eyes, and, of course, killed himself.\"\n ―Margaret Lanterman\nCooper turns off his alarm and tells Diane that he dreamt he was eating a large, tasteless gumdrop, only to discover he was chewing one of his earplugs. He says he is doing 15 extra minutes of yoga in the morning to drive away the pain of his ribs (from being shot). While doing a headstand, he finds Audrey's note under the bed, which says she is going to One Eyed Jacks.\nHawk reports to Harry that two retired schoolteachers live next door to the Palmers' old place, and that they have no memory of a grey-haired man living next door. Lucy tells Harry that she will be visiting her sister and new nephew for two days. Cooper tells Harry he knows where Audrey is.\nTim Pinkle explains to Bobby and Shelly the workings of a harness to move a man from bed to chair. Shelly says that the hearing for Leo today. They walk outside as the harness swings Pinkle back and forth.\nJudge Sternwood holds court in the Roadhouse. The district attorney urges that Leland be held without bail, with Harry speaking in his defense. The judge releases Leland on his own recognizance and Ben leaves after the ruling is announced.\nHarold opens the door for Donna, who offers to share her life, to be part of his living novel, if he lets her read Laura's diary. Harold says that he will read it to her, but he will not let her take it away. Harold takes a notebook and the diary out of a secret shelf. When Donna asks him to tell about himself, Harold says he grew up in Boston, then corrects himself to say he grew up in books. Donna says that dreams might be real, then playfully takes the diary outside. Harold follows her, then collapses.\nThe judge examines evidence against Leo. Leo's attorney, Jack Racine argues that since Leo is brain dead, trying him would be a mockery. District Attorney Daryl Lodwick argues that they must proceed in order to give the town a sense of justice. The judge pulls Harry and Cooper aside to ask if they think Leo is guilty, and if the town needs an immediate trial. The judge concludes that he will deem Leo not competent to stand trial, and recommend that he be sent home. Sternwood advises Cooper to keep his eyes on the woods.\nBig Ed and Nadine return home. James greets them, and Nadine asks who he is, still convinced she is in high school. Big Ed says that Doctor Jacoby is in Hawaii, recovering from his heart attack. Nadine accidentally rips the door off the refrigerator.\nBen enters his office to be met by Mr. Tojamura accompanied by a valet right after being told that he was here by Louie. He makes a bigger offer for the Ghostwood Development Project and says that Tokyo Bank is ready to move immediately. He gives Ben a check for $5,000,000.\nHank walks down the hall of the hotel, Bobby following him, avoiding eyeshot. Cooper follows, playing with a duck call. Hank enters Ben's office, and watches him bow goodbye to the Japanese investors. Hank warns Ben that Cooper is on his way. The receptionist announces a call from Jean Renault, asking if Ben is ready to play. Ben asks to talk to Audrey, and Jean says that can wait and instructs Ben where to leave the money. Ben shows Cooper the briefcase of money, in serialized denominations. Cooper tells Ben to stay near a phone, and leaves. Ben instructs Hank to make sure Cooper and the money are delivered, and to bring back Audrey.\nMaddy and Donna examine a floor plan of Harold's home. Donna explains how to get Laura's diary, and says she will signal with a flashlight.\nJean practices with a wrist blade as he and Blackie eat fresh fruit. Blackie asks questions about how to make the deal work. Nancy, Blackie's sister, returns and Blackie leaves. Nancy says she has waited long enough for Blackie.\nAndy works the phones at the station, the office and his body covered with post-its. He calls for the results of his semen analysis test, finding that his sperm count is back up to normal. He proudly declares that he is \"a whole damn town.\"\nHarry and Cooper examine a floor plan of One Eyed Jacks. Hawk reports that no one has seen the one-armed man at his hotel in two days. He found the same drug, and describes its strange smell. Hawk leaves, and Cooper and Harry continue to plan their approach.\nAndy calls the number where Lucy is supposed to be staying. The number is actually for an abortion clinic.\nMaddy orders a cup of coffee to go at the diner. James asks why, and Maddy leaves quickly.\nMaddy watches Harold's house through the bushes. Donna is inside, giving Harold a memory. She and Laura were 13, wearing tight, short skirts to go to the roadhouse. They met some men, Josh, Rick, and Tim, who were about 20. The girls left with Rick to party. Laura danced and moves her hips. Donna suggested skinny-dipping, and Laura kissed Josh and Rick. Donna swam out, and Tim joined her and kissed her. She never saw Tim again, but she says it was the first time she fell in love. Harold tells her the story was beautiful.\nCooper and Harry creep toward One Eyed Jacks. A guard smokes outside. An owl stares at Cooper and hoots. Harry incapacitates the guard and they walk inside. Tools lie about the hallway and the officers search for the right room. Harry sees the backs of Jean and Blackie while the surveillance tape is paused on a television. Blackie asks Jean why he likes Nancy better.\nMaddy continues to watch through the bushes. Harold tells Donna about raising flowers and they kiss gently. He leaves, and Donna signals through the window with a flashlight.\nCooper continues through the hallway. He finds Nancy, and forces her to take him to Audrey. Nancy pulls a knife, but Cooper anticipates this and overpowers her. He carries Audrey away. Jean kisses Blackie and kills her with the wrist blade, then sees Harry watching through the window and fires at him before fleeing. Cooper and Audrey reunite with Harry, but are confronted by a bodyguard with a gun. A knife is suddenly thrown into the bodyguard's back and Hawk reveals himself, commenting that Dale and Harry could not keep a secret, and the four flee. Hank calls Ben to report that the officers are leaving with Audrey, just as Jean puts a knife to his neck. Jean finds the prosecutor's ID in Hank's pocket and believes it to be his.\nDonna tries to silently instruct Maddy to access the secret compartment while Harold gives her an orchid. Maddy finds the secret compartment, but the shelf crashes to the floor. Harold sees Maddy and grabs a sharp gardening rake. He corners the girls and tells them that Laura knew the ultimate secret, the secret of who killed her. He cuts his face with the rake in agony, as Donna and Maddy cower in fear.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward (credit only)\nPeggy Lipton as Norma Jennings (credit only)\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell (credit only)\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nAlso Starring\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nSheryl Lee as Maddy Ferguson\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nChris Mulkey as Hank Jennings\nLenny Von Dohlen as Harold Smith\nRoyal Dano as Judge Clinton Sternwood\nDavid L. Lander as Tim Pinkle\nWendy Robie as Nadine Hurley\nVictoria Catlin as Blackie O'Reilly\nVan Dyke Parks as Jack Racine\nRitch Brinkley as D.A. Daryl Lodwick\nFumio Yamaguchi as Mr. Tojamura\nMichael Parks as Jean Renault\nCo-Starring\nGalyn Görg as Nancy O'Reilly\nClaire Stansfield as Sid\nMike Vendrell as Bodyguard Outside\nBob Apisa as Bodyguard on Stairs\nUncredited\nDerick Shimatsu as Valet\nKevin Young as Toad\nBellina Logan as Louie 'Birdsong' Budway (voice)"}