{"name": "Episode_16", "url": "https://twinpeaks.fandom.com/wiki/Episode_16", "text": "Episode 16\nNot to be confused with Part 16.\n\"Episode 16\", or, \"Arbitrary Law\" is the ninth episode of the second season of Twin Peaks, and the seventeenth episode of the series as a whole.\nPlot\n\"So now the sadness comes. The revelation. There is a depression after an answer is given. It was almost fun not knowing. Yes, now we know. At least we know what we sought in the beginning. But there is still the question, why? And this question will go on and on until the final answer comes. Then the knowing is so full there is no room for questions.\"\n ―Margaret Lanterman\n \nAlbert, Cooper, Truman and Hawk walk outdoors along a path in the woods. Albert says that Maddy was murdered by the same man who killed Laura, there was an \"O\" under Maddy's ring fingernail, and she had strands of the fur belonging to a stuffed white fox in her right hand. Cooper tells Truman not to make phone calls reporting Maddy's murder and that he wants 24 hours to finish the case. Albert advises Cooper to follow his vision quest before there is another killing and Hawk tells Cooper he is on the path and to follow it.\nAt the Double R Diner, Donna and James chat over coffee. James gives Donna a ring and Norma and Vivian quarrel over Norma's omelets. As he eats breakfast, Andy tries to say \"J'ai une âme solitaire\" and Donna overhears him. When she asks him about it, Andy tells her about Harold Smith's suicide note. Donna leaves to find Cooper.\nAs Donna, Cooper, and Andy approach Mrs. Tremond's house, Donna tells Cooper about Mrs. Tremond's telling her about Harold and her grandson's saying the same words as in Harold's note. When they knock on the door, a middle-aged woman answers. She identifies herself as Mrs. Tremond and tells Donna she could not have seen her mother because she has been dead for three years. She also has no children. When the woman learns Donna's name, she gives her an envelope that she found in her mail the day after Harold's death, addressed to Donna in Harold's handwriting. The envelope contains a page torn from Laura's diary. An entry for February 22 describes a dream Laura had that seems identical to Cooper's dream. She writes that she has to stop BOB and that he is afraid of only one man, Mike, and Laura wonders if the old man in her dream was Mike. On February 23, Laura wrote, \"Tonight is the night that I die - it's the only way to keep BOB away from me.\" Cooper remarks that Laura and he had the same dream. He tells Andy to take Donna home and goes to see Gerard.\nCooper talks to Mike while Doctor Hayward urges that Gerard be given his drug. Cooper urges Mike to tell him how to unlock the dream. Mike tells him that when he and BOB were killing together there was a perfect relationship, appetite, satisfaction, a golden circle. Cooper says he gave his ring to the Giant. Mike says the Giant can help find BOB, but Cooper must ask him first. As Cooper leaves, he encounters the old waiter, who carries a glass of milk and says, \"I know about you. That milk will cool down on you, but it's getting warmer now.\" He gives the thumbs-up sign to Cooper.\nIn Ben's office, Truman tells Cooper about finding a record of the telephone call Leland reported, a call to Laura Palmer's number. He notes the stuffed white fox and concludes that Maddy was here. Albert reports that Maddy died the night before last between 10:00 PM and midnight and Truman says this fits, \"we didn’t take Ben until after midnight,\" he notes, albeit an apparent error. Albert gives Cooper the results of Ben Horne's blood test.\nAt the sheriff's station, a workman adjusts the sensitivity of the sprinkler system while Andy tells Lucy he wants to talk about their baby. Lucy tells him she is not certain if the baby is his or Dick's. Andy calls Tremayne and tells him they need to talk. Catherine, disguised as Tojamura, visits Ben's cell with papers for him to sign. Ben says he cannot deliver on the Ghostwood contract and Tojamura asks for the return of the $5 million. As Ben explains about Jerry's looking for a better lawyer, Catherine extends a bare, pedicured foot through the bars and Ben recognizes her as Catherine. Catherine calls him slimy rat bastard and says she intends to make his life hell. Ben asks her to tell Truman about his being with her the night of Laura's murder. He signs Ghostwood and the mill over to her and she starts to leave. She tells him she will consider telling the sheriff and says \"we've spent our entire adult lives lying to each other. Why spoil it with the truth now?\"\nLeland greets Donna, who has come to deliver a tape of the song she, Maddy, and James recorded, so that Leland may mail it to Maddy. He recognizes Laura's sunglasses and becomes agitated. She tells him about the discovery of Laura's secret diary and he gets a phone call from Maddy's mother, who reports that Maddy never came home. When Donna becomes upset, Leland suggests lemonade.\nLeland startles Donna when he returns with the lemonade. He puts on a phonograph record of \"J'attendrai\" and asks Donna to dance with him. Flashes of BOB are seen as thunder is heard. Leland grabs Donna, seemingly prepared to attack, but the doorbell rings. Leland admits Truman who tells him he needs Leland's help because there has been another murder. Making the connection, Donna walks through the woods, crying. James drives upon his motorcycle. Donna tells him that Maddy's been killed and James says they could have helped her. He says this is no good and Donna asks him not to leave. He says nothing they do matters and he leaves Donna in tears.\nBen sits in a booth at the Roadhouse. Cooper and Albert sit at the bar. Truman brings Leland in and Ed Hurley joins them. Cooper tells them to clear a space in the center of the room and Cooper summarizes the investigation and his techniques. He says he needs magic, but says someone is missing. The clock strikes 3:00 PM and Major Briggs enters with the old waiter, who had flagged him down. The waiter gives Cooper a stick of gum, which Leland recognizes as a gum from his childhood. The waiter says, \"that gum you like is going to come back in style,\" causing Cooper to recall his dream. Laura whispers, \"My father killed me.\" to Cooper. The Giant appears and drops Cooper's ring to the floor. Cooper puts a stick of gum in his mouth, picks up the ring, and tells Ben Horne to accompany him to the sheriff's office, with Leland as Ben's attorney. As they leave, Cooper flashes the thumbs-up sign to the waiter.\nThey arrive at the sheriff's station at 3:56 PM. Cooper tells them to take Ben Horne into an interrogation room and Leland says he wants to begin bail proceedings, but Cooper puts him off, then whispers something to Truman. When they open the door of the interrogation room, they push Leland inside and lock the door. Leland starts to hoot and slams himself against the walls. Cooper tells Hawk to take Ben upstairs and release him. Ben expresses his shock and Hawk says that it is not Leland contained in the room. When Cooper explains to Truman what Laura told him in her dream, Truman remarks that he needs hard evidence, so Cooper suggests a confession. They cuff Leland in a chair as Hawk keeps a gun aimed at him. Truman reads him his rights and Leland laughs and says, \"I suppose you want to ask him some questions.\" When Cooper asks if he killed Laura Palmer, Leland hoots and says, \"that's a yes.\" He admits killing Maddy because he has a \"thing for knives, just like what happened to in Pittsburgh.\" He describes Leland as a good vehicle, but says it is time to shuffle off. When Cooper asks if Leland knows what he had done, he tells Cooper to watch Leland when he goes. Truman has enough and they leave Leland alone. \nDick Tremayne arrives and Lucy takes him into the Sheriff's conference room, where Andy is. She tells them she is going to keep her baby and will depend on a post-natal blood test to determine who the father is, but regardless of the result, she will choose between them who will act as the father. Dick's cigarette smoke rises toward the smoke detector.\n \nOutside the interrogation room Cooper says Ben Horne's blood type was wrong. He also points out that the action of the dwarf in his dream, dancing, pointed to Leland's compulsive dancing. The man next door to Leland's grandfather was Robertson - Mike said the people BOB inhabited were his children - son of Robert, the name being spelled under the fingernails. Leland killed Laura because she was on to him, as he learned from her diary. Leland placed the call to Laura from Ben's office. Cooper suggests Leland killed Maddy because she reminded him of Laura. Leland recites the poem and screams the last line, \"fire walk with me.\" Dick's smoking causes the sprinkler system to go off and Leland/BOB goes ballistic. He hoots and beats his head against the door repeatedly. They open it and find Leland on the floor, bleeding. Cooper kneels beside Leland and takes him in his arms. Before he dies, Leland remembers that he killed Laura. He says \"they\" wanted Laura but she fought them. She would not let them in so they killed her. Cooper comforts Leland and tells him the time has come to seek the path and to enter the light. Leland says he sees Laura in the light and he dies.\nThe next morning, Cooper, Truman, and Albert encounter Major Briggs on the path in the woods. Truman remarks that Leland was completely insane. Albert says people saw BOB in visions. When Truman says he has trouble believing, Cooper asks if it is any easier to believe a man would rape and murder his own daughter. Briggs asks if it matters what the cause is and Cooper replies, \"Yes. It’s our job to stop it.\" Albert suggests \"Maybe that's all BOB is, the evil that men do\" and that it may not matter what they call it. Truman agrees and says that if BOB were real, he has gotten away and questions his whereabouts.\nAn owl flies by a crashed car and through a ravine.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson (credit only)\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne (credit only)\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell (credit only)\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Tojamura & Catherine Martell (voice)\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson / Laura Palmer\nGuest Starring\nMiguel Ferrer as FBI Agent Albert Rosenfield\nIan Buchanan as Dick Tremayne\nJane Greer as Vivian Smythe Niles\nDon Davis as Maj. Garland Briggs\nAl Strobel as Phillip Michael Gerard\nCo-Starring\nMichael J. Anderson as Man From Another Place (archive footage)\nClive Rosengren as Mr. Zipper\nFrank Silva as Bob\nCarel Struycken as Giant\nMae Williams as Mrs. Tremond\nHank Worden as Waiter\nNotes\nThe episode is set on Saturday, March 11\nRatings\nNielsen Rating: 72nd 7.9/15\nProduction errors\nAs Leland throws himself against the walls, the set on the left-hand side is visibly shaking.\nAlbert says that Maddy was killed between 10PM and midnight and Harry adds that Ben was arrested after midnight. However, \"Episode 14\" shows that Ben was arrested at dusk before Cooper and Harry went with the Log Lady to the Roadhouse while Maddy was being murdered."}