{"name": "Episode_18", "url": "https://twinpeaks.fandom.com/wiki/Episode_18", "text": "Episode 18\nNot to be confused with Part 18.\n\"Episode 18\", or, \"Masked Ball\" is the eleventh episode of the second season of Twin Peaks and the nineteenth episode overall.\nPlot\n\"Is life like a game of chess? Are our present moves important for future success? I think so. We paint our future with every present brush stroke.Painting. Colors. Shapes. Textures. Composition. Repetition of shapes. Contrast. Let nature guide us. Nature is the great teacher. Who is the principal?Sometimes jokes are welcome. Like the one about the kid who said: 'I enjoyed school. It was just the principal of the thing.\"\n ―Margaret Lanterman\nJames speeds down a road on his motorcycle.\nBetty Briggs explains to Cooper and Harry that Garland has disappeared before, but the absences were work-related. She says the fact that they were in the woods is significant, and he talks about the woods constantly. She will not divulge whether Garland was trying to contact a woodland spirit, but offers to pass along some notes from his bedside table. Andy reports that he found a matching scarf and ascot for the Milford wedding. Gordon Cole calls Cooper to offer his support. He says that the DEA is sending down a top dog.\nCooper sits before a panel of men, led by Roger. Cooper says he is innocent of any criminal wrongdoing, and confident that he made the right choices. Roger says that he expects a bureau man to defend himself. Cooper says he is looking for moves from beyond the edge of the game board, and talks spiritually. Roger warns him that he might be extradited for drug trafficking and murder. Roger says he may recommend a full psychological workup.\nNadine approaches Donna at lockers and confesses that she feels chemistry with Mike Nelson. Nadine says that Ed acts too old.\nJames pulls in next to a sports car at a roadhouse. He sits next to a beautiful woman. Her name is Evelyn Marsh, and she asks James to fix her car.\nAndy leaves a bouquet for Lucy. Dick visits with a little boy. Andy offers to go with them for a milkshake.\nCooper asks Harry and Hawk about the White Lodge. Hawk says that there are other worlds, and that the White Lodge is where the spirits that rule man and nature reside. He says the Black Lodge is its shadow side, where people go to be purified when they die, and that it will annihilate a person's soul. Denise Bryson arrives, presenting female, and asks to be called by her new name instead of her assigned masculine name. Denise asks to catch up with Cooper, says he'll get started immediately.\nMike Nelson is pumping iron at the school gym. Nadine lifts a 600lb weight. The coach asks Nadine if she's interested in joining the wrestling team.\nJosie sleeps in Harry's bed. Harry brings her a glass of water. He tells her she must tell him the truth. She says she used to work for Thomas Eckhardt in Hong Kong. She says she was a child prostitute, and he pulled her off the streets. He mentored her. Andrew Packard was a business partner who married Josie. Eckhardt wants Josie back. She believes he is responsible for Andrew's death. Josie escaped from the airport: she says she would rather die than return to Hong Kong.\nRoger reads a paper at the diner. Hank and Ernie return. Norma tells Ernie that Vivian is back in Seattle. Andy, Dick, and little Nicky eat desserts at the counter. Nicky pranks both Dick and Andy.\nJames tells Evelyn that he thinks he can fix the car. She tells him that she doesn't know where her husband is, that he travels regularly. She offers to let him stay in the room above the garage, that she needs the car fixed before her husband gets home.\nBen watches an old home movie from his childhood, of building the Great Northern Hotel. He carresses the projector screen. Hank finds him in the office. Ben reminds Hank of his recent challenges. Hank tells Ben that he no longer owns One Eyed Jacks, and that Hank no longer works for Ben. Ben rants, drops furniture, and makes shadow monsters with his hands.\nCooper inspects a letter from Windom Earle. It's another chess move and a tape. Cooper listens to the tape and inspects a chess board. Windom says the king must die, and that he will attain his goal at any cost.\nDougie and his bride exchange vows. Dwayne interrupts the ceremony to say that the bride is a gold digger. Harry pulls him out of the ceremony. Cooper meets Bryson at the wedding reception. Bryson has found cocaine in Cooper's car. She says it looks like a frame, but they need some proof. Bryson says that she started presenting female as part of a job, and continued doing so because it felt right. Dwayne complains to Pete about the wedding. Harry tells Cooper he's had to separate Dwayne from Dougie several times. Cooper dances with Audrey and Andy dances with Bryson.\nJosie tries to convince Catherine of her good will. Catherine tells Josie to work as her maid, or she will give her up to Eckhardt. Josie agrees and leaves. Andrew Packard enters and reveals that he and Catherine are using Josie as bait for Eckhardt.\nExtended scene\nA scene entitled \"16mm Period Piece\" is a longer version of Ben's home movie of the Great Northern groundbreaking.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson (credit only)\nDana Ashbrook as Bobby Briggs (credit only)\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward (credit only)\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran (credit only)\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nGuest Starring\nChris Mulkey as Hank Jennings\nIan Buchanan as Dick Tremayne\nClarence Williams III as FBI Agent Roger Hardy\nJames Booth as Ernie Niles\nDavid Duchovny as DEA Agent Dennis / Denise Bryson\nWendy Robie as Nadine Hurley\nCharlotte Stewart as Betty Briggs\nGary Hershberger as Mike Nelson\nTony Jay as Dougie Milford\nRobyn Lively as Lana Budding Milford\nAnnette McCarthy as Evelyn Marsh\nRoyce D. Applegate as Rev. Clarence Brocklehurst\nRon Taylor as Coach Wingate\nDan O'Herlihy as Andrew Packard\nCo-Starring\nJohn Boylan as Mayor Dwayne Milford\nCatherine E. Coulson as The Log Lady\nJill Engels as Trudy\nJoshua Harris as Nicky\nUncredited\nDavid Lynch as FBI Regional Bureau Chief Gordon Cole (voice)\nBirgit K. Schier as Utility Stunts\nKenneth Welsh as Windom Earle (voice)\nKevin Young as Toad"}