{"name": "Episode_10", "url": "https://twinpeaks.fandom.com/wiki/Episode_10", "text": "Episode 10\nNot to be confused with Part 10\n\"Episode 10 \", or, \"The Man Behind Glass,\" is the third episode of the second season of Twin Peaks, and the eleventh episode of the series as a whole. It originally aired October 13, 1990.\nPlot\n\"Letters are symbols. They are building blocks of words, which form our language. Languages help us communicate. Even with complicated languages used by intelligent people, misunderstanding is a common occurrence. We write things down sometimes – letters, words – hoping they will serve us and those with whom we wish to communicate. Letters and words, calling out for understanding.\"\n ―Margaret Lanterman\nHarry helps orderlies restrain Ronette in the hospital. Cooper and Albert enter. Cooper takes a sample from her fingernail—a small piece of paper containing the letter 'B.' Cooper tells Harry and Albert about his visit from the giant.\nDonna visits Harold Smith, who offers her his hospitality. He has many flowers in his living room and he says he sent the letter for her to investigate Meals on Wheels. He says he is a shut-in because he cannot go outside that he was a mystery in Laura's life. He asks Donna to place one of his orchids on her grave for him and walks out to his greenhouse. Donna tries to pull a slip of paper from the bookshelf, but Harold interrupts her with a ladyslipper orchid. Harold says Donna is every bit as lovely as Laura said she would be and she takes the orchid and tells Harold that she will be back.\nAt the stationhouse, Cooper stands in front of a blackboard with the letters found under girls' fingernails, and the names of the people who have seen BOB (Maddy, Mrs. Palmer, Cooper, Ronette), and a picture of BOB. He says the lines between the names are a psychic link that will lead them to him. Harry asks about the giant, and Albert dismisses it, then reports that the cocaine found in James' gas tank matched the cocaine found in Jacques' car and Leo's house, meaning that Leo framed James. The letter B found under Ronette's finger was cut from an edition of Flesh World. He also says that he sent a picture of BOB to law enforcement agencies across the country, and came up with nothing. He reports that Cooper was shot with a Walther PPK, which he notes to be James Bond's gun. On his way out, Albert insults Harry again, so Harry grabs Albert's collar and says that the last time he punched Albert, he felt sorry about it, but the next time will be a pleasure. Albert states his philosophical convictions and says that he loves Sheriff Truman.\nIn the front of the stationhouse, Cooper tells James he can go home, but to stop trying to figure everything out himself. Lucy tries to find words that use the letters B, T, and R. The foppish Dick Tremayne then comes in to take Lucy to lunch.\nLeland enters and talks to the officers about the picture of BOB. He says that he knows him: when he was a little boy, his grandfather had a summer home, and BOB was his neighbor. He lived in a white house, and he thinks the name was Robertson. Cooper sends Hawk to the lake to investigate. Leland says that BOB used to flick matches at him, and ask \"Do you want to play with fire, little boy?\"\nLucy and Dick sit at the counter at the Double R Diner. Richard talks about his method for memorizing customer orders and Lucy asks why he has not called in six weeks after three months of going out every week, and after their night on a bed in Horne's Home Furnishings. She then reveals that she is pregnant.\nJames and Madeleine sit at the diner, the former asking about Donna's smoking. James tells about Donna's visit to the prison, and how she seemed to want him through the bars. Madeleine holds James' hand and Donna enters. Misunderstanding the gesture, she tells them how much she liked Harold, and storms out.\nBlackie and Emory tie up Audrey and Emory makes a video of her. Emory and Blackie argue over whether their plan will work.\nAt the stationhouse, the one-armed man shows Harry his selection of boots. He sees the picture of BOB and reacts strongly.\nShelly meets Harry and Cooper in the station and they ask for a statement regarding Leo, but she refuses to say anything against him. Cooper escorts her out the door and tells Harry that he believes her reasons to be an insurance scam, but he is not sure who thought it up.\nThe one-armed man struggles with his medicine in a bathroom stall and has a seizure. He talks to BOB and says he is after him now.\nCooper follows a marching band out of the hotel elevator and tells Ben about Audrey's phone call, asking if there's trouble at home. Ben tells Cooper that Audrey has gone missing before, and warns him to keep away from Audrey. An Asian man eavesdrops on their conversation and follows Cooper.\nAudrey lies on her bed. A man named Jean pulls a veil from her face and gives her a caramel and a shot. A woman stands nearby, holding his tools.\nBlackie plays a surveillance tape of Cooper at the casino and Emory informs her that Cooper is in the FBI. Jean Renault stands behind them with the woman, Blackie's sister. Jean says he will be the middle man for Audrey's ransom, so Ben will never know that Blackie and Emory are behind it. In exchange, Emory and Blackie will bring him the man responsible for his brother's death: Agent Cooper. Jean says they cannot let the girl live.\nCooper enters Harry's office with coffee and doughnuts. Harry reports that Josie called, saying she will be back the next day. Harry asks to see her first, alone and Cooper permits it. Hawk reports that he found a boarded up white house by the lake, and is trying to discover whose it is. Harry asks them if they have seen Gerard, the one-armed man, as he never came back from the bathroom. Cooper searches the bathroom and finds Gerard's needle and medicine. \"Without chemicals, he points,\" Cooper says and wants to find the one-armed man.\nA hospital orderly cuffs Nadine to her bed. Doctor Hayward tells Big Ed that she ripped through two pairs of leather restraints the previous night and that her adrenaline levels are high. He tells Ed to talk or sing to her. As Ed sings, Nadine grips his hands, sits up, and snaps the cuffs. She claps spasmodically and chants a cheer. She begins talking to Ed, seeming to think she is 18 and about to try out for the cheerleading squad.\nCooper and Harry enter Jacoby's room at the hospital. His wife, a young Hawaiian woman, rubs his feet. Cooper helps to hypnotize Jacoby and he walks him through Jacques' murder. Jacoby says he knows the murderer.\nDonna brings the orchid to Laura's grave and tells Laura about her new relationship with James. She says that she loves James, but it is a mess and that Laura's problems are still the center of her life.\nJames visits Madeleine to say that he cannot find Donna and that his mother came home. They almost kiss, then hold each other. Donna finds them and suddenly leaves, with James chasing her out.\nLeland comforts Maddy, who is upset that people think she is like Laura. Cooper and Harry wait in the doorway and arrest Leland for the murder of Jacques Renault.\nHarold answers a knock at his door. Donna tells Harold that she is tired of being patient with James. Harold comforts her and leaves to get her a drink. Donna strokes a flower and opens a notebook: the diary of Laura Palmer.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs (credit only)\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings (credit only)\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell (credit only)\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nAlso Starring\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nMiguel Ferrer as FBI Agent Albert Rosenfield\nIan Buchanan as Dick Tremayne\nLenny Von Dohlen as Harold Smith\nWendy Robie as Nadine Hurley\nDon Amendolia as Emory Battis\nVictoria Catlin as Blackie O'Reilly\nMichael Parks as Jean Renault\nCo-Starring\nGalyn Görg as Nancy\nAl Strobel as Phillip Michael Gerard\nFeaturing\nPhoebe Augustine as Ronette Pulaski\nMak Takano as Asian Man\nUncredited\nJennifer Aquino as Eolani Jacoby\nLinda Carlson as Colleen Hurley (deleted scene)\nConnie Woods as New Girl at One Eyed Jacks\nNotes\nTimeline: March 5, Sunday\nShooting script differences\nDeleted the scene with James' mother, Colleen Hurley. The script reuse the entirety of the scene from Episode 4's script."}