{"name": "Episode_13", "url": "https://twinpeaks.fandom.com/wiki/Episode_13", "text": "Episode 13\nNot to be confused with Part 13.\n\"Episode 13\", or, \"Demons\" is the sixth episode of the second season of Twin Peaks, and the fourteenth episode overall.\nPlot\n\"Sometimes we want to hide from ourselves. We do not want to be us. It is too difficult to be us. It is at these times that we turn to drugs and alcohol or behavior to forget that we are ourselves. This is – of course – only a temporary solution to a problem which is going to keep returning, and sometimes these temporary solutions are worse for us than the original problem.Yes, it is a dilemma. Is there an answer? Of course there is. A wise person once said with a smile, the answer is within the question.\"\n ―Margaret Lanterman\nHarold tells Donna that she lies and betrays just like all everyone else. He is about to stab Donna when James bursts in and pulls them out; Harold holds on to the diary. James says he will go to the police.\nCooper carries Audrey into the Bookhouse and lays her down. He finds evidence that she has been drugged with heroin. She mumbles in her delirium about her throat hurting, and about sinking. She regains lucidity and tells Cooper that she had prayed for him to come.\nDonna and James watch Maddy drive off. James says that they should stick together, and that way they will be safe forever.\nHarry thumbs through a book of criminal photos and Cooper tells him that Audrey was very close to a lethal dose of heroin. Harry has identified Jean Renault in the book and tells Cooper about the surveillance tape, and Cooper deduces Jean's plot. Cooper says that he left his jurisdiction twice, and now Audrey is paying the price. Harry reassures him that Audrey is safe now and tells Cooper that he is the best lawman he' has ever met, but he thinks too much.\nCooper meets Ben in the hotel dining room with the briefcase of money. He reports that Audrey was at the One Eyed Jacks, that Blackie was murdered by Jean Renault, and that Audrey is recovering from a drug overdose. Ben hugs and thanks Cooper.\nBobby pushes Leo through the kitchen in a wheelchair. Tom Brockman, the insurance agent, congratulates Bobby and Shelly on their dedication to Leo. Shelly signs the agreement and the agent gives them their first check, which is much smaller than Bobby had planned for.\nDonna tells Harry about Laura's secret diary. Harry warns her that she is like the boy who cried wolf. Gordon Cole, Cooper's hard-of-hearing supervisor, enters. Gordon delivers Albert's reports: the hair from outside Cooper's room was from a vicuna coat, the drug from Gerard's syringe was unique, and the papers from near the train track were from a diary. Hawk enters dragging Gerard, who is taken to Harry's office.\nBen visits Audrey and she rebuffs his words of comfort. She asks for Cooper to take her home, but Ben suggests they all go together.\nNadine proudly comes back home with Ed and some bags and asks when her parents will be back from Europe, then not-so-subtly hints that the should have sex.\nJonathan gets dressed and tells Josie they are leaving that night. Josie argues that she needs to be paid from the insurance money and by Ben Horne, but Jonathan says he will kill Harry if she does not leave that night.\nMaddy looks over the lake, sitting next to James. He apologizes for their romantic confusion and Maddy says that she liked it that James was confusing her for Laura. She says that he and Donna belong together and that she is going home the next day.\nBen hands Josie a glass of wine and she says she will not leave the office without her money. Ben threatens her with his secret file on her late husband's demise. She rebounds with her own key to a safety deposit box full of evidence against him. Ben signs over to her the check from Tokyo Bank.\nBobby and Shelly have a party celebrating Leo's homecoming. Bobby and Shelly kiss, but Leo's head droops forward and Shelly screams.\nCooper meets Gordon at the station house. Gordon tells Cooper that Albert thinks Cooper is in over his head, like he was in Pittsburgh and delivers an anonymous letter that was sent to the home office. It is an opening move from a chess deal, indicating to Cooper that it is from Windom Earle.\nBen and Leland enter Ben's office and Ben says he needs Leland back. Leland says that he is 110%. Ben says Jerry is on his way to check out the new investors, and they need a way to delay the project, so Leland suggests several devious ways.\nHarry enters Josie's house and finds Jonathan carrying a full load of suitcases. Josie tells Harry she is leaving. Harry tells her she cannot leave, that he loves her. She turns away.\nBen lights a cigar at a table with Mr. Tojamura, who asks why he has received nothing when Ben has a cashier's check for $5,000,000. Mr. Tojamura says he will withdraw while Ben tries to dance around the questions, and Tojamura says his family was at Nagasaki. The sounds of a piano and Leland's voice begin, and Ben excuses himself. Leland does not take the hint to stop and Tojamura watches from the bar; next to him, Pete turns and identifies the song Leland sings as being from \"The King and I.\" As Leland and Ben exchange compliments, Pete tries hard to engage Tojamura in conversation.\nThe officers interrogate Gerard, who begs for his medicine and Cooper asks if he suffers from schizophrenia. He begins to have a seizure and speaks in an otherworldly voice. He says his name is Mike, and he is an inhabiting spirit. He says that BOB was his familiar and that he cannot reveal where BOB came from. He says that BOB is eager for fun and that everyone runs when he smiles. He talks about parasites and says that BOB needs a host to feed on fear and the pleasures. Together, Cooper and Mike they recite a poem: \"Through the darkness of future past, the magician longs to see, one chants out between two worlds, fire walk with me.\" Mike says that he saw God and took off his arm, but remained close to Gerard in order to stop BOB. He says that the picture is BOB's true face, but few can see it: only the gifted and the damned. He says that for the last 40 years, BOB has been in a lodge house in the trees, a house with many similar rooms but occupied by different souls every night. Cooper says \"The Great Northern Hotel!\"\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward (credit only)\nPeggy Lipton as Norma Jennings (credit only)\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran (credit only)\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nAlso Starring\nEric Da Re as Leo Johnson\nMichael Horse as Deputy Tommy 'Hawk' Hill\nSheryl Lee as Maddy Ferguson\nGuest Starring\nLenny Von Dohlen as Harold Smith\nIan Abercrombie as Tom Brockman\nDavid Lynch as FBI Regional Bureau Chief Gordon Cole\nWendy Robie as Nadine Hurley\nFumio Yamaguchi as Mr. Tojamura\nAl Strobel as Phillip Michael Gerard\nFeaturing\nJill Engels as Trudy\nRon Kirk as Cappy\nLeonard Ray as Lounge Local\nMak Takano as Jonathan\nBrett Vadset as Joey Paulsen"}