{"name": "Episode_4", "url": "https://twinpeaks.fandom.com/wiki/Episode_4", "text": "Episode 4\n\"The One-Armed Man\" redirects here. You may be looking for the eponymous character, Mike. For the 2017 episode, see Part 4.\n\"Episode 4\" (or \"The One-Armed Man\") is the fifth episode of the first season of Twin Peaks.\nPlot\n\"Even the ones who laugh are sometimes caught without an answer. These creatures who introduce themselves, but we swear we have met them somewhere before, yes? Look in the mirror. What do you see? Is it a dream, or a nightmare? Are we being introduced against our will? Are they mirrors? I can see the smoke. I can smell the fire. The battle is drawing nigh.\"\n ―Margaret Lanterman\nSarah Palmer describes a man to Deputy Andy Brennan as he makes a sketch. Donna sits on the couch with Sarah, and Maddy carries in some tea. Harry sits on a chair, listening. Sarah says she saw him at the foot of Laura's bed. Leland, in his bathrobe, asks if she told them about the necklace and says that Sarah had two visions. She tells of a flashlight moving across the ground, and a gloved hand moving a rock and pulling out Laura's broken necklace. Donna looks away.\nLucy is entranced with Invitation to Love and Harry enters and asks for an update. She tells the plot of the soap. Harry leaves, and Lucy and Andy have a small spat.\nIn the conference room, Doctor Jacoby performs some sleight of hand with golf balls. Agent Cooper watches him from across the table and tries to get Jacoby to tell him why Laura came to him. Jacoby does not confirm whether Laura had problems with cocaine or sexual problems and turns his attention to the map of Tibet, and discusses Hawaii and the medicinal properties of ginger. Cooper asks why Jacoby will not help the police investigation. Jacoby says his personal investigation will continue the rest of his life and says Laura had well-guarded secrets that he was not able to access. Harry enters and Jacoby says that the night after Laura died, he followed a man in a red Corvette to Old Sawmill Road, then lost him. On the intercom, Lucy tells Cooper that he has a call from his supervisor, Gordon Cole. Cooper dismisses Jacoby and asks him if will be around, and Jacoby says that at the end of the month, he will be going on a pilgrimage to Pebble Beach.\nCooper asks Harry if Leo drives a red Corvette: Harry says yes and that he has men tailing Jacques Renault. On the phone, Gordon says that the twine from Laura's shoulders is a common household item, but the twine from her wrists does not match. He says that the marks on her shoulders were bird bites and that Albert is reconstructing the plastic fragment from her stomach. Gordon says that Albert wants Harry's badge because of their fight.\nAndy brings his sketch from his conversation with Sarah. It is the same man that Cooper dreamed of, \"BOB.\" Deputy Hawk calls to say he has found the one-armed man at the Timber Falls Motel and they leave to meet him.\nAt the Timber Falls Motel, Josie sits in her car with a camera. Catherine rubs Benjamin's shoulders and brags about her success in switching the books. Harry pulls up to the Motel, and Hawk says to check room 101, under the name of Gerard. Catherine and Benjamin joke about their plan to torch the mill. Harry, Andy, and Cooper knock on the door to the hotel room. Andy drops his gun, and it fires. Benjamin looks through the curtains and out the window and Catherine says they sound serious. Harry bursts into a motel room, to a man in a towel with his hands in a closet. He has one arm. Benjamin excuses himself for a bath, and a poker chip falls out of his pocket. Catherine examines it: it reads \"One Eyed Jacks.\"\nThe officers show the drawing of the man from the dream to the one-armed man, Philip Gerard. He says he has never seen that man, but he looks like somebody. They ask if he knows anyone named Bob and he says that veterinarian Bob Lydecker is his best friend and is in a coma at the hospital. Gerard tells them that he lost his arm in a car accident while he was on the road selling pharmaceuticals, but is now selling shoes. When asked if he had a tattoo on his now-missing arm, he confesses that it did and it said \"Mom,\" which makes him break down crying.\nThe men return to the car and Hawk tells them that Josie Packard had been staking out the motel.\nAt Twin Peaks High School, Donna puts on lipstick in the girls' room, and Audrey enters with a cigarette and shares her ambitions of running away with Cooper, and conscripts Donna into helping solve the murder. Audrey summarizes some facts about Laura. Donna agrees, on the promise of secrecy.\nNorma meets her husband, Hank Jennings, in jail and he pleads with Norma to back him up and promises that he has changed. At his parole meeting, Hank blames fate for his accident and Norma says that she will give him a job when he's out of jail and that they will live together.\nThe officers park at a gas station and Cooper remarks that in his dream, the two men lived above a convenience store. They walk to Lydecker's Veterinary office, where inside the waiting room are several women with exotic pets, including a llama. The receptionist looks at the picture and says that is not Doctor Lydecker. Cooper believes that the bird that attacked Laura Palmer is a patient at Lydecker's office, and confiscates the office's files.\nAt the Johnsons' house, Shelly and Bobby make out. They talk about the funeral and Bobby is angry that James was seeing Laura behind his back. Shelly tells Bobby that Leo is with Jacques, and Bobby walks away to think. He tells Shelly that Leo and Jacques were running drugs across the border and selling them at the high school. Shelly shows Bobby the bloody shirt and Bobby takes it. She shows him the gun and asks him to teach her how to use it.\nThe lawmen return to the station with the files from the veterinarian. Harry instructs Lucy to go through them and look for bird owners and Andy apologizes for dropping the gun. He tells Lucy about it, and she brushes him off.\nCooper takes Andy to the firing range and Andy says he does not know why Lucy is angry. Hawk aces the shooting test, and Cooper instructs Andy to practice every day. Harry asks if Cooper has ever been married, and Cooper and Hawk discuss the vagaries of love. Cooper shoots four bullets through the eyes, and two through the nostrils. Over the intercom, Lucy says that the files are organized alphabetically by the name of the pet.\nAt the diner, Shelly tells Norma that she has one man too many in her life and says that all Leo was looking for was a maid he didn't have to pay. Norma sympathizes and says neither of them know what to do with their respective men. Norma says her plans are up in the air and that she is no longer sure she will divorce him, though Shelly says she definitely has plans for Leo. James enters and walks to the pay phone. Norma offers Shelly a day at the spa, together.\nDonna answers James' phone call and she invites him to the church potluck. She says they need to talk about what Audrey told her. Madeleine walks up to the diner counter. James says he will go to see Donna later, then talks to Madeleine. Madeleine comments on how she looks like Laura but says they did not know each other well.\nNorma finishes a phone call and tells Shelly that Hank got his parole.\nBenjamin uses an exercise bike, talking on the phone to the Icelandic investors. Audrey enters and asks if he is ashamed of her, based on their previous conversation. She says that she wants to change her life and help with the family business, saying that Laura's death inspired her to make something of herself. She asks to work at the cosmetics department in the store. She embraces her father and sees a picture of herself with Laura Palmer. The phone rings and Benjamin dismisses Audrey. He tells the caller to meet him down by the river in half an hour and to be discreet.\nThe officers sort the veterinary files. Gordon Cole calls to say that Albert is faxing the reconstruction of the plastic object from Laura Palmer's stomach and that the marks were from a parrot or a myna bird. The fax is a poker chip with a J -- possibly for One Eyed Jacks. Andy finds a file for Waldo, a myna bird owned by Jacques Renault. Cooper says they will make a house call.\nTwo people play tennis at night on a lighted court. Cooper watches them, and the officers run to the apartment building and up the stairs. They knock at a room and call for Jacques. Bobby is inside and hears them, fleeing through the window and down an alley. The officers enter, and a police car with siren blaring drives toward the alley after Bobby. Cooper finds the bloody shirt with Leo's initials.\nA red corvette sits in the woods. with Leo smoking nearby until Ben taps him on the shoulder. Benjamin criticizes his choice of vehicle but says that Hank believes Leo to be gifted. Leo points to a body and says it is Bernie, and that Jacques is back in Canada. Leo does not believe that Bernie gave him up, as Bernie was not too bright. Benjamin tells Leo to make sure that the mill looks clearly like arson, and hands him an envelope of cash.\nJames and Donna walk through the woods. Donna says that Mrs. Palmer knows about the necklace's burial, that she had a vision and saw someone take it. James pulls aside a rock to find that the locket is gone. Donna says that somebody must have seen them and followed them. She says that both Laura and her mother had visions and they discuss telling this to the police. Donna says they are the only two who loved Laura, that they must find her murderer for the sake of their relationship.\nJosie answers a call from Harry, who asks if she was at the Timber Falls Motel, but she says to call her tomorrow. Pete enters and says the day at the mill is over, and she fixes him a sandwich. He invites her to join him in a fishing contest and she opens a letter with a picture of a domino with double threes. She walks away toward a taxidermy bear, then the phone rings. It is Hank, licking an identical domino. Josie holds herself, and the credits roll.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Maddy Ferguson\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nChris Mulkey as Hank Jennings\nJed Mills as Wilson Mooney\nKimmy Robertson as Lucy Moran\nFeaturing\nMary Bond Davis as Female Parole Board Member #1\nMary Chalon as Female Parole Board Member #2\nJames Craven as Male Parole Board Officer\nAdele Gilbert as Midge Loomer\nAl Strobel as One-Armed Man\n\"INVITATION TO LOVE\"\nErika Anderson as Emerald\nLance Davis as Chet Weems\nUncredited\nLinda Carlson as Colleen Hurley (deleted scene)\nDon LaFontaine as Invitation to Love's announcer \nDavid Lynch as FBI Regional Bureau Chief Gordon Cole (voice)\nKevin Young as Toad\nUnknown performer as prison guard Andrews\nUnknown performer as prison guard Dickson\nNotes\nTimeline: February 28, Tuesday\nShooting script differences\nDeleted a line about Mrs. Milford.\nThe llama snorting in Cooper's face was confirmed by Kyle MacLachlan as a \"happy accident.\"\nThough MacLachlan keeps a straight face (despite being clearly startled by the llama), Michael Ontkean can be seen stifling a smirk, and the receptionist can be seen laughing in the background. According to MacLachlan's Twitter, the scene was only done in one take because Ontkean could not stop laughing to film the second.\nDeleted the scene between James and his mother Colleen Hurley. It was included in its entirety into Episode 10's script but was yet again not included in the released cut.\nTrivia\nThe direction of the episode was inspired by the 1945 film Fallen Angel."}