{"name": "Episode_1", "url": "https://twinpeaks.fandom.com/wiki/Episode_1", "text": "Episode 1\nNot to be confused with the pilot episode or Part 1.\n\"Episode 1\", also known as \"Traces to Nowhere\", is the second episode of Twin Peaks' first season, which aired on ABC on April 12, 1990. It was written by series creators Mark Frost and David Lynch, and directed by Duwayne Dunham.\nThe day after Laura Palmer's murder, Agent Dale Cooper continues his investigation, questioning several suspects connected to the victim, including Laura's secret boyfriend James Hurley and her best friend Donna Hayward.\nPlot\n\"I carry a log, yes. Is it funny to you? It is not to me. Behind all things are reasons. Reasons can even explain the absurd.Do we have the time to learn the reasons behind human beings' varied behavior? I think not. Some take the time. Are they called detectives? Watch, and see what life teaches.\"\n ―Margaret Lanterman\nAt 6:18 AM, Special Agent Dale Cooper dictates a tape to Diane, telling her about the conditions of his hotel room as well as his troubles with the nature of Marilyn Monroe's relationship to the Kennedys and who really pulled the trigger on JFK.\n \nAt breakfast, waitress Trudy Chelgren pours Cooper a cup of coffee, which he praises as being \"damn fine.\" Audrey Horne then observes him as he gives Trudy his order. She comes over and introduces herself to the special agent and sits across from him. He asks her about Laura Palmer, and she informs him that Laura tutored her brother Johnny.\nCooper goes to the sheriff's station, where he greets Deputy Andy Brennan, Lucy Moran, and Sheriff Harry S. Truman, all in the middle of consuming donuts. As Truman chews, Cooper fills him in on the plans for the day, then excuses himself to urinate.\nDoctor Will Hayward presents the results of Laura's autopsy, performed by Joe Fielding, as he could not bring himself to do it. The results find that the victim died from a loss of blood and she had various bite marks and lesions. It was also found that she had sexual relations with three men within a day of her death. Hayward has no doubt that Ronette Pulaski witnessed the crime, but was unsure when she would become responsive.\nShelly goes out to Leo, ready to go to work. He gives her a load of laundry to do before she leaves, in which she finds a bloodied shirt. She quickly hides it when Norma arrives to take her to work.\nJames Hurley is questioned by Agent Cooper and Sheriff Truman, and he confirms that he shot the video of Laura and Donna at the picnic. He tells them about the nature of their relationship, that it was Laura's idea to keep it secret. He also confirms that Laura was a cocaine user and tells them about his activities with her the night she died. Cooper presents the half of the heart necklace found at the crime scene, and James says he recognizes it. However, he claims to not know who has the other half.\nLeo frantically searches for the bloodied shirt, but does not find it.\nIn their cell, Bobby and Mike discuss money they owe to Leo, the remainder of which was in Laura's possession, but not paid before her death. Deputy Hawk then brings James back to his cell.\nDonna wakes up and goes to her mother, wondering why she was not woken up earlier to be at the sheriff's station. Her mother says it was decided to let her rest, and Donna explains her feelings over the previous day, including her new love affair with James.\nEd Hurley is introduced to Cooper, and warned that Bobby and Mike would likely try to come after James. Lucy then receives a long-distance call for Cooper from Agent Albert Rosenfield. Ed tells Harry that he suspects Jacques Renault of drugging his beer.\nAt the general store, Norma encounters Nadine, who was there to buy cotton balls in order to silence her drape runners.\nJames is released to Ed and requests the Bookhouse Boys to watch his back. Cooper then lets Bobby and Mike go, warning them to not go after James.\nPete cleans a fish as Josie thanks him for his support the previous day. Harry and Dale then arrive to question her about Laura, as she had been tutored by her in English. Pete pours the men cups of coffee and Josie tells them that the last time she saw Laura, she said that she then understood how Josie felt about her husband's death. Josie receives a phone call as Cooper asks how long Harry and Josie had been seeing each other. Pete then comes in to tell them that there was a fish in the percolator, so to not drink the coffee. Over the phone, Catherine antagonizes Josie, saying that her \"shenanigans\" cost the mill a substantial amount of money. As Pete cleans the percolator, Josie asks Cooper to define \"shenanigans.\"\nCatherine and Ben discuss their business plans to get rid of the mill, with Ben suggesting that they set it on fire.\nDonna comes to visit Sarah Palmer, Leland requesting she try not to upset her. Sarah and Donna both express how much they miss Laura. Donna takes Sarah's hand, and when Sarah looks up, she sees Laura's face in place of Donna's. She hugs her and screams when she sees a man with long, gray hair.\nAt the hospital, Hawk questions Janek and Suburbis Pulaski about Ronette and her activities. The deputy then spots a one-armed man and follows him to the morgue, but quickly loses track of him.\nAudrey dances in her father's office. He comes inside and asks if she had anything to do with the Norwegians leaving. She admits her guilt and Ben threatens her to ensure that she does not pull another stunt like this again.\nAt the Briggs home, the family sits around the dinner table. Garland Briggs wishes to discuss with Bobby the events since Laura's murder, but Bobby instead lights a cigarette. The major smacks his son, sending the cigarette flying into Betty's dinner. Betty tells their son that they are there for him.\nAt the Double R Diner, Cooper tries one of their cherry pies for the very first time, liking it so much that he requests more. He greets the Log Lady and is introduced to Norma, who he asks about the Meals on Wheels program that Laura helped organize. As the Log Lady leaves, she tells them that her log saw something the night Laura was murdered.\nLeo cuts open a football as Shelly arrives home. He asks her where his shirt is and beats her with a bar of soap stuck in a tube sock.\nJames goes to the Hayward home to meet Donna's parents and have dinner with them. Bobby and Mike stop outside and see James' bike.\nDoctor Lawrence Jacoby begins listening to a tape made for him by Laura and begins crying as he observes half of a heart necklace he had hidden inside of a coconut.\nDeleted scenes\n\"Lucy, Andy, and Donuts\"\nLucy and Andy go together to pick up donuts for the lawmen and Lucy tells Andy about her aunt who liked jelly donuts and that her aunt's son reminds her of Agent Cooper.\n\"27 Going on 6\"\nJohnny fires suction cup arrows at buffalo targets as Jacoby laughs and tells Agent Cooper and Sheriff Truman about his and Laura's history with Johnny.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nSheryl Lee as Laura Palmer\nRuss Tamblyn as Dr. Lawrence Jacoby\nGuest Starring\nGrace Zabriskie as Sarah Palmer\nDon Davis as Major Garland Briggs\nMary Jo Deschanel as Eileen Hayward\nCharlotte Stewart as Betty Briggs\nGary Hershberger as Mike Nelson\nWendy Robie as Nadine Hurley\nKimmy Robertson as Lucy Moran\nFeaturing\nCatherine E. Coulson as The Log Lady\nAlan Ogle as Janek Pulaski\nMichele Milantoni as Suburbis Pulaski\nJill Rogosheske as Trudy\nAl Strobel as One-Armed Man\nUncredited\nFrank Silva as BOB\nProduction staff\nCreated by Mark Frost & David Lynch\nMusic Composed & Conducted by Angelo Badalamenti\nProduced by Gregg Fienberg\nWritten by Mark Frost & David Lynch\nDirected by Duwayne Dunham\nExecutive Producers:\nMark Frost\nDavid Lynch\nAssociate Producer: Philip Neel\nDirector of Photography: Frank Byers\nProduction Designer: Richard Hoover\nEditor: Jonathan P. Shaw\nProduction Manager: Gregg Fienberg\nFirst Assistant Director: Robert D. Simon\nSecond Assistant Directors:\nCristopher T. Gerrity\nDeepak Nayar\nProduction Supervisor: Tim Harbert\n1st Assistant Camera: Rudy Fenenga Jr.\n2nd Assistant Camera: Beth Cotter\nArt Director: Okowita\nSet Decorator: Brian Kasch\nConstruction Coordinator: Keith Cox\nProperty Master: Clarence \"Cass\" Quitan\nCostume Designer: Sara Markowitz\nCostume Supervisor: Laurie L. Hudson\nMake-Up: Carla Roseto Fabrizi\nHair: Annette E. Fabrizi\nMake-Up/Hair Assistant: Linda A. Vallejo\nGaffer: Robert Ferrara\nKey Grip: Joseph A. Kelly\nSound Mixer: Walter Hoylman\nBoom Operator: Walter Charles Gorey\nTransportation Coordinator: Steve Boyd\nTransportation Captain: Greg Van Dyke\nLocation Manager: Steve Share\nCasting Assistant: Elaine J. Huzzar\nScript Supervisor: Judi Townsend\nProduction Controller: Nowell B. Grossman\nProduction Secretary: Lori Tulli-Mitchell\nOrchestrations: Angelo Badalamenti\nAssistant to Mark Frost: Paula K. Shimatsu-U.\nAssistant to David Lynch: Debby Trutnik\nAssistant to Gregg Fienberg: Suzanne Hargrove\nSupervising Sound Editor: John Larsen\nMusic Editor: Lori L. Eschler\nAssistant Editor: Pamela Reisenleiter\nApprentice Editor: Alison M. Howard\nRe-recording Mixers:\nGary Alexander\nJim Fitzpatrick\nAdam Jenkins\nAssorted wardrobe provided by:\nThe Greif Companies\nSheplers\nExtras Casting: Superior Casting, Inc.\nTitles & Opticals by Pacific Title\nColor by de luxe\nTelecine and Electronic Post Production: Encore Video\nPost Production Sound & Sound Effects by Todd-AO/Glen Glenn Studios\nIn Association with Propaganda Films\nNotes\nTimeline: February 25th, Saturday\nThe origin of the fish in the percolator comes from a past experience of David Lynch. During breakfast at the studio of his friend Bushnell Keeler he discovered that he and David Keeler drank coffee made with a bar of soap in the percolator.\nProduction\n\"Episode 1\" was written by the series creators David Lynch and Mark Frost. The pair had co-written \"Pilot\", and would also write \"Episode 2\" together. Frost would pen a further eight scripts for the series after that, while Lynch would write just one episode—the second season opening installment, \"Episode 8\". The episode was the first in the series to be directed by Duwayne Dunham, who would return to helm two further installments in the series' second season. The episode features the first full appearance of Frank Silva as BOB, though the character is not yet identified at this point. Silva was the art director for the series, and had accidentally been caught on camera during a shot. Lynch was pleased with the result and decided to include Silva in the cast from then on.\nDunham had first met Lynch when he worked as the film editor for Lynch's 1986 film Blue Velvet. Dunham then edited \"Pilot\", and was about to look for another editing job elsewhere when he asked Lynch if the director had another film planned; a week later Lynch decided to film Wild at Heart and asked Dunham to edit that as well. However, Dunham had committed to another project and felt uncomfortable leaving one editing job for another; Lynch then offered him a directing position on Twin Peaks in the interim to justify cancelling his other project. Dunham finished principal photography on \"Episode 1\" the same day that Lynch finished filming \"Wild at Heart\".\nThe introduction of a sexual rapport between the characters of Audrey Horne and Dale Cooper was a suggestion of Dunham's, who felt it would benefit both characters. Dunham felt that the central mystery in the series — the murder of schoolgirl Laura Palmer — was simply a \"MacGuffin\" to compel what he saw as the real focus, the interaction of the large ensemble cast. As such, he took care to introduce meaningful interactions between characters wherever possible. Dunham also spent time with each of the cast to help them develop their characters, having studied the scripts involved and basing his take on the characters on his experience with \"Pilot\".\nDunham retained the frequent use of static cameras seen in \"Pilot\", something he saw as a hallmark of Lynch's directing style; describing the result as \"like framed pictures\". He also continued the use of a \"warm\" reddish tint to the footage, using soft coral filters and carefully selected props and costumes to obtain this coloring. This tint was considered important enough that Lynch sent a representative to the network to ensure they understood it was deliberate and not a mistake, for fear that they might correct the saturation to be more \"realistic\" before broadcasting it.\nRatings\n\"Episode 1\" was first broadcast on American Broadcasting Company (ABC) on April 12, 1990. Upon its initial airing, it was seen by 14.9 million households, or 27 percent of the available audience. It placed second in its timeslot after Cheers. This marked a decline from \"Pilot\", which attracted 33 percent of the available audience. The following episode would be viewed by 21 percent of the available audience, representing a further drop in numbers.\nWriting for The A.V. Club, Keith Phipps awarded the episode an \"A−\" rating. He felt that the scene showing Leo Johnson domestically abusing his wife was \"among the show's most disturbing moments\", comparing it to a scene from the 1990 film The Grifters. Phipps also felt the sound design in the episode was impressive, commenting positively on the blurred distinction between diegetic and non-diegetic music. Writing for Allrovi, Andrea LeVasseur rated the episode four stars out of five. Television Without Pity's Daniel J. Blau felt that the episode showed series composer Angelo Badalamenti to have limited range, repeating several similar musical cues throughout. He also considered Eric Da Re's performance as Leo Johnson to be unconvincing, finding it difficult to believe that the character was as feared and menacing as was implied. However, Blau described the introduction of BOB as still seeming powerful and frightening even several years after first being seen, considering it a potent and disturbing scene.\nProduction errors\nAudrey's hair is significantly longer than in the Pilot."}