{"name": "Episode_27", "url": "https://twinpeaks.fandom.com/wiki/Episode_27", "text": "Episode 27\n\"Episode 27\", or, \"The Path to the Black Lodge\" is the twentieth episode of the second season of Twin Peaks, and the twenty-eighth episode of the series as a whole. It originally aired April 18, 1991.\nPlot\n\"There are clues everywhere, all around us. But the puzzle maker is clever. The clues, although surrounding us, are somehow mistaken for something else. And the something else, the wrong interpretation of the clues, we call our world. Our world is a magical smoke screen. How should we interpret the happy song of the meadowlark or the robust flavor of a wild strawberry?\"\n ―Margaret Lanterman\nLawmen remove Rusty Tomasky's body from the gazebo as Agent Cooper and Sheriff Truman question a friend of Rusty's. He tells them that he was passing by Twin Peaks with his band and Rusty went with a man who offered him beer. Cooper states that Windom Earle is playing off the board.\nThe men return to the sheriff's station in the morning, and Lucy tells Andy that she will be choosing the father of her child the next day. Andy then gives her some pointers for her speech she is to give at the Miss Twin Peaks Contest.\nJack looks for Audrey as he prepares to leave the hotel. Doctor Hayward gives Ben an examination. Will tells him to stay away from Eileen, but Ben insists on doing what he believes to be the right thing. Jack comes and Doc leaves for his office. Jack tells Ben that he will be leaving Twin Peaks due to a partner being murdered.\nDonna looks in the attic of her home, examining her birth certificate and finds that no father is listed. Her mother calls her down with an important phone call from Deputy Hawk.\nAudrey returns to the hotel and Hawk stops her to take her to a meeting ordered by Agent Cooper.\nBen and Jack further discuss the latter's departure and the effects that it may have on the Stop Ghostwood campaign. Jack has Ben give Audrey a letter.\nMajor Briggs assigns Cappy some work and meets with Dale and Harry to discuss Earle's activities with Project Blue Book, telling them that he became obsessive and violent and was dropped from the project. He shows them footage of Earle speaking about dugpas and a place called the Black Lodge. Cooper figures that Earle's true motivation for coming to Twin Peaks is to find the Black Lodge and that the Owl Cave petroglyph has a sort of connection. Earle listens in on the conversation and states that he knows more than the lawmen do. He plans to go with Leo Johnson to ambush Major Briggs.\nA woman eats pie, her hand shaking. Bobby and Shelly discuss the latter's speech for the Miss Twin Peaks contest, and Bobby tells her that he loves her. Shelly gets a phone call from Agent Cooper.\nMayor Dwayne meets Lana at the roadhouse and tells them that he, Norma, and Dick are the judges. They plan a scheme for her to get Dick's vote.\nCooper meets with Shelly, Audrey, and Donna concerning the poem that was given to them by Earle and any strange encounters they had with him. He tells them to check in with the sheriff twice a day and gives them guidelines for their safety.\nEarle tells Leo about the dugpas as the latter cleans off a table saw. Leo notices Shelly on one of the queen cards, Earle expressing his doubt over whether Leo loves her. Leo holds out the shock collar remote, Earle feigning fear until Leo shocks himself entertaining Earle.\nAudrey returns to the hotel, missing Jack as he leaves. She goes to her father's office and asks about Jack, but Ben tells her that he feels Stop Ghostwood needs a spokesperson, specifically her, and urges her to enter Miss Twin Peaks. Audrey finally gets Ben's attention about Jack; he tells her he has gone, and she leaves.\nPete Martell claims to see Josie's face above the fireplace and Audrey has him take her to the airport.\nCooper, Truman, and Andy observe the petroglyph and wonder where Briggs has gone. Truman has Andy call Betty. Cooper muses about Annie, saying that he thinks about her frequently throughout the day. His hand briefly shakes.\nBriggs wanders through the woods until he encounters two men in a horse costume, who brandish a dart gun, incapacitating him. Earle reveals himself and Leo as the horse, laughing.\nJack prepares to leave in his plane.\nCooper goes to the diner and talks with Annie, and she notices that he is being troubled, and he admits that he has been thinking about her more than the case at hand. She admits to thinking about him all day. He offers to take her dancing later and they share a kiss, accidentally knocking over a stack of dishes.\nPete takes Audrey to the airport and right before Jack prepares for takeoff, Audrey stops him. They express their love for each other, and Jack states that he must leave, but does not know if he will return. She requests him to make love to her and they go inside his plane, leaving Pete teary-eyed as his hand starts shaking.\nEarle interrogates Briggs about the Owl Cave, but the major states that he is not at liberty to give him the answers he seeks. Windom injects him with a sort of truth serum, causing Briggs to admit that he saw the petroglyph in a dream during his disappearance. He describes signs that say, \"there is a time if Jupiter and Saturn meet, they will receive you.\" He then utters some indistinguishable words which very much sound like \"Taht mug uoy ekil si gnimoc kcab ni elyts\" which is reverse speech for: \"That gum you like is going to come back in style\"\nCatherine shows the puzzle box to Andrew, who solves one of the layers, then smashes another with a rolling pin, revealing a metallic box.\nCooper meets Annie at the roadhouse and offers to teach her how to dance. She expressed to him that she wanted more than his kisses, but they are interrupted by Mayor Milford addressing the crowd, but struggling with the microphone. She expressed her attraction to Dale and they share a kiss, being once again interrupted by Milford. She decides to enter Miss Twin Peaks, but then the Giant appears to Cooper, waving his arms and mouthing \"no.\"\nJack leaves, waking Pete up in his truck. Audrey goes to Pete, who reassures her that Jack would return. After she mentions Jack's promise to take her fishing, Pete offers to go with her, stating that a \"trout's leap in the moonlight\" is a cure for a broken heart.\nLeo and Briggs are disturbed by computer noises as an unphased Earle discovers that the petroglyph is actually a map to the Black Lodge.\nDeep in the woods, a light appears and BOB steps out into the open as a reflection on the ground in front of him reveals red drapes.\nDeleted scene\nA deleted scene entitled \"Bobby Coaches Shelly\" features Bobby admitting to Shelly that he has not been fair to her, then they go over Shelly's speech for Miss Twin Peaks, which does not appear to follow the given theme for the speech.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings (credit only)\nJames Marshall as James Hurley (credit only)\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell\nKimmy Robertson as Lucy Moran\nJoan Chen as Jocelyn Packard (credit only)\nPiper Laurie as Catherine Martell\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Tommy 'Hawk' Hill\nKenneth Welsh as Windom Earle\nGuest Starring\nBilly Zane as John Justice Wheeler\nHeather Graham as Annie Blackburn\nRobyn Lively as Lana Budding Milford\nDon Davis as Maj. Garland Briggs\nMary Jo Deschanel as Eileen Hayward\nDan O'Herlihy as Andrew Packard\nCo-Starring\nWillie Garson as Heavy Metal Roadie\nJohn Boylan as Mayor Dwayne Milford\nCarel Struycken as The Giant\nFeaturing\nRon Blair as Randy St. Croix\nRon Kirk as Cappy\nTed Raimi as Heavy Metal Youth\nFrank Silva as Bob\nLayne Robert Rico as Pilot\nUncredited\nunknown performer as Lady with the Shaking Hand"}