{"name": "Episode_9", "url": "https://twinpeaks.fandom.com/wiki/Episode_9", "text": "Episode 9\nNot to be confused with Part 9.\n\"Episode 9\", or, \"Coma\" is the second episode of the second season of Twin Peaks, and the tenth episode of the series as a whole. It originally aired October 6, 1990.\nPlot\n\"As above, so below. The human being finds himself, or herself, in the middle. There is as much space outside the human, proportionately, as inside.Stars, moons, and planets remind us of protons, neutrons, and electrons. Is there a bigger being walking with all the stars within? Does our thinking affect what goes on outside us, and what goes on inside us? I think it does.Where does creamed corn figure into the workings of the universe? What really is creamed corn? Is it a symbol for something else?\"\n ―Margaret Lanterman\nDuring breakfast, Cooper explains Buddhist Tibetan traditions and history to an uninterested Albert. Albert tells him the results of Jacques Renault’s autopsy and states that Jacques was snuffed with a pillow. The killer wore gloves and the tape used to bind his wrists was stolen from a hospital supply cabinet. Albert says the mill fire was arson, with Leo Johnson being the prime suspect. Albert then reports that Windom Earle, Cooper's former partner, who was institutionalized, has vanished into thin air. An Asian man reads the paper and watches Cooper intently.\nDonna carries a tray of food to bedridden Mrs. Tremond. A a little boy wearing a jacket and bow tie sits near the door and makes creamed corn disappear from the food tray and appear in his hands. Mrs. Tremond says \"My grandson is studying magic,\" and denies knowing Laura well. She suggests that she ask Mr. Smith, next door. The boy says \"J'ai une âme solitaire,\" and Donna goes next door, knocks, then leaves a note. \n \nIn Ronette's room, Harry and Cooper read the instructions before adjusting the stools, then sit next to Ronette's bed. Ronette denies that Leo was the man that hurt her and when Cooper shows her the sketch of BOB, Ronette reacts violently. Jerry and Ben debate the merits of burning the real or the faked ledger and decide to toast marshmallows instead.\nAt the Double R Diner, Andy has trouble taping the sketch of BOB captioned \"Have you seen this man?\" to the front door. The Log Lady enters and sits at the counter next to Major Briggs. Norma asks the Log Lady to spit her gum in an ashtray rather than on the counter. The Log Lady tells the Major that her log has something to tell him: \"Deliver the message.\" The Major says he understands.\nAt the sheriff's office, Andy tells Lucy that when he had applied as a donor to the Tacoma Sperm Bank and they told him he was sterile and could never have babies so now he wants to know why Lucy is having one and how. In the sheriff's office, Truman has Hank sign-in and tells him to keep his nose clean for another week. After Hank leaves, Truman tells Cooper he and Hank grew up together and that Hank used to be a Bookhouse Boy - one of the best. Ben Horne phones and reports that Audrey has been missing for two days.\nJerry brings the unsigned insurance policy to Ben and explains that Catherine would not sign it because of concerns about the beneficiary being Josie. They decide to call the Icelanders and Leland enters. Einar tells Ben that Leland had called to tell him about the fire and Ben and Jerry calm the concerned Einar down. Ben suggests that Leland confine his activities to preparing his tax return. Leland then sees a copy of the sketch of Bob and says that he knows the man, as the man who lived next door to his grandfather's summer house at Pearl Lakes when Leland was a little boy. Leland leaves to tell the sheriff. Ben asks Jerry to kill Leland.\nAt the hospital, Doctor Hayward shows Leo to Shelly and tells her there is possible brain damage. Shelly asks if he is a vegetable and he does not deny it. Shelly cries. \nLucy receives a call for the sheriff from someone who will not give his name. She tells the caller she cannot connect him unless he tells her his name and then hangs up.\nAt One Eyed Jacks, Audrey intercepts a girl carrying ice to Emory Battis, who is lying inverted on a chaise-lounge with ankles and wrists bound while another girl pushes a vacuum cleaner. Audrey signals the girl to leave and then unplugs the vacuum and wraps the cord around his neck. She threatens to reveal all about Emory, Laura, and Ronette to her father. Emory admits working for the owner of One Eyed Jacks, her father, and recruiting Laura and Ronette. He says Laura came there one weekend but was using drugs and they threw her out. He says her father saw Laura there, and that he makes it his business to entertain all the girls. He says Laura knew Ben Horne owned One Eyed Jacks and that Laura always got her way, just like Audrey.\nIn the evening, Bobby and Shelly sit in his dad's car. He tells her that Leo gets a disability check as long as he is out of prison, and he gets over $5,000 a month, but only if he is home. They then talk about being together.\nAt night, Cooper tells Diane about being troubled because of Windom Earle's disappearance and also because Audrey's absence touches him. Major Briggs visits and tells him that he has a message for him. He explains that his work includes maintenance of deep space monitors aimed at distant galaxies and they routinely receive communications that are gibberish and noise, or, \"space garbage.\" Among these was one clear message that came in late Thursday night or early Friday, about the time Cooper was shot, he notes. The message was: \"The owls are not what they seem.\" When Cooper asks how he knew it was for him, the Major shows him another message that came in later: \"Cooper,\" repeated many times.\n \nAt the Hayward home, James, Maddy, and Donna record a song. Donna notices James and Maddy looking at each other and runs out of the room, upset. A phone call comes for Donna from Harold Smith as Maddy has a vision of BOB coming at her over the couch, causing her to scream. James and Donna go to her, but there is nothing there.\nCooper dreams several flashbacks, including the giant telling him, \"the owls are not what they seem,\" Ronette dreaming of BOB, the image of an owl superimposed over Sarah's vision of BOB, Sarah going downstairs, and BOB smiling.\nCooper awakes and answers the phone to Audrey saying, \"why aren't you here?\" She tells him he looked handsome in his tuxedo and that she is in trouble. Blackie and Emory hang up her phone and Blackie tells Audrey, \"Miss Horne, you don't know what trouble is, not by a long shot.\"\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley (credit only)\nJack Nance as Pete Martell (credit only)\nKimmy Robertson as Lucy Moran\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard (credit only)\nAlso Starring\nEric Da Re as Leo Johnson\nHarry Goaz as Deputy Andy Brennan\nSheryl Lee as Maddy Ferguson\nGuest Starring\nChris Mulkey as Hank Jennings\nMiguel Ferrer as FBI Agent Albert Rosenfield\nDavid Patrick Kelly as Jerry Horne\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nVictoria Catlin as Blackie O'Reilly\nDon Amendolia as Emory Battis\nFrances Bay as Mrs. Tremond\nGrace Zabriskie as Sarah Palmer\nCatherine E. Coulson as The Log Lady\nFeaturing\nPhoebe Augustine as Ronette Pulaski\nAustin Jack Lynch as Little Boy\nJill Pierce as Ice-Bucket Girl\nMak Takano as Asian Man\nUncredited\nJula Bell as Girl at One Eyed Jacks with Vacuum Cleaner\nFrank Silva as BOB\nUnknown performer as Einar Thorson (voice)\nNotes\nTimeline: March 4, Saturday\nNielsen Rating: 9.2/18"}