{"name": "Ernie_Niles", "url": "https://twinpeaks.fandom.com/wiki/Ernie_Niles", "text": "Ernie Niles\nErnie \"The Professor\" Niles was the step-father of Norma Jennings and was once an accomplice of her husband, Hank Jennings.\nBiography\nErnie served in the Korean War, during which time, he discovered his hyperhidrosis.\nErnie was incarcerated at the Washington State Penitentiary for fraud. During his sentence, he met Hank Jennings.\nAfter his release, he met Vivian Smythe at her motel, the Weary Traveler. He was soon hired as an informal handyman and, within weeks, had moved in with Vivian, later marrying her. They moved to Seattle, where they invested in an ultimately unsuccessful restaurant.\n \nIn March 1989, Ernie went to the Double R Diner in Twin Peaks with Vivian and was introduced to her step-daughter, Norma Jennings, who also happened to be Hank's wife. He got on the phone with the Great Northern Hotel, where they then left to get their room, as he had a fax from Tokyo waiting.\nAt dinner with his wife, Norma, and Hank, Hank Jennings, the women excused themselves and the men discussed their shared past in crime. However, Ernie revealed to Hank that he had changed his ways. When the women returned, Hank made a toast to Ernie and Vivian.\nErnie and Hank excitedly entered the office at One Eyed Jacks days later with a couple of girls, who they then dismissed and they discussed their future business as Jean Renault entered. Renault wished to use his computer expertise for a financial operation. A man then entered with cocaine to traffic and Ernie was taken to the casino by Hank.\nExhausted, he went to the diner the next day with Hank after their hunting trip. He said that he killed a 12-point buck. Norma told him that his wife had gone back to Seattle.\nErnie ate at the diner the following day when he was approached by DEA agent Denise Bryson who had photos of him in the middle of a drug deal.\nHe was interrogated by Bryson and FBI Special Agent Dale Cooper, and confessed his guilt, claiming he did it all against his will. He explained the circumstances of the drug deal and Denise told him that he would be part of a sting operation for them.\nThe next day, Ernie contemplated making the call to Renault to set the buy, Denise trying to urge him into doing so. Cooper came in and when Denise called Ernie \"gun-shy,\" he made the call, albeit reluctantly.\nDeputy Hawk prepared him for the buy by putting a microphone on him.\nAt the buy at Dead Dog Farm, Ernie's excessive sweat caused the microphone to malfunction and emit smoke, blowing his and Denise's cover. They were held at gunpoint until Cooper offered himself in exchange for them.\nIn exchange for his cooperation, Ernie was cleared of any wrongdoing. He returned to Seattle, finding that Vivian had moved him out and filed for divorce. Subsequently, Ernie reverted to a life of crime and experienced bankruptcy, poverty, and alcoholism.\nHe died in the waiting room of a Pierce County hospital in 2005 and a prison charity organization scattered his ashes over Puget Sound."}