{"name": "Evelyn_Marsh", "url": "https://twinpeaks.fandom.com/wiki/Evelyn_Marsh", "text": "Evelyn Marsh\nEvelyn Marsh was a woman who, along with Malcolm Sloan, plotted to kill her husband, hiring James Hurley in order to frame him for the murder.\nBiography\nIn March 1989, Evelyn sat at Wallies Hideout and eyed a young man when he entered. She asked if he was running from something. The young man said he was from Twin Peaks and she requested him to repair her husband's Jaguar. He then introduced himself as James Hurley and he agreed to take a look at the car.\nJames examined the car, finding that he should be capable of fixing it up. She said that she was not sure where her husband was, but that he was out on business. She offered him room and board while he worked on the car.\nAfter showing his progress on the car the next day, James asked Evelyn about her husband's physical abuse toward her, information that had been divulged to him by Malcolm Sloan, her secret lover who was pretending to be her brother. However, she refused to talk about it, and they kissed until Jeffrey arrives. She left to go to him.\nThe following day, Evelyn asked James about the woman who made him leave Twin Peaks, and he told her specifically about a girl he was in love with named Laura, who died. She told him she understands what caused him to run and they kissed. James then showed her the repaired car and they shared a bottle of champagne along with a romantic encounter.\nAfter sleeping with James, she dressed and left his room as he slept. She went to Malcolm and they kissed.\nIn the morning, Evelyn went with her husband to James, the two men meeting for the first time. Jeffrey went for a drive in the car.\nLater, she went to James' room to find that he had prepared to leave and she begged him not to go.\nShe went to Wallies Hideout, where she met a young woman who was looking for James. She told the girl that James possibly went to Mexico and that she should go home.\nShe returned home in the evening to find James packing. She told him she loved him and that Jeffrey had died in an \"accident.\" He figured out that this was meant to look like James killed him, a plan put in motion by Malcolm.\nEvelyn and Malcolm reported to a deputy the next day that James should be considered a suspect in Jeffrey's death.\nShe later returned to the bar, where the young woman came to her, introducing herself as Donna. She did not tell her the reason she had helped frame James and Malcolm came to get her, threatening Donna to not interfere.\nJames returned to her home, questioning her motives in the crime. She said that though she wanted Jeffrey's money, she harbored true feelings for James, despite her actions. They kissed and Malcolm revealed himself, hitting James with a gun. He prepared a cover story in which James came back to kill her and she killed him in self-defense.\nMalcolm tried to convince her to leave her fingerprints on the gun so he could then kill James, but she refused. Donna then burst into the room, pleading for James' life. Malcolm begged for Evelyn to hand over the gun, but she shot him.\nJames was later told by police that Evelyn would have to stand trial and that he would have to testify against her."}