{"name": "Experiment", "url": "https://twinpeaks.fandom.com/wiki/Experiment", "text": "Experiment\n\"What the hell?!\"\n ―Gordon Cole\nThe experiment was a supernatural being connected to the spirit BOB. It is white and female looking with a gaping mouth and two small horns. Its thumbs were reversed.\nBiography\nOn July 16, 1945, following the first nuclear test at White Sands, New Mexico, the experiment, floating in a dark void, expelled a stream of matter from its mouth, containing several speckled eggs. The stream also contained a large orb that bore an image of BOB's face.\nIn September 2016, the experiment materialized in a black mist in a glass box in New York City moments after Dale Cooper did. It violently shifted around for a few moments before breaking out and attacking Sam Colby and Tracey Barberato, hacking them to death.\nAgent Tamara Preston later showed a still image of the figure, taken from a camera at the crime scene, to Agent Albert Rosenfield and FBI Deputy Director Gordon Cole, who were both visibly bewildered by the figure.\nThe Fireman showed Deputy Andy Brennan an image of the experiment, seen before it broke out of the glass box.\nBehind the scenes\nThe \"Experiment\" was a computer-generated character modeled by actress Erica Eynon. \"Part 1\" credits Eynon as \"Experiment Model.\"\nThe experiment looks similar to the white naked figures from some pictures from David Lynch, notably those of his Distorted Nudes book, \"Woman Thinking #2\" seen in the Dark Splendor book and the Head Series from his \"Small Stories\" exposition.\nIt could be theorized that the people watching the glass box expecting something to happen are an allegory of the viewers watching the series, but that was reportedly not Lynch's original intention.\nIn \"Part 17,\" Gordon Cole discusses the entity Judy, possibly referring to the experiment itself.\nIn The Secret History of Twin Peaks, it is mentioned that after founding JPL, Jack Parsons conducted rituals at the Devils Gate in Pasadena in an attempt to call forth the goddess Babalon, also known as the Mother of Abominations, a key figure in the Thelema mythos. Later, the weekend before the 1947 Roswell Incident, in Jornada del Muerto, on the ground where the bomb was tested, he tried to open a second gate to bring forth the elemental entity known as the \"Moonchild\" using the Working of Babalon.\nIn addition, Douglas Milford recounts President Richard Nixon showing him and actor Jackie Gleason a bizarre figure, similar in appearance to the experiment, in an observation room at Homestead Air Base.\nWhen directly asked about a connection between the Experiment and the figure shown to Milford, co-author Mark Frost acknowledged the possibility without confirming or denying it. He reacted the same when asked if sex magic was partly the cause of its appearance in \"Part 1,\" in the same vein as Jack Parsons' rituals."}