{"name": "Fat_Trout_Trailer_Park", "url": "https://twinpeaks.fandom.com/wiki/Fat_Trout_Trailer_Park", "text": "Fat Trout Trailer Park\nThe Fat Trout Trailer Park was a trailer park located in Deer Meadow, Washington, owned and managed by Carl Rodd since the late 1980s.\nIn the shooting script of Twin Peaks: Fire Walk with Me, the trailer park was instead known as the Canyon Trailer Park.\nHistory\nTeresa Banks, a waitress and part-time prostitute, lived at the Fat Trout for about one month in early 1988. During her stay, she worked as a waitress at nearby Hap's Diner, while also renting rooms at the Red Diamond City Motel to meet johns. One night, after she attempted to blackmail Leland Palmer, Palmer beat her to death with a lead pipe inside her trailer. He then wrapped her in plastic and threw her into Wind River, where her body was found soon thereafter.\nFBI Special Agents Chet Desmond and Sam Stanley visited the trailer park to search her unit and question Carl Rodd, the owner. While they were having a coffee inside Banks' trailer, a hunched woman shuffled up to the door and peered inside, shuddering, before retreating, which seemed to disturb Rodd.\n \nLater that evening, Agent Desmond returned to the trailer park and asked Carl for directions to Deputy Cliff Howard's trailer. Rodd, interrupted by Margaret, pointed it out to him and left to take care of her concern. However, Desmond was intrigued by a noise emanating from a particular telephone pole, and instead went to inspect a seemingly empty trailer in the other direction. After knocking and receiving no answer, he knelt down and spotted a green and gold ring lying beneath it, which Banks had worn in an old photograph. Desmond reached out to pick it up.\nSome days later, Special Agent Dale Cooper arrived to investigate Desmond's disappearance, as the latter agent had not been seen since. Rodd, exasperated, told Cooper about his last conversation with Agent Desmond, then followed him to the spot where the unmarked trailer had been. Rodd explained that an old woman and her grandson had lived there, named \"Chalfont,\" which was also the family who had occupied it before them. Cooper then noticed that someone had written \"Let's Rock\" across the windshield of Desmond's abandoned car.\nBy 2016, Rodd had relocated the park to a new lot near Twin Peaks, Washington, dubbed the \"New\" Fat Trout Trailer Park.\nNotable residents\nTeresa Banks\nMrs. Chalfont and her grandson\nChalfont family\nCurious woman\nCliff Howard\nMargaret\nMillie\nCarl Rodd - owner, manager\nSam"}