{"name": "February_1989", "url": "https://twinpeaks.fandom.com/wiki/February_1989", "text": "February 1989\nThe following events took place in February 1989:\nEvents\n\nSunday, February 5\nLaura Palmer gives James Hurley a half heart necklace to show her affection.\nSunday, February 12\nLaura, James, and Donna Hayward have a picnic in the woods. James films the two girls dancing with Laura's video camera.\nThursday, February 16\nPhillip Jeffries arrives at the Palm Deluxe in Buenos Aires, Argentina and asks the clerk if \"Ms. Judy\" is staying there. The clerk gives him a letter from a young woman. Jeffries goes upstairs with a bellhop carrying his bags.\n10:10 a.m. EST – Cooper reminds Gordon Cole that he was worried about this particular day because of a dream.\nWhile Cooper tests the Philadelphia FBI office's surveillance cameras, Philip Jeffries steps out of the elevator after being missing for two years.\nJeffries confronts Cooper, Cole, and Albert Rosenfield, rambling incoherently about Judy and a meeting above the convenience store. While Cole attempts to call for backup, Jeffries disappears from his chair.\n \nJeffries reappears back at the Palm Deluxe in Buenos Aires, screaming in pain. Shortly afterward, Jeffries disappears once again.\nLaura Palmer and Donna Hayward walk to school, greeting their respective boyfriends Bobby Briggs and Mike Nelson. Laura takes cocaine in the girls' restroom.\n2:30 p.m. PST – Bobby kisses the homecoming display case showing Laura's photograph.\nLaura and James Hurley have a rendezvous in the school's custodian closet.\nAfter school, Laura and Donna spend the afternoon at Donna's house, talking about James and falling in space.\nAt home, Laura realizes BOB has found and removed pages of her diary. In a panic, she drives to Harold Smith's home and leaves the diary in his keeping.\nAt dinner, Leland Palmer instructs Laura and Sarah how to introduce themselves in Norwegian for the business delegation arriving next week. They chant the phrase in unison, before breaking down in laughter.\nLate at night, Laura sneaks out of the house and meets a trucker friend of Leo Johnson for sex.\nFriday, February 17\nDale Cooper warns Albert Rosenfield that Teresa Banks' killer will strike again soon, and predicts that Albert will help him solve the next case.\n \nAt the Double R Diner, Laura Palmer prepares to leave for a Meals on Wheels drive. She is called over to the street by Mrs. Tremond, who gives her a framed picture of a doorway. Pierre whispers to her that \"the man behind the mask\" is searching for her secret diary. Laura tells Shelly that she can't make the run today, and leaves in a hurry.\nShelly tells Norma Jennings about Laura's absence and agrees to make the run for her. Ed and Nadine Hurley come into the diner, but Nadine is upset to see Norma at the counter and stalks out, as Ed apologizes and follows. Norma retires to a booth and starts crying.\nLaura searches her house and finds BOB crouching behind her dresser. Screaming, she flees the house and hides behind a hedge. She then begins to panic when she sees Leland exit the house and drive away.\n \nLaura goes to Donna's house and, sobbing, asks her to reassure her that they're still friends. They spend the afternoon at her house, where Will and Eileen both try to console her.\nLaura returns home and joins her parents for dinner. Leland, however, berates her for failing to wash her hands before sitting down, and then threatens her to tell him who gave her her locket. Sarah begs him to stop scaring her, and finally he relents.\nWhile preparing for bed, Leland breaks down in tears, and goes to Laura's room to apologize for his behavior.\n \nAfter falling asleep, Laura finds herself inside the room shown in Mrs. Tremond's picture. She steps through to find Mrs. Tremond and the little boy, before the curtains of the red room appear. She sees a conversation between Dale Cooper and the the arm. The arm extends a gold ring to her, while Cooper warns her not to take it. She seemingly awakens with the ring in her hand, and then sees Annie Blackburn lying next to her. Annie gives her a message about \"the good Dale\" to write in her diary.\nSaturday, February 18\nTo be added\nSunday, February 19\nAt the Timber Falls Motel, Phillip Gerard puts out a circle of candles, chanting, \"Fire walk with me.\"\nDonna and Laura recover from the previous night at Donna's house, Donna struggling to recall how she made it home. Crying, she hugs Laura, who says she doesn't want Donna to be like her. Leland arrives to take Laura to breakfast.\n \nOn the way, Leland and Laura are pursued by Gerard, who roars past them and pulls up next to Leland, shouting at him about stealing \"the corn. Leland guns the engine to drown him out, as Gerard waves a ring at Laura and shouts that \"it's\" her father. Leland speeds away and pulls up at a mechanic's shop. Laura, emotionally shot, tries to recall where she has seen the man before, then asks her father if he stopped by the house two days before.\nAt night, Laura remembers seeing Gerard's ring on Teresa Banks' finger, and offered to her by a little man in a dream. She asks BOB who he really is. Leland recalls murdering Teresa the previous year.\nMonday, February 20\nTo be added\nTuesday, February 21\nTo be added\nWednesday, February 22\nCliff Howard is sent to Twin Peaks by Jacques Renault to make a drug deal with Bobby Briggs and Laura Palmer, carrying baby laxative in the place of cocaine. He pulls a gun on Bobby, who then shoots him dead.\nEvents (original)\n\nThursday, February 23\nTo be added\nFriday, February 24\nTo be added\nSaturday, February 25\nTo be added\nSunday, February 26\nTo be added\nMonday, February 27\nTo be added\nTuesday, February 28\nTo be added\nEvents (alternate)\nSee: 1989 § Events (alternate)\nDeaths\nFebruary 22 – Cliff Howard\nFebruary 24 – Laura Palmer\nFebruary 28 – Bernard Renault"}