{"name": "Federal_Bureau_of_Investigation", "url": "https://twinpeaks.fandom.com/wiki/Federal_Bureau_of_Investigation", "text": "Federal Bureau of Investigation\n \nThe Federal Bureau of Investigation, or FBI is the domestic intelligence and security service of the United States.\nThe service took over the murder investigations of Teresa Banks, Laura Palmer, and Maddy Ferguson.\nInfrastructure\nHeadquarters in Washington, D.C. \nFBI Academy in Quantico \nLas Vegas FBI field office \nPhiladelphia FBI field office \nPittsburgh FBI field office \nPortland FBI field office \nSan Francisco field office \nNotable personnel\n\nAdministration\nDirector J. Edgar Hoover\nDeputy Director Gordon Cole - previously Regional Bureau Chief who oversaw the murder investigations of Teresa Banks, Laura Palmer, and Maddy Ferguson and the investigation of a mysterious dossier.\nChief of Staff Denise Bryson - former DEA undercover agent.\nBill Kennedy - Secretary of Denise Bryson.\nAgents\nSpecial Agent Dale Cooper - assigned to the murder investigations of Laura Palmer and Maddy Ferguson in 1989. He was suspended due to accusations that he was acting outside his jurisdiction, and was allegedly involved in a cocaine trade. He was reinstated after proving his innocence.\nDiane Evans - Agent Cooper's secretary\nAgent Albert Rosenfield - forensics expert who assisted Cooper on the Laura Palmer and Maddy Ferguson investigations, in addition to determining the identity of an assailant who shot Cooper.\nSpecial Agent Windom Earle - worked as a liaison for the FBI in Project Blue Book.\nSpecial Agent Robin Masters - top agent of Cooper's promotion class.\nSpecial Agent Chester Desmond - assigned to investigate the 1988 murder of Teresa Banks, during which he disappeared without a trace.\nSpecial Agent Phillip Jeffries - disappeared in Buenos Aires in 1987, then re-emerged in Philadelphia in 1989 only to disappear again without a trace.\nSpecial Agent Tamara Preston - assigned by Cole in 2016 to determine the identity of an archivist who compiled a dossier concerning the town of Twin Peaks.\nForensic specialist Sam Stanley - assisted Desmond in the Teresa Banks investigation. He subsequently was placed on administrative leave following a breakdown.\nSpecial Agent Roger Hardy - assigned to investigate the accusations against Cooper.\nSpecial Agent Frederic Nathan - FBI investigator working with Douglas Milford who interrogated Kenneth Arnold.\nSpecial Agent S.W. Reynolds - FBI liaison officer for Project Sign.\nSpecial Agent Randall Headley - Las Vegas-based agent.\nAgent Wilson - Las Vegas- based agent.\nAgent Gene - was at a school bus arrest alongside Chet Desmond and two other agents.\nSpecial Agent Aldo Smith\nSpecial Agent Bill Raum\nExternal links\n Federal Bureau of Investigation at Wikipedia"}