{"name": "Fireman", "url": "https://twinpeaks.fandom.com/wiki/Fireman", "text": "Fireman\n\"Agent Cooper. Listen to the sounds.\"\nThe Fireman was a man who resided in a fortress set on a rocky island in a vast purple sea.\nBiography\nIn appearance, the Fireman was an extremely tall, gaunt, formally dressed man. A similar younger \"giant\" with more casual garments appeared in visions to Dale Cooper in 1989.\nFollowing the first ever successful nuclear test in 1945, the Fireman went to a room where Senorita Dido listened to a phonograph and a mechanism signaled an alarm. He went to an upstairs theater and observed the mushroom cloud, followed by the experiment releasing BOB in a stream of matter. The man levitated and a gold cloud formed from his head. An orb containing the image of Laura Palmer formed from the cloud and Senorita Dido sent it to Earth.\nOn another occasion, the Fireman appeared to Freddie Sykes, telling him to buy a green gardening glove that would bring immense strength to his right hand, and of his destiny in Twin Peaks.\nSometime later, the man drew Dale Cooper's attention to the sounds of an old phonograph and told him \"It is in our house now,\" and \"It all cannot be said aloud now.\" He then told Cooper to remember \"430\" and \"Richard and Linda. Two birds with one stone.\" He said that Cooper was \"far away,\" and Cooper disappeared.\nOn October 1, Deputy Andy Brennan appeared before the Fireman, who showed him a series of images in a portal above. Andy saw the experiment releasing BOB, Woodsmen, a high school girl screaming, Laura Palmer, angels, Naido, Dale Cooper and his doppelganger, and a utility pole. Andy also saw a hazy image of himself walking his wife Lucy Brennan through the sheriff's station and seeing somebody at the door.\nThe next day, the Fireman floated prone in the projection room, next to the face of Garland Briggs. Dale Cooper's doppelganger appeared in midair, trapped in a cage. The Fireman waved his hand and the screen, showing Sarah Palmer's house, shifted to show the road leading to the Twin Peaks Sheriff's Department. The cage passed through the golden tube, sending the doppelganger to that location. There, after a confrontation, Freddie used the gardening glove to destroy BOB, while the real Cooper used the ring to send the unconscious doppelganger back to the red room.\nBehind the scenes\nThe Fireman is played by Carel Struycken, who previously appeared in the original series as The Giant. It is currently unknown if they are intended to be the same character. The Fireman was named \"???????\" in the credits until Part 14. In an interview with Rue Morgue, Struycken interprets The Giant and The Fireman to be one and the same:\nRM: How did you feel about the new name The Fireman? I mean, was it a bit jarring considering you were seen as The Giant for over twenty-five years?\nCS: Well, I didn’t see it as a change. Remember, The Giant never called himself that, nor did anyone else. In this case, I do identify myself as The Fireman. So I see The Fireman as his true identity. That sounds about right, doesn’t it? (Laughs)\nIn addition, Showtime's official Tumblr site for the 2017 series has a character web page for The Fireman, which includes fan art and quotes of Struycken as both The Giant and The Fireman on the same page, which corroberates Struycken's statement. The page's web address (URL) also refers to the \"Giant,\" indicating the web page's title had been renamed from \"The Giant\" to \"The Fireman\" at some point during the air run of the 2017 series.\n \nWhen asked if the Fireman sided with humans, Twin Peaks co-creator Mark Frost answered that the character has his own reasons, which are beyond human understanding. Struycken revealed that he was given the direction that the Fireman and Dido were \"performing some kind of ritual intervention to counteract the evil in the world\" when shooting Part 8. This scene was based on a drawing by David Lynch, which is also similar to Mr Jim's Vision, The Antman and Floating Figure (chalk on paper, 1985)"}