{"name": "Fireman%27s_home", "url": "https://twinpeaks.fandom.com/wiki/Fireman%27s_home", "text": "Fireman's home\n\"It is in our house now.\"\n ―The Fireman\nThe Fireman lived in a massive fortress set on a rocky atoll in a vast purple sea.\nProperties\n \nWithin the fortress's walls, people and objects appeared to be black and white. The Fireman and Senorita Dido lived in a set of rooms decorated in early 20th century decor, including a sitting room and a large projection room. Bell-shaped mechanisms with unknown purposes were scattered throughout the building.\nThe mansion room, which looks out over the same sea, may be part of the home.\nHistory\nIn July 1945, a mechanism in the fortress alerted the Fireman and Senorita Dido to the experiment giving \"birth\" to BOB and other malignant spirits. The Fireman went to the projection room and saw this process occur, and then levitated, emitting a golden aura from his head. A gold orb bearing Laura Palmer's image emerged from this aura, which Dido embraced and sent into the air. It passed through a tube and then through the screen, landing on a representation of the Earth.\n \nOn another occasion, Dale Cooper and the Fireman sat together in a similar room listening to a gramophone as it emitted unusual noises. The stranger gave Cooper a series of clues and said that Cooper was \"far away,\" whereupon Cooper disappeared.\nOn October 1, Deputy Andy Brennan disappeared from the woods on Blue Pine Mountain and appeared in a chair, sitting across from the Fireman. When the man raised his hand, a smoke-emitting device appeared in Brennan's hands and his attention was directed to a porthole in the ceiling, where he saw a series of images, including the experiment, the woodsmen, Dale Cooper and his double, Laura Palmer, and the eyeless woman Brennan had just found in the woods. After seeing himself and his wife Lucy walking through the Twin Peaks sheriff's station, he was returned to the woods and told his companions that they needed to keep the woman safe.\nBehind the scenes\n \nThe extrerior of the fortress, also referred to as a factory, was based on the Mr. Jim's Home by the Sea painting by David Lynch. The machine that projected Laura's orb into the screen was based on a sketch by Lynch.\nIn an interview with Salon promoting The Final Dossier,\n the interviewer asks Mark Frost if the Fireman's home and the White Lodge are one in the same. Mark cryptically indicates this is a possibility: \nSalon: The coordinates are one of the running plot threads throughout the new season. In \"Part 17,\" Evil Coop is transported from Jack Rabbit's Palace to a room inhabited by The Fireman – a space some fans have speculated could be the fabled \"White Lodge\". Is that an accurate label?Mark Frost: I don't want to over-interpret it for people, but if they're theorizing leads them there, that's certainly a valid point of view."}