{"name": "Frank_Truman", "url": "https://twinpeaks.fandom.com/wiki/Frank_Truman", "text": "Frank Truman\nFranklin \"Frank\" Truman was the sheriff of Twin Peaks, a position he held prior to and after his brother.\nBiography\nFrank was named after President Franklin D. Roosevelt by his father.\nHe gave the nickname \"Hawk\" to Tommy Hill, referring to a tomahawk due to Hill's heritage.\nIn high school, he was the captain of the 1968 football team, alongside his brother Harry, \"Big\" Ed Hurley, Hawk, Hank Jennings, Thad \"Toad\" Barker, and Jerry Horne.\nHe served as a Green Beret in the Vietnam War. Subsequently, he became the sheriff of Twin Peaks, a position previously held by his father and later by Harry when Frank left Twin Peaks for western Washington, where he held a long career in law enforcement.\nAt some point, Frank and his wife, Doris, had a son who became a soldier and eventually committed suicide.\nIn 2016, following Frank's retirement, his brother was diagnosed with cancer. While Harry sought treatment in Seattle, Frank agreed to return as the sheriff of Twin Peaks, having arranged to hold the position for two years, after which time, Hawk would be promoted.\nAfter a fishing trip, Frank went to the sheriff's station after speaking with Lucy Brennan on a cell phone, which scared her, causing her to fall back in her chair. He then got an update from Maggie and the fellow deputies on situations that had occurred in the town while he was away, including a drug overdose by Denny Craig. He saw Deputy Bobby Briggs in the hallway and surmised that Denny's overdose was from Chinese designer drugs and told Bobby to keep on the lookout.\n \nTruman then met with Hawk, concerning a message from Margaret Lanterman's log that related to FBI Special Agent Dale Cooper, who had disappeared from the town 25 years prior. He dismissed the skeptical Deputy Chad Broxford and Bobby revealed to them that Cooper was the last one to have seen his father alive, but did not know what the two discussed. Andy and Lucy's son, Wally Brando then arrived and paid his respects to Frank's brother, hoping for him to overcome his illness.\nSometime later, after a phone call with his brother, Frank's wife came to him, clearly frustrated about various things, including a leaky pipe at their house and her father's car.\nDoris later returned, frustrated with Frank due to her belief that her father's car had still not been repaired.\nHawk brought pages to Frank that were found in a bathroom stall door at the station. The pages belonged to a diary belonging to Laura Palmer and recounted a dream she had where Annie Blackburn told her that the \"Good Dale\" was in the Lodge, but could not leave. The two agreed to fill in Harry on the details, since he was the first person to see Cooper upon his exit from the Lodge. However, Frank allowed his brother—whose illness apparently worsened—to rest before being told of the discovery.\nFrank then contacted Doctor Will Hayward, who saw to Cooper's condition after his exit from the Lodge. He noted to Truman strange behavior from Cooper, as well as a possible visit to Audrey Horne in an intensive care unit, where she was in a coma.\nAlong with Hawk and Bobby, Frank visited Bobby's mother, Betty, who told them that she had been expecting this meeting after her husband told her about it prior to his death. She gave them a metallic container that Garland had hidden inside of a chair.\nThey took the container back to the sheriff's station and kicked Chad out of the conference room to open it. However, Frank and Hawk could not and an amused Bobby took them outside to open it, revealing slips of paper referring to the \"Jack Rabbit's Palace\" – an imaginary place where Bobby and Garland used to play during the former's childhood – and a series of letters and numbers, \"COOPER / COOPER\" being among them.\nFrank and Hawk later discussed their destination and Hawk explained an ancient map to him. He questioned a symbol on the map, which Hawk told him that he did not wish to know about. Deputy Holcomb then came to ask Frank if he wanted to see his new car.\nTruman later went to inform Benjamin Horne that his grandson, Richard, was the perpetrator in a hit-and-run incident that killed a young boy and the assault of Miriam Sullivan. Ben said he would take care of Miriam's situation and gave Frank a key to give to Harry as a keepsake, as it was the key Dale Cooper used for his hotel room at the Great Northern.\nFBI Deputy Director Gordon Cole later returned a call to Frank, who informed him of their findings in Laura's diary that indicated two Coopers.\nAfter arresting problematic Deputy Broxford, Bobby led Frank, Hawk, and Andy to Jack Rabbit's Palace, following Major Briggs' instructions. They encountered a nude, eyeless woman, who Andy noted to be important and to be kept under their care. Frank and Hawk admitted that they did not recall anything between finding the woman and Andy telling them about her.\nLater, as Frank sat alone in the conference room, Hawk called Bobby, Andy, and Lucy to join then, announcing the death of Margaret Lanterman.\nAndy later introduced Cooper's doppelganger – who was posing as the original Cooper – to Frank. Truman took the doppelganger to his office and was told he was visiting to take care of \"unfinished business.\" However, Frank then received a call from the original Cooper, who had just arrived in Twin Peaks. After a brief silence, the men drew their guns on each other, but before either could open fire, Lucy shot the doppelganger, commenting that she now knew how cell phones worked.\nCooper advised Frank to stay away from the doppelganger's body and soon arrived as the room darkened and bearded men attempted to revive the doppelganger. BOB was released from the doppelganger's body and defeated by Freddie Sykes, who had been brought from the holding cells to the office by Andy.\nAfter placing a ring on the doppelganger's finger, causing him to disappear, Cooper retrieved his hotel room key from Frank and voiced his best wishes for Harry.\nBehind the scenes\nFrank is played by Robert Forster, who had been the first choice to play Frank's brother, Harry S. Truman. The character was added to Twin Peaks: The Return after Harry's actor Michael Ontkean declined to return.\nTrivia\nHis favorite book is noted to be Angle of Repose by Wallace Stegner."}