{"name": "Freddie_Sykes", "url": "https://twinpeaks.fandom.com/wiki/Freddie_Sykes", "text": "Freddie Sykes\n\"...don't even get me going right now on that oddball Cockney kid with the green glove...\"\n ―Tammy Preston\nFreddie Sykes was an English-born security guard at the Great Northern Hotel in Twin Peaks, Washington, and a friend of James Hurley.\nBiography\nAfter an evening at a local pub in the East End of London, Freddie had an epiphany in an alley. He climbed upon a stack of boxes and jumped before being transported through a vortex to a void, where he met a man who called himself \"the Fireman.\" The Fireman told him to go to a nearby hardware store and buy a particular green gardening glove, which if placed on his right hand would give him superhuman strength. Finally, Freddie was told that he would find his \"destiny\" in Twin Peaks, Washington.\nThe next day, Freddie found the opened package and the lone glove as he had been told, but the shopkeeper would not sell it to him since it was open. However, Sykes paid for it anyway and took it. When the shopkeeper tried to stop him, Freddie punched him without thinking, breaking the shopkeeper's neck. Subsequently, Freddie was unable to remove the glove whatsoever. A doctor tried to take it off but caused his hand to start bleeding.\nFreddie ultimately decided to go to Twin Peaks, and found that his plane ticket had already been purchased. Six months later, he was working as a security guard at the Great Northern Hotel, alongside James Hurley. The two visited the Roadhouse one evening and watched the Chromatics perform. On another evening at work, which happened to be James' birthday, he crushed walnuts with his gloved hand and reluctantly told James the story behind his glove.\nLater, Freddie and James went to the Roadhouse, where James greeted Renee. However, she was with her husband, Chuck, who attacked James. Freddie came to his aid, punching Chuck and another man with his gloved hand. Because of this, Freddie and James were incarcerated at the Twin Peaks Sheriff's Department, there, Deputy Chief Hawk informed them that the men Freddie punched had been taken to intensive care.\nAfter Deputy Chad Broxford escaped from his cell and armed himself, he held Deputy Andy Brennan at gunpoint. As Broxford approached Freddie's cell, he punched the door open, incapacitating Chad.\nAfter Dale Cooper's doppelganger was shot by Lucy Brennan, Andy brought Freddie to the room. The real Dale Cooper arrived and BOB was pulled out of the doppelganger's body. Cooper acknowledged Freddie as BOB attacked and he fulfilled his destiny, shattering BOB into pieces.\nBehind the scenes\nFreddie's glove is a recycled concept from David Lynch that was originally intended for Jack Nance."}