{"name": "Fred_Crisman", "url": "https://twinpeaks.fandom.com/wiki/Fred_Crisman", "text": "Fred Crisman\nFred Lee Crisman was a military pilot and deep-cover CIA special investigator.\nBiography\nCrisman served with the OSS during World War II as a liaison to the British Royal Air Force. He flew several combat missions in Europe and Asia. He flew his last mission on May 26, 1945 and allegedly came across a Lemurian cave in Burma.\nIn 1946, Crisman wrote a letter about the supposed Lemurian cave to Ray Palmer's magazine, Amazing Stories. Following the letter's publication, Crisman and Palmer became friends.\nBy 1947, Crisman was an active officer with the United States Army Air Force Reserve, worked in marine salvage, and was employed by the Department of Veterans Affairs. Additionally, he was an active CIA agent, assigned to the Pacific Northwest as a \"special investigator at large.\"\nOn June 21, Harold Dahl – an employee at the marine salvage business – reported to Crisman an incident at Puget Sound Harbor near Maury Island where he sighted six unidentified aircraft, bringing him metallic fragments dropped by one of the objects and camera film he had taken of them. Crisman contacted both Tacoma Times police beat reporter Paul Lantz and friend Ray Palmer about the incident, mailing him some of the fragments.\nOn the evening of July 30, Crisman and Dahl traveled to the Winthrop Hotel and met with Kenneth Arnold, who had also claimed to have seen UFOs the previous month and showed him the fragments. The group decided to share the story with United Airlines pilot Emil J. Smith and Military Intelligence investigators Captain Davidson and Lieutenant Brown. Smith, Davidson, and Brown joined them for another meeting the following morning, though Dahl was absent.\nThat night, Crisman received a call from Dahl, who explained that his absence was due to meeting a government official in a black suit who warned him to no longer speak of the Maury Island incident, for the safety of his family. Dahl went on to say that when he had returned home, his son Charles was missing.\nLater, Crisman heard on the radio that a B-25 carrying Davidson, Brown, and some of the fragments had crashed and quickly informed Arnold of the accident. Crisman was later informed by Paul Lantz that an anonymous source claimed the B-25 to have been sabotaged or shot down.\nHe returned to the hotel, informing Arnold and Smith about the possible subterfuge. United Press stringer Ted Morello called the group to confirm details about Davidson and Brown, also telling them that an anonymous source warned that the same thing could happen to Arnold and Smith. This warning prompted the frightened Crisman to flee the hotel.\nCrisman was taken into custody by the military and put on an Air Force transport to Alaska. During his stay in Alaska, he allegedly discovered another Lemurian cave alongside a soldier he referred to as \"Dick.\" Crisman stated that \"Dick\" was killed by a ray gun that was brandished by a being from the cave. After his return to Tacoma, Crisman's reserve commission was revoked by the Air Force on September 8.\nMonths after his return, Crisman wrote a letter to Amazing Stories, recounting his discovery of the cave in Alaska. In 1950, he wrote a letter to Palmer's Fate magazine, proclaiming that the Maury Island incident was not a hoax.\nCrisman was recalled to active duty during the Korean War, serving as a fighter pilot for two and a half years and carried out espionage missions in the region. He worked various jobs for the remainder of the 1950s and 1960s, including a teacher, school administrator, freelance writer, political speechwriter, and host of a right-wing political talk show broadcast from Puyallup. Between 1960 and 1963, Crisman flew from Tacoma to New Orleans and Dallas eighty-four times.\nIn 1967, Crisman was called by Clay Shaw, a fellow OSS officer who was accused of conspiring to assassinate President John F. Kennedy. The grand jury subpoenaed Crisman, who was questioned about his connections to various persons of interest in New Orleans District Attorney Jim Garrison's investigation into Kennedy's assassination. No charges were brought against Crisman and Shaw was acquitted.\nCrisman died of kidney failure at the Seattle Veterans Hospital in 1975.\nPosthumously, a key witness in a 1977 investigation into the Kennedy assassination identified Crisman as one of three vagrants arrested shortly after the shooting. However, an alibi was provided by a high school in Rainier, Oregon that employed him at the time.\nBehind the scenes\nFred Lee Crisman (July 22, 1919 – December 10, 1975) was an author who made various paranormal claims during the 20th century, such as the 1947 Maury Island incident. He later testified in the case against Clay Shaw for conspiring to assassinate John F. Kennedy.\nCrisman has also been proposed as an identity for one of \"three tramps\" that were arrested shortly after Kennedy's killing, but the House Select Committee on Assassinations concluded that Crisman only had a resemblance to one of these men and was not present in the vicinity of the assassination.\nArthur Bishop narrated Crisman's letter in the audiobook version of The Secret History of Twin Peaks."}