{"name": "Garland_Briggs", "url": "https://twinpeaks.fandom.com/wiki/Garland_Briggs", "text": "Garland Briggs\n\"There are powerful forces of evil in the world. It is some men's fate to confront great darkness. We each choose how to react. If the choice is fear, then we become vulnerable to darkness.\"\nMajor Garland Briggs was a United States Air Force officer and the overseer of Listening Post Alpha, a top-secret installation in northeastern Washington devoted to studying paranormal activity both local and extraterrestrial. In March 1989, he disappeared for two days from the woods outside Twin Peaks and was taken to the White Lodge, a strange alternate reality connected to the region. Briggs was subsequently kidnapped by the rogue former FBI agent and colleague Windom Earle, who sought to gain entry to the malevolent Black Lodge.\nShortly after escaping from Earle, Briggs discovered that Agent Dale Cooper had somehow been compromised by his own experience in the lodge. Major Briggs then disappeared under mysterious circumstances and was believed dead for the next twenty-five years, until his recently deceased body was discovered in South Dakota.\nBiography\n\nEducation\nBriggs attended Boys High School in New York City and the Virginia Military Institute.\nTransfer to Twin Peaks\nBriggs was transferred from Fairchild Air Force Base to Twin Peaks, Washington with his family in 1982, later revealed in 1985 to have been under the orders of Lieutenant Colonel Douglas Milford. Milford had hand-picked Briggs to continue his work in compiling an archive of history concerning the town of Twin Peaks and the mysteries surrounding it.\nThe last days of Laura Palmer\nOn the evening of February 23, 1989, Briggs sat in his living room with his wife, Betty, as he read aloud from the Book of Revelation. The doorbell rang and Betty got up to let Laura Palmer—the girlfriend of their son, Bobby inside. She went to the basement to see Bobby and after she left, the major heard Bobby light a cigarette and he told him to put it out.\nAgent Cooper's investigations\nMajor Briggs sat in his kitchen in uniform the next morning, reading the newspaper as he had his shoulders massaged by his wife. They soon received a phone call, which his wife answered. On the phone was Sarah Palmer, Laura's mother, who reported that her daughter was not home and was calling to see if she was with Bobby.\nLater, following the discovery of Laura's body and the questioning of Bobby, the major was at the sheriff's station with his wife as they talked to their lawyer, and offered an ear to Bobby, as he would be home later in the evening. However, Bobby turned him down. Confused about the situation, they went home.\nHe prayed with his family the next evening around the dinner table. He told Bobby he wished to discuss his feelings about Laura's murder and that he respected his rebellious nature, but noted that there were limits in place. When Bobby ignored him and placed a cigarette in his mouth, the major slapped him, his patience being pushed to the limit.\n \nOn the day of Laura's funeral, Major Briggs spoke to his son, reprimanding him for smoking a cigarette and then told him to put it out. He discussed funerals with his son, saying that Laura died too soon and that they had a responsibility to the dead. He again spoke of his willingness to talk more to his son.\nTwo days later, the Briggs family attended a counseling session with psychiatrist Doctor Lawrence Jacoby. Garland and his wife stated their worries with Bobby's behavior and Jacoby then stated he wished to see Bobby alone. The major protested, but the psychiatrist said he would need to see each family member individually. Briggs and his wife then left Bobby and Jacoby alone.\nHe later attended a party at the Great Northern Hotel with Icelandic businessmen, talking to Einar Thorson about his fascination with Iceland.\nHe sat at the Double R Diner a few days later and saw his son come in and asked him to join him. Bobby asked the major what he did for a living, but he said that it was classified. He then told Bobby about a vision he had of a grand home. He said his son happily visited the home and the two embraced. As he left the diner, Hank Jennings asked him how the pie was, to which Briggs said \"exceptional.\" They shared a salute and he left.\nBriggs had a coffee at the diner the next day and observed Deputy Andy Brennan struggling with tape. The Log Lady came and sat next to him. She asked him if he was proud of his medals, but he said \"achievement is its own reward. Pride obscures it.\" She then said her log had something to tell him, but he could not hear it, so she translated \"Deliver the message\" and the major understood the meaning of this.\nHe visited FBI Special Agent Dale Cooper at the Great Northern to deliver a message concerning a communication in deep space, specifically one found from around the time Cooper had been shot, saying \"THE OWLS ARE NOT WHAT THEY SEEM.\" This was followed in the morning with another communication saying \"COOPER\" several times.\nA week later, Briggs escorted an old waiter to the Roadhouse.\nHe met with the lawmen the morning after the killer of Laura was determined as Leland Palmer, who had died in custody, having been possessed to commit the crimes by an entity called BOB. Briggs stated that there was much more at hand than they could handle.\nDisappearance\nFollowing the funeral of Leland Palmer, Briggs attended the reception at the Palmer home. He spoke to Doctor Jacoby, who had recovered from a heart attack he had sustained earlier. He asked Agent Cooper about his plans now that the murder case was closed, and the FBI man stated that he was not sure but had vacation time he could use. Briggs then invited him to go fishing.\nBriggs and Cooper toasted marshmallows around a campfire, discussing Cooper's suspension from the FBI and the nature of BOB. The Major explained forces of evil and darkness when it came to face men. He also made mention of a \"White Lodge,\" but Cooper first went to relieve himself. A bright light flashed and Briggs called for Cooper, then disappeared.\n \nMajor Briggs appeared at his home to his wife and son two days later. He embraced his wife, telling her that things were \"not exactly\" all right. During his disappearance, a three-triangle pattern appeared behind his ear. Exhausted from whatever he had experienced, Briggs fell into a deep, sixteen hours long sleep.\nThe next day, Briggs told Doctor Hayward, Agent Cooper, and Sheriff Truman of his experiences during his disappearance, including a sight of a giant owl. When the sheriff asked him what his work involved, he responded that it was classified. However, he decided that the information was much too important for these restrictions. He told them that he was involved in the Air Force's Project Blue Book, despite it being officially disbanded in 1969 and that they were searching for a place called the White Lodge.\nAfter learning of the death of Douglas Milford, which occurred three days before, Briggs went to Listening Post Alpha, where he received one final message from Milford, written the night Briggs disappeared. The message contained Milford's regrets involving their work, a warning that the government had not been on the level with either of them, and his speculations on the nature of the Black Lodge and the encounters both he and Briggs had experienced with it, but he ultimately urged Briggs to continue the work.\nThe major stumbled to the sheriff's station the following day, saying to the receptionist Lucy Moran that he needed to speak to the sheriff, and then collapsed. He was taken to Harry's office and came to, and was given water by Lucy. He stated his worry about the Air Force's reaction to his disappearance, that their search for the White Lodge was not for pure reasons. He also predicted that there would be \"great trouble,\" and he left.\nA few days later, as Shelly gave him his bill at the diner, he commented, \"Compelling.\" The Log Lady came to him and examined the markings behind his ear.\nHe went to the sheriff's station with her, where they discussed their respective markings with Cooper.\nThe path to the Black Lodge\nDays later, in the sheriff's station conference room, Briggs observed Andy drawing a petroglyph on the blackboard and he corrected one of the lines. Cooper came in, needing his help concerning the disappearance of Leo Johnson, the appearance of Windom Earle - Cooper's insane ex-partner, and the petroglyph found in Owl Cave. The agent requested the major provide information on Earle's involvement with Project Blue Book. However, Briggs said that his security clearance was revoked following his own disappearance, and found moral reasons to not access the files, but he asked if a loss of human lives would be prevented by his help. He then turned his attention to the petroglyph, claiming to have seen it before. Briggs then agreed to do what Cooper had asked of him.\nBriggs assigned Bookhouse Boy Cappy the next day to research symbols from the petroglyph. Cooper and Truman arrived and he told them about Earle's involvement with Project Blue Book. He said that Earle became obsessed once the investigation focused on the woods surrounding Twin Peaks, and was promptly removed after he became violent. Briggs then showed them footage of Earle speaking of an evil place called the \"Black Lodge\" by the dugpas.\nLater, Briggs walked through the woods and saw men in a horse costume, one singing \"Home on the Range.\" The man fired a dart into Briggs, making him fall as the man revealed himself to be Windom Earle.\nAt a cabin, Earle interrogated him about the symbol at Owl Cave. However, the major insisted he was not at liberty to divulge the information. He was then injected with a truth serum and revealed he first saw the petroglyph at Owl Cave in a dream and that the symbols meant \"there's a time if Jupiter and Saturn meet, they will receive you.\" He then said \"Taht mug uoy ekil si gnimoc kcab ni elyts... Taht mug uoy ekil...\"\nBriggs awoke in the cabin the following day, chained to Leo Johnson, who freed him and asked him to \"save Shelly.\" The major got up and left.\nHe stumbled his way through the woods—under the influence of haloperidol—until he encountered Deputy Hawk, who took him back to the station.\nAt the station, Cooper asked him questions, but his answers were all unclear due to the effects of the drug. Among his babbling were \"protect the queen,\" and \"fear and love open the doors,\" the latter referring to the two Lodges.\nBriggs' condition had returned to normal by next morning, when he had breakfast with his wife at the diner. Sarah Palmer soon came with Doctor Jacoby and she told him \"I'm in the Black Lodge with Dale Cooper,\" in a man's voice.\nPresumed death\nBriggs had been led to believe that the person chosen to continue his and Douglas Milford's work was Dale Cooper, and so they met at the Briggs residence on March 27, 1989, just before 12 pm. While Briggs was unaware that Cooper had been replaced by his doppelganger from the Black Lodge, he still sensed that something was wrong about \"Cooper\" during his conversation with him and feared that he had misunderstood Milford's final message.\nAfter Cooper left, Briggs took down a note about his misgivings and then wrote a message for his son Bobby, directing him to visit a location near the station at 2:53 on October 1 and October 2 and take some of the soil. He hid it in in a metal capsule in his living room chair, telling Betty that one day their son, Hawk, and Sheriff Truman would come to ask about Dale Cooper, whereupon she was to give them the message.\nBriggs then went to Listening Post Alpha on his own, intending to send a 'MAYDAY' signal. The next day, Briggs was reported to have died in a fire at the station, although his body was not found. Cooper left town soon after this.\nOver the next twenty-five years, sixteen access attempts were made for Briggs' fingerprints.\nIn the Zone\nDespite what had appeared to have been Briggs' demise, a highly strange thing concerning it started happening in the two decades afterwards. At fifteen different occasions, in several locations across the United States, his fingerprints would appear, seemingly at random and without explanation. Further investigation would establish the identity of every single one of these prints as being that of Briggs.Disturbed by the implications of these findings, Briggs' employers, the US Air Force, started actively covering up these cases and also put protocols in place to track any new appearances of Briggs' prints.\nMeanwhile, the real Briggs was apparently \"hibernating\" in another reality, called the \"Zone\" by William Hastings, a native of Buckhorn, South Dakota. One September, Hastings and his partner Ruth Davenport somehow visited the Zone, where they met \"the Major.\" Hastings said that this man directed them to access a secure military database and find him a set of coordinates. When they did so, Hastings watched as the man floated into the air and said, \"Cooper, Cooper,\" before his head disappeared. He and Ruth were then attacked by other people in the Zone who demanded to know the name of Hastings' wife. Hastings awoke at his home, while Ruth was killed. Later, Hastings positively identified Briggs as the person he and Ruth had spoken to.\nRuth's severed head was discovered in her bed along with another copy of Briggs' naked, decapitated body, the sixteenth of its kind. Both had apparently died within the last week. Dougie Jones' wedding ring was discovered in his stomach. As per the protocols the military had put in place, the efforts of the Buckhorn Police Department to identify Briggs' body via fingerprints alerted the US Air Force to their findings. The report of the body's appearance was given to Colonel Davis. In response, Davis sent Lieutenant Cynthia Knox to Buckhorn to investigate the case and confirm the prints identity. Upon arrival, Knox discovered it was not just prints, it was an actual body.\nIn a dark void connected to the purple sea, Dale Cooper saw Briggs' head floating past, saying \"Blue Rose\".\nBriggs' face later floated in the projection room of the Fireman's home as Dale Cooper's doppelganger attempted to gain access via the portal on Blue Pine Mountain. Instead, the doppelganger was caged and redirected to the parking lot outside the Twin Peaks Sheriff's Department.\nBehind the scenes\nBriggs was played by American actor Don S. Davis.\nBriggs has the following ribbons on his rack:\nMultinational Forces and Observers Medal\nLegion of Merit Ribbon\nSilver Star Ribbon\nBronze Star Ribbon\n(without \"V\" device)\nPurple Heart Ribbon\nwith 1 Bronze Oak\n(meaning it was awarded twice)\nJoint Service Commendation Ribbon\nArmy Commendation Ribbon\nwith \"V\" combat valor device\nArmy Valorous Unit Award Ribbon\nwithout gold frame\nNational Defense Service Medal Ribbon\nKorea Service Medal Ribbon\nVietnam Service Medal Ribbon\nKorean Service United Nations\nRepublic of Korea Presidential Unit Citation Ribbon\nwithout gold frame\nRepublic of Vietnam Presidential Unit Citation Ribbon\nwithout gold frame\nVietnam Gallantry Cross Ribbon\nOddly, he never wore pilot's wings above his rack.\nHis rack has two ribbons which are exclusive to the US Army and none exclusive to the USAF.\nAs Davis passed away in 2008, the character appeared in the 2017 series through the use of CGI and a prosthetic corpse (with a missing head)."}