{"name": "Georgia_Coffee_commercials", "url": "https://twinpeaks.fandom.com/wiki/Georgia_Coffee_commercials", "text": "Georgia Coffee commercials\n \nA series of four commercials were made for Georgia Coffee in 1993 and were only aired in Japan. Filmed after Twin Peaks: Fire Walk With Me, they featured a sequential story in four parts with Dale Cooper as the main character. Angelo Badalamenti's music was used in the ads, specifically the title theme, \"Dance of the Dream Man,\" and \"Audrey's Theme.\" Despite being aimed at a Japanese audience, most of the dialogue is in English, with the exception of a few Japanese lines by the characters Ken and Asami.\nOriginally a second series of four were planned, but the Coffee company, unhappy with the first series, canceled them.\nThey were later released in the 2007 DVD box set, Twin Peaks: Definitive Gold Box Edition.\nChapters\n\nLost\nAt the Twin Peaks Sheriff's Department, Cooper listens to Ken telling him about his missing wife, Asami, who had sent him a postcard from Twin Peaks. He notes that when they searched her room, all they found was a photograph of her and a deer head. Cooper suggests that they think about it over a coffee. Lucy and Andy bring in some cups and a pot, but Cooper and Ken pull cans of Georgia Coffee out of their pockets, open them, and take a drink with Cooper declaring it \"incredible,\" and noting that \"this Georgia is damned fine coffee.\" The Log Lady enters the room and states, \"it's true.\" Cooper then points out a symbol on the deer head that is the emblem from Big Ed's Gas Farm.\nCherry Pie\nCooper and Ken arrive at the Gas Farm where they spot Asami's car, the Von Senger Vibel. There is a triangle with fifteen red snooker balls in the front seat. This leads them to the Double R Diner, where they grab a slice of cherry pie from Shelly Johnson. Cooper refuses her coffee and pulls out a can of Georgia Coffee, as lightning strikes outside. Once again, the Log Lady states, \"it's true.\" After trying a taste, Shelly gives Ken an origami swan.\nMystery of the \"G\"\nBack at the Sheriff's Office, Cooper notices a letter \"G\" on the bottom of the swan. Lucy brings in some Georgia Coffees for them and Hawk questions them. Cooper tells Hawk that he'll love the coffee. The Log Lady, as lightning strikes, once again states, \"it's true.\" After their tastes, Andy points out that he's connected pins on the map of Twin Peaks and they form the letter \"G\". The last pin is on top of Glastonbury Grove, the Owl Cave.\nThe Rescue\nThat night in the grove, Cooper enters the Black Lodge and finds Asami in the red room. He grabs her hands as she says \"Cooper\", and pulls her out of the lodge. Ken greets his wife and they all have coffee.\nExternal links\nAn analysis of the commercials at SensesOfCinema.com"}