{"name": "Gersten_Hayward", "url": "https://twinpeaks.fandom.com/wiki/Gersten_Hayward", "text": "Gersten Hayward\nGersten Hayward was the youngest of three daughters born to Dr. Will Hayward and Eileen Hayward of Twin Peaks.\nBiography\n\nChildhood\nAs a child, possessing an above-genius level IQ, Gersten was a prodigious student and a skilled pianist.\nOn an evening in early March 1989, Gersten welcomed her family, Leland and Sarah Palmer, and Maddy Ferguson to the \"Hayward Supper Club.\" She wore her fairy princess outfit for the school play and said she had received the highest grades in math and English, like her sisters. Gersten presented Harriet, who read the Palmers a poem about their deceased daughter Laura as Gersten played a piece on the piano. After the poem, she played Mendelssohn's \"Rondo Capriccioso, Opus 14.\"\nDuring dinner, Leland Palmer spontaneously asked Gersten to play \"Get Happy\" as he sang. Leland began singing faster and faster, losing her, before collapsing from exertion.\nLater life\nGersten took college-level courses in high school, graduating at the age of sixteen, and was fluent in four languages. She entered Stanford University, but suffered a nervous breakdown during her second semester.\nShe was treated at a Bay Area psychiatric hospital and returned to Twin Peaks. Although her health improved, she soon became dependent on opioids and designer drugs. Following her mother's death in 2009, Gersten began a series of reckless and chaotic relationships with several individuals, most notably with Steven Burnett. Their off-again, on-again affair preceded and overlapped Steven's marriage to Becky Burnett. In the interim, Steven had become Gersten's primary source for narcotics.\nOn a day in late 2016, Steven's wife, Becky, showed up at Gersten's apartment in a rage and shot through her door, believing them to be inside, while Gersten and Steven listened from a nearby stairwell.\nLater, Gersten and Steven, seemingly under the influence, went to the woods behind Steven's trailer park, where they sat against a tree. Steven held a gun and rubbed his leg, distraught over something he had done. Gersten tried to console him and talk him out of suicide, insisting that it was \"her\" fault and that he had been stoned. They were interrupted when Cyril Pons approached them, walking his dog. Gersten jumped up and ran around the tree, while Pons turned and fled. She listened in horror as Steven fired his gun.\nAs of September 2017, Gersten had not been seen or heard from in town since, and was believed to have left the area.\nBehind the scenes\nGersten was played by American actress Alicia Witt, who previously appeared in David Lynch's 1984 film Dune. Witt reprised the role in the 2017 revival.\nThe end credits of Episode 8 are shown over the backdrop of Gersten playing the piano."}