{"name": "Giant", "url": "https://twinpeaks.fandom.com/wiki/Giant", "text": "Giant\nThe \"Giant\" was a spirit who frequently appeared to FBI Special Agent Dale Cooper in visions. He provided Cooper with clues that directly led him to solve the murder of Laura Palmer. The Giant's appearances to Cooper were usually preceded by those of a kindly old waiter who worked at the Great Northern Hotel.\nBiography\nApocryphal stories of giants abounded in Native American lore. Chief Twisted Hair of the Nez Perce described to Meriwether Lewis a tribe of very tall white men who lived above White Tail Falls in a sacred grove, who had given his people at least three sacred artifacts. One of these was a gold and green ring.\nIn March 1989, a Giant, resembling a nearly ten-foot-tall man, appeared at the Great Northern Hotel in FBI Special Agent Dale Cooper's room to tell him three things that he said would come true: \"there's a man in a smiling bag,\" \"the owls are not what they seem,\" and \"without chemicals, he points.\" He then took Cooper's ring and said he would give it back when these things came true. He also said \"Leo locked inside hungry horse\" and that there was a clue at Leo's home. After telling the special agent he would require medical attention for his gunshot wound, he disappeared.\nThe next night, he appeared to Cooper again to tell him that he forgot to tell him something. Cooper mentioned the smiling bag to be true. The Giant then said that one person had seen the \"third man\" and that three people had seen him, but not his body. He then told Cooper he forgot something and disappeared.\nAs Maddy Ferguson was being murdered, he appeared to Cooper onstage at the Roadhouse, and said \"It is happening again, it is happening again.\"\n \nWhen Cooper remembered that, in his dream, Laura told him her father killed her, the Giant appeared to him and returned his ring.\nThe Giant appeared to Cooper onstage at the Roadhouse as he danced with Annie Blackburn, and was discussing having her join the Miss Twin Peaks competition. The Giant waved his arms back and forth and saying, \"No,\" as if warning him.\nHe appeared to Cooper once again in the Red Room, taking place of the elderly waiter. He sat next to The Man from Another Place and said \"one and the same,\" before he disappeared.\nBehind the scenes\nThe Giant was played by Dutch actor Carel Struycken, who later played The Fireman in the 2017 series. It is unknown if they are intended to be the same character.\nIn popular culture\nIn The Simpsons episode, \"Lisa's Sax,\" Homer watches a scene from Twin Peaks depicting the Giant dancing with a white horse. Homer comments, \"Brilliant, heheh!...I have absolutely no idea what's going on.\"\nThe Finnish doom metal band Swallow the Sun's song \"The Giant\" refers to this character.\nThe track \"Transmission 3\" by DJ Shadow samples the voice of the Giant from \"Episode 8.\"\nThe Giant's clues for Cooper in \"Episode 8\" are sampled on the classic ambient album Substrata by Biosphere. The lines \"Sorry to wake you... I forgot to tell you something... The things I tell you will not be wrong...\" appear in the song \"The Things I Tell You.\""}