{"name": "Glass_box", "url": "https://twinpeaks.fandom.com/wiki/Glass_box", "text": "Glass box\nA glass box surrounded by cameras and other sorts of equipment resided in a New York City skyscraper reportedly owned by an anonymous billionaire.\nHistory\nAn unidentified man was hired to watch the box until being replaced by student Sam Colby. The man reportedly saw something in the box, but did not disclose the details to Colby.\nOne night in 2016, after changing the SD card in a camera that filmed the box, Colby got a delivery of coffee from acquaintance Tracey Barberato. She asked to go back with him into the room that housed the box, but with a security guard present, he told her she could not. When he went back in, he caught her trying to look over his shoulder as he entered the door code on a keypad.\nSometime later, he left the box's room and Dale Cooper appeared inside before being transported out. Tracey had brought coffee for Sam again and this time, the security guard was not anywhere to be seen, so Sam took Tracey into the room with him. After a few moments of watching the box and drinking their coffee, they began to make out. As they began to engage in sex, a ghostly figure appeared in the box and broke through to relentlessly slaughter them.\nWhen the structure was discovered, FBI agent Tamara \"Tammy\" Preston was instructed to oversee the murders investigation; on September 26, she presented her findings to Albert Rosenfield and Gordon Cole. The New York Police Department was unaware of the existence of the place, and did not know the name of its owner. Although multiple guards were on duty 24–7, none of them resulted traceable; Sam and Tracey were ID'd, but their bodies did not show outer prints, DNA or fiber to investigate. Hundreds of digital files were found and confiscated from SD cards kept in safes in the room: most of them consisted of hours of the glass box as shown from different angles, with blurred shapes passing in front of the camera for a few frames. The night of the murder, one of the multiple cameras caught a glimpse of the ghostly figure, which faded as soon as it moved.\nOn September 29, Tammy showed Albert and Gordon a photo taken from one of the earlier SD cards, depicting Cooper's doppelganger talking to a scientist in front of the glass box."}