{"name": "Glastonbury_Grove", "url": "https://twinpeaks.fandom.com/wiki/Glastonbury_Grove", "text": "Glastonbury Grove\n\"You'll not run from me now... not in this circle of trees.\"\n ―Windom Earle\nGlastonbury Grove was a circular stand of twelve sycamore trees located in Washington's Ghostwood National Forest, close to Pearl Lakes and the town of Twin Peaks. In the center of the grove, flanked by two more sycamores, was a rocky pool containing a thick, black substance resembling scorched oil.\nUnder certain conditions, a translucent set of curtains would appear across the grove's center, allowing passage into a red-curtained labyrinth believed to be the mythical Black Lodge.\nHistory\nThe grove was named after Glastonbury, England, a town said to be the burial site of the legendary King Arthur.\n \nA petroglyph found in Owl Cave depicted the grove as part of a map of the region, accompanied by the symbols for Saturn and Jupiter. This was interpreted to mean that the passage to the Black Lodge located there would open at the conjunction of those planets.\nIn 1805, Meriwether Lewis traveled to the grove with a small company from the Corps of Discovery following a map provided by Twisted Hair, who claimed that a tribe of tall white men resided there. A hallucinatory episode followed, which neither Lewis nor his companions could fully recall.\nShortly before his death, Samson Lanterman brought home a bottle of the pool's oil, telling his wife Margaret that the substance was \"an opening to a gateway.\"\n1989\nIn February 1989, after killing his daughter Laura, Leland Palmer went to the grove and screamed, his face taking on a pale, demonic appearance. The red curtains appeared, allowing him to pass into the red room.\nThe following month, on the night of March 27, BOB's arm extended from thin air over the pool, grasping, followed by BOB himself. The curtains appeared over the pool briefly.\nLater, Windom Earle brought the kidnapped Annie Blackburn to the grove in Pete Martell's stolen pickup truck, having deduced from the petroglyph that the site held an entrance to the Black Lodge. As they approached, Annie uttered a prayer, but after they stepped between the trees, she fell silent, apparently hypnotized. Some time thereafter, Dale Cooper and Sheriff Harry S. Truman arrived in pursuit, where Cooper insisted that he needed to proceed alone. Truman watched in horror as Cooper stepped through the curtains, vanishing from view.\nTruman waited outside the entrance for the next day and well into the night, until Cooper and Annie reappeared in the grove, both unconscious and bloodied. Truman rushed Annie, catatonic, to Calhoun Memorial Hospital and brought Cooper back to his room at the Great Northern.\n2016\nOne evening, Deputy Hawk hiked through the woods to visit the grove, following a message Margaret Lanterman had delivered from her log. On the phone, Hawk told Margaret that he had a feeling something important was supposed to happen there, and she replied: \"The stars turn, and a time presents itself.\" She warned him to be watchful, and invited him to join her for coffee afterward. At the grove, Hawk shone his light around the pool, and briefly saw the red curtains, drifting in and out of view.\nLater, Dale Cooper exited the red room at will by raising his hand to the curtains and stepped out into the grove, where he found Diane Evans waiting for him. She asked if it was really him, and he confirmed that it was.\nBehind the scenes\nIn the shooting scripts and The Secret History of Twin Peaks, the spelling is \"Glastonbury,\" whereas Twin Peaks: Access Guide to the Town and the Georgia Coffee commercials use the spelling \"Glastonberry.\""}