{"name": "Gordon_Cole", "url": "https://twinpeaks.fandom.com/wiki/Gordon_Cole", "text": "Gordon Cole\n\"You'll have to speak up, sheriff, hearing's gone! Long story! Got these things cranked up to the max!\"\nGordon Cole was a Regional Bureau Chief, and later Deputy Director, with the Federal Bureau of Investigation and Agent Cooper's immediate superior, in a career that spanned more than four decades.\nBiography\n\nEarly career\nIn 1968, Gordon Cole went through FBI training with Phillip Jeffries at Quantico, where the two graduated as the top agents.\nSometime around 1969, as a result of an incident he would only explain as a \"long story,\" Cole was suffered severe and permanent hearing loss, requiring him to wear two hearing aids at maximum volume. Even still, he was known to constantly mishear others' statements, and spoke in a loud volume to compensate.\nIn 1975, Cole and Jeffries responded to a case in Olympia, Washington, where suspect Lois Duffy appeared to have killed an identical person, who said \"I'm like the blue rose,\" before dying and disappearing. This was the first case and the namesake of the Blue Rose task force.\nIn 1978, Gordon Cole was the deputy director of the FBI's Criminal Investigation Division. He first met Dale Cooper when he flew to Pittsburgh to oversee the investigation of Windom Earle's kidnapping and a bizarre series of murders. They talked through the case together, after which Cole, in Cooper's words, \"gave it the thumbs-up, then blew back to Washington just as fast and loud as he came in.\"\nOn President Richard Nixon's advice, Douglas Milford recruited Cole about a year after Nixon's resignation from office to secretly continue the work of Project Blue Book.\nIn early 1983, Cole and Jeffries visited the town of Twin Peaks, supposedly in order to investigate the construction of the Listening Post Alpha facility by the U.S. Air Force on Blue Pine Mountain that Mayor Dwayne Milford and a number of locals were concerned about. Afterward, Cole sent the mayor a letter stating that he had personally spoken to the project supervisor Major Garland Briggs and his superiors and determined that the base was a new radar and weather forecasting facility, part of President Reagan's new Strategic Defense Initiative also known as the \"Star Wars\" project. In truth, Cole's report was part of the cover story for Listening Post Alpha, officially known as SETI Array 7-I, a deep-space monitoring operation overseen by the mayor's brother Douglas Milford.\nAround 1985, while protecting Caroline Earle at a safe house, Agent Cooper was shot and gravely injured by an unknown assailant, while Caroline was killed. Cole was the one to break the news to Cooper when he awoke, and also revealed that Windom had lost his mind upon finding the two of them. Heartbroken, Cooper requested a leave of absence, returning to duty months later. After visiting Earle in the insane asylum, Cooper shared a recording of their conversation with Cole and confided his belief that Earle had been insane far earlier than Caroline's death, and was in fact somehow responsible for it. After hearing the tape, Cole agreed that Earle clearly needed to remain institutionalized for the rest of his life.\nMurder of Teresa Banks\n \nIn early 1988, the body of Teresa Banks was found in Deer Meadow, Washington. Cole dispatched Agent Chester Desmond to lead the investigation and arranged to meet him in Portland for a briefing. At the airport, Cole introduced Desmond to Agent Sam Stanley and then presented Lil, who performed an interpretive dance to share important facts about the case. Cole said that Lil was \"his mother's sister's girl,\" before covering his face with his hand. Lil was also wearing a blue rose.\nOn February 16, 1989, Agent Phillip Jeffries reappeared at the FBI office in Philadelphia after two years missing. Cole, along with Cooper and Albert Rosenfield, tried to make sense of Jeffries' story, shortly before Jeffries disappeared from the office once again.\nMurder of Laura Palmer\nOn February 28, 1989 - four days after Agent Cooper had been assigned to the murder investigation of Laura Palmer - Cole called Cooper at the Twin Peaks Sheriff's Department to update him on Laura's autopsy results. He also warned that Agent Albert Rosenfield intended to press assault charges against Sheriff Truman. Cooper vehemently insisted that he would fight against it, and implored Cole to intervene. Later in the day, Gordon faxed Cooper a reconstruction of a plastic fragment found in Laura's stomach, which was part of a One Eyed Jacks poker chip.\n \nCole arrived in Twin Peaks in person on March 8, following Cooper's shooting at the Great Northern Hotel. He interrupted Truman's questioning of Donna Hayward to introduce himself, and to share Rosenfield's lab report on the shooting incident and the syringe found on Phillip Gerard. Later, Cole met Cooper at the sheriff's station, enthusiastically greeting him and remarking that Cooper reminded him of a \"small Mexican chihuahua.\" In Truman's office, Cole conveyed Agent Rosenfield's concern that Cooper was getting in over his head, and shared a troubling message sent to the bureau from the escaped Windom Earle - the first move in a chess game.\nThat evening, along with Cooper, Truman, and Deputy Hawk, Cole withheld Gerard's haloperidol dose and watched as he was possessed by Mike, an inhabiting spirit from the Black Lodge. Mike explained his nature and his purpose: to stop BOB, his former partner in crime. He then revealed that BOB was, at that moment, somewhere at the Great Northern.\nEarly the next morning, Cole mentioned to Cooper and the others that pages from Laura Palmer's secret diary had been found a mile away from the crime scene; Cooper sent Deputy Hawk to search Harold Smith's home for the diary. Cole then took his leave, heading for Bend, Oregon on secret business, and wished them luck.\nCooper's Suspension from the FBI\nDays after Cole departed from Twin Peaks, Leland Palmer was found to be the killer of Laura, having committed the act while possessed by BOB. Following this, Cooper was suspended from the FBI due to acting outside of his jurisdiction and an apparent connection to a drug trade operated by the Canadian Renault family.\nOn March 14, Cole called from Bend to inform Cooper that DEA agent Dennis Bryson would soon arrive in Twin Peaks to assist in the operation to apprehend Jean Renault.\nReturn of Windom Earle\nOn March 22, Cole returned to Twin Peaks to bring Cooper the classified portion of Windom Earle's dossier. He also presented Cooper with a sidearm and announced that he was reinstating Cooper as an FBI agent to help locate and stop Earle before he could complete his insane plan.\n \nCole and Cooper took Sheriff Truman to the Double R Diner, where Cole recommended raw meat and eggs to treat Truman's hangover. While Truman ran to the restroom, Gordon became smitten by the sight of Shelly Johnson, comparing her aloud to the Venus de Milo and stepping up to the counter to chat with her. As they talked, Cole was astonished to realize that he could hear her perfectly, and could converse at a normal volume for the first time in twenty years. After a testy exchange with the Log Lady sitting nearby, Cole ordered coffee and a massive piece of pie, explaining that his socks were on fire. He later requested a piece of paper and a pencil in order to write an epic poem about the meal he had just had. Shelly later took him to see Doctor Will Hayward about his hearing problem.\nThe next morning, Cole was at the Double R regaling Shelly with a case story when they were joined by Cooper and Annie Blackburn. Cole explained to Shelly that he would soon be leaving Twin Peaks indefinitely, and said that during their short friendship she had touched his heart. Then, saying that he might regret it the rest of his days unless he did it, Cole leaned in to kiss her. Bobby Briggs, entering the diner, angrily shouted at them, prompting Cole to yell, \"YOU ARE WITNESSING A FRONT THREE-QUARTER VIEW OF TWO ADULTS SHARING A TENDER MOMENT!\" He then advised Bobby that he would soon see it again, and kissed Shelly a second time.\nThe Dossier\nOn July 17, 2016, a ledger was recovered from an active crime scene, containing a lengthy dossier on the history of Twin Peaks and unusual phenomena in the region, compiled by an unknown individual. On August 4, Cole tasked Agent \"TP\" (Tammy Preston) of the bureau's Investigations and Operations Support Section with reviewing the dossier and determining the identity of its author. Preston noticed that references to and statements by Cole were among the documents in the dossier, but could only turn in her findings while wondering about the extent of Cole's involvement.\nRe-emergence of Agent Cooper\nAt some point in the 25 years after Cooper's disappearance, Cole had been promoted to Deputy Director. Though he still required the use of a hearing aid, his comprehension skills had vastly improved to the point that most people did not need to shout for him to understand them, although he still comically misheard his colleagues at times. Agent Tamara Preston presented to Cole and Albert crime scene photos of the deaths of Sam Colby and Tracey Barberato, apparently caused by a figure that appeared in a glass box in the room with them. Cole then received a call concerning Agent Cooper, who had been missing since 1989. He was informed that Cooper was in South Dakota and Cole decided to bring Tammy and Albert with him.\nAs he waited to speak with Denise Bryson - by then the FBI's Chief of Staff - he visited with Bill Kennedy. He informed Denise about the situation with Cooper. When she expressed her doubts about Agent Preston, Cole reminded her of the support he gave her years ago when she became Denise. She then voiced her support and Cole left.\nCole was left disappointed by the fact that the federal prison in South Dakota was nowhere near Mount Rushmore, prompting Albert to give him a picture, which satisfied him. He then noticed Tammy sticking her head out the window of the car, which Albert explained was due to her getting carsick. Mishearing this, Cole pointed out that Cossacks are in Russia, resulting in Albert yelling \"Carsick!\" once more, which confused the driver. Annoyed, Cole remarked that Albert must have woken up on the wrong side of the bed that morning.\nUpon arrival at the prison, Gordon, Tammy, and Albert were presented with the contents found in Cooper's trunk: cocaine, a machine gun, and a dog leg. They were then permitted to speak to Cooper, who claimed that he had been working undercover with Phillip Jeffries and that he was on his way to debrief with Cole when he had his car accident that led to his incarceration.\nCole took note that during the interview Albert had an out-of-the-ordinary reaction to Cooper, so they spoke privately. Albert admitted to Cole that he had been contacted by Phillip Jeffries some years before, requesting information on an agent in Colombia that was pertinent to Cooper's safety and a week later, the agent was killed. They then discussed the meeting with Cooper, both feeling that something was not right, but did not fully understand the situation, classifying it as a \"Blue Rose.\" To confirm their suspicions, Cole asked Albert about Diane Evans, Cooper's former secretary, to come see the imprisoned Cooper. Albert noted that he still knew where she drank.\nAfter Diane refused to go with Albert, Cole later convinced her to see Cooper at the prison. After a brief and shaking visit, Diane told him that the imprisoned Cooper was not the Dale she knew, as he lacked his heart.\nOn the way back from South Dakota, Cole was informed by Colonel Davis that the body of Major Garland Briggs had been identified in Buckhorn, South Dakota. Cole had the plane re-routed to Buckhorn and received a call from Warden Murphy, who told him that Cooper had escaped from prison.\nThey met Lieutenant Cynthia Knox at the police station and were shown to Briggs' decapitated body by Knox and Detective Dave Macklay, who explained that the body had been found in a bed with Ruth Davenport's severed head and that the prime suspect of Davenport's murder – William Hastings – had an interest in alternate dimensions. Cole pulled Albert aside after Albert noticed the body showed the incorrect age for Briggs, which caused Cole to connect it to Cooper. Coroner Constance Talbot showed them a ring found in the body with the inscription, \"To Dougie, with love, Janey-E,\" prompting Cole to wish to speak to Hastings.\nPreston soon interrogated Hastings, who claimed to have entered an alternate dimension, where he met Briggs, who floated up whilst speaking Cooper's name.\nAfter Cole and Tammy observed Albert having dinner with Constance, Cole heard a knock on his hotel room door. Upon opening it, he saw a vision of a crying Laura Palmer before it faded, and Albert stood before him. Albert informed him that a text had been received by Diane following Cooper's escape from prison and she had responded with information about Hastings. Tammy then came to show them a photo of Cooper and another man with the glass box that was held at the penthouse where Sam Colby and Tracey Barberato were killed.\nHastings led the Gordon, Albert, Tammy, and Macklay to where he and Ruth had entered \"the zone,\" where Cole and Albert spotted \"dirty, bearded men.\" Cole went to where Bill had entered \"the zone.\" He saw a hurricane-like formation and raised his hands, eventually seeing a vision of more bearded men. Albert pulled him away before he could be transported and they found a headless woman's body, which they presumed to be Ruth Davenport. After Albert photographed the body, they went to Macklay's car, where Hastings suddenly died.\nLater, as Gordon, Albert, and Diane awaited coffee, Gordon's hand shook. Tammy soon brought coffee and donuts and Macklay confirmed the body as belonging to Ruth. Gordon and Albert describe the bearded men, which Diane confirmed to have also seen exiting the car after Hastings died.\nCole and Albert later inducted Preston into the Blue Rose task force and Diane into an official role in the Cooper investigation.\nAs Gordon spent an evening with a French woman, Albert interrupted to show Cole texts received and sent by Diane, reading \"Las Vegas?\" and \"THEY HAVEN'T ASKED YET.\"\nHe later called the Twin Peaks Sheriff's Department and was transferred to Sheriff Frank Truman – the brother of previous sheriff Harry S. Truman – who informed him that they had found pages from Laura Palmer's diary that suggested the existence of two Coopers.\nCole met with Preston and Albert, and filled them in on his call to Twin Peaks. Diane soon joined them and confirmed to Cole that Cooper had mentioned Briggs the last time they saw each other. Albert explained to Diane of Briggs' significance and she recognized the Janey-E and Dougie Jones mentioned on the ring found in Briggs' stomach – her half-sister and her husband, who lived in Las Vegas. Cole then contacted the FBI branch in Las Vegas, telling them that the Joneses were suspects in a double murder.\nCole recalled a dream he had about Monica Bellucci – apparently one of many – in which he had coffee with her in Paris. He saw Cooper there, but could not see his face. Bellucci told him \"we are like the dreamer who dreams and lives inside the dream,\" and asked \"but who who is the dreamer?\" before Cole saw himself in 1989, specifically the day of Jeffries' brief re-appearance. Cole then recalled Jeffries pointing to Cooper and asking who Cole thought he was.\nDiane came to Gordon, Albert, and Tammy to recount the events of her first meeting with the man she believed to be Cooper following his disappearance, explaining that he had sexually assaulted her and took her to an \"old gas station.\" Diane then declared she was \"in the sheriff's station\" and became upset, saying she was not herself. She drew a gun from her handbag, but Albert and Tammy reacted in time, shooting her until she disappeared, revealing that she was actually a tulpa. Gordon then questioned what she meant by \"sheriff's station.\"\nIn the aftermath, while the group tried to figure out what had just happened, Cole revealed a secret he kept for 25 years: before his disappearance, Major Briggs informed Cole and Agent Cooper about an entity he had become aware of known as \"Jowday,\" which had been changed over the years to become \"Judy,\" which Phillip Jeffries was aware of. Cooper told Cole to look for him if he ever disappeared. He then adds that an informant for the FBI, Ray Monroe, had told him that the doppelganger of Cooper was looking for coordinates. While trying to figure this out, Gordon received word from Agent Headley that Dougie Jones had left the hospital. Bushnell Mullins took the phone and reported a message Dougie had left for Gordon, causing him to realize Dougie was Cooper. Thinking about the message, Gordon realized Cooper was headed for Twin Peaks, and quickly left with the agents.\nThe agents made it to Twin Peaks just after Cooper had managed to defeat his doppelganger, and bore witness to the real Diane Evans' return. As Cooper made a speech, the lights suddenly went out in the station. Cole then joined Diane and Cooper in the basement of the Great Northern, where they bid their goodbyes to Cooper as he went into a locked door.\nVery shortly thereafter, Cole was found by the Horne brothers in the Great Northern's boiler room. He proceed to quickly excuse himself from the aftermath of the dramatic and mysterious events in the sheriff's office, asking Tammy to stay behind in Twin Peaks for a couple of days to write a report on the recent events in the town. He then returned to the Philadelphia FBI field office via plane the very same day.\nPersonality\nAs Cooper's superior, Gordon Cole shared many of his quirks, including a love of donuts, coffee, and cherry pie. Due to his hearing loss, Gordon would occasionally hear a mundane comment from another character then go off on a tangent about a phonetically-similar yet categorically different topic, though it would generally be impossible to tell what he heard that made him think such tangents were appropriate. Combined with his loud voice, Gordon had a habit of annoying people around him, including the Log Lady, Sheriff Truman, and Albert Rosenfield, although it was generally unclear if he was aware of this.\nGordon also had a romantic side to him. Upon realizing he could hear Shelly Johnson perfectly, he proved quite the charmer, regaling her with tales of his exploits and even managing to steal a kiss before he left Twin Peaks. He later had a brief date with a French woman at a hotel, who was clearly enamored by him. This lascivious behavior apparently earned him a bit of a reputation, about which Denise Bryson expressed some concern while questioning Gordon over his hiring of Agent Tammy Preston.\nDespite his generally care-free attitude, Gordon was still very professional in his work. He admonished Cooper for attacking Albert during a phone call when the latter put out a complaint against Sheriff Truman, and made a point to be sure Denise Bryson's colleagues were supportive of her during her transition. At some point between 1989 and the 2010s, he made a decision to hold more private conversations by increasing the volume on his hearing aid, which prevented him from having to shout all the time, at the cost of making some of the simplest noises excruciating to hear.\nBehind the scenes\n Twin Peaks David Lynch Returns as Gordon Cole SHOWTIME Series (2017) \nCole is played by Twin Peaks co-creator David Lynch. According to Lynch in the DVD extra A Slice of Lynch, the loud voice was originally unintentional, but soon became one of, if not the most significant trait of the character.\nDavid Lynch reprised the role in the 2017 revival and was featured in a teaser released on December 18, 2016. Showtime CEO David Nevins characterizes Cole's presence in the new series as \"pretty prominent.\"\nThe name \"Gordon Cole\" was taken from a minor character played by an uncredited Bert Moorhouse in the 1950 film Sunset Boulevard, one of Lynch's personal favorite films.\nLynch jokingly said in interview that his character's favorite movie was Sunset Boulevard which he watched many times.\nWhen asked about the origin of his hearing loss, Twin Peaks co-creator Mark Frost suggested a firing range mishap.\nGallery\n\nTwin Peaks (2017)\n"}