{"name": "Hank_Jennings", "url": "https://twinpeaks.fandom.com/wiki/Hank_Jennings", "text": "Hank Jennings\nHenry \"Hank\" Jennings was the criminal husband of Norma Jennings. He often acted as a henchman for several of Twin Peaks more shady citizens, such as Ben Horne and Josie Packard.\nBiography\n\nEarly life\nHank was born as the sole child of Emil and Jolene Jennings. His father passed away during his adolescence, due to a drunken accident with a beer brewing apparatus, and did not leave him with much aside from the bad reputation he himself had inherited from his father, Einer. When it came to his mother, he was the proverbial apple of her eye, and her doting on him lead him to develop a self-confidence that surpassed the borders of his actual qualities by a wide margin.\nIn his youth, Hank was, in spite of his family's bad reputation, able to stay out of any serious trouble due to being in great physical shape and showing great competence and promise as an athlete. In high school, he worked at the Double R Diner and was praised as a hero of the school's undefeated football team in 1968, on which he had the role of fullback and was on the starting lineup with Frank Truman, Harry S. Truman, \"Big\" Ed Hurley, Tommy \"Hawk\" Hill, Thad \"Toad\" Barker, and Jerry Horne, all members of the Bookhouse Boys. However, he made a deal with Jean Renault to toss the championship game against Kettle Falls.\nThe spring after high school, Norma Lindstrom – whom Hank had briefly dated during junior year – cheated on Ed Hurley with Hank, resulting in Ed half-drunkenly marrying Nadine Butler. Hank and Norma wed shortly thereafter and honeymooned in Hollywood, where they got tickets to The Tonight Show.\nHe was good friends with fellow Bookhouse Boy Harry S. Truman, but at some point, due to his shoddy agenda, the friendship was terminated as well as Hank's membership in the organization.\n\"The Andrew Packard Case\" and \"The Ballad of Big Ed and Norma and Nadine,\" attributed to Dale Cooper and Hawk Hill, respectively, give a different background of Hank's marriage to Norma:\nAfter Ed Hurley was deployed in Saigon during the Vietnam War, Hank formed a bond with Norma, feigning sadness over Ed's absence. Meanwhile, Hank intercepted any letters written from Ed to Norma, ensuring she did not receive them.\nAt Twin Peaks' annual tree-lighting ceremony that year, Hank proposed to Norma and she accepted. They were married at the Chapel-in-the-Woods. The ceremony was attended by their families, but notably absent were any members of the Bookhouse Boys. The pair honeymooned in San Francisco and Los Angeles, where they attended a taping of The Tonight Show.\nSoon after marrying Norma, Hank began working for Jean Renault, spending much of his time away from home, causing him to miss his mother-in-law's funeral in 1984.\nMurder of Andrew Packard\nOn September 27, 1987, Hank was hired by Josie Packard to kill her husband, Andrew Packard, by making his boat christened \"JOSIE\" explode. He then committed vehicular manslaughter on a vagrant to avoid investigation into Packard's apparent death.\nIn prison, he met Ernie Niles.\nParole\nIn early 1989, Hank met with his wife prior to his parole hearing and asked her to back him up so he could be released, insisting that he would change. At his hearing, he insisted that the manslaughter incident was merely fate. Norma said that if he was released, he had a job opportunity at the Double R Diner.\nHe later called Josie and asked if she received his message: a drawing of the domino he held in his hand.\nHaving been granted parole, Hank stood at the jukebox in the Double R Diner the next day. He then went to a booth and listened in on a conversation between James Hurley, Donna Hayward, and Maddy Ferguson. When Norma came into work with Shelly Johnson, he stopped her. He stated his intentions to work his way back into her heart and she gave him a job washing dishes. Later that night, Hank went to the Johnson home and beat up Leo and threatened him.\nIn the morning, he told Shelly about his troubles in prison when it came to his relationships from before. He then saw a lighter on the counter and pocketed it. Sheriff Harry S. Truman then came in and told him the conditions of his parole, that he was to meet with his case officer every Friday.\nHe was given $90,000 by Josie, a payment for the vagrant he killed to get in prison for vehicular manslaughter to avoid investigations about the death of her husband Andrew. He wanted more money, though she said they had an agreement. He cut their thumbs and pressed them together as their sign of being in business together for life.\nAgreeing to help Josie have Catherine Martell killed, he called Martell from the diner, saying the ledger she was searching for was at the Packard Sawmill, which was due to be burned down that night. He went to Norma and talked about his uncomfortable mattress in prison and how he dreamed of her and hoped for a life with her and the diner, then kissed her.\nHe later called Benjamin Horne, informing him that he was ready to take care of Leo Johnson. He went to Leo's home and shot him through the living room window.\nAt the diner the next morning, he picked up knives from a table to be washed. Later, he asked Major Garland Briggs how his pie was, to which Briggs said \"exceptional.\" They shared a salute as the Major left and Norma entered. He asked how Shelly was doing after being hospitalized for smoke inhalation, but Norma did not wish to speak.\nHe later stood in front of Benjamin Horne's fireplace at the Great Northern Hotel as Horne entered with his brother. He told them that Josie left the previous night and confirmed Leo's condition in a coma. He also said that Catherine was most likely dead within the rubble of the sawmill.\nThe following day, Hank observed a buck head in Sheriff Truman's office with the note \"THE BUCK STOPPED HERE.\" Harry entered with FBI Special Agent Dale Cooper. Hank signed his parole form and left.\nA couple of days later, he approached Donna Hayward at the diner with a Meals on Wheels delivery. She said she would be having lunch with someone she met on her route and left. Norma then told him that restaurant critic M.T. Wentz was due to arrive in Twin Peaks. He took some money from the register to get things to spruce up the diner.\nA man arrived at the diner and they believed him to be Wentz. Norma seated him as Hank had Toad eat in the kitchen. She told him that the man only ordered a cheeseburger, which Hank supposed to be a trick. After leading the man to the bathroom, Hank got into the man's jacket pocket and found that he was actually Washington State Prosecutor Daryl Lodwick.\nAt night, Hank was visited by a man who roughed him up and referred to him as \"blood brother.\"\nHank walked through the Great Northern the next day and went to Ben's office, but quickly left after finding him in a meeting. The businessmen he was meeting with left and Hank stuck his head in to warn Ben that Cooper was on his way. After the agent left, Ben instructed him to follow Cooper and retrieve his daughter Audrey from One Eyed Jacks.\nOutside of the brothel, he reported gunfire to Ben and that Cooper and Truman had Audrey. He was then grabbed by a man who restrained him and found the identification belonging to Daryl Lodwick.\nHank went to the diner after being absent for two days, a fact that frustrated Norma. When their argument settled, his mother-in-law, Vivian Smythe Niles, went to him, visiting Twin Peaks and helping Norma at the diner. She offered to have dinner with them, which Hank accepted.\nAt dinner with Norma, Vivian, and Vivian's husband Ernie Niles, the two women excused themselves from the table and the men discussed their history together as criminals. Believing that Ernie was only with Vivian for money, Hank was surprised to find that he had changed his ways. When the women came back, he made a toast to Vivian and Ernie.\nFollowing Leland Palmer's funeral several days later, Hank attended the reception at the Palmer home. Leland had died in custody after being arrested for the murder of his daughter. He saw Ed and Norma speaking as he brought out food for Leland's widow, Sarah Palmer.\nDuring a hunting trip, Hank went to the office at One Eyed Jacks with Ernie and two girls. They dismissed the girls and discussed their future business until Jean Renault entered. Ernie was set as the new broker and Hank took him to the casino.\nAfter their hunting trip, Hank and Ernie went to the diner. He brought out some food for them as they prepared for their drug delivery for Renault.\nHank went to Ben Horne's office, where he was watching films on a projector. Horne explained that Catherine still lived and that he had been brought in for questioning in the Laura Palmer case until Leland Palmer confessed and died in custody. Hank told Ben that he no longer owned One Eyed Jacks and he then worked for Jean Renault.\nThe next day, he spotted Norma and Ed holding hands. The day after this, he saw Norma getting ready to leave the diner and asked where she was going. She responded that she was off to run errands and that leaving him there with the breakfast crowd would be a sort of test for him.\nHank ambushed Ed, who he had caught with Norma at the Hurley home, and punched him. However, as he beat him, Nadine came and attacked Hank, easily taking him down.\nDuring his hospital visit (which he had claimed was both because of having a tree fall on him and that he had gotten hit by a bus), he was charged with various parole violations by Deputy Hawk.\nOn crutches and escorted by Hawk, he went to Sheriff Truman's office, who specified his parole violations, including the attempted murder of Leo Johnson. He offered to trade information on who murdered Andrew Packard, but the offer was shot down. However, he hinted that it was Truman's lover, Josie. He mocked the sheriff, and Hawk kicked out one of his crutches, causing him to fall. He was then escorted out.\nLater, Hank sat in his cell at the station and Norma came in to ask him for a divorce. He begged her to testify an alibi for him regarding the night he shot Leo, but she refused, and he refused the divorce. She declared, \"I'd rather be his whore than your wife,\" and left. Hank angrily screamed for her.\nReturn to prison\nHank was returned to prison to serve a 25-year sentence in Walla Walla for his parole violations, which included drug trafficking, assault, and attempted murder.\nIn 1992, he was fatally knifed in the prison weight room by a distant cousin of the Renault family. He confessed on his deathbed to the football game fix-up and to being involved in the \"murder\" of Andrew Packard. His death marked the end of the Jennings bloodline.\nTrivia\nIn the original script for \"Episode 1,\" Cooper refers to Hank as \"O. Henry Jennings.\"\nHank's prisoner number is 8464257.\nHis \"calling card\" / \"lucky charm\" domino changes throughout the series: When he gets out of prison it is 3/3, then when he meets up with Ernie it is 4/4 and when he assaults Ed it is 4/3. Fans sometimes believe that the number on his dominos changes to indicate his number of victims but since it decreased at some point, it is very unlikely. Chris Mulkey stated at the 1999 Twin Peaks Festival explained that \"3\" represented \"magic\" and being doubled it represents \"mysticism\". The change of domino occurred because the original prop disappeared and at the time without narrative explanation.\nHis favorite book was Double Indemnity by James M. Cain.\nGallery\n"}