{"name": "Harold_Smith%27s_apartment", "url": "https://twinpeaks.fandom.com/wiki/Harold_Smith%27s_apartment", "text": "Harold Smith's apartment\nHarold Smith lived in an apartment next to Mrs. Tremond and her grandson.\nHistory\nLaura Palmer came to Harold's home in mid-February 1989, with pages torn out of her diary. She told him that BOB was responsible, though Harold said he was not real. She told him about her history of BOB coming for her and said \"fire walk with me\" before bursting into tears. She had Harold hide the diary before she left, saying she did not know when she could come back, if at all, devastating Harold.\nOver a week after Laura was found murdered, Harold peered through his blinds after there was a knock on his door. He found a note left by Laura's best friend, Donna Hayward. He later called Donna and they arranged to meet the next day.\nWhen Donna came to his home, Harold told her about his nature as a shut-in, that he was incapable of going outside. He also said he wished for her to place an orchid on Laura's grave. He brought it out to her and she went, saying that she would be back.\nDonna came back to his home in the evening, upset over James Hurley apparently falling for Madeleine Ferguson. Harold went to get her something to drink.\nHe had lunch with Donna the next day and they drink to Laura. He shared some of Laura's diary and she suggested he turn it into the authorities, but he saw no reason to, as she entrusted him with the diary.\nDonna brought Harold lunch the following day and she offered to share her life with him if she could read Laura's diary, but he said he would read it to her and that it could not leave the room. He took out a notebook from a hidden compartment of his bookshelf and began writing what Donna told him. However, she changed the subject and distracted him. She grabbed Laura's diary and backed out the door. He followed her but collapsed when he stepped outdoors.\nHe met with Donna again later, writing down more of her life. She told him about a time where she and Laura encountered some young men who took them to the woods and skinny-dipped. She said this to have been the first time she fell in love, with one of the young men, named Tim.\nHe showed his flowers to Donna and he kissed her hand before they shared a kiss. He excused himself and came back and heard a sound from his living room, which turned out to be Maddy Ferguson taking Laura's diary from his bookshelf. Upset, he cornered the girls and scratched his face with a gardening tool.\nHe expressed his disappointment in Donna lying to him, showing his loss of faith in humanity. He tried to get the diary, but James Hurley burst in to get the girls, and Harold managed to grab the diary back from Donna.\nHe sprayed his flowers and let out an anguished scream.\nHarold was found dead the next day, hanging in his greenroom with scraps of the diary around him. His suicide note read \"J'ai une âme solitaire,\" meaning \"I am a lonely soul.\"\nGallery\n"}