{"name": "Harold_Dahl", "url": "https://twinpeaks.fandom.com/wiki/Harold_Dahl", "text": "Harold Dahl\nHarold Dahl was a marine scavenger who claimed to have seen unidentified aircraft in 1947.\nBiography\nOn June 21, 1947, Dahl was salvaging orphan logs at Puget Sound Harbor near Maury Island alongside his son Charles and the family dog. Upon spotting six unidentified aircraft, they traveled to shore, from where Dahl observed the aircraft through binoculars and took several photos. He observed that one of the aircraft appeared to be damaged and it eventually exploded, dropping both metallic and rock-like debris that burned his son and killed the dog. The other flying objects recovered the sixth and disappeared. Dahl collected samples of the debris and gave them and his camera film to his supervisor, Fred Crisman.\nThe following day, Paul Lantz published an article in the Tacoma Times which printed an interview with Dahl, recounting the UFO sighting.\nOn July 30, Dahl met with Crisman and fellow UFO witness Kenneth Arnold at the Winthrop Hotel. The following morning, Dahl was confronted by a man in a black suit, claiming to be investigating the Maury Island incident. Although the man presented no credentials, Dahl believed him to be affiliated with the FBI.\nDahl accompanied the man to a nearby coffee shop, where the man described the Maury Island incident in precise detail, further stating that Dahl \"was not supposed to see\" it. He further elaborated that, for the safety of Dahl's family, he should not speak of the incident in the future, except to say that it was his own work of fiction. The man then drove Dahl home, where he discovered Charles to be missing.\nHe later received a call from Arnold and Emil J. Smith, who were unable to reach Crisman. The distressed Dahl told them he had not heard from Crisman and no longer wished to speak to them.\nFive days later, Charles allegedly called Dahl from a motel in Missoula, Montana with no recollection of how he got there. Dahl later moved away from Tacoma and, until his death in 1982, maintained that the Maury Island incident was a hoax.\nBehind the scenes\nHarold Dahl was an alleged harbor patrolman who, along with Fred Crisman, claimed to see six donut-shaped flying objects that dropped debris that broke a worker's arm and killed a dog. Dahl further claimed that he was approached by a man in a dark suit who ordered him to not talk about the incident.\nThe FBI concluded the incident to be a hoax motivated by making a profit with the Chicago-based Fantasy Magazine."}