{"name": "Harry_S._Truman", "url": "https://twinpeaks.fandom.com/wiki/Harry_S._Truman", "text": "Harry S. Truman\n\"A man who doesn’t love easily loves too much.\"\"A good man.\"\"The best.\"\n ―Dale Cooper and Hawk\nHarry S. Truman was the sheriff of Twin Peaks, a position previously held by his father and brother. He assisted FBI Special Agent Dale Cooper with the 1989 murder investigation of homecoming queen Laura Palmer and other investigations the agent led during his time in Twin Peaks. As a result, Truman and Cooper became close friends.\nDuring the course of the following twenty-five years, Truman became ill and his brother returned to Twin Peaks to take over his duties.\nBiography\n\nEarly life and career\nHarry S. Truman was born to Frederick Truman, the sheriff of Twin Peaks, Washington, and had an elder brother named Franklin Truman.\nHis father named him after the 33rd President of the United States, Harry S. Truman, but they had no known relation.\nHarry was the quarterback of Twin Peaks' all-star high school football team in 1968, alongside his brother Frank, \"Big\" Ed Hurley, Tommy \"Hawk\" Hill, Hank Jennings, Thad \"Toad\" Barker, and Jerry Horne in the starting lineup.\nHe attended Washington State College and upon graduating he returned to Twin Peaks to carry out his lifelong ambition of entering public service.\nIn 1981, he was promoted from deputy to sheriff of Twin Peaks, following his brother and their father before him.\nIn February 1989, Harry advised Deputy Hawk to set a trap for drug mule Bernard Renault, who was coming in on foot from Canada. Deputy Andy Brennan made a stray comment that Bernie was coming in on foot, resulting in an awkward silence after Harry confirmed this. Harry, puzzled, interpreted this as Andy saying they would have to cover a lot of trails, but Andy merely stated he thought it would be a long hike.\nLater, the sheriff's station receptionist, Lucy Moran told Harry and Andy over the intercom that his lover of five weeks, Josie Packard had heard a prowler outside her house. Harry, apparently having been summoned for one of his and Josie's rendezvous, left Andy to watch the station.\nMurder of Laura Palmer\n \nOn the morning of February 24, Harry received a call from Pete Martell, who told him about a body he found on the shore behind his house, the Blue Pine Lodge and Harry later went there to unwrap the plastic and take pictures of the scene. He was shocked to see that the corpse was none other than Laura Palmer, one of the town's most beloved citizens.\nHe drove up to the Great Northern Hotel, where he informed Leland Palmer that his daughter been found dead, and then drove to the morgue. Afterward, he went to the Twin Peaks High School and told Laura's boyfriend, Bobby Briggs that Laura had been found dead.\nLaura's mother, Sarah Palmer, later told Harry about Laura's activities the night before, saying that she remembered saying good night and that Laura's phone rang once during the evening.\nAt the Calhoun Memorial Hospital, Harry met with FBI Special Agent Dale Cooper, who had taken over the case, and escorted him to the unconscious Ronette Pulaski, who had gone missing the night before. They talked about the little connection Ronette and Laura had. On the way to the morgue, they bumped into psychiatrist Dr. Lawrence Jacoby, who told them that Laura was seeing him without her parents' knowledge.\nAfter Cooper found a piece of paper bearing the letter \"R\" under one of Laura's fingernails, Harry asked him what was going on, and Dale proceeded to explain that a similar piece of paper was found under the fingernail of murder victim Teresa Banks a year prior. At the sheriff's station, Dale and Harry looked through Laura's possessions, including her diary. They found out that she was \"nervous about meeting 'J'\" the night before. Dale also found a key and some cocaine residue. Harry denied that it was cocaine, saying that Laura was not that type of person. Cooper said that they would find out who she really was.\nHarry and Cooper then went to the train car where Laura was murdered and found half of a necklace and a piece of paper with blood on it, which spelled out \"FIRE WALK WITH ME.\"\nAfter going to the train car, Harry and Cooper went to the bank to open Laura's safety deposit box, finding issues of Flesh World and ten thousand dollars in cash. In one of the magazines, they saw a picture of Ronette Pulaski, discovering a further connection.\nAt a town meeting held that evening, Harry told Cooper about Josie and her husband, Andrew Packard, saying that he died in a boating accident the year before. He also told him about the property rivalry with Benjamin Horne and pointed out Margaret Lanterman, the Log Lady, to him. Afterward, he and Cooper went to the Roadhouse to prepare a stakeout. They watched as Bobby arrived with his friend Mike Nelson, and how Laura's best friend Donna Hayward arrived and left with Joey Paulson. Harry pursued Joey's motorcycle and eventually lost track of it, but later stopped James Hurley and Donna, who were coming back from their meeting.\nAfter going back to the station, Cooper and Harry drank coffee at the station's doughnut spread, set up by Lucy. Cooper said that he would need a reasonably priced hotel room, and Harry told him that he should stay at the Great Northern. Harry then left the station to see Josie at the Blue Pine Lodge, where she lived with Pete Martell and his wife, Catherine. They hugged and looked out to where Laura's body was found.\n \nThe next morning, Harry ate his breakfast when Agent Cooper arrived. Cooper went over the plans they had for the day: questioning James, Bobby, and Mike, then checking Laura's autopsy. Cooper then went to the restroom as Truman swallowed the bite he had been chewing during the whole exchange.\nDoctor Will Hayward arrived with Laura's autopsy results, which revealed the time of death to be between midnight and 4:00 AM and the cause of death to be due to loss of blood. Bite marks were found on her shoulders and tongue, with lesions on her wrists, ankles, and upper arms. The autopsy also found that within the final twelve hours of her life, she had sexual relations with at least three men. Hayward also said that he believes the same perpetrator attacked Ronette. Truman asked how long it would be until Ronette is responsive, which Hayward did not have the answer to.\nTruman and Cooper questioned James, showing him the tape of Laura and Donna on a picnic. He confirmed that he filmed the video and that Laura insisted their relationship be a secret. He also said that he had convinced her to stop using cocaine until something seemed to frighten her. James also said that he was with Laura the night she died, but she ran off into the woods around 12:30 and he never saw her again. When Cooper showed him Laura's necklace found in the train car, he recognized it, but said he did not know who has the other half.\nHe went with Cooper to question Mike and Bobby when they encountered Ed Hurley, who wore a bandage over his left eye. Truman introduced him to Cooper. When he asked about his nephew, James, the special agent explained that he was free to go and was not suspected of the murder, but should be careful around Mike and Bobby. When Cooper took a call from Albert Rosenfield, Ed explained to Harry that his beer was possibly drugged by bartender Jacques Renault the night before.\nHe sat with Mike and Bobby when Agent Cooper entered to let them go after Mike said that their fight at the Roadhouse was self-defense. Cooper also warned them to stay away from James. Truman made note of his relationship with Cooper being like that of Dr. Watson to Sherlock Holmes.\nHe went with Cooper to see Josie, who had been tutored in English by Laura. After Pete poured them coffee, Josie said that the last time she saw Laura was on the previous Thursday at 5:00 and left an hour later. She also said that Laura told her, \"I think now I understand how you feel about your husband's death.\"\nWhen Josie excused herself to answer a phone call, Cooper asked how long Harry had been seeing her, which he caught onto through body language. Embarrassed, Harry said they had been seeing each other for six weeks. Pete then burst in, telling them not to drink the coffee, as there was a fish in the percolator. Josie then came back, visibly upset, asking what \"shenanigans\" meant, which Cooper defined for her.\nHe later took Cooper to the Double R Diner, where he suggested him to try the pie and asked waitress Shelly Johnson if he could speak to Norma Jennings, the owner. He told the special agent about Shelly's criminal trucker husband, Leo. They saw the Log Lady and Cooper asked if he could ask about her log, to which Harry replied, \"many have.\" Norma then came over to them with Cooper's pie. He introduced them and the special agent asked about Laura's involvement with the Meals on Wheels program and they asked for the names of people on her route. The Log Lady then came over and says that her log saw something the night Laura was killed.\n \nThe next day, in a clearing, he set up a bottle 60 feet and 6 inches away from Lucy, per Agent Cooper's instruction. Hawk asked him what the special agent was up to, but he did not know. He sat down and listened to Cooper's presentation of Tibet and a method he had derived from them to determine which individuals with the initial 'J' were to be people of interest in the Palmer case. He had Truman read off the names and their connection to Laura before he threw rocks toward the bottle. The rock for Lawrence Jacoby knocked over the bottle but did not break it. Harry questioned the idea of Cooper's method coming from a dream, then when the list went down to a \"Jack with one eye,\" the sheriff interpreted this as referring the casino, One Eyed Jacks across the Canadian border. The bottle then broke when the rock for Leo Johnson was thrown.\nLater at the sheriff's station, Harry showed Cooper a bloody rag found by Hawk a half mile from the train car Laura was killed in. Albert Rosenfield then arrives in Twin Peaks, and was Truman immediately warned by Cooper of his difficult nature. This proved to be true, as Harry was subsequently insulted by Albert's treatment of the sheriff's department as being primitive. Harry threatened him to watch his attitude and Rosenfield silently left to begin work with his team while Cooper grinned and gave a thumbs-up to Harry.\nAt night, Harry received a call from Cooper, who declared that he knew who killed Laura Palmer.\nTruman went to the Great Northern the following morning with Lucy to follow up on Cooper's statement the previous night. Dale described a dream he had the previous night and that it was a code to solve the crime. However, he did not remember the name of the killer. Truman then received word from Andy that a fight had broken out at the morgue.\nThey arrived at the morgue and found that there was a disagreement between Dr. Hayward and Rosenfield concerning whether Laura's body should be released for the funeral or kept at the morgue for more tests by Albert, who immediately began insulting the Sheriff. This resulted in Harry punching him, causing Cooper to intervene and tells Harry to wait in the car.\nHarry took Cooper to Leo Johnson, who denied knowing Laura personally and said he has no criminal record, which Cooper refuted immediately. When questioned about his whereabouts on the night Laura was killed, Leo insisted that he was on the road and that Shelly would confirm this.\nHarry and Dale met with Albert to discuss the test results he found with Laura's body. He confirmed that the white substance in the bag found in Laura's diary was cocaine, two kinds of twine were used on Laura's wrists, industrial soap particles were found in the back of her neck. He also presented claw marks found on Laura's shoulders. Lastly, he presented a small, partially-digested plastic fragment bearing the letter 'J.' Andy then came to inform them of the funeral about to start, so Truman excused himself.\nAt the funeral, Bobby declared that the whole town was guilty of killing Laura. When James charged at him, Harry helped restrain them. Immediately after this altercation, Leland broke down and threw himself onto Laura's casket.\nHe later sat with Ed and Hawk at the diner, and were joined by Cooper. They told him about their operation to halt the drugs flowing into Twin Peaks, which they believed Jacques Renault to be involved with. They then took him to the Bookhouse, introducing him to the Bookhouse Boys. There they had Bernard Renault restrained and they questioned him about the drug operation.\nLater in the evening, he sat with Josie, asking her what was bothering her. She said that she believed that Catherine Martell and Benjamin Horne wished to hurt her and that Andrew's death may not have been an accident. She showed him a safe and said there were two ledgers, but only one was seen in the safe. She asked him if he thought Andrew could have been murdered by Catherine and Ben trying to gain the mill, and that they would come for her next. He told her that he would not allow this to happen, and they kissed.\nHarry sat at the Palmer home as Mrs. Palmer described to Andy a man she saw in a vision as the deputy sketched him. Leland came in and mentioned another vision Sarah claimed to have of a hand digging up Laura's necklace.\nHe went back to the sheriff's station with Andy, learning from Lucy that Cooper was in the conference room with Doctor Jacoby. He entered the room as Jacoby stated that he could not break down the barriers surrounding Laura's many secrets. He asked the doctor if Laura ever discussed Bobby or James with him, and he said they were boys while Laura was a woman. He denied being one of the men who had sex with Laura the night she was murdered, but said he followed a man that night who she had spoken about and who drove a red Corvette. Cooper supposed this man to be Leo. They received a call from Cooper's superior, Regional Bureau Chief Gordon Cole, who said that the marks on her shoulder were from a bird. He also brought up the altercation between Albert and Truman, but Cooper ended the conversation, Harry thanking him. Andy then entered with the finished sketch of a man Sarah Palmer had a vision of, Cooper claimed to have also seen him, but in his dream. A call is then received from Hawk, who has found the one-armed man that Cooper wished to question.\nHe went with Andy and Cooper to the Timber Falls Motel, where the one-armed man, Gerard, was staying in room 101. When they approached Gerard's room, Andy drew his gun, but dropped it, making it go off. Truman sent Andy away while he and Cooper kicked in the door, where Gerard stood, wrapped in a towel.\nThey showed to Gerard the sketch of the man Mrs. Palmer saw, but he said he does not know who it is. When Cooper asked if he knows a man named \"BOB,\" the given name of the man in his dream. Gerard said that his best friend was named Bob Lydecker, who was in a coma. He was asked how he lost his arm, and said it was the result of a car accident and that he was currently a shoe salesman. Cooper asked if the lost arm had a tattoo on it, which he confirmed, tearfully saying that it said \"Mom.\"\nAs they left the motel, Hawk told him that Josie had previously been on a sort of stakeout at the motel prior to their arrival.\n \nHe went with Cooper to the Lydecker Veterinary Clinic, where the receptionist said that the man in the sketch was not Bob Lydecker. Cooper confiscated the clinic's files, believing the bird that attacked Laura to be a patient there.\nThe lawmen brought the clinic's files to the station and Harry had Lucy look through them, pulling the names of all of the people with birds. He then told Andy to meet at the shooting range with him, Cooper, and Hawk. Lucy called and found that the files are in alphabetical order according to pet name.\nHarry looked through the files with Andy and Cooper when they received another call from Gordon Cole who said that the bird that attacked Laura was a parrot or myna bird. Hawk then brought in an analysis on the piece of plastic found in Laura's stomach, finding that it was part of a poker chip from One Eyed Jacks. Andy then found a file on a myna bird named Waldo, owned by Jacques Renault.\nHarry went to Jacques's apartment with Hawk and Cooper, where they saw a man they believed to be Jacques, but he got away. Cooper then found a bloody shirt with Leo Johnson's initials sewn into it.\nHe later called Josie and asked her if she had been at the motel, but she said she had to go.\nThe next morning, Harry was at Jacques's apartment and greeted Cooper, filling him in on Renault's background. He also said that the man had not been seen for two days. As Doctor Hayward said that the blood type found on Leo's shirt was AB negative, Cooper saw something on the ceiling and commented that the blood belonged to Jacques. Truman gave Cooper a boost as Hayward confirmed the blood to be Leo's. From the ceiling, the special agent retrieved a copy of Flesh World. Inside, they found envelopes marked with a post office box that may have belonged to Jacques. Also inside the magazine, they noticed a photo of Leo's truck.\n \nHawk later confirmed that the post office box was registered to Jacques and brought letters found in it. Cooper found an ad from Laura in the copy of Flesh World, noting the red drapes in the photo match a photo in Jacques's cupboard as well as in ones he saw in his dream. They then set out to find the cabin in the photo.\nLed by Hawk, they searched the woods for the cabin with Hayward and encountered the Log Lady at her home. They went inside and sat down for tea and cookies. She told them what her log saw the night Laura was killed and they went back out to find the cabin. They heard music playing, and followed it to the cabin, where inside, Harry uncovered Waldo the bird and found a cuckoo clock with poker chips inside from One Eyed Jacks.\nThe next day, Harry was in the conference room with Doctor Hayward and Waldo, trying to get the latter to speak when Agent Cooper arrived. Hayward determined that the bird would only speak once it had recovered from its current malnourished state, so he went to get apples to feed to it. Hawk arrived with forensics results stating there were three people with Jacques in his cabin: Laura Palmer, Ronette Pulaski, and Leo Johnson. He also brought a photo of Waldo and Laura. Cooper placed his voice activated tape recorder near Waldo and they planned an operation to go to One Eyed Jacks.\nHe went to the diner with Cooper, where he saw Hank Jennings, fresh out on parole, reminding him of what this entailed. He commented to the special agent that he did not believe people could change. When Shelly offered Cooper a cup of coffee, Harry said they should get going, but Cooper disagreed, saying that every day, one should give their self a present.\nHarry went to see Josie and observed a fish caught by Pete until Josie arrived. He asked her why she was at the motel earlier in the week, but she said she was at the mill. He ensured she could tell him anything and she revealed that she had followed Ben and Catherine there and took photos of them. She also revealed she heard Catherine talking on the phone about a fire at the mill.\nHe later met Ed and Cooper at the Great Northern and they went over their plan for One Eyed Jacks. Cooper presented $10,000 of the FBI's money to gamble with. Cooper gave Ed $300 to start with and Ed left the other two alone. Harry told Cooper about his concern for Josie and the possible danger with the mill.\nA gunshot was heard at the sheriff's station conference room and Harry went to investigate, discovering that Waldo had been shot. Cooper listened to the tape recording and found that Waldo had said several things, including, \"Leo, no!\"\nHarry sat with Andy on a stakeout, where they awaited Jacques Renault to cross the border. They were tipped off by Hawk just before he arrived and they arrested him, charging him with the attempted murder of Ronette Pulaski and the murder of Laura Palmer. Jacques put up a fight, disarming an officer and nearly shooting Truman before he was shot in the arm by Andy.\nAt the hospital, they asked Jacques about the night Laura was killed. He said Leo had hit him in the head with a bottle and he used Leo's shirt to stop the bleeding, and then he got sick and passed out. However, he did not know anything about the train car. They then went to a room where Doctor Jacoby was held after suffering a heart attack.\nHarry supposed that Leo took the girls to the train car by himself. Doctor Hayward then told them that Jacoby claimed to have gotten a call from Laura Palmer and saw her by the gazebo at Easter Park.\nHe went back to the station and was informed by Lucy that Leo had called. James arrived, wishing to speak to him, but Cooper took him instead. Leland then arrived, asking if they arrested Laura's killer. Harry told him it was just a suspect and he could not release more details. He then went outside.\nHe came back in and went to Cooper and James, presenting cocaine found in the gas tank on James' bike.\nAfter contact was lost with Agent Cooper later in the night, Harry went with Hawk and Andy to Dale's room at the Great Northern, where they find him on the floor, bleeding from a gunshot wound.\nAt the hospital, he stood over Cooper as he came to. Cooper explained what happened, but said the person who shot him was masked. Lucy filled in Cooper on what happened overnight, and Cooper told him they required a warrant to search Leo's house.\nHe followed Cooper, who got out of his hospital bed to resume work, against Doctor Hayward's wishes. They watched as Jacques' body is wheeled through the hallway, in a body bag. Cooper asks if the bag was smiling.\nHe investigated a shooting reported at Leo Johnson's house and supposed that Leo tried to kill someone in the house, then another person shot him through the window. Hawk brought a copy of Flesh World and Leo's duster, which reeked of gasoline. Andy began calling to him from outside about the arrival of Albert. Harry went outside, where Andy shuffled around, having stepped on a loose board, which hit him in the head. This action revealed a hidden pair of boots and cocaine.\nWith James, Harry listened to a tape made by Laura for Doctor Jacoby, which James stole. A \"mystery man\" was mentioned in the tape, which James believed not to be Leo or Jacques. He also said that Laura had once said a poem about fire and \"Would you like to play with fire, little boy? Would you like to play with BOB?\" Cooper then entered and requests the necklace from James, who happened to have it, saying it was in Doctor Jacoby's office, inside a coconut. After Hawk took James back to his cell, Harry asked how Cooper knew he had the necklace. Dale says that he had to have it due to his relationship with Laura and that he would give it up for the case. Cooper was also surprised that Jacoby was now directly involved with the case.\nHe went with Cooper to Jacoby's hospital room and they asked him how he came into possession of Laura's necklace. He recounted following James and Donna and digging up the necklace as a keepsake. Jacoby also noted that the last time he saw Laura, she seemed to be at peace and was ready to die.\nHe walked through the hospital with Cooper and Rosenfield, where he noticed Bobby. They then encountered Ed, who was there as his wife Nadine was in a coma after overdosing on sleeping pills. He got a coffee for Albert as Cooper took Ed aside.\nAlbert went to book a room at the Great Northern as Harry and Cooper discussed their further plans in the case.\nCooper went over the night Laura died, believing 'J' to be absolutely confirmed as James, who she was with that night. He and Albert believed the phone call to have been from Leo. They determined that a third man other than Leo and Jacques killed Laura. Albert upset the already crying Andy, who stood up to defend the sheriff's department, then left.\nHe took Pete home from the hospital, who had been checked in for smoke inhalation due to the fire at the sawmill. Pete read a note from Josie, who was apparently on an emergency business trip to Seattle. Harry also informed him that Catherine was still missing after disappearing in the fire. The phone rang and Harry answered. A man on the other end asked for Josie, then requested to know when she would be back. When Harry asks him who was calling, the man hung up.\n \nAfter Ronette woke from her coma, Harry went with Truman to show her sketches of Leo and \"BOB.\" She did not recognize Leo as the one who tried to kill her, but when shown \"BOB,\" she began to thrash about, repeatedly saying \"train.\"\nHarry went to his office with Cooper, where Hank waited for a parole meeting. Harry had him sign the form and he left. He told Cooper about his past with Hank, who was once a Bookhouse Boy. Ben Horne then called the sheriff's station to inform him that his daughter, Audrey had been missing, for two days at most.\nThe next morning, Harry went back to Ronette, with Cooper and Albert soon arriving. Ronette was sedated so Cooper could extract a small piece of paper containing the letter 'B' from under her fingernail. Cooper believed Laura's killer placed it after tainting Ronette's IV. Cooper then told Harry and Albert that he was visited by a giant who gave him three clues.\n \nCooper later proposed that the letter found under the fingernails are all linked to \"BOB\" by a sort of psychic link between himself, Ronette, Maddy, and Mrs. Palmer. Albert then informed them that the cocaine in James' bike matched that found in Jacques's car and Leo's house. He also said that the letter under Ronette's fingernail was cut from an issue of Flesh World. Albert also gave his further developments on the attempt on Cooper's life, then insulted Harry once again. The sheriff took him by the collar and Rosenfield explained his motives to be built on the foundation of love. He said, \"I love you, Sheriff Truman,\" and left. Cooper placed a hand on Harry's shoulder and said, \"Albert's path is a strange and difficult one.\"\nWith Hawk, Harry and Dale discussed the giant that appeared to the special agent just before Leland Palmer arrived to explain his knowledge of the man: that he was a neighbor to his grandfather, named Robertson. Hawk was sent to find information on this. Leland said the man would also flick matches at Leland whilst saying \"you wanna play with fire, little boy?\" Cooper believed this to be the man they were looking for.\nPhillip Gerard later showed Harry shoes that he had for sale. The man seemed to begin acting strange and said he needed to take his medication.\nHarry and Cooper sit down with Shelly, who refuses to say anything against Leo. Cooper lets her go and tells Harry he suspects she has made this choice so she can live off of Leo's insurance money but does not believe she thought of this idea herself.\nHarry later received a phone call from Pete, who said Josie called him and would return the next day. The sheriff then requested Cooper to let him see her first, on his own. Hawk arrived with his findings, saying that he turned up nothing more than a boarded-up house with an unmarked mailbox, and records were being checked for further information. Harry then asked him if he had seen Phillip Gerard, who had not been there since he showed the shoe samples. Cooper noted that in his dream, the One-Armed Man, \"Mike\" knew \"BOB,\" so he went to the bathroom with Harry following, and found a syringe.\nHarry went with Cooper to Doctor Jacoby's hospital room, which was decorated with Hawaiian decor. He introduced them to his wife, Eolani, who lived at their Hawaiian home. As he prepared to be hypnotized, Jacoby had Harry hold a stone as Cooper performed the hypnotism. Harry nearly fell asleep during the process. Jacoby described Jacques's murder and that he knew who did it.\nHe then went with Cooper to the Palmer home to arrest Leland for the murder of Jacques Renault.\nTruman interrogated Leland, asking him about his activities at the hospital and gets him to confess to killing Jacques.\nHe told Cooper of the impending arrival of the Judge Clinton Sternwood and the prosecutor Daryl Lodwick for Leland's hearing. He also gave Hawk's report that there was never a man with the name Robertson living next to the Palmers. Cooper then noticed that Andy wore the same kind of boots as Leo and that he got them from Phillip Gerard.\nHarry saw Lucy upset and walking away from Cooper, who had been talking to her about her behavior as of late. Cooper then explained to him that he needed the best Bookhouse Boy at his disposal for a secret operation. Truman said the man would be at the Roadhouse at 9:30.\nJosie arrived back in Twin Peaks and Harry met with her, upset that she did not tell him about leaving town and that it seemed strange that Catherine died and left behind insurance money around the proximity of her leaving. She distracted him by kissing him and pleading for him to make love to her.\nHe later went back to the station where Judge Sternwood had just arrived. The judge caught onto the fact that he had problems with the woman in his life. Cooper then came and Harry introduced him to the judge.\nHe went to the conference room with the two men, where Leland was brought to them. The proceedings were delayed due to the absence of Lodwick. Sternwood's law clerk, Sid came and was introduced to Cooper before leaving with the judge to the Great Northern. Cooper asked him if the Bookhouse Boy was prepared for the evening, which Truman confirmed.\n \nIn street clothes, he met Cooper at the Roadhouse at 9:30, revealing himself to be the Bookhouse Boy in question.\nThe next day, Hawk came to the sheriff's station to inform Harry that the house Leland claimed to be owned by a Robertson was actually owned by schoolteachers who had no recollection of a gray-haired man. As Hawk excused himself to the bathroom, Harry reminded him to keep an eye out for Phillip Gerard. Lucy then came to him to say her goodbyes before she went to Tacoma to visit her sister. He escorted her out of the station as Cooper arrived and announced that he knew where Audrey was.\nAt Leland's hearing, Harry spoke for the defense, sympathizing with him due to how much was brought upon him from the death of his daughter. This ultimately caused Leland to be released on bail until his trial.\nAt Leo's hearing, Sternwood decided to deliberate with Harry and Dale after the defense and prosecution had made their statements. Sternwood decided that Leo was not fit to stand trial, as his shooting had left him in an invalid state. Sternwood then had Harry tell Shelly.\nOn his way to his office, he heard Andy declare himself to be \"a whole damn town.\" He then met with Cooper and they discussed their plan to rescue Audrey, but Hawk entered to inform them on the whereabouts of Gerard. Harry then dismissed him and they continued discussing their plan, then left.\n \nTruman approached One Eyed Jacks with Cooper and he took out a security guard and used the guard's head to open a set of doors. They headed inside and follow a map drawn by Cooper to find Audrey. They split ways as Harry watched a man and Blackie O'Reilly talk whilst a security footage frame of Cooper was on a screen in the room.\nHe continued to watch until the man stabbed the woman and spotted Harry, opening fire. Harry drew his gun and noticed that the man had disappeared. Cooper rejoined with Audrey and they began to head out, but were stopped by a security guard with a gun. However, a knife struck the guard in the back and Deputy Hawk came down the stairs, remarking \"Good thing you guys don't know how to keep a secret.\"\nThey took Audrey to the Bookhouse and Cooper determined that she had been doped with heroin.\nIn his office, Harry looked through a book of mugshots, finding a photo of Jean Renault, who was the man he saw kill Blackie. He informed Cooper that Renault was after him and had used Audrey as bait. The agent expressed his dismay at letting someone he cared about get in harm's way, but Harry assured him that he was the best lawman he had ever met.\nHarry later met with Donna, who claimed that there is another diary by Laura in the possession of Harold Smith. He suspected the teenagers to be still trying to solve the murder, despite the warnings they had received. However, he told her that he would try to send one of his men to Smith's home. A loud man then walked past the room, looking for Harry. He then entered the room and identified himself as FBI Regional Bureau Chief Gordon Cole, Cooper's supervisor. Harry told Donna to wait and talked outside with Cole, who explained that he was hard of hearing, which was apparent, given that he misunderstood Harry several times. He delivered Albert's test results on the fibers found outside Cooper's room, finding that they were from a Vicuna coat. He also mentioned test results on Phillip Gerard's syringe, having not recognized the drug contained in it. Hawk then brought in Gerard, who Truman had taken to his office.\nWhen Cooper arrived, he and Gordon had a private conversation in Harry's office, but Harry and Hawk could hear everything Cole said due to his loud speech. Harry interrupted to inform them of this but was invited to join. Cole gave Cooper an anonymous letter of a chess deal, from Windom Earle, Cooper's now insane ex-partner.\nTruman went to the Blue Pine Lodge, where Josie introduced him to her assistant, Mr. Lee, and she announced that she was going home and that she sold the mill. As she started to leave, he told her that he loved her, which caused her to stop and look back but she ultimately left.\nHe went to the conference room with Cooper, Hawk, and Cole to question Gerard, who complained about needing his medicine. Cole refrained from giving him his medicine and his personality changed into \"Mike,\" who explained \"BOB\" as being his familiar. He also described him as a sort of parasite that feeds on fear and pleasures. Mike also said that he was to stop BOB, who was currently in a large house made of wood among the trees, with many rooms, which Cooper determined to be the Great Northern Hotel.\nThe next morning, Harry went to Hawk, Cole, Cooper, Mike, and Andy to tell them that they were ready to go to the Great Northern. Hawk went with a warrant to Harold Smith's apartment and Cole left for Bend, Oregon.\nThey took Mike to the hotel and brought him guests one-by-one to determine if they were BOB's host. Mike began to have a sort of seizure when Ben Horne entered the room.\nHe went to Harold Smith's apartment when Hawk finds Harold dead, apparently of a suicide by hanging. Cooper found a suicide note that read, \"J'ai une âme solitaire,\" or \"I am a lonely soul.\" Among torn pages strewn about the apartment, Hawk determined them to be from Laura's secret diary.\nHarry went to the conference room, where Cooper stated his suspicions that Benjamin Horne was the man they were looking for. They went to Ben's office at the Great Northern to arrest him for questioning in the murder of Laura Palmer.\nThey took him back to the station, where Harry and Cooper encountered the Log Lady, who said to them, \"there are owls in the Roadhouse.\" He went to the Roadhouse with them, where a blonde singer performed.\nThe following day, Sheriff Truman walked with Cooper, who addressed a tape to Diane, telling her they had just met with the one-armed man. They walked to the Timber Room, where Leland joyfully danced about. Harry broke the news to him that Ben had been arrested for Laura's murder.\nBen was taken to the interrogation room, where a finger was pricked for a blood test, which his brother - serving as his lawyer - claimed to be brutal treatment. Cooper revealed Jerry's questionable background as a lawyer, which caused him to settle down. The special agent then presented Ben with Laura's diary, which stated, \"Someday, I'm gonna tell the world about Ben Horne.\" Cooper's manner of speaking angered Ben and the lawmen left the brothers alone for a moment.\nHarry looked out his window at a woodpecker when Pete arrived, telling him that Josie was gone, which he confirmed to know already. However, confusion entered the conversation when he mentioned Josie's assistant, which Pete said he was told was her cousin, Jonathan. Cooper then came, saying that Mike had escaped from the Great Northern and they then left.\nWhile driving, he and Cooper stopped a reckless driver, who turned out to be Leland Palmer. Harry received a call from Lucy, telling him that Mike was found.\nMike was brought to the interrogation room and said that Ben was not BOB. However, Harry charged Ben with Laura's murder. Cooper brought him outside and told him he did not believe Ben was the killer. Harry said he had enough of Cooper's premonitions and they had enough evidence against Ben.\nLater at night, another body was found, also wrapped in plastic. Truman was called out and went with Cooper to find that the body belonged to Maddy Ferguson, Laura's nearly-identical cousin.\nThe following morning, Albert presented a letter 'O' found under Maddy's ring finger, determining her murderer to be the same person that killed Laura and Teresa. He also said fur from a taxidermy white fox was in her hand. Harry offered to call Leland so Maddy's family could be contacted, but Cooper refused this, wishing to have one more day to solve the case.\nIn Ben Horne's office, Harry presented Horne's telephone records to Cooper, showing that he called Laura the night she died and that there was a stuffed white fox in the office, assuring Harry that Maddy was there and was killed by Ben.\nHe went to the Palmer home to retrieve Leland for help in the case and took him to the roadhouse, where Ben, Leo, Bobby, and Ed arrived. Cooper stated his belief that the killer was in the room. Cooper commented that not everyone was there, and Major Garland Briggs then entered, escorting an old waiter. Cooper said to have Ben brought back to the station with Leland as his attorney.\nAs Ben was taken to interrogation, Cooper whispered to Harry to have Leland pushed into the room first, as he was the culprit. They did this and quickly closed the door as Leland became enraged, revealed to be BOB's host.\n \nThey entered the room and Harry restrained Leland while reading him his rights. Through Leland, BOB laughed and howled as he was interrogated, and did not hesitate to confess to the murders. They left the room and Cooper went over his dream and all of the evidence pointing toward Leland and the events that must have occurred the night of Laura's death. BOB chanted out a poem, then the sprinkler system went off, followed by BOB slamming Leland's head into the interrogation room door. They frantically entered, finding Leland bleeding on the floor. With BOB apparently gone from him, Leland tearfully expressed his guilt and died in Cooper's arms.\nTruman, Cooper, and Albert met with Major Briggs, the sheriff confused over the whole situation. He had his doubts over BOB's existence, but wondered where he was.\nCooper's suspension from the FBI\nFollowing Leland's funeral, Harry attended the reception. Major Briggs arrived just as a fight broke out between Mayor Dwayne Milford and his brother, Dougie. Harry helped break it up.\nHarry later went to his office, where Catherine awaited. Harry expressed his surprise that she was alive. When he asked about her absence over the previous weeks, she said that she believed her life was saved by an angel.\n \nCooper came to Harry's office to say his goodbyes before going on the fishing trip and leaving town. The sheriff gave the agent a Green Butt Skunk fishing lure. He also gave to him a Bookhouse Boys patch, welcoming him as a member of the society. As Cooper left the station, he was stopped by Special Agent Roger Hardy and RCMP Officer Preston King, the former telling Cooper that he had been suspended from the FBI.\nHardy questioned Cooper regarding his activity in Canada, particularly Audrey's rescue operation. After Cooper was questioned privately, Harry gave him the Bookhouse Boys gesture after seeing that his gun and badge had been taken. Hardy then asked for his cooperation, but Truman said that he was behind Agent Cooper all the way.\nTruman's sleep the following night was disturbed by movement outside his window and he went to the door, finding Josie, who was exhausted and she fell into his arms.\nTruman and Cooper met with Betty Briggs the following morning and discussed her husband's disappearance while on a fishing trip with Agent Cooper. She brought up that it could have been work-related, but the possible nature of this was classified. After Betty left, Cooper told Harry that there was no way that the Major's disappearance was work-related. Andy and Hawk then entered with a wedding present for Dougie Milford and his young bride-to-be Lana Budding. A call was then patched in from Gordon Cole who gave Cooper his support and said that DEA agent Dennis Bryson was hard at work on the case.\nCooper asked Harry and Hawk if they have heard of a place called the White Lodge, as it was the last thing Briggs spoke about before his disappearance. Hawk explained the White Lodge being a place controlled by spirits, it being a local legend. Dennis Bryson then arrived, dressed as a woman, and insisted on being called Denise. She explained the details of the case to Cooper and left.\nHe went home, where Josie laid in bed. He brought her a glass of water and kissed her before getting on the bed and holding her close. He asked her to tell him the truth, and she answered that she used to work for a man named Thomas Eckhardt in Hong Kong and that Mr. Lee also worked for Eckhardt and had threatened to kill her if she did not return. She also stated that she believed Eckhardt was responsible for her husband's death.\nHarry later attended the Milford wedding. When Dwayne vocally objected to the marriage, Harry calmed him down.\nThe next morning, he and Andy went to the Great Northern, where Dougie Milford had died in bed of an apparent heart attack. Mayor Milford came in and cried over his brother, blaming Lana for his death.\nLater at the station, Harry introduced Cooper to Colonel Reilly, who was heading the investigation of Major Briggs' disappearance. Reilly especially expressed an interest in owls in the area at the time of the disappearance. When Cooper tried to get more information, specifically about the White Lodge, Reilly said that the subject was classified.\nIn Truman's office, Hayward delivered Dougie's autopsy results to Dwayne, finding that he had died of a heart attack, with no evidence of foul play. However, the mayor wished to press charges against Lana anyway, continuing to believe she killed his brother with sex. After Dwayne left, Harry and Will left the former's office and saw Lana, and were taken by her charm, as was the case with the rest of the men present.\nThe next day, Harry listened to Major Briggs—who had re-emerged the previous night—recount his experience since his disappearance, including a vision of a giant owl. The sheriff asked him what his work entails, but he said that it was classified. However, he dismissed this, finding this to be information that must be divulged to them. He said that he was involved in Project Blue Book, a United States Air Force investigation into unidentified flying objects, despite its official disbandment in 1969 and that they were searching for the White Lodge. Air Force personnel then came in to retrieve Briggs on official business.\nHarry then went to the Blue Pine Lodge to see Josie, who had been assigned as a maid for Catherine, having had no choice.\nLater, Truman cleaned his rifle as Ernie Niles was being prepared for a sting operation against Jean Renault, who had been framing Cooper as being involved in Renault's cocaine trade. When Cooper expressed his regret that he could not take part in the operation, Truman deputized him.\nOutside the buy, Harry watched until their cover was blown by Ernie's excessive sweat ruining the microphone. Cooper negotiated with Renault, offering himself for Denise and Ernie. Harry had Hawk call in backup.\nLater, Denise made her way into the house dressed as a waitress and delivered a gun to Cooper, who used it to shoot Renault dead.\nThe lawmen returned to the station, where the power was out, due to a bomb in the woods, according to a call received by Lucy. Cooper headed inside and called to Harry, having found a dead body in the sheriff's office, in front of a chessboard.\nWindom Earle crime spree\nAs Cooper and Hayward examined the body, Truman stated that there were no witnesses to this odd event. The FBI agent correctly identified that the victim died from being stabbed, believing Windom Earle to be responsible, due to its similarities to a previous case. Hawk came in to say that there were two sets of the same boot prints outside, one coming and one leaving.\nAs the body was wheeled out, Harry brought Cooper some coffee, now also believing Earle to be responsible, as there was no physical evidence left at the scene, just as Cooper had predicted. The agent also said that he had been cleared of all charges by the FBI and DEA, but was still suspended. Truman offered him the case since he was still a deputy of the Twin Peaks Sheriff's Department for the time being. Hawk entered to inform them that no prints were found in an abandoned car Harry told him to search and that Hank was not present at the Dead Dog Farm deal, as he was in the hospital, claiming to have been hit by a bus. Hawk also told them that Shelly Johnson called, saying that Leo came to the previous night and ran away after attacking her.\nHaving found Cooper observing a chessboard, Truman asked about the significance of chess to Earle, to which the agent said that the two had played the game every day for three years, and Cooper never won. Dale then told Harry about his affair with Earle's wife, Caroline who was murdered under his watch, presumably by her husband.\nLater, Major Briggs entered the station and collapsed, wishing to speak to Harry. After the major came to, they met in the sheriff's office, where Briggs stated his worry in the Air Force's reasons for seeking out the White Lodge, where he believed he was taken during his disappearance. After the major left, Andy came and took them to the conference room, where Lana Milford sat with Doctor Jacoby. The psychiatrist said that Lana was not cursed, but had a heightened sexual drive. As Jacoby and Lana left, they were confronted by Dwayne Milford with a rifle. Cooper had the mayor and Lana settle matters privately. Meanwhile, the rest of the men stood outside until Cooper told them to enter, where they found Lana kissing Dwayne, who announced their plans to adopt a child.\nLater in the evening, Harry showed Cooper an article from Seattle, recording the death of Jonathan, the man Josie was with. Dale suspected that Josie could somehow be involved.\nHarry and Cooper spoke with Bobby and Shelly in the conference room, as the two were attacked by the now-mobile Leo the previous night. Harry asked why Bobby was at the Johnson home, to which Bobby openly admitted that he and Shelly had been seeing each other since even before Laura was murdered. Cooper asked where he was the night of the fire at the mill, suspecting him of shooting Leo, but Bobby stated Hank to be responsible. Harry told Shelly he would assign deputies to watch her house and he dismissed the couple.\nAlbert then arrived and the two greeted each other with a hug. Albert presented a file on Earle, who had been sending packages to various law enforcement agencies, each containing an article of clothing from Caroline on her wedding day.\nHe and Dale later met with Josie concerning Jonathan's death.\nLater, he met with the agent again, where he said the dead man found in his office was named Erik Powell. Cooper said that the victim's surname was Caroline's maiden name and that this was intentional by Earle. Harry suggested they employ Pete Martell in the case for his expertise at the game of chess.\nHe later told Norma that Hank would be put in prison for the attempted murder of Leo and his various parole violations.\nThe next morning, Harry and Dale listened to a tape left for the latter by Earle. The sheriff promised his protection and he had Lucy call Pete and check the newspaper for chess moves.\nLater, Hawk escorted Hank into Truman's office, where the sheriff charged Hank with the attempted murder of Leo Johnson. Hank attempted a trade for information on who murdered Andrew Packard, but Harry declined. Despite this, Hank hinted that Josie was responsible and mocked him. Hawk kicked out one of Hank's crutches and escorted him out of the angered Harry's office.\nAs Pete observed a chessboard, Harry told Lucy to have the Gazette not close out the personal ads. They discussed Earle's methods, but then Albert arrived and spoke to Cooper in private. Harry overheard that Josie has been positively identified as Cooper's would-be-assassin and he left.\nHe went to the Blue Pine Lodge, looking for Josie, who apparently went to the Great Northern with many of her belongings to see Thomas Eckhardt.\nHarry arrived after she killed Eckhardt and he commanded her to put her gun down, which she had aimed at Agent Cooper. She asked for his forgiveness and clutched her pistol to her chest before collapsing. Harry rushed to her and cradled her in his arms, only to find that she was dead.\nThe next day, he sat at the Bookhouse, drinking and thinking about Josie. Hawk brought him breakfast from Norma and Harry asked about the situation at the station, confident that Cooper and Hawk could handle his responsibilities.\nCooper later came to visit him, telling him about Josie's criminal history from Interpol, including felonies and prostitution arrests. Harry angrily told Cooper to leave.\n \nHe later became drunk and threw around the furniture in the Bookhouse. Cooper soon came to calm him down, especially to have Harry hand over his gun. Harry began talking about Josie and how she made his life better, and he expressed his regret that he did not take her away from her past. Cooper brought him into a hug, calming him. After this, Cooper and Hawk took him to bed.\nHarry woke to a vision of Josie, which soon disappeared and instead saw a woman with a garrote who began to strangle him. He soon was able to overpower her and managed to incapacitate her.\nHe took the woman, Jones, to the sheriff's station, where he locked her in a cell. He went to Cooper and confirmed that the woman worked for Thomas Eckhardt, but he was unsure why Eckhardt would have wanted him dead. Cooper supposed \"sexual jealousy\" due to the man's obsession with Josie. As the agent described a revolting cure for hangovers, Harry excused himself to the bathroom.\nHe went to his office, where a bonsai tree from Josie sat on his desk. Doctor Hayward informed them that Earle came to his home with the next chess move. Gordon Cole then arrived, his loud voice disturbing Harry's headache. Cole revealed that Earle had faked his mental illness and was loaned to the Air Force for Project Blue Book in 1965.\nHarry took Cooper and Cole to the diner, where he again excused himself to the bathroom after Cole explained his own cure for a hangover. Soon, he rejoined Cooper, who was fascinated by a chickadee outside on a Dodge Dart. Norma's sister, Annie Blackburn, came and poured them coffee, also suggesting teetotaling and prayer as a hangover cure. Harry then observed Cooper's interactions with Annie, which made him suspect that Cooper was in love, which was confirmed by Harry with the fact that she laughed at a stupid joke he told her. Before she went, she noted a drawing Cooper had made on his napkin, saying it was from Owl Cave, which Harry confirmed.\nHarry made the next move in the chessboard, per Pete's instruction, and he and Cooper then headed off to Owl Cave with Hawk and Andy.\nAt the cave, Hawk lead them to the symbol Cooper had drawn, located on a wall of the cave, with another symbol. Cooper found that they must be related to tattoos found on Briggs and the Log Lady. Owls then swooped over the men and Andy swung a pickaxe into the cave wall, revealing a petroglyph.\nThe men return to Owl Cave the next day, where it was apparent that someone else had been there too. Hawk noted that there were the tracks that he also found near the power station - Windom Earle.\nAt the station, Harry observed a piece of a poem sent to Shelly, Donna, and Audrey. Cooper said that this was sent to the girls by Earle, as it was a poem Cooper once sent to Caroline. Truman suggested that they speak to the girls, then Hawk came in with Donna's segment of the poem. He also told Harry and Dale that Major Briggs was there to see them, and Dale requested the deputy to bring him Leo Johnson's arrest report. Cooper used the report to determine that the poems were dictated by Earle to Johnson.\nHe went to Catherine and asked her for any information on Josie, wishing to understand her. Catherine explained that Josie worked by essentially being an actress in everything she did. Catherine then brought him a box, which he could not seem to open. Pete then came back from the tryouts for the Miss Twin Peaks Contest, for which he was on the committee. He tried to take the box, but dropped it, causing part of it to slide out - another box.\nTruman was called to a crime scene at the park gazebo, where a dead youth had been found inside a large chess pawn.\nA friend of the victim told the lawmen that the youth's name was Rusty Tomasky and was in Twin Peaks while on his way to play a gig with his band.\nHe and Cooper later met with Major Briggs, who told them about Earle's involvement with Project Blue Book, that when the investigation began to involve the woods surrounding Twin Peaks, he became obsessive until his removal. Briggs then showed them footage of Earle describing an evil place called the Black Lodge. Cooper then said that he believed the true reason Earle came to Twin Peaks was not vengeance against him, but to find the Black Lodge, which he believed to be connected to the petroglyph.\nLater, they observed the petroglyph more, trying to decipher it as they waited on Briggs to arrive. He had Andy call the Briggs home as Cooper stated that he had not been completely focused all day, as he had been thinking about Annie.\nThe next day, Harry told Cooper that he had men searching the woods for Major Briggs, who Cooper believed to be targeted by Windom Earle. He also mentioned that he believed Josie was killed by fear, and he saw BOB just after her death. He said that he believed this had a connection and BOB fed off of fear. Cooper believed there may be a connection between BOB and the Black Lodge, which he also believed to be the \"evil\" within the woods that Truman had referred to.\nBriggs was brought back to the station by Hawk, who found him stumbling through the woods. Cooper came and noted that the major was under the influence of haloperidol, the same drug used by Phillip Gerard. Because of this, his answers to Cooper's questions were unclear. Cooper expressed his worry about the Black Lodge, that they must find their way in at the right time.\nCooper had an epiphany that the Lodge would open when Jupiter and Saturn aligned. Briggs uttered \"protect the queen,\" and \"fear and love open the doors,\" the latter referring to the Lodges. Cooper also surmised that Earle will be taking the queen—Miss Twin Peaks—of their chess game to the door of the Lodge. As they began to head out, Andy accidentally knocked over the bonsai plant, revealing it to have contained a microphone planted by Earle.\nHarry and Cooper arrived at the Miss Twin Peaks Contest, having ordered deputies to surround the building. Chaos ensued following Annie's win of the title of Miss Twin Peaks and she was taken away by Earle.\nHarry went to the conference room, where Hawk and Cooper were studying the petroglyph, which Andy discovered was actually a map. He told Cooper that he had deputies looking for Earle, but the FBI agent said that the only hope of finding Earle and Annie lied within the petroglyph. Pete then came in, reporting that the Log Lady had stolen his truck. However, Cooper said that she did not steal it and that she would arrive momentarily. Truman took a closer look at the petroglyph and noticed the twelve Sycamore trees of Glastonbury Grove, where Hawk had previously found a bloody towel and pages from Laura's diary. The Log Lady then arrived with oil, which her husband called \"an opening to a gateway.\" Dale and Harry smelled the oil and link it back to Doctor Jacoby's statement of smelling \"scorched engine oil\" the night Jacques was killed. Hawk then brought in Ronette Pulaski, who smelled the oil and became frightened, as she recognized the smell from the night Laura Palmer was killed.\nHarry and Dale traveled to Glastonbury Grove, where Cooper declared he must go on alone. Harry watched as he disappeared into a set of red drapes. Andy soon joined the sheriff, where they waited at the Grove for more than ten hours after Cooper disappeared into the Black Lodge. Andy eventually went to get Harry some breakfast.\n \n \nEventually, Cooper and Annie appeared at the entrance, the latter unconscious with blood on her face. Truman and Doctor Hayward took Cooper back to the Great Northern and Annie to the hospital. Cooper got up to brush his teeth. Truman and Doc Hayward heard the mirror break while Dale laughed and asked, \"How's Annie?\" Harry and Will ran into the bathroom after hearing the mirror break, where they found Cooper lying on the floor with blood on his face and the mirror shattered. Cooper, smiling strangely, told Harry that he struck his head on the mirror, and it struck him as funny.\nAccording to a dossier discovered in 2016, after Cooper left Twin Peaks, Harry read the Andrew Packard case file that was in the Bookhouse and started drinking from reading about Josie. Finally, he allegedly wrote a letter about what he knew of the case, hoping that he would feel better. FBI Special Agent Tamara Preston stated that the letter's handwriting was a 96% match to Truman's.\nFollowing Cooper's sudden departure from Twin Peaks, Harry spent over twenty years investigating what had become of him. He also was an uncredited source for parts of Briggs' dossier.\nLater life\nWhen Wally – the son of Andy and Lucy – was born, Harry was named as his godfather.\nHe eventually had several run-ins with the troubled Richard Horne, son of Audrey Horne.\nIn 2016, Truman was diagnosed with cancer and he secretly underwent treatment at a research hospital in Seattle while pretending to have merely retired. He only told his brother, Frank, of the nature of his ailment, although Hawk later managed to learn of it on his own. Frank returned to Twin Peaks, once again serving as sheriff, in an agreement to hold the position for two years to stabilize the department before promoting Hawk to the position.\nAt some point, Harry's nephew, a soldier, committed suicide.\nPersonality\nHarry was an empathetic, self sacrificing man, which was made clear by his lifelong ambition to work in public service. He also deeply honored tradition and his family, as his father and brother were the sheriff of Twin Peaks before him.\nPatient, compassionate, and socially aware, Harry almost always said the right thing to calm down anyone who was upset. He managed to subdue Bobby Briggs at Laura's funeral, and he also managed to calm down Dwayne at the Milford wedding. He displayed great patience and social precision when navigating the sensitive topic of Laura's murder with her parents - Leland and Sarah Palmer. He displayed the same compassion and understanding during Leland's initial arrest for the murder of Jacques Renault.\nHis patience was also demonstrated repeatedly and consistently in his responses to Agent Cooper's rather unconventional means of investigation. He quickly learned that nothing of value or substance will come from questioning Cooper, and so he usually went along with his ramblings and dreams. At times, he even appreciated Cooper's upbeat attitude and approach to life - he allowed Cooper to treat him to coffee under the insistence that one must give oneself a present every day.\nDespite his patience, Harry could be rather cynical and skeptical. This was shown when he finally decided that Cooper's methods of investigation are unreasonably unconventional, and had no basis in reality. He also doubted the existence of BOB, even when BOB had revealed himself and his crimes to the sheriff's department. Harry rarely voiced his cynicism, however, being more of s listener than a speaker. Nevertheless, Harry resented being considered a sidekick, a follower, or second best. He did not enjoy being left out of the loop, feeling very uncomfortable and uneasy when he did not know what was going on.\nHarry was also very sensitive - though he tried not to be. Despite his best efforts at remaining stoic and emotionally solid, his feelings shone through easily in his body language and the way he reacted towards Albert Rosenfield's snarky comments regarding Twin Peaks. Overcome with a protective rage, he attacked Albert twice. His second attempt was admittedly unsuccessful, possibly because Harry was so caught off guard with Albert's sudden outburst of emotion, and confession of love. Truman's tough exterior was completely shattered following the death of Josie Packard. The devastated Truman became a furious drunk, only to be calmed by Cooper and reduced to tears.\nNon-canon appearances\n\nInternational Pilot\nThis section covers only the alternate ending presented in the International Pilot.\nHarry gets a call from Lucy, who says Sarah Palmer saw Laura's killer and will be expecting the Sheriff and Deputy Hawk at the Palmer home to get a sketch of the man.\nTruman gets the sketch of the man and meets Agent Cooper at the hospital, where the one-armed man from the elevator awaits them in the room where they earlier examined Laura's body. The man identifies himself as \"Mike\" and tells them that he lived above a convenience store with a man named \"BOB.\" Harry shows him a police sketch of a balding man, which Mike says is not BOB. He then shows a sketch of a long-haired man, which Mike confirms to be BOB. He says that BOB is in the basement.\n \nTruman and Cooper go the basement, where Harry aims his gun at BOB, who welcomes them to \"the killer's lair.\" They approach him as he asks about Mike, wishing to \"sing with him again.\" Harry asks BOB what the letters under the victims' fingernails were going to spell, and he answers \"Robert.\" BOB promises he will kill again and Mike appears with a gun, shooting BOB dead. Mike is overcome by a great pain and collapses to the floor.\nSaturday Night Live sketch\nHarry (played by Kevin Nealon) enters Cooper's room at the Great Northern to tell him that Leo Johnson has confessed to murdering Laura Palmer. However, Cooper ignores him, instead suggesting they go to One Eyed Jacks disguised as Indians. He tells him of Leo's confession again, which Cooper determines to be another piece of the puzzle to finding out who killed Laura. He then reveals evidence, including a videotape of Leo killing Laura. Cooper dismisses the obvious and tells him of a dream he had of a hairless mouse with a pitchfork, singing about caves, and surmises this to relate to the caves near the Packard Sawmill.\n \nAndy then brings a handcuffed Leo into the room, who is ready to do his time. Leland comes in to thank Agent Cooper for finding the man who killed Laura. However, Cooper says the killer has not been caught, causing Leland to have a breakdown, then leave. Harry questions why Cooper has done this.\nAudrey enters and Leo interrupts them to show Cooper photos of him before, during, and after Laura's murder, but this still does not convince the FBI agent. After Audrey gives Cooper a present, she leaves, and Cooper tells Harry of his plan to stake out the graveyard disguised as altar boys. Harry shoots this plan down and tries again to convince Cooper, but he keeps suggesting other plans. Cooper picks up a rock and says that if he breaks the window with it, Leo is innocent. He throws the rock, which breaks the window. This frustrates Leo, who says he sent several notes to Cooper, confessing to the crime.\nNadine Hurley then comes with her silent drape runner, asking Cooper to take it to the patent office in Washington, D.C. then leaves. Harry says he is going to leave as well, but Cooper stops him, as they have not yet heard from the Log Lady. Harry says they will not hear from her, as they have already used both female Saturday Night Live cast members. Nevertheless, she rushes in, saying that her log has said Leo committed the crime and she leaves.\nAs Truman leaves with Andy and Leo, Cooper asks who shot him, which Leo confesses to as well.\nBehind the scenes\nSheriff Truman was played by Michael Ontkean in Twin Peaks and Twin Peaks: The Missing Pieces, the latter of which were deleted scenes from Twin Peaks: Fire Walk with Me.\nAccording to Mark Frost, casting Truman proved difficult. The role was turned down by David Strathairn and Robert Forster was nearly cast, but had to turn it down due to a prior commitment to another television pilot. Under contract with ABC, Ontkean was cast nearly a week before shooting after expressing interest in the script and meeting with Mark Frost. Ray Wise auditioned for the role before being cast as Leland Palmer.\nAlthough Ontkean initially expressed enthusiasm for reprising his role in Twin Peaks (2017), he ultimately turned it down for undisclosed reasons. Frank Truman was written into the series to accommodate this and, ironically, the role was given to Forster.\nTrivia\nThe sheriff's name in the pilot's original script was Daniel \"Dan\" Steadman.\nThe sheriff has a photo of the 33rd President of the United States, Harry S. Truman, in his office.\nIn Twin Peaks: Access Guide to the Town, Harry's father is identified as mill worker Boyd Truman, whereas The Secret History of Twin Peaks states his father to be Frederick Truman, sheriff of Twin Peaks and founding member of Citizens Brigade, which became the Bookhouse Boys.\nAlso mentioned in Access Guide is inventor Crosby Truman, but it is unknown if there is any relation to Harry.\nAccording to The Secret History of Twin Peaks, his favorite book was To Kill a Mockingbird by Harper Lee."}