{"name": "Hawk", "url": "https://twinpeaks.fandom.com/wiki/Hawk", "text": "Hawk\nTommy \"Hawk\" Hill was Deputy Chief at the Twin Peaks Sheriff's Department and a member of the Bookhouse Boys.\nHe was a full-blooded Nez Perce, although, during a discussion as to whether or not he believed in the soul, he referenced Blackfoot Indian mysticism to Special Agent Dale Cooper.\nHe was clearly aware of the supernatural presence in woods of Twin Peaks and also discusses with Cooper his belief in a direct connection to Native American spirituality. He was also the first person to verbally express to Cooper what the White Lodge and Black Lodge were.\nBiography\n\nEarly life\nWhen Hawk was a child, he would play in Owl Cave and pretended it was \"haunted by fierce ghosts.\"\nIn high school, Hill was given the nickname \"Hawk\" by Frank Truman, though he was initially resentful of it. He was also a running back in the starting lineup of Twin Peaks High football team of 1968, alongside Frank Truman, Harry S. Truman, \"Big Ed\" Hurley, Hank Jennings, Thad \"Toad\" Baker and Jerry Horne. He was presumably a halfback.\nFollowing high school, he served in the Vietnam War and, sometime after returning home, became a deputy in the Twin Peaks Sheriff's Department under Frank Truman and subsequently Harry S. Truman after Frank retired and left Twin Peaks.\nCareer\nIn February 1989, Hawk informed Sheriff Truman and Deputy Andy Brennan that \"Bernie\" was coming in from Canada. When Andy made a stray comment that if he was coming in on foot, thus had a long hike, Hawk quickly left the room before an \"Andy\" situation developed.\nMurder of Laura Palmer\nAfter homecoming queen Laura Palmer was found murdered on the morning of February 24, Hawk and Andy asked her boyfriend, Bobby Briggs, about his whereabouts until Sheriff Truman arrived to inform Briggs that Laura had been found dead.\nLater, Hawk went with Andy and Truman to the Palmer home, where he found evidence as the sheriff questioned Mrs. Palmer. He found Laura's diary and took it for the investigation, though they did not have the key and Leland Palmer was mildly reluctant to let him take it. He also found a camcorder.\nWhen James Hurley was arrested, he and Andy took him to his cell.\nAfter James was questioned the next morning by Truman and FBI Special Agent Dale Cooper, Hawk took him back to his cell once again and later released James to his uncle, Ed Hurley, and the two men made the Bookhouse Boys gesture to each other, touching their temples.\nAt the hospital, Hawk asked Janek and Suburbis Pulaski about their daughter, Ronette, who was attacked by the person who killed Laura. He then spotted a one-armed man go toward the morgue.\nHawk called Agent Cooper the next day, updating him on Ronette's condition and the findings from her parents. He went on to tell him about the one-armed man he saw around the intensive care ward.\n \nHe later assisted Truman in setting up a bottle sixty feet and six inches away from receptionist Lucy Moran, per Cooper's instructions. He questioned what the special agent was doing, but the sheriff was just as baffled. Later, he sat and listened to a presentation Cooper had prepared about Tibet and a method he had derived from a dream to determine which individuals with the initial 'J' were people of interest in the Palmer case. Cooper had Hawk hold rocks that he threw at a bottle. The rock for Lawrence Jacoby knocked over the bottle, but did not break it, and the rock for Leo Johnson broke it.\nHawk informed Agent Cooper the next day that he had found no sign of the one-armed man, then went to Laura's funeral, where he helped restrain Mike Nelson when Bobby and James charged at each other.\nLater he went to the Double R Diner with Harry and Ed. They were joined by Cooper, who they informed about their operation to halt the drug flow into Twin Peaks, introducing him to the Bookhouse Boys. They subsequently took him to the Bookhouse.\nIn the evening, Hawk discussed the human soul with Cooper. He said that he believed in waking souls and dream souls. They had a drink to Laura, but were interrupted when Leland Palmer had a breakdown on the dance floor and they escorted him home.\nHawk called Cooper the next day and said that he had found the one-armed man at the Timber Falls Motel. His name was Gerard and he was in room 101. After Cooper and Truman kicked in the door, Hawk checked Gerard's background and found no criminal record or warrants. After they question Gerard, Hawk told Truman that Josie Packard had been in her car at the motel prior to his arrival.\nHawk later helped bring in files confiscated from the Lydecker Veterinary Clinic and met with Truman, Cooper, and Andy in the pistol range, where he fires at a target, not missing a shot.\nHe later brought in an analysis on a plastic object found in Laura's stomach, determining it to be part of a poker chip. Andy then found a file on a myna bird owned by Jacques Renault named Waldo and Hawk went to retrieve Jacques's address.\nWhen they arrived, they saw a man they believed was Jacques, (who was actually Bobby Briggs placing evidence in Jacques' apartment) but he got away.\nThe next morning, Hawk received a transmission from Truman that he was at Jacques's apartment and wished for Hawk to be there as soon as he can, as he had been sent to find Bernard Renault.\n \nHe later arrived at the apartment, confirming that a post office box noted on envelopes hidden in the apartment belonged to Jacques, providing letters he found in it. He handed Cooper a copy of Flesh World found in the apartment and he found an ad of Laura, which had red drapes matching ones in a photo in the apartment and a dream Cooper had. They then set out to find the cabin seen in the photo.\nHawk led them through the woods, where they encountered the Log Lady. They sat down for tea and cookies while she spoke for what her log saw the night Laura was killed and the men set back out to find the cabin. They heard music playing and found the cabin. They entered, where Hawk found a camera with film in it and blood.\nHe brought forensics results to Cooper in the conference room the next day, determining that Jacques had three people in his cabin: Laura Palmer, Ronette Pulaski, and Leo Johnson. He also provided the only photo found on the camera's film, which showed Waldo on Laura's back.\nHawk later helped Cooper with his wire for the operation at One Eyed Jacks. They then heard a gunshot near the conference room, where they found Waldo dead.\nLater joined by Ed, he listened to Cooper's operation as he spoke with Jacques, who described his involvement with Laura the night she was killed.\nHawk then informed Sheriff Truman that Jacques would be crossing the border.\nLater, after the law apprehended Renault, he stood with Andy and Ed and they told other lawmen about Andy's heroic actions of saving Sheriff Truman's life.\nHe is later told by Cooper to pull the surveillance off of Leo's house and go to Easter Park.\nHe went with Truman and Andy later that night to Agent Cooper's room at the Great Northern after contact was lost with him. They found the special agent on his floor, bleeding from a gunshot wound.\nAt Leo Johnson's house in the morning, he presented a copy of Flesh World and Leo's duster—which smelled of gasoline—to Truman and Cooper.\nHe took James back to his cell after he was questioned by Sheriff Truman and later to the hospital to give him over to Ed.\nHe later sat in the conference room as Cooper went over the events of the night Laura was killed.\nHe spoke with James at the station a couple of days later before being dismissed by Cooper. He then observed Lucy working on finding out what words all contained the letters found under the fingernails of Teresa Banks, Laura Palmer, and Ronette Pulaski. He offered to help just before Lucy's lunch date, Dick Tremayne arrived, whose impending arrival made Andy call in sick. Hawk broke Tremayne's cigarette and ignored his attempts to introduce himself.\nWith Sheriff Truman and Agent Cooper, he later discussed a giant that appeared to Agent Cooper. Leland Palmer then arrived to give his knowledge on \"BOB,\" who was apparently the neighbor to Leland's grandfather named Robertson. Cooper sent Hawk to find further information on this.\nHe later returned with his findings that there was no record of anyone named Robertson in the area, but suspected an unmarked mailbox in front of a boarded-up house. Harry then asked if he had seen Phillip Gerard, but he had not. Cooper noted that in his dream, the One-Armed Man knew \"BOB,\" so he led Hawk and Harry to the bathroom, where Gerard had been, and they found a syringe.\nHawk quickly enters the station two days later to inform Harry that the house allegedly lived in by Robertson was actually owned by schoolteachers who knew nothing of a man with BOB's appearance. Having had to drink three cups of tea to extract this information, he excused himself to the bathroom.\nLater, he walked into Harry's office to inform he and Cooper on the whereabouts of Gerard, who had not been seen in a couple of days. He was then suspiciously dismissed by Truman.\nHe followed them to One Eyed Jacks where they rescued Audrey Horne, and he came to their rescue, throwing a knife into an armed guard's back.\nThey took Audrey to the Bookhouse, where Cooper determined that she had been doped with heroin and Hawk later found Phillip Gerard and brought him to the station, to Harry's office.\nCooper later came to the station and had a private conversation with FBI Regional Bureau Chief Gordon Cole, though Hawk and Harry could hear every word Cole said due to his loud speech.\nHe went with Cooper, Truman, and Cole to the conference room to question Gerard. Cole refused to give Gerard his medicine and he seemingly switched personalities into the \"inhabiting spirit,\" Mike. He explained \"BOB\" as being his familiar and that he fed on fear and pleasure. He also said that he was to stop BOB, who was in a house made of wood: the Great Northern Hotel.\nHawk has coffee outside the receptionist's desk the next morning with Cole, Cooper, Mike, and Andy. He was sent by Harry with a search warrant for the apartment of Harold Smith, who allegedly had in his possession another diary written by Laura. He went to Harold's apartment and found his hanging body, with plants and pages strewn about the apartment. After Harry and Cooper arrived, Hawk realized that the pages were from Laura's secret diary.\nWhen Benjamin Horne was determined to have been a prime suspect in the murder, he went with Harry and Cooper to his office, where they arrested him.\nLucy came back to Twin Peaks the next day with her sister, Gwen and nephew, having been visiting them in Tacoma. Hawk was asked by Lucy if he had seen Andy, but he shook his head. Gwen then referred to him as \"Eagle Eye.\" He corrected her and was introduced to her by Lucy. Gwen then asked him if he hated white people for their historical actions against Natives, but he responded, \"Some of my best friends are white people.\"\nAfter Mike escaped from his custody at the Great Northern, Hawk found him and took him back to the station interrogation room. There, Mike said that Ben Horne was not BOB. However, Truman charged him with the murder and Hawk took Mike back to the hotel.\nAt night, another body wrapped in plastic was found, this time belonging to Laura's cousin, Maddy Ferguson.\nHawk observed the next day as FBI Agent Albert Rosenfield delivered evidence found on Maddy's body: a letter 'O' under her fingernail and fur from a taxidermy white fox. When Cooper was unsure where to go next with the case, Hawk encouraged him.\nHe wheeled Leo into the roadhouse, where Cooper determined the killer of Laura and Maddy through the use of what he called \"magic.\" He asked to have Horne escorted back to the station with Leland as his attorney. Hawk and Albert took Ben down to interrogation, but Leland was pushed into the room first by Harry and Cooper, causing him to be enraged, revealed as BOB's host.\nThey soon entered the room, where Leland was restrained by Truman as Hawk cautiously pointed his gun him. Through Leland, BOB howled and laughed as he confessed to the murders. Hawk curiously watched him as the lawmen left the room, the sheriff satisfied with the confession. As Cooper discussed all of the evidence against Leland and the events that occurred the night of Laura's murder, Hawk watched Leland through the room's window.\nThey left after BOB chants a poem, then frantically entered again after the sprinkler system went off and BOB slammed Leland's head into the door. Hawk left to call an ambulance, but Leland ultimately died in Cooper's arms.\nCooper's suspension from the FBI\nA few days later, as Dick and Lucy talked about the baby, Hawk tried to get Andy to intervene. However, Andy proposed a truce, which Hawk was not impressed with.\nAs Agent Cooper prepared to leave Twin Peaks, he told Hawk that if he was ever lost, he hoped Hawk to be the one who was sent to find him. However, Cooper was stopped by Special Agent Roger Hardy, who told him that he had been suspended from the FBI.\nHawk went with Andy to Truman's office the next day, where Andy presented a wedding gift for Dougie Milford and his wife-to-be Lana Budding. Hawk stated his disbelief that Milford was marrying again and explained to Agent Cooper that the man's marriages were \"seasonal.\"\nCooper later asked Hawk and Harry if they had ever heard of a place called the White Lodge, it being the last thing Major Garland Briggs spoke about prior to his disappearance while fishing with Cooper. Hawk explained the White Lodge's spiritual nature and that it had a shadow-self, the Black Lodge, and that every spirit must pass through to reach perfection. He said that his people called it \"The Dweller on the Threshold.\" DEA Agent Dennis Bryson then arrived, having been assigned to Cooper's case. However, Hawk and the other men were surprised that Bryson was wearing women's clothing and preferred to be called Denise. After she explained the case to Cooper and left, Hawk remarked, \"That's a good color for him.\"\nHawk later attended the Milford wedding.\nHawk comforted Lana Milford the next morning following the death of her new husband. He restrained the upset Mayor Dwayne Milford as he angrily chided Lana, and Hawk had him escorted out. Lana explained to him that she believed she had been cursed since her prom night, during which her date - who had braces - had his jaw lock open when they kissed and had to have it broken in three places to be corrected. Hawk told her that her curse could be cured and that \"when something really big goes down, the man.\" He leaned against a door just before Andy opened it, causing him to fall. Hawk was later taken by Lana's charm once again along with Harry, Andy, Dick, and Doctor Hayward.\nHawk prepared the very sweaty Ernie Niles for a sting operation into Jean Renault's drug trade the next day. He listened in on the drug buy until Ernie's wire malfunctioned due to his sweat, blowing their cover. Cooper offered himself to Renault in exchange for Ernie and Denise. Harry commanded Hawk to call in backup. After Denise made her way into the house as a waitress and gave a gun to Cooper, Hawk confirmed Renault's death by Cooper.\nWindom Earle and the Black Lodge\nThey returned to the station, where the power was out, due to a bomb in the woods, according to Lucy, though Hawk was sure that there was something more sinister at work.\nA body was found in Sheriff Truman's office. Hawk reported in that he found two sets of the same boot prints outside the station, one coming and one going. Truman later told him to check an abandoned car found on a logging road and he reported that it had no prints. He also said that Hank Jennings was not present at the Dead Dog Farm buy, as he was in the hospital, claiming to have been hit by a bus. Hawk handcuffed him to the bed and charged him with various parole violations.\nHawk escorted Hank into Sheriff Truman's office a couple of days later, where Hank was charged with the attempted murder of Leo Johnson. However, he offered a trade for information on who killed Andrew Packard, and despite the sheriff declining, Hank hinted that Josie Packard was responsible. When Hank mocked Harry, Hawk kicked out one of his crutches and escorted him out.\nFollowing the death of Josie Packard, Hawk brought breakfast from Norma to Harry, who sat at the Bookhouse, drinking. Harry thanked him and asks how things were at the station, confident that Cooper and Hawk could handle his responsibilities.\nHawk went to Cooper to report on Harry's situation. Cooper also noted that Hayward's autopsy on Josie found that she only weighed 65 pounds.\nLater, he again went to Cooper to bring him to the Bookhouse, as Harry was then tearing the building apart in a drunken rage. After Cooper calmed him down, they took Harry to bed.\nHawk brings gear to the entryway the next day for the department's trip to Owl Cave, while Andy spelunked through the ceiling. At the cave, they found the symbol Cooper came to find, and by Andy's mistake of swinging his pickaxe into the cave wall, a petroglyph was revealed.\nThe lawmen returned to Owl Cave the next day, where Hawk found tracks belonging to Windom Earle, Cooper's insane ex-partner.\nLater, at the station, Hawk brought a segment of a poem sent to Donna Hayward, the other two having been sent to Audrey and Shelly Johnson, the latter's being in possession of the Sheriff's Department already. Cooper believed the poems to have been sent by Earle. Hawk told them that Major Briggs had come to speak with them, and Cooper requested him to get Leo Johnson's arrest report. Hawk brought Cooper the report, which showed that the poems were in Leo's handwriting. The agent believed the poem was dictated to him by Earle. Hawk called Donna and Audrey to the sheriff's station the next day, per Agent Cooper's instruction.\nThe following day, Hawk searched the woods for Major Briggs, who had disappeared again. Soon, he encountered him stumbling and took him to the station.\nHe later attended the Miss Twin Peaks Contest. After Annie Blackburn's win, chaos ensued.\nHawk later studied the petroglyph, which Andy had discovered was a map. Harry took a closer look and identified Glastonbury Grove, where Hawk had previously found a bloody towel and pages of Laura's diary. The Log Lady came, bringing oil that her husband called \"an opening to a gateway.\" Hawk then brought in Ronette Pulaski, who smelled the oil and became frightened, as she recognized the smell from the night Laura Palmer was killed.\nTwenty-five Years Later\nOver the next twenty-five years, Hawk was promoted to Deputy Chief in the sheriff's department, and one day, he received a call from the Log Lady, who relayed a message from her log, saying that something was missing and he had to find it and that it related to Agent Cooper, who had been missing for twenty-five years. She also told him that it related to Hawk's heritage.\nHawk brought files to the conference room and explained to Andy and Lucy—by then husband and wife—what Margaret had told him.\nHawk later searched the woods and Margaret called him to say \"the stars turn and a time presents itself.\" She also offered him pie and coffee if he stopped by her cabin, but he took a rain check, as he had reached Glastonbury Grove.\nAndy and Lucy examined the files, but could not figure out what was missing. Lucy then suggested it was a chocolate bunny in the evidence that she admitted to having eaten years before due to having gas. Andy asked if chocolate bunnies had anything to do with Hawk's heritage, but Hawk eventually brought them to the conclusion that their investigation was not about the bunny.\nHawk soon filled in Sheriff Frank Truman - serving in the stead of his sick brother - on the situation concerning Margaret's message. Bobby Briggs - by then a deputy - entered and told them that Agent Cooper had been the last one to see his father alive, but he did not know what they discussed.\nHawk and Andy later continued looking through files, Andy asking Hawk if had found any Indians yet.\nWhile in a restroom, Hawk dropped a coin, which rolled under a stall. When he went to pick it up, he noticed a screw missing from the stall door's paneling. He got a step ladder and a crow bar and pulled back the paneling, finding pages inside.\nThe pages were found to be from Laura Palmer's diary, which noted that Annie had told her in a dream that the \"Good Dale\" was in the Lodge, but could not leave. Hawk believed this to be what the Log Lady had told her to find, but was not completely sure what it meant. After showing the pages to Frank, they agreed to fill in Harry on the details and contact Doctor Hayward.\nAlong with Frank and Bobby, Hawk visited Bobby's mother, Betty, who told them that she had been expecting this meeting after her husband told her about it prior to his death. She gave them a metallic container that Garland had hidden inside of a chair.\nThey took the container back to the sheriff's station and kicked Chad out of the conference room to open it. However, Frank and Hawk could not and an amused Bobby took them outside to open it, revealing slips of paper referring to the \"Jackrabbits Place\" – an imaginary place where Bobby and Garland used to play during the former's childhood – and a series of letters and numbers, \"COOPER / COOPER\" being among them.\nMargaret later called Hawk again with another cryptic message concerning the presence of electricity, and its glow dying. She told him that the Truman brothers were \"true men\" and his brothers, as well as the other good men who had been with him. Her message culminated with her telling him \"Laura is the one.\"\nHawk discussed with Frank their destination, presenting an ancient map, which he explained to the sheriff. When Frank questioned a particular symbol on the map, Hawk advised him that he did not wish to know anything about it. Margaret called Hawk again, telling him there was \"fire\" where he was going.\nAfter Sarah Palmer had a breakdown at a nearby grocery store, Hawk went to visit her, assuring her that if she ever needed any help, to call him. During his visit, he heard a rattling noise from inside the home, which Sarah dismissed as \"something in the kitchen.\"\nAfter arresting problematic Deputy Broxford, Bobby led Hawk, Frank, and Andy to Jack Rabbit's Palace, following Major Briggs' instructions. They encountered a nude, eyeless woman, who Andy noted to be important and to be kept under their care. Hawk and Frank admitted that they did not recall anything between finding the woman and Andy telling them about her.\nAfter Hawk and Bobby locked up James Hurley and Freddie Sykes following a fight at the Roadhouse, Margaret called Hawk one last time to say that she was dying. She urged him to remember everything she ever said to him and to watch for \"the one\" she had told him about. After she told him goodnight, he hung up and softly said \"goodbye.\"\nHawk later gathered Bobby, Andy, Lucy, and Frank in the conference room to announce Margaret's passing.\nAfter a gunshot rang out in Sheriff Truman's office, Hawk made his way there to find Cooper's doppelganger dead on the floor. Truman told the baffled Hawk that the dead man was not Cooper, who soon arrived as woodsmen removed BOB from the doppelganger's body.\nAfter Freddie defeated BOB, Cooper told everyone he hoped to see them again and that there were things that would change, stating that the past would dictate the future.\nNon-canon appearance\n\nGeorgia Coffee Commercials\n\nA Mystery of \"G\"\nHawk becomes curious about Georgia Coffee when Cooper suggests it and highly praises it. When Andy connects pins on a map, he identifies the location as Glastonbury Grove.\nThe Rescue\nHawk travels to the grove with Cooper, Ken, and Andy, where Cooper enters the Black Lodge and finds Ken's wife, Asami.\nBehind the scenes\nHawk is played by Michael Horse, who reprised the role in the 2017 series.\nTrivia\nHawk was not present in the original script for the pilot. Instead, there was an African-American deputy named Bernie Hill.\nIn the International Pilot, Lucy tells Leland Palmer that Hawk is the department's sketch artist. In all other episodes, Andy has this job.\nAccording to The Secret History of Twin Peaks, his favorite book is Fear and Loathing on the Campaign Trail '72 by Hunter S. Thompson.\nHawk's first name and nickname are a reference to the Tomahawk, a traditional Native American ax.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}