{"name": "Highway_21", "url": "https://twinpeaks.fandom.com/wiki/Highway_21", "text": "Highway 21\n\"I stopped the bike at the light at Sparkwood and 21. She jumped off and ran away. I didn't see her again.\"\n ―James Hurley\nHighway 21 was an interstate highway that ran through Twin Peaks, Washington, also serving as the town's Main Street.\nHistory\nIn 1989, Leland Palmer arrived at the Hayward home to pick up his daughter Laura for breakfast. On the way home, Mike shouted madly at Leland and Laura, shouting at Leland that \"the thread will be torn\" and showing Laura Teresa Banks' ring. Leland pulled into a gas station parking lot to gather his wits.\nOn the night of February 23, James Hurley began to take Laura home, but she jumped off of his bike at the intersection of Highway 21 and Sparkwood Road. In tears, she told him \"his Laura\" is gone. Screaming that she loves him, Laura runs away from James into the woods.\nFollowing Laura's murder, Maddy Ferguson, Donna Hayward, and James lured Dr. Lawrence Jacoby out of his office, making an appointment at the intersection of Highway 21 and Sparkwood Road on behalf of Laura.\nIn 2016, Richard Horne sped and illegally passed traffic, causing him to run over and kill a boy at the same intersection where Mike yelled at Laura years before. Carl Rodd witnessed the event and after seeing a golden aura float from the child's body, he went to comfort the boy's mother. Near this intersection was located a utility pole.\nNotable buildings\nAngelo Wong's (77 Main Street)\nBig Ed's Gas Farm\nDouble R Diner\nHurley house\nRoadhouse\nBookhouse\nWagon Wheel Bakery\nTwin Peaks Sheriff's Department\nMo's Motor\nGallery\nNear Big Ed's Gas FarmHighway 21 (near Mo's Motor).jpgNear Mo's Motor\nBehind the scenes\nIn the original script of the pilot, Highway 21 is described as follows: \"A long, straight, empty stretch of road leads up between two mountains, Whitetail and Blue Pine, the Twin Peaks.\" \nVarious sections of the highway were filmed in various places. The intersection of Highway 21 and Sparkwood Road was filmed on the corner of SE Reinig Road and SE 396th Drive, Snoqualmie, Washington.\nThe intersection where Mike yelled at Laura and where the boy was hit by Richard's car, was filmed at intersection of the Meadowbrook Way and Park Street in Snoqualmie, Washington."}