{"name": "Impressions:_A_Journey_Behind_the_Scenes_of_Twin_Peaks", "url": "https://twinpeaks.fandom.com/wiki/Impressions:_A_Journey_Behind_the_Scenes_of_Twin_Peaks", "text": "Impressions: A Journey Behind the Scenes of Twin Peaks\nImpressions: A Journey Behind the Scenes of Twin Peaks is a series of behind the scenes short films by Jason S., released as part of Twin Peaks: A Limited Event Series and Twin Peaks: From Z to A. Each film follows David Lynch throughout the production of Twin Peaks (2017).\nNarrated and scored in an abstract manner by Josef Maria Schäfers, the short films intercut hundreds of hours of footage with new aerial photography of many of the locations, both those used for filming and featured in the series.\nInstallments\nThe Man with the Gray Elevated Hair\nThis film focuses particularly on Lynch's meetings with actors – specifically Sheryl Lee, David Patrick Kelly, Nae Yuuki, Grace Zabriskie, Sherilyn Fenn, Kyle MacLachlan, and Laura Dern – and setting up various scenes set in and around Twin Peaks as well as the motel Cooper and Diane visit.\nTell It Martin\nThis film follows Lynch throughout the shooting of scenes set in Las Vegas. He is seen discussing scenes with actors Sawyer Shipman, Christophe Zajac-Denek, Jim Belushi, and Robert Knepper.\nTwo Blue Balls\nLynch is followed during the filming of scenes set in South Dakota, Montana, New York, and New Mexico. He meets with actors Matthew Lillard, Cornelia Guest, Benjamin Rosenfield, and Madeline Zima.\nThe Number of Completion\nThe film follows Lynch during the filming of scenes set in the Fireman's home, Sheriff Truman's office, and the KPJK radio station. He discusses scenes with actors Joy Nash, Robert Forster, Jim Belushi, Kimmy Robertson, Kyle MacLachlan, Laura Dern, and Robert Broski. Carel Struycken is also briefly featured, practicing his lines.\nBad Binoculars\nThis film features Lynch directing a rehearsal for an Audrey and Charlie scene, directing scenes featuring Jerry Horne after he leaves the woods, and scenes at the Twin Peaks Sheriff's Station, both on-location in Washington and on a sound stage in Los Angeles.\nSee You on the Other Side Dear Friend\nThis film goes behind the scenes with Lynch during the filming on-location in Philadelphia,\nLas Vegas, and South Dakota, directing scenes involving the FBI, Lucky 7 Insurance, Ruth Davenport's apartment, and the doppelganger's car accident.\nDo Not Pick Up Hitchhikers\nIn this film, Lynch discusses Tim Roth's role with him and directs the scene taking place in Warden Murphy's office, the doppelganger's first death, Murphy's assassination, the Detectives Fusco learning of Ike's location, and Cooper's hospitalization.\nA Bloody Finger in Your Mouth\nThis film shows the filming of Diane's scene in the red room, the scene at Szymon's Famous Coffees, the Las Vegas FBI office, Rod getting hit by Candie, and the Fuscos' visit to Lucky 7 Insurance.\nThe Polish Accountant\nThis film goes behind the scenes with the woodsmen encountering the New Mexico couple, the Jones family, the Las Vegas news broadcast, Ike's arrest, Rodney and Bradley's first meeting with Cooper, and the Polish accountant scene.\nA Pot of Boiling Oil\nThis film shows the filming of a red room scene (during which, Al Strobel tells Lynch of his accident that cost his left arm), scenes in Benjamin Horne's office, Audrey and Charlie scenes, and Cooper's exit from the red room.\nCredits\nDuck Diver Films presents\nA Rancho Rosa Partnership Production\nDirected by\nJason S.\nProduced by\nSabrina S. Sutherland\nJason S.\nPhotographed by\nJason S.\nAdditional Photography by\nKristy Koopman\nStefanie Schmid Rincon\nMusic Composed by\nJosef Maria Schäfers\nAdditional Music by\nAnn-Kristin Mayr\nJason Denner\nSound Design by\nClaude Sotheby\nDialog Re-recorded and Mixed by\nPeter Schultz\nFilm Edited by\nMüller von Schmidt\nNarration Written by\nJason S.\nJosef Maria Schafers\nVanessa Weiss\nNarration Spoken by\nJosef Maria Schafers\nStory Consultant\nJon Nguyen\nDigital Intermediate by\nFotokem Creative Services\nDigital Intermediate Colored by\nIsmael Salas\nDigital Intermediate Produced by\nRob Brodersen\nMusic Recorded at\nStudio Stella Luncke, Berlin\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}