{"name": "Invitation_to_Love", "url": "https://twinpeaks.fandom.com/wiki/Invitation_to_Love", "text": "Invitation to Love\nInvitation to Love was a soap opera that aired in Twin Peaks, Washington as of early 1989. The series followed the travails of the inhabitants of \"the Towers,\" a lavish high-rise apartment complex.\nCast\nMartin Padley as Chet Weems\nthe nebbish, put-upon husband of Jade and former husband of Emerald\nSelina Swift as Emerald and Jade\nJared's identical twin daughters, opposite in personality, both of whom were married at different times to Chet and Montana\nEvan St. Vincent as Jared Lancaster\nthe owner of the Towers and Jade and Emerald's father, beset by illness and financial difficulties\nand Jason Denbo as Montana\n \nJade's dangerous ex-husband, plotting with Emerald to murder Jared and steal the Towers\nIn March 1989, a cardboard cutout of the character Emerald was used to promote a sale at the perfume counter of Horne's Department Store.\nNotable episodes\n\nEpisode aired February 26, 1989\nShelly Johnson caught the opening title of this episode at home, but shut it off dismissively.\nEpisode aired February 27, 1989\nLeland Palmer was watching this episode at home when his niece Maddy Ferguson arrived to attend Laura's funeral.\nEvents\nJared Lancaster writes a suicide note, saying he has decided to \"end it all\" due to his financial difficulties. He writes a new will which leaves the Towers to his beloved daughter Jade. As he is preparing to shoot himself, Jade forces her way into his office and tearfully begs him to reconsider, saying he has too much to live for. They embrace.\nEpisode aired February 28, 1989\nLucy Moran was watching this episode on a portable television on her desk when Sheriff Harry S. Truman returned to the station and asked her what was going on. Lucy excitedly summarized the latest developments in the series, before Truman specified that he had asked what was happening at the station. It was also playing on TV at the Timber Falls Motel while Benjamin Horne and Catherine Martell conspired to burn down the Packard Sawmill.\nEvents\nEmerald seduces Chet, ignoring his pleas that he is married to her sister now. She convinces him to sneak into Jared's office and steal his new will so that the original (leaving the Towers to Emerald) will take effect when Jared dies at midnight. After Chet returns, Emerald and Montana gloat about their plan, although Montana angrily corrects her that the Towers will belong to both of them, not Emerald. Jade unexpectedly arrives with several wildflowers she picked outside, but is stunned at the sight of Montana, her ex-husband. Emerald suggests they all sit down to have a talk.\nEpisode aired March 1, 1989\nThis episode was playing on a television in the Double R Diner's kitchen as Norma Jennings and Shelly Johnson returned from a hair salon trip.\nEvents\nChet enters Jared's office to find him tied up and gagged in his chair. He starts to dial a phone number but Montana attacks him from behind, beating him to the floor, before Emerald steps on his chest. Both of them laugh, as the episode ends.\nEpisode aired March 2, 1989\nNadine Hurley watched this episode at home, beaming with pride at the character Chet. Late at night, Lawrence Jacoby watched it in his office, before receiving a phone call from \"Laura Palmer.\"\nEvents\nMontana flirts with an uncomfortable Jade, offering her a drink, but she insists that she has grown and become a different person than she was when they were married. Suddenly, Chet bursts in and holds Montana at gunpoint. He concedes that Emerald was lost to him years ago, but warns Montana that if he tries to come between him and Jade he'll kill him. As the clock strikes midnight, Chet shoots Montana in the shoulder, as the episode ends.\nEpisode aired March 3, 1989\nThis episode was playing, muted, on the Johnsons' TV set while Leo attacked Bobby Briggs with an axe, before he was shot through the window by Hank Jennings. As Leo sat bleeding on the couch, he watched Montana's death scene.\nEvents\nContinuing from the previous day's cliffhanger, Chet shoots Montana, just before Jared arrives at his side. Taking the gun from him, Jared shoots Montana a second time. Montana slides down a wall to the floor, staring in abject shock. Later, Emerald laughs to herself as she burns her father's second will.\nBased on the previous day's cliffhanger ending, this is indeed a separate episode, but it somehow appeared on TV after midnight, instead of during the day.\nEpisode aired March 17, 1989\nThis episode, presumably a re-run, was playing in the Johnsons' living room as Shelly attempted to feed a comatose Leo while arguing with Bobby Briggs.\nEvents\nEmerald stalks down a hallway in the penthouse suite, Chet hurrying along after her. They are in the midst of an argument about Emerald being rude to her father and sister while the former was in the hospital. Emerald is enraged at Chet's concern for Jade's feelings, and Chet retorts that Jade is a kind and loving person compared to her. Suddenly, they are interrupted by the arrival of Montana, who has just returned from eighteen months in the Amazon. Emerald is delighted, while Chet is horror-struck.\nMark Frost indicated that Invitation to Love continued to air as of the 2010s, and that Jade was a fan, borrowing her pseudonym from the character of the same name.\nBehind the scenes\nInvitation to Love is a fictional soap opera created for Twin Peaks, episodes of which can be seen playing on incidental TV sets in each of the first season's episodes beginning with \"Episode 2.\" The original impetus was to make the town of Twin Peaks seem even more unusual, by way of its residents obsessively watching a series that existed nowhere else in America, but in practice the segments also acted as a commentary and a knowing satire of events unfolding in Twin Peaks itself, humorously highlighting the more outlandish or melodramatic elements of the show.\nAccording to Harley Peyton, an idea that was discussed, but later abandoned, was to have the main cast of Invitation to Love visit Twin Peaks.\nThe second season almost entirely dropped the concept; only one segment is heard playing in the background in \"Episode 20.\" Writer Robert Engels stated that David Lynch disliked the mocking, over-the-top nature of the segments as filmed.\nThe Invitation to Love segments, shot entirely on video, were written and directed by Mark Frost and filmed at the renowned Ennis House in Los Angeles. The cast was comprised largely of friends and family of Mark Frost and his father Warren, including Mark's then-brother-in-law, Rick Giolito, who played Montana. The full assembly cut of all the segments was uploaded to YouTube by the fan site Twin Peaks Archive.\nCast\nDon LaFontaine as announcer\nLance Davis as Martin Padley / Chet\nErika Anderson as Selina Swift / Emerald and Jade\nPeter Michael Goetz as Evan St. Vincent / Jared Lancaster\nRick Giolito as Jason Denbo / Montana"}