{"name": "Jack_Rabbit%27s_Palace", "url": "https://twinpeaks.fandom.com/wiki/Jack_Rabbit%27s_Palace", "text": "Jack Rabbit's Palace\nJack Rabbit's Palace was a landmark near Listening Post Alpha within Ghostwood National Forest near Twin Peaks, Washington.\nLocated 253 yards east from Jack Rabbit's Palace was a portal connected to the Fireman's home.\nHistory\nDuring Bobby Briggs' childhood, his father spent time with him at Jack Rabbit's Palace, named by Bobby. There, they would play make-believe games.\nOn October 1, 2016, per instructions led by his father, Bobby led Frank Truman, Hawk, and Andy Brennan to Jack Rabbit's Palace. They moved 253 yards to the east further through the woods and saw a nude eyeless woman. A portal formed above them and Andy was transported inside after holding the woman's hand. He appeared before a tall man, who called himself the Fireman. Andy was shown a white figure regurgitating BOB, Woodsmen, a high school girl screaming, Laura Palmer, angels, the eyeless woman, bifurcation of Dale Cooper, a telephone, himself and Lucy, and a utility pole before being transported back out. He appeared back at Jack Rabbit's Palace, where the other lawmen waited. He carries the woman and told them that she was important and must be kept under their watch.\nThe next day, Dale Cooper's doppelganger reached the woods outside Twin Peaks, arriving at Jack Rabbit's Palace. A portal formed and he was transported to the Fireman's theater where Major Briggs' head floated. The Fireman levitated as the screen showed the Palmer home, then a road in front of the Sheriff's station, where the doppelganger was then transferred.\nBehind the scene\nThe name of this place may be a reference to David Lynch's series of short films, Rabbits, in which one of the main characters is a rabbit named Jack.\nIn Lynch's Inland Empire, Jack Rabbit says he has \"a secret\" which is later shown to be a secret entrance or portal (which is being sought by The Phantom character) - in Twin Peaks, Jack Rabbit's Palace is indeed the location of a secret portal."}