{"name": "Jack_Parsons", "url": "https://twinpeaks.fandom.com/wiki/Jack_Parsons", "text": "Jack Parsons\n\"Once a magician stands between two worlds, he’s in danger of not belonging to either one of them. In the end, Jack danced too close to the flames and it cost him his life.\"\n ―Unidentified colleague\nJohn Whiteside \"Jack\" Parsons (born Marvel Whiteside Parsons) was an American rocket engineer and rocket propulsion researcher, noted for founding the Jet Propulsion Laboratory and playing an integral role in the development of rocketry science in the 1930s. In addition, as a member of the Thelemite movement and a student of Aleister Crowley, Parsons' occult activities came to the attention of Project Sign and investigator Douglas Milford.\nBiography\nParsons was born to an affluent family in Pasadena, but became destitute due to the Depression. He was largely a self-taught chemist and briefly attended classes at three prestigious universities, but did not receive a degree due to his family's financial struggles. Nevertheless, he managed to secure a grant from the California Institute of Technology to fund his research. At some point, he married Helen Northrup.\nParsons was a pioneer of rocket fuel science in the 1930s and early 1940s. His developments were adopted by the United States military during World War II. After the war, Parsons became less involved in JPL's routine activities, but continued to work on research with various scientists and engineers that he christened his \"Suicide Squad.\"\nIn 1939, Parsons became acquainted with the English mystic, Aleister Crowley and converted to Thelema, a religion derived from Crowley's teachings. Three years later, he had become leader of the West Coast Theleme lodge.\nParsons co-founded the Pasadena-based Jet Propulsion Laboratory in 1943 and soon thereafter, purchased a mansion known as the Parsonage. By 1945, Parsons regularly hosted Thelema gatherings, which involved drug use and sex magick rituals. He met L. Ron Hubbard in August and brought him into the fold, offering him a stay at the Parsonage. During that year, Parsons began a relationship with his wife's half-sister, 17-year-old Sara \"Betty\" Northrup.\nParsons used the Arroyo Seco for experiments in \"the explosive sciences, of both the literal and metaphorical varities\" with the goal of opening \"the gate.\" It was here where he also began enacting the Working of Babalon, a Thelema ritual to summon the goddess Babalon.\nDuring one Thelema gathering, Parsons spoke alone with Hubbard, discussing Crowley, the teachings of Thelema, alchemy and the relationship between magick and his research. Throughout the discussion, Hubbard noticed Parsons fiddling with a ring on his right hand. Parsons then muttered \"The magician longs to see,\" and remarked that he felt there were spirits contained within the mansion's wood. He then excused himself to attend to his guests, abruptly ending the exchange.\nHubbard and Parsons became close friends and during the next two years, they worked together on the Working of Babalon and to open a second gate, to summon the \"Moonchild,\" an entity discussed in the works of Crowley. They performed the ritual in the Roswell, New Mexico desert in 1947, the weekend before an infamous supposed UFO crash in the same area.\nHubbard later cheated Parsons out of his life savings and left for Florida with Betty Northrup. Additionally, Parsons became under suspicion of selling research to a foreign power. He was ultimately acquitted, but was severed from JPL. Parsons attempted to sue Hubbard to recoup his money, but was countered with Hubbard's knowledge of Parsons' relationship with Northrup beginning when she was 17.\nParsons later married Marjorie Cameron.\nOn December 3, 1949, Parsons met with Major Douglas Milford – who was in the guise of a journalist – to \"set the record straight\" about his termination from JPL. However, Parsons instead spoke exclusively of his activities with Hubbard before his wife picked him up for a trip to a flea market.\nHe was called to testify before the House Un-American Activities Committee to whom he gave several names and insisted that he was no longer involved with the Church of Thelema, insisting that he now practiced \"individual freedom.\" Despite significant surveillance by the FBI, Parsons was not indicted by the committee, but his military security clearances were not renewed due to his membership of the American Civil Liberties Union.\nAfterward, Parsons found work as a mechanic, hospital orderly, and finally as a pyrotechnic consultant for war movies.\nIn November 1950 Richard Nixon filed an interview he conducted with Parsons. Parsons disclosed that his religious views were a belief of personal freedom. He stated his belief that \"every person is a divine being, but only through achieving a balance of self-will and love for all living things can one open the door to discover their own divine purpose.\"\nBy June 15, 1952, Parsons and his wife lived in a carriage house down the street from the now-demolished Parsonage, with plans for relocating to Mexico. At the house, he met again with Milford, who was again posing as a journalist. Parsons spoke to Milford about his separation from the Church of Thelema, their meeting was rushed by an order Parsons was working on for a movie studio.\nTwo days later, Parsons was killed in an explosion, which police surmised was accidental, caused by his dropping a can of the highly-volatile fulminate of mercury. He was pronounced dead on arrival at the Pasadena General Hospital.\nSome of Parsons' colleagues were skeptical of law enforcement's conclusions, arguing that Parsons would have not been so careless with such explosives. Some rumors suggested that a bomb had been detonated from the crawl space beneath Parsons' lab.\nFriends attempted to salvage Parsons' reputation by disposing of his hypodermic needles, as well as painting over a wall he had painted black and with a devil's head. Despite this, the media focused almost exclusively on his occult activities.\nIn the years immediately following his death, Parsons was seldom recognized for his work, but eventually gained some prominence, albeit only marginal. In 1972, a crater on the dark side of the moon was named in Parsons' honor.\nBehind the scenes\nJack Parsons (October 2, 1914 – June 17, 1952) was an American rocket engineer and rocket propulsion researcher, chemist, and Thelemite occultist. Because of his contributions to rocket engineering, he is regarded as one of the most important figures in the United States space program."}