{"name": "Jacques_Renault", "url": "https://twinpeaks.fandom.com/wiki/Jacques_Renault", "text": "Jacques Renault\nJacques Renault was the second of the three Renault brothers, between his older brother Jean and younger brother Bernard. He worked as a bartender at the Roadhouse in Twin Peaks as well as a croupier and dealer at One Eyed Jacks, a casino and brothel located across the Canadian border. At the bar, he directed sex buyers to sex workers such as Laura Palmer.\nBiography\nOriginally from Canada, Renault found employment in Washington lumber fields. After significant weight gain, he turned to bartending at the Roadhouse in Twin Peaks.\nCriminal dealings\nIn February 1988, Renault received a call at the Roadhouse from Teresa Banks, who was asking about the appearances of Ronette Pulaski and Laura Palmer's fathers.\nAbout a year later, Bobby Briggs called Jacques at the Roadhouse, looking for cocaine. Jacques told him of an individual that would meet him in two days \"by the sound of sawing wood.\"\n \nLater, he saw Laura Palmer enter the Roadhouse and he sent two adult male clients her way to solicit her for prostitution. Jacques later met the group, which also included Ronette Pulaski at the Power and the Glory in Canada. They talked about Teresa Banks, who had been dead for a year and he invited the girls up to his cabin later in the week.\nLaura Palmer's murder\nJacques, Leo Johnson, and Ronette waited for Laura near a cabin on the night of February 23, where they engaged in sex and consumed cocaine. Jacques tied Laura up, against her will, and proceeded to rape her. Afterwards, he stumbled outside and was knocked out cold. Laura was murdered soon thereafter.\nThe following night, Jacques was working the bar at the Roadhouse.\nDays later, Jacques walked towards the Roadhouse on his way to work, but saw a light on, warning him that his brother, Bernard, was in trouble. He then called Leo and informed him of the situation, requesting him to come pick him up.\nArrest and death\nThree days after this, he began his shift at the blackjack table at One Eyed Jacks, where a man in a tuxedo began talking to him. He dealt cards to the man in the tuxedo, who seemed to have a great deal of luck on his side. The man slid a poker chip to him that was partially broken off, and the man claimed to be a friend of Leo. Jacques accepted his offer to buy him a cocktail.\nThey discussed Leo and the drug operation, including their activities with Laura Palmer the night she was killed. The man told him he had a $10,000 job for Jacques across the border, without Leo. The man then further asked about the night in his cabin with Leo, Laura, and Ronette, also noting that his bird seemed to be \"in love\" with Laura. Jacques described the events of the bird attacking her and how the poker chip was damaged. He then parted from the man.\nHe went to where the man told him and was arrested by the local law enforcement in Twin Peaks, charged with the attempted murder of Ronette Pulaski and for the murder of Laura Palmer. However, he did put up a fight, disarming an officer and attempting to shoot Sheriff Harry S. Truman, but before he could do so, he was shot in the arm by Deputy Andy Brennan.\nHe was questioned in a hospital bed by Sheriff Truman and the man in the tuxedo, who had by then been revealed to as FBI Special Agent Dale Cooper. He was asked about his activities with Ronette and Laura, as well as what he did that night. Jacques admitted to having been hit on the head with a bottle by Leo and that he had used Leo's shirt to stop the bleeding. He then said that he had gotten sick and passed out. \n \nHe later fell asleep in his hospital bed but was then smothered to death with a pillow by Laura's father, Leland Palmer, who later confessed and was released on bail. It is unclear if Leland actually killed him as revenge for Laura's murder or, as Cooper later assumed, to make sure Jacques would not give any testimony which would incriminate him.\nAnother 1989\nOn the night of February 23, Jacques waited for Laura Palmer on a fire road near the intersection of Sparkwood and Highway 21, along with Leo Johnson and Ronette Pulaski. However, Laura never appeared.\nDuring the course of the night, Leo, Jacques, and Ronette ended up visiting an abandoned train car in the nearby woods. Ronette was found the next morning wandering along a rail bridge into Idaho. In the following days, Jacques was questioned in relation to Laura's disappearance, but was never indicted.\nBehind the scenes\nWalter Olkewicz played Renault. The actor appears as Jean-Michel Renault in the 2017 revival. Jean-Michel's relationship to Jacques and his brothers is unclear."}