{"name": "James_Hurley", "url": "https://twinpeaks.fandom.com/wiki/James_Hurley", "text": "James Hurley\n\"James is still cool. He's always been cool.\"\n ―Shelly Briggs\nJames Hurley was the secret boyfriend of murdered homecoming queen Laura Palmer, and later fell for her best friend Donna Hayward in addition to other women who found their ways into his life.\nBiography\nJames was born to Billy and Susan Hurley. James' father abandoned his family and his mother became dependent on alcohol and would leave for indefinite periods of time, leaving James mostly in the care of his uncle, Ed Hurley and Ed's wife Nadine.\nFollowing his grandfather's death, James worked weekends pumping gas at Big Ed's Gas Farm, eventually becoming a mechanic.\nLaura's final days\n \nBy February 5, 1989, James began a relationship with homecoming queen Laura Palmer and he gave her half of a heart necklace on that day. One week later, he went on a picnic with Laura and her best friend, Donna Hayward, and filmed them.\nA few days later, James met with Laura in the morning, then at 2:30, James secretly met Laura and she said that she was \"long gone\" like a \"turkey in the corn.\" James requested her to never leave and they shared a kiss.\nJames showed up outside the Palmer home a few days later and Laura went to him. He asked where she had been the previous night, sure that it was drug-related. He asked when he could see her, but her father showed up and Laura said she had to go. James then left.\nHe called her on the evening of February 23 and he came and picked her up on his bike. They went to the woods and she told him about a murder her boyfriend, Bobby committed and she began to act strangely. She said that he did not know her, and even Donna did not. James began to take Laura home, but she jumped off of his bike. In tears, she told him she loved him and ran off into the woods. He watched her go and sped away. James spent the rest of the night riding around on his bike.\nLaura's murder\nThe next morning, James walked through a hallway at Twin Peaks High School to Donna's locker, asking if she had seen Laura yet and commented that it was a nice day for a picnic. He then went to class when, in the middle of roll call, a deputy showed up and spoke to the teacher. He looked over at Donna, who began to appear worried. The teacher said that there would be an announcement, causing James to break a pencil, fearing that the worst had happened to Laura.\nJames later went to his uncle Ed Hurley's gas station. He commented to him that Laura was \"the one.\" He also left a message for Donna to meet him at the Roadhouse later in the evening and drove away to sit alone, examining his half of the heart necklace.\n \nIn the evening, he met with Donna, who said the authorities were looking for him. He said he would be cooperative, even though he believed they would incarcerate him, as he was with Laura the night before. He described the evening before and said that it somehow made sense that she was killed. He expressed guilt over her death and he kissed Donna. They heard sirens and buried the necklace, for the authorities believed the killer had it. They drove off but were stopped by Sheriff Harry S. Truman and FBI Special Agent Dale Cooper, who was leading the investigation of Laura's murder. James was arrested, despite Donna's insistence that he did nothing wrong.\nAs he was taken to his cell by Deputies Andy Brennan and Hawk, he told Donna that everything would be all right. When he reached his cell, he saw Mike Nelson and Bobby in another, and they began barking at him.\nThe next morning, James was questioned by Cooper and Truman, as he was under suspicion for the murder of Laura. They showed him the tape of Laura and Donna enjoying a picnic, which he confirmed to them that he had filmed. He said that his relationship was kept a secret at Laura's insistence and that he tried to stop her from using cocaine, which she did, but started using again when something scared her. He told them about his activity with Laura the night she died, again feeling guilt over her death. When Cooper showed him Laura's necklace, he asked if James recognized it and if he knew what happened on February 5. James told them that he did not know and did not recognize the necklace.\nJames was released to Ed, saying that he needed the Bookhouse Boys watching his back, to which Ed said he was covered.\nFor dinner, James went to Donna's house and met her father and her mother. When Doctor Hayward asked about James' parents, he said that his father died when he was 10 and his mother was a writer who traveled a lot.\nHe thanked Dr. and Mrs. Hayward for dinner before they went to bed, leaving him and Donna alone. He stated that he did not believe their new relationship was wrong and that it would have happened even if Laura had not died.\nJames went to Ed and Nadine's house the next day to tell them that he would not go to Laura's funeral. Despite this, he later showed up at Laura's funeral. When Bobby accused the whole town of killing Laura, James charged at him, and the two were restrained by the lawmen and Ed.\nJames was later at the Bookhouse when Cooper was introduced to the Bookhouse Boys. He was with Joey Paulson and they had drug mule Bernard Renault restrained.\nJames went to the Double R Diner the next day and called Donna, who said they needed to talk about things she had found out about Laura. He then met a young brunette who resembled Laura - her cousin, Maddy Ferguson.\nThat night, he went with Donna to the woods to find the half of the necklace they buried, as Mrs. Palmer apparently had a vision of someone digging it up. They did not find it.\nHe met with Donna the following morning at the gazebo in the park to tell her the truth about his parents, rather than what he had told her father.\nJames went to the diner with her and introduced her to Maddy. They discussed their investigation into Laura's death and wished for Maddy to find a hiding place that Laura had spoken of. They then left the diner.\nWith Maddy and Donna the next day, James listened to a tape made by Laura, found by Maddy. It was recorded for the psychiatrist, Doctor Lawrence Jacoby, and in it, Laura spoke of the ease of speaking into the recorder and mentioned a coconut in connection to secrets. They noticed that the tape for the night Laura died was missing, and James suggests that could have remained in Jacoby's possession. He then had the idea to go to Jacoby's office and look for it, and says they could lure him out with a \"phone call from Laura.\"\nAt night, he met with Donna and Maddy, the latter wearing a blonde wig, making her look exactly like Laura. James called Jacoby's office and handed the phone to Maddy, who spoke as Laura, luring Jacoby out of his office. He and Donna left Maddy at the park while they went to the office. They watched Jacoby leave and they went inside.\nIn the office, James found Jacoby's collection of paper umbrellas noting important events in his life. Donna found a coconut containing the missing half of Laura's necklace and the tape recorded the night she died. They went back out to his motorcycle and drove off.\nThey went back to Donna's house and listened to the tape, in which Laura declared James to be sweet, but dumb, and mentioned a \"mystery man\" who drove a red corvette. After the tape, he stated that Jacoby did not kill Laura, but Donna asked how he got the necklace.\nHe went to the sheriff's station, wishing to talk to Sheriff Truman, but was taken aside by Agent Cooper. James showed him Laura's tape, pointing suspicion to the man with the red corvette. Cooper told him that Jacoby was in the hospital, having suffered a heart attack after allegedly seeing Laura and he asked if James was involved in this. Truman then entered with cocaine found in the gas tank of James' motorcycle.\nThe next day, he listened to the tape with Sheriff Truman and insisted he was alone when he stole the tape. He told Harry that he did not believe the \"mystery man\" mentioned in the tape were suspects Leo Johnson or Jacques Renault. James also noted a poem about fire that Laura would say along with \"Would you like to play with fire, little boy? Would you like to play with Bob?\" Agent Cooper entered, telling James he knew he had the other half of Laura's necklace and requested it. James complied and gave it to him, saying it was inside a coconut.\nDonna comes to visit him in his cell later, smoking a cigarette. She asked him what he told Cooper and Truman.\nHe was later brought to the hospital, where Nadine was in a coma after overdosing on sleeping pills.\n \nAt the Hayward home the following day, James played guitar and sang a song with Maddy and Donna. As the song finished, he exchanged glances with Maddy, upsetting Donna and she ran out. He chased her and she insisted nothing was wrong before kissing him. When Maddy screamed, he and Donna went to her aid.\nThe following day, James went to the station where Cooper informed him that they knew the cocaine in his gas tank was planted and that he would not be charged with any crime. The agent also warned James to stop trying to solve the case on his own.\nHe went to the diner with Maddy and they discussed Donna's strange behavior. He also stated his wished to sometimes ride away from town on his bike and Maddy placed her hand on his to comfort him just as Donna walked in and misinterprets this. She compared James with a man she met while working the Meals on Wheels route. She then stormed out.\nJames went to the Palmer home and told Maddy he could not find Donna, so he talked to her about his drunken mother returning home. She held him and Donna once again entered and misinterpreted their actions. She stormed out and James angrily followed her out.\nTwo days later, Ed brought Nadine home from the hospital. However, she did not recognize James, her mind having apparently reverted to her teenage self. James suggested they take her to see Doctor Jacoby, but he was in Hawaii, recovering from his heart attack. Nadine - having gone to the kitchen to get something to drink - came back, carrying a cabinet door she ripped off.\nHe sat at the diner later when Maddy came to get a coffee. He asked if she had seen Donna, but she says she had not and the coffee was for her uncle. She hurriedly left and he followed.\nHe burst into the home of Harold Smith later at night to save Donna and Maddy after he heard them scream.\nJames went to the lake the next day and joined Maddy, determining that his attraction to her was just because of Laura. She also expressed that she had some sort of mental connection to her. Maddy also told James that she would be returning home the next day. She kissed him on the cheek and said goodbye.\nJames met with Donna the following day at the Roadhouse and they discussed Harold's suicide, Donna expressing guilt over it. He also told her that Maddy would be leaving, which she had been unaware of. Donna then became emotional during the singer's performance of \"The World Spins.\"\nHe went with Donna to the Palmer home in the morning to say goodbye to Maddy, but Leland said he had just dropped her off at the bus station. They then were amused by the living room being filled with golf balls and they left.\nThe following day, James gave Donna a ring, wishing for them to be together all the time. She approved and they shared a kiss. They saw Deputy Andy, who recited \"J'ai une âme solitaire,\" which, according to Donna, was said by a Mrs. Tremond's grandson and, according to Andy, was Harold Smith's suicide note.\nHe met Donna by the lake, where she told him that Maddy had been murdered by the same person that killed Laura. James insisted they could have helped Maddy, but did not know how. He left, profoundly upset.\nLeaving Twin Peaks\nAfter Leland Palmer was arrested for Laura's murder and died in custody after confessing, James left Twin Peaks on his bike. Near Portland, Oregon, he stopped at a bar called Wallies Hideout and went inside to order a beer. While there, he met a woman named Evelyn Marsh, who asked him to repair her husband's Jaguar, to which he agreed.\nJames took a look at the car, complimenting it. When he asked about her husband, she said that she was not sure where he was, but he was out on business. She offered him room and board while he worked on the car.\nMalcolm Sloan introduces himself to James the next day as Evelyn's brother and Mr. Marsh's car driver. He explained that Jeffrey physically abused Evelyn, which he claimed could not be stopped on Jeffrey's watch.\nJames showed Evelyn his progress on the car, showing that he had improved its condition. He asked her about the abuse. However, she was reluctant to talk about it, and they kissed until her husband arrived.\nJames laid in bed that night, listening to Jeffrey Marsh yell at his wife. Malcolm came into his room, swearing that he would kill Marsh.\nHe called his uncle the next day, asking him to send him all of the money James had in his savings. After he hung up, Evelyn came in, asking him why he left Twin Peaks, specifically the women that caused him to do so. She told him she understood and they kissed.\n \nJames later showed her the repaired car and they shared a glass of champagne along with a romantic encounter.\nIn the morning, James met Jeffrey, who admired his love for cars. Later, Evelyn came to his room, finding his bags packed, though she begged him to not leave. He went to check his bike. In the evening, he continued to pack while Evelyn once again begged him to stay, declaring her love for him. As police approached, she tells him that Jeffrey had died in a car accident. He figured out that this was a setup for him, and she said it was planned by Malcolm, who was not her brother. She told him to go and find the girl that loved him.\nHe left the house and found Donna waiting for him and they ran away from the Marsh home.\nJames and Donna went back to Wallies Hideout, where he told her that he was being framed for Jeffrey's murder and said he must talk to Evelyn, believing she would tell the truth to the police.\nHe returned to the Marsh home, where he confronted Evelyn, questioning her motives. She told him that she was in it for the money, but said that she had true feelings for him. They kissed and Malcolm hit him with a gun. While he was knocked out, Donna came to his aid and Evelyn killed Malcolm.\nJames and Donna had a picnic the following day and he said that he would have to go to trial as a witness. She forgave him for his relationship with Evelyn and asked him to return to Twin Peaks with her, but he refused, feeling it was not right, though he promised her that he would come back.\nAs James predicted, he was summoned as a witness for the prosecution in the case against Evelyn. In the court, his testimony was strongly challenged by a defense attorney, which greatly shook his confidence, and when he afterwards heard \"loose talk\" that he was at risk for being charged with perjury, James panicked and fled town before completing his testimony, causing the Oregon authorities to issue a warrant for his arrest. He soon reached San Francisco, from where he sent a postcard to Donna. In it, he stated that he planned to go to Mexico.\nIn Mexico, he found mechanic work in Baja, working under an alias. He remained there for nearly a year until his skills as a mechanic greatly impressed a capo for the Sinaloa Cartel, who ended up hiring him to maintain his personal fleet of luxury vehicles. Approximately six months later, a rival gang invaded the capo's estate, seeking to execute him. A shootout between the invaders and the capo's personal ensued, with James standing as one of the few survivors, as he had sought refuge in a car's trunk. In the aftermath of the shooting, James was arrested by Mexican federal authorities. \nJames spent a few months in the custody of the Mexican government before word of his peril reached Twin Peaks. With the help of Sheriff Truman and FBI Deputy Director Gordon Cole, James was eventually cleared of wrongdoing and he was subsequently escorted to the American border by the Mexican authorities who instructed him to leave the country and never return. He returned to Oregon, where he served six months in a minimum security prison and was given two years of probation, during which time he was not allowed to leave the state. During this period, Ed rented an apartment in Portland, so he could keep an eye on James and make sure he lived up to the conditions of his probation. As soon as the two years were up, James immediately took to the road again on a newly acquired motorcycle, and he would continue to travel around the US for the next decade. \nLater life\nIn 2006, while in West Virginia, James totaled his motorcycle in an accident involving a runaway coal truck. He suffered a compound fracture in his leg and returned to Twin Peaks, finding employment at his uncle's gas station.\nHe soon found a night job as a security guard at the Great Northern Hotel and began to regularly perform as a musician at the Roadhouse.\nOne evening in 2016, he visited the Roadhouse with co-worker Freddie Sykes one night and looked across the room at Shelly's friend, Renee, apparently not for the first time. James often went there hoping to run into her, despite her being married.\nNights later, James performed \"Just You\" at the Roadhouse.\nOn James' birthday, he and Freddie sat outside the Great Northern. James inquired about the green glove Freddie always wore and he explained that, one night after drinking too much, he had been taken somewhere and \"the Fireman\" had told him to buy that particular glove at a nearby store, as it would give him superhuman strength. He also stated that the Fireman had told him to go to Twin Peaks to find his destiny.\nJames then went inside the hotel's furnace room, and tracked the strange humming that had been plaguing Benjamin Horne's office to a particular door.\nLater, James and Freddie went to the Roadhouse, where James greeted Renee. However, she was with her husband, Chuck, who then attacked James. Freddie came to his aid, punching Chuck with his gloved hand. James urged the crowd to dial 9-1-1, commenting that Chuck and another man Freddie punched were badly hurt.\nJames and Freddie were later locked up at the Twin Peaks Sheriff's Department, where Hawk informed them that the men Freddie punched were in intensive care. After Hawk and Bobby left, James took notice of an eyeless woman in the cell across from him.\nJames was witness to Freddie incapacitating Deputy Chad Broxford and shattering BOB into pieces at the sheriff's station. During the battle, James kept Naido out of harm's way.\nNot long after, James' uncle Ed married true love Norma. James played a song he wrote on his guitar during a civil ceremony conducted by the Big Log near the old train station, with half the town in attendance.\nBehind the scenes\nJames is played by James Marshall. According to Marshall, the character was inspired by American actor James Dean.\nEpisode 4 and episode 10's scripts shared the same scene between James and his mother, Colleen Hurley. She was portrayed by Linda Carlson in the deleted scene. However, The Secret History of Twin Peaks established James' mother as Susan Hurley.\nTrivia\nIn a photo of the 1968 Twin Peaks High School football team seen in Twin Peaks: Access Guide to the Town, a player is identified as Jeff Hurley. It is unknown if he has any relation to James and his family.\nAccording to The Secret History of Twin Peaks, his favorite book is Charlotte's Web by E.B. White.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}