{"name": "Janey-E_Jones", "url": "https://twinpeaks.fandom.com/wiki/Janey-E_Jones", "text": "Janey-E Jones\nJane Jones, nicknamed \"Janey-E\", was the wife of Dougie Jones and mother of Sonny Jim Jones.\nBiography\nDiane Evans' double claimed that Janey-E was her estranged half-sister, whom she hated. Diane had supposedly not spoken to her for several years, but knew of her marriage to Douglas Jones.\nAs the double is not necessarily trustworthy on the matter, Diane and Janey-E's relationship is unconfirmed.\nIn September 2016, Dougie went missing for three days, missing Sonny Jim's birthday party. One night, Janey-E came outside to find him in a confused state; he had just been dropped off by a casino limo driver. Upset, she smacked him and took him inside, but he was mostly unresponsive. She took the bag he was carrying, finding thousands of dollars in casino winnings, and she felt a wave of happiness since it appeared to be enough to pay off their debts.\nThe next morning, she assisted Dougie in getting to the bathroom and getting him dressed. She then made him pancakes and coffee for breakfast. When Dougie took a drink of his coffee, he spat it out and grinned, saying \"Hi!\"\nShe later counted the money that Dougie won, coming to a total of $425,000. Then noting his strange behavior and the absence of his car, Janey-E begrudgingly took Dougie to work.\nDougie was brought home in the evening by police officers. Janey-E took him inside and made him a sandwich, then told him she planned a doctor's appointment for him the next day. After sending Dougie upstairs to say goodnight to Sonny Jim, she opened an unmarked envelope that was delivered to them, which contained a photo of Dougie with Jade. Angry, she called him down and scolded him before receiving a call from the men who Dougie owed money to, planning to meet them the next day.\nJaney-E met with Tommy and Jimmy at the park, where she explained that her family could not afford to pay them back the full $52,000, but paid back Dougie's loan with 25% interest, which she explained to be a generous offer.\nWhen picking up Dougie from work later, detectives revealed to them that Dougie's car had been involved in an explosion. As they left Dougie's place of business, he was attacked by a hitman who he disarmed and subdued with ease.\nJaney-E later waited with Dougie as his boss Bushnell Mullins gave a statement to the police. After he decided to give Dougie the rest of the day off, she suggested she could take him to the doctor.\nShe took him to Dougie's doctor, who found him to be in perfect health, much to Janey-E's surprise, as Dougie was usually overweight.\nAfter going home, she tried to tempt him as he ate cake, and despite him not giving much response, she took him upstairs for sex. She admitted to him the next morning that she could not stop thinking about the previous night.\nAfter Dougie brought Bradley and Rodney Mitchum an insurance payout they were owed, the brothers treated Janey-E to a new car.\nLater, Janey-E brought Dougie a slice of cake and as she left him unattended, he stuck a fork in an electrical outlet, causing a power outage in the home.\nDougie was hospitalized and Janey-E and Sonny Jim sat at his bedside as Mullins arrived, followed by the Mitchum brothers, with food in tow before offering to stock the Jones home.\nAfter Janey-E took Sonny Jim to the bathroom, they returned to find that Dougie was awake and much more alert than he was before. He then drove them to the Silver Mustang Casino, where Dougie told them he had to leave, but would be back. However, he did first accidentally speak of Dougie in the third person and Janey-E came to the realization that he was not her husband. Before he left, Janey-E kissed him and thanked him.\nSoon after, Dougie knocked on the Jones' door and embraced Janey-E and Sonny Jim, who were overjoyed at his return.\nTrivia\nJaney-E shares her full name with actress Jane Jones, who played Margaret Honeycutt in the pilot episode of Twin Peaks and Twin Peaks: Fire Walk with Me. It is unknown if this was intentional."}