{"name": "Jean_Renault", "url": "https://twinpeaks.fandom.com/wiki/Jean_Renault", "text": "Jean Renault\nJean Renault was the eldest and most ruthless of the three Renault brothers, but hid his ruthlessness behind a soft-spoken, charming appearance. He was described as being involved in gambling, extortion, drug dealing and other crimes in the Northwest.\nBiography\nRenault attended the Quebec Reform School.\nIn 1968, Renault bribed Twin Peaks High School football player Hank Jennings to throw a game against Kettle Falls. When asked his reasons, Renault stated, \"Because I can.\"\nAt One Eyed Jacks in early March 1989, he sat on Audrey Horne's bed and woke her up, giving her English caramels.\nHe went to Blackie O'Reilly and Emory Battis, who looked over security footage, finding that there was an undercover FBI agent named Cooper at the casino. Jean wished to have him, for his actions resulted in the deaths of both of his brothers.\nThe next day, Jean went to Benjamin Horne's office at the Great Northern Hotel in Twin Peaks. He showed him a videotape made by Battis of Audrey in captivity. In exchange for Audrey, he wished to be Horne's business partner and wanted Agent Cooper.\nLater, back at the brothel, Audrey was brought to him, saying that Emory hit her. He told him to never let this happen again, then informed Audrey that he spoke to her father and that she was not in danger. As Emory tried to explain the situation further to Audrey, Jean shot and killed him. He then held Audrey, who began to cry.\nRenault called Benjamin Horne the next day and gave the instructions for Agent Cooper to follow.\nHe sat with Blackie, plotting to kill Agent Cooper with a blade hidden on his wrist and their taking over the brothel along with making Audrey overdose on heroin. Jean's lover, Nancy O'Reilly—Blackie's sister—then came in as Blackie left. The two then plotted to kill Blackie.\nHe and Blackie later discussed the plan to kill Audrey. When Blackie tried to leave, he pulled her in for a kiss and stabbed her. He saw a man in the window and drew a gun, shooting at him, then escaped. Outside, he found Hank Jennings with the identification of Washington state prosecutor Daryl Lodwick.\nDays later, Renault to the office at the brothel, where he met with the man he earlier restrained with the identification of Lodwick, now known to be Hank Jennings. Hank had brought him Ernie Niles for his computer expertise that could be used for a financial operation. Preston King entered with a drug supply to frame Agent Cooper and Hank took Ernie to the casino. King expressed his doubts in Niles, finding him to be too nervous.\nDuring a drug buy at Dead Dog Farm with Ernie and a buyer from Seattle, smoke began to bellow from Ernie's shirt, revealing a microphone. Renault and King held the men at gunpoint and begin negotiating with Agent Cooper, who was on the perimeter of the farmhouse. Cooper gave himself up in exchange for Ernie and the other man, Agent Bryson.\nLawmen surrounded the farmhouse where they hold Cooper, who suggested they surrender. Jean revealed to the FBI man that he held him responsible for the deaths of his brothers, as he saw both to be caused by the special agent's involvement in the town. A woman dressed as a waitress approached the house and she was allowed entry. She sneakily passed a gun to Cooper, who used it to shoot Renault dead.\nGallery\nJean Renault's mugshot."}