{"name": "Jerry_Horne", "url": "https://twinpeaks.fandom.com/wiki/Jerry_Horne", "text": "Jerry Horne\nJeremy \"Jerry\" Horne was the playboy brother of Benjamin Horne and the uncle of Audrey and Johnny. \nBiography\n\nEarly life\n \nAt some point in his childhood, Jerry was present with his family at the groundbreaking for the Great Northern Hotel and, with his brother, watched Louise Dombrowski dance in their room with a flashlight.\nJerry was the place kicker (punter, return specialist) in the starting lineup of Twin Peaks High School football team of 1968 alongside Frank Truman, Harry S. Truman, Big Ed, Tommy \"Hawk\" Hill, Hank Jennings, and Thad \"Toad\" Barker. Since all of the players in the lineup were Bookhouse Boys, he was perhaps a member.\nHe graduated last in his class at Gonzaga University in 1974 and managed to pass the bar on his third attempt, followed by having his license to practice law revoked in Illinois, Florida, Alaska, and Massachusetts.\nGhostwood Development Project\nBy 1989, Jerry began working alongside his brother, traveling around the world to find potential business partners for the Ghostwood Development Project. Also by this time, Ben became the owner of the Canadian brothel and casino, One Eyed Jacks. On February 26, 1989, Jerry came to the Great Northern Hotel after a trip to Paris. He interrupted the Horne family's dinner and brought a sandwich for Ben, who loved it. He left the dining room with his brother, who told him about the murder of Laura Palmer and that the Norwegians who were set to sign the Ghostwood deal had left. Ben also said that there was a new girl at One Eyed Jacks and that one of the brothers was \"first in line.\"\nThey took a boat to One Eyed Jacks and he ordered drinks for him and his brother. The brothel's madame, Blackie O'Reilly, brought out the girls, including the one Ben spoke of. Jerry lost a coin toss for her and Blackie had a drink with him.\n \nJerry arrived at the Great Northern a few days later with potential business partners from Iceland and went to Ben's office. Ben said that the businessmen had received complaints from nearly every guest in the hotel. Jerry told his brother about an Icelandic woman named Heba that he had fallen in love with and gave him a leg of lamb. Ben suggested a plan to have the visitors sign the deal, potentially convincing them with a trip to One Eyed Jacks. Leland Palmer then came, wishing to occupy his mind with work. When he broke down crying, Jerry closed the office doors.\nHe later wooed Heba at a party held for the businessmen at the Great Northern. Subsequently, he made an announcement to the attendees but was interrupted by music playing, which in turn caused Leland to have a breakdown. Confused, Jerry went to his brother, who said, \"get Doctor Jacoby, a net, and get out of my life.\"\nThe next day, Jerry sang with a group of Icelanders and Ben, each with a mug of beer, except for Ben, who had ice cream. Jerry was asked to dismiss them to the dining room so Ben could ask when the businessmen would be signing the contracts, to which Jerry said they are ready and wished to finalize the deal at One Eyed Jacks. He then went to round them up for the trip there.\nTwo days later, he asked Blackie where Ben was, and she asked why Ben was holding out on her. This angered Jerry and he then calmly shined a light on her face, commenting that she used to be pretty. Jerry then left her some heroin and went to the room where Ben was, saying that there was a situation that needed his attention.\nBack at Ben's office, they discussed plans on finding Catherine Martell's whereabouts and getting a report on Leo Johnson's medical condition. They are interrupted by a cheerful Leland Palmer, whose hair had turned completely white. He and Ben danced along with the song Leland sang and Leland then announced that he was \"back and ready.\"\nHe walked through the hotel with his brother, discussing a dessert. They noted Audrey's absence and went to Ben's office, where Hank Jennings waited. Hank explains Josie Packard leaving the night before, along with Leo being in a coma. Jerry took issue with Leo apparently chopping wood inside the house. Hank also noted the probability that Catherine was dead in the wreckage of the mill.\nJerry sat with his brother the next day in front of the two ledgers for the Packard Sawmill. They went over the rest of the plan to obtain the mill's land.\nHe later went to Ben's office with an insurance policy for the mill, unsigned by Catherine. Ben had him call the Icelanders as Leland entered, suggesting they call but found that they were already doing so. Jerry handed the phone to Ben, who spoke to Einar Thorson, who said that Leland called him about the fire, believing this had some effect on the development plans. Leland soon spotted a police sketch that he claimed to recognize and rushed out to inform the authorities. Ben then said to Jerry, \"Please kill Leland.\"\nNearly a week later, he went to the sheriff's station, where his brother was in custody for the murder of Laura Palmer. He said he would act as his lawyer, as Leland was responsible for the murder of Jacques Renault. When Jerry asked about his activities the night Laura was killed, Ben said he was with Catherine. They then reminisced about when they were boys, watching Louise Dombrowski dancing in their room with a flashlight.\nWhen Ben was questioned by FBI Special Agent Dale Cooper and Sheriff Harry S. Truman, Jerry claimed that the treatment of his brother was completely violating his rights. Agent Cooper then revealed that he knew Jerry's spotty background in law. Ben was angered after being presented with Laura's diary, which made suspicious statements about him. Jerry asked to be left alone with Ben for a moment, which was granted by the Sheriff and FBI Agent. He reprimanded Ben for this outburst of anger and stated that he needed a better lawyer, as there was much evidence pointing his way.\nA one-armed man was brought before Benjamin, rambling on about someone named \"BOB.\" Jerry commanded Truman to either charge Ben or release him, as he had been held for twenty-four hours. Harry charged Ben with Laura's murder and Ben tried to attack the sheriff, but Jerry restrained him.\nBen was released the following day after Leland Palmer was found guilty and died in custody. He also lost the Ghostwood Development Plan to Catherine Martell.\nBen's Civil War\nA few days later, Audrey brought Jerry to Ben's office, the latter believing himself to be Robert E. Lee while re-enacting a miniature Civil War. When Jerry got Ben's attention, Ben believed him to be Jeb Stuart.\nJacoby stated the next day that his experiment in letting Ben interact with the public did not help his mental state, as he continued to believe himself to be General Lee, though Jerry admitted that Ben was fun in this state. He told Audrey that they could develop some projects in Ben's stead, though she stated she would take over.\nHe later acted as Wilmer McLean in Ben's Civil War. Jacoby soon arrived as General Grant and surrendered, despite the historical inaccuracy. Ben collapsed and came to, believing his Civil War to have been a dream.\nStop Ghostwood\nJerry attended a board meeting the next day with John Justice Wheeler, a potential business partner. Ben presented his plan to preserve the near-extinct Pine Weasel, which called to work against the Ghostwood Development Plan.\nTwenty-five years later\nTwenty-five years later, Jerry had traded the business of hotels for that of cannabis, but still remained somewhat close to his brother, who he loudly interrupted while meeting with a new hire, Beverly Paige. Jerry crudely asked if Ben had slept with her yet, and Ben reprimanded him, demanding respect for the woman. The brothers chatted briefly until Ben asked if Jerry was wearing their mother's hat.\n \nJerry had also become of a viewer of Doctor Jacoby's webcast that he hosted as \"Dr. Amp,\" which Jerry would view while smoking cannabis.\nWhile high, Jerry later became lost in the woods and spoke on the phone with his brother. Still high, he later noticed his foot, which he hallucinated as telling him that it was not his foot. He tried grabbing it, causing himself to fall down. He remained in the woods for some time, struggling to acquire phone service, and eventually reached a clearing.\nJerry soon saw his great-nephew Richard and Cooper's doppelganger investigating a rock and watched through one side of a pair of binoculars, turned backwards. After Richard received an electric shock and disintegrated, Jerry frustratingly blamed his binoculars.\nHe later discarded his clothing and reached Jackson Hole, Wyoming, where he was taken into custody by the police, who called Ben to have him picked up.\nBehind the scenes\nJerry was played by actor David Patrick Kelly, who reprised the role in the 2017 revival."}