{"name": "Johnny_Horne", "url": "https://twinpeaks.fandom.com/wiki/Johnny_Horne", "text": "Johnny Horne\nJohnny Horne was Benjamin Horne's mentally disabled son. He was tutored by homecoming queen Laura Palmer prior to her murder.\nBiography\n\n1980s\nOn Thanksgiving morning, Audrey, as a toddler, pushed a nine-year-old Johnny down the stairs.\nJohnny began to be tutored by Laura Palmer in December 1986 and his favorite story for her to read was Peter Pan.\nOn February 24, 1989, while wearing a headdress, Johnny constantly hit his head against a dollhouse, upset that Laura was not present, for she had been murdered the night before.\nTwo days later, Johnny sat at the dinner table with his family, wearing a headdress, as usual. His humming was the only sound other than silverware and plates until his uncle Jerry arrived.\nThe next day, he was coaxed into removing his headdress for Laura's funeral by Doctor Lawrence Jacoby.\nAt the funeral, where he brought with him an antique copy of Peter Pan, after the prayer, Johnny loudly said \"Amen!\"\nSylvia later revealed to Audrey why she believed her to be responsible for Johnny's disability in a bitter speech that obviously upset Audrey greatly. However, Dr. Jacoby insisted that Johnny's condition was self-induced: a retreat to childhood as a result of an unknown emotional trauma.\nWeeks later, Johnny laughed at his father's musings about Stonewall Jackson, believing himself to be Robert E. Lee.\nA few days later, he let out a war cry and fired a suction-cup arrow at a buffalo target.\n2010s\nOn a day twenty-five years later, Johnny was running around his home unsupervised, slamming doors behind him, as his mother Sylvia yelled \"Mary, what are you doing?\" Johnny ran head first into a wall and broke several framed pictures, including one of the falls by the Great Northern Hotel. A flash of electricity occurred during the collision, possibly from a crashing lamp. He lay on the ground, unconscious and bleeding profusely, until Sylvia found him.\nAfter the incident, Johnny was outfitted with a protective helmet and mouthpiece and restrained to a kitchen chair, while a disfigured teddy bear repeatedly issued the greeting \"Hello Johnny, how are you today?\" One morning, Johnny helplessly watched, screaming, as Richard attacked and robbed Sylvia at their home. He fell over in his chair while attempting to free himself.\nBehind the scenes\nJohnny was played by Robert Davenport in the Pilot and by Robert Bauer through the rest of the series. Erik Rondell appeared as Johnny in the 2017 series of Twin Peaks.\nHis scenes from Episode 25 are recycled footage from \"27 Going on 6,\" a scene deleted from Episode 1."}