{"name": "John_Justice_Wheeler", "url": "https://twinpeaks.fandom.com/wiki/John_Justice_Wheeler", "text": "John Justice Wheeler\nJohn Justice \"Jack\" Wheeler was a friend of Benjamin Horne and later fell in love with his daughter Audrey Horne.\nBiography\nWhen Jack was younger, businessman Benjamin Horne made an investment in him and invited him years later in 1989 to join him in business.\nUpon arrival in Twin Peaks, Jack approached the concierge desk at the Great Northern Hotel, where the young woman there first was cold to him, but after looking at him was more willing to be attentive. He then noted that she was Ben's daughter, Audrey and requested her to send someone to the airport to retrieve his luggage that he did not have room for on the van he took to the hotel. He then told her about a picture he had of her when she was ten.\nLater, he went to a board meeting with Horne, where he met Bob Briggs and was reacquainted with Benjamin's brother Jerry. Audrey was also present. Ben explained how he helped Jack to start his business and asked for his help with Horne Industries Incorporated. Ben presented a plan to work against Catherine Martell's Ghostwood Development Project by attempting to preserve the near-extinct Pine Weasel.\nHe had dinner that evening with Ben and Audrey. After Ben excused himself, Jack said that he had come to help the Horne business as a favor to Ben, an old friend. When she excused herself for an appointment, he watched her as she left.\nHe apologized to Audrey the next day about any negative behavior the previous evening and she did the same before he asked her out to a picnic, to which she agreed. At their picnic, Jack sang to Audrey, which she was appreciative of. He senses that there is another man in her life, but she insists that this is no longer the case.\nDuring the Stop Ghostwood campaign's presentation, the endangered weasel bit Dick Tremayne's nose and became loose, causing a panic in the crowd. When Audrey was knocked over, Jack came to her aid and caught her. They then shared a kiss.\nIn the morning, Audrey came to his room with food he ordered through room service. He offered to take her for a flight and dinner, which she accepted.\nLater, he went to Ben's office and found out that Audrey would be leaving for Seattle in an hour, canceling their plans. She then left. Ben asked Jack his secret to \"being good,\" to which he advised to always tell the truth. He then told Ben that he was falling in love with Audrey, and Ben seemed to approve.\nAt the hotel, he sat down by the fire with a drink and discussed love with a man, in particular, their respective situations in their love lives. Bellman Jeff Moore then brought a telegram to him, informing him that his close friend and business partner in Brazil had been murdered. He prepared to check out of the hotel.\nHe went to the front desk in the morning to ask if Audrey had returned, but she had not, and also had not left any messages. He had someone sent to retrieve his bags and he went to Horne's office and informed him that he would leave due to his partner's death. Jack looked for Audrey one more time before he left the hotel.\nBen later expressed his discouragement, feeling as though he could not continue his business without Jack, but Jack wished him well and left a message for Audrey as he went.\nHe began to leave in his jet when Audrey stopped him. Jack got out and kissed her. They expressed their love for each other and Audrey told him she was a virgin, so they boarded his jet together.\nLater in the evening, Jack left Twin Peaks by himself.\nBehind the scenes\nWheeler is played by American actor Billy Zane. The character was originally introduced to replace Agent Cooper as Audrey Horne's love interest, due to Kyle MacLachlan's opposition to the idea of Cooper becoming romantically involved with a high school student."}