{"name": "Josie_Packard", "url": "https://twinpeaks.fandom.com/wiki/Josie_Packard", "text": "Josie Packard\nJocelyn \"Josie\" Packard (born Li Chun Fung) was the owner of the Packard Sawmill following the apparent death of her husband, Andrew Packard.\nBiography\n\nEarly life\nJosie was born Li Chun Fung in Guangzhou Province to a high-ranking Red Pole enforcer in the Siu-wong triad and a beautiful prostitute known as \"Lace Butterfly,\" who died shortly thereafter from a heroin overdose. Her father became Deputy Mountain Master of the largest triad in the region.\nShe attended a private boarding school in Shanghai, where she organized her own drug trade and prostitution ring, then graduated with honors.\nShe founded her own fashion label, which was used as a front for her drug trade, and was suspected in several \"accidental\" overdoses. She was initiated into her father's triad and became fluent in six languages, also maintaining several aliases. She also became an associate of Thomas Eckhardt, who became obsessed with her.\nHer father was killed in a gang war in 1980, and she was suspected of masterminding it, turning the triad against her. She went into hiding until she met Packard Sawmill owner Andrew Packard in 1983 at a black-tie mixer in Hong Kong. He took her to his hometown of Twin Peaks, Washington in the United States, where she accepted his marriage proposal. She moved into the Blue Pine Lodge with Packard and his sister Catherine and her husband Pete Martell.\nLife in Twin Peaks\nPackard named his 1936 Chris-Craft Sportsman after Josie. On September 27, 1987, under orders from Thomas Eckhardt, Josie hired Hank Jennings to rig the boat to explode, then commit vehicular manslaughter on a vagrant to avoid investigation into her husband's death. Following this, she inherited the sawmill.\nIn 1988, Josie began taking English lessons from teenager Laura Palmer.\nIn January 1989, she began seeing Twin Peaks' Sheriff, Harry S. Truman. She would regularly report seeing a prowler in order to have him come visit her.\nOn a day a few weeks later, Dell Mibbler was confused about the dimensions of two-by-fours, with Josie unable to give an explanation, Pete explained why they were not exactly two inches by four inches, justifying it by pointing out that the dollar was not worth what it used to be.\nDuring a tutoring session with Laura on February 23, Laura told her \"I think now I understand how you feel about your husband's death.\"\n \nThe next morning, Josie was looking into a mirror, applying makeup while humming. She looked over when she heard Pete leave to go fishing. When he discovered a body wrapped in plastic, she and Catherine looked on as it was revealed to be Laura Palmer.\nTroubles with the Mill\nLater, Josie got into an argument with Catherine, who wanted to keep the mill running through the rest of the day while Josie wanted it shut down, due to the disappearance of worker Janek Pulaski's daughter, Ronette and the murder of Laura Palmer. She got her way when Pete ordered the workers to pull the plug. Josie announced to the workers her reasons for the mill closing for the day.\nShe later attended a conference where Special Agent Dale Cooper announced the FBI's takeover of the Laura Palmer case, due to its similarities to a murder that occurred the previous year.\nIn the evening, she was visited by Sheriff Truman, and they looked on at where Laura's body had been found earlier that day, Truman noting that the murder must have happened twenty-four hours before.\nShe greeted Pete the next morning with, \"on top of the morning to you, Pete,\" which he corrected. She also thanked him for standing up for her during the argument with Catherine. Sheriff Truman arrived with Agent Cooper to question her about Laura, who had been tutoring her in English. She said the last time she saw Laura was Thursday at 5:00pm and she left an hour later. She also noted that Laura had said, \"I think now I understand how you feel about your husband's death.\" She then received a phone call from Catherine, who told her that her \"shenanigans\" the previous day cost the mill $87,000. She went back to Cooper, who defined \"shenanigans\" for her.\nThe next day, Josie was given the key to the safe containing the mill's ledger by Pete. She opened the safe hidden behind a fake bookshelf and found two ledgers.\nShe attended Laura's funeral the next day, and later in the evening, she sat with Harry, who questioned her about what was bothering her. She said that Benjamin Horne and Catherine wanted to hurt her and also supposed to him that Andrew's death was not an accident. She showed him the safe, where there was then only one ledger. She told him her fear that she may have been a target if Andrew was killed for the mill. Harry swore to protect her, and they kissed.\nIn the morning, Josie took pictures of Catherine with Benjamin Horne at the Timber Falls Motel.\nIn the evening, she received a call from Harry. When he asked about her activities at the motel, she said she had to go and hung up. She gave Pete a turkey sandwich and he asked if she was interested in joining him for a fishing competition.\nPete went to bed and Josie opened an envelope containing a drawing of a domino. She then received a phone call from Hank, who asked if she received his message. She hung up, clearly shaken.\nThe next day, Josie smoked a cigarette inside Benjamin Horne's office. Horne later entered and she showed him the ledger she found hidden in his desk and they arranged to proceed with their business the following night.\nHarry came to see her the following day and asked why she was at the motel earlier in the week. At first, she was reluctant to tell him, but revealed her activities to him and that she heard Catherine talking on the phone about a fire at the mill.\nShe received a call from Ben, and they agreed to have Catherine at the mill. She hung up with Hank standing next to her.\nJosie gave Hank a suitcase of $90,000. He then noted the value of it and how she was responsible for the death of her husband, and that it was not merely a boating accident. Hank said he wanted more money, though Josie said they had an agreement. He then cut their thumbs and pressed them together as a symbol of them being in business together for life.\nThe following evening, she went to the Great Northern Hotel and shot Agent Cooper in the abdomen three times. She then left town, leaving a note for Pete saying that she had emergency business in Seattle.\nAfter being absent for several days, she returned to the Blue Pine Lodge with many boxes. Pete informed her that Catherine had died when the mill was burned down.\nAftermath\nShe met with Harry, who asked about her activities while she was absent and was upset that she did not tell him about leaving. He also noted his suspicion of her leaving around the time Catherine died and left behind insurance money. They kissed and made love on the couch.\nShe later introduced Jonathan Kumagai to Pete as her cousin. When Pete went to get him coffee, they discussed the sale of the mill's land and that they were expected in Hong Kong in two days, per Thomas Eckhardt's wishes.\nA couple of days later, Jonathan told Josie to pack for Hong Kong, but she told him she had not received insurance money or a payment from Ben Horne yet. He threatened to kill Harry if she did not go to Hong Kong.\nShe went to Horne's office for her money, which he said would be paid at a later time, but she refused to leave without it. He threatened her with blackmail and she did the same, putting them at a stalemate. He handed her a $5,000,000 check from Tokyo Bank and she left.\nAs Jonathan took her bags out of the Blue Pine Lodge, Harry came and she introduced Jonathan as \"Mr. Lee.\" She told him that she was returning home, for her time in Twin Peaks was over since she sold the mill. She started to go and he declared his love for her. She stopped but then kept going.\nAfter their arrival in Seattle, Josie shot Jonathan three times in the back of the head, then returned to Twin Peaks, where she went to Harry's house and fell into his arms.\nThe next morning, Josie lay in bed when Harry entered, pulling the shades open and giving her a glass of water. He kissed her and joined her, holding her close. He asked her to tell him the truth and she explained that she previously worked for Thomas Eckhardt in Hong Kong, who took her off the streets when she was 16. She explained that \"Mr. Lee\" worked for Eckhardt and said that he would kill her if she did not return to Hong Kong with him. She told Harry that she believed Eckhardt was responsible for her husband's death.\nShe went to Catherine, who survived the mill fire, and asked her about Andrew, telling her that Eckhardt killed him, which did not surprise Catherine. She told Josie that she would then work as her maid as a result of her part in Andrew's death. Catherine took advantage of this the next day, calling Josie to bring her and Pete appetizers and promised her all of the respect she deserved. When Harry came to see her the following day, he wished to help her out of her situation as Catherine's maid.\nCooper and Harry met with her the next day to discuss Jonathan, who was found dead, and the Seattle police believed she had something to do with it. She got a phone call from Eckhardt, wishing to meet with her. However, Catherine hopped onto the line, welcoming him to Twin Peaks.\nShe later answered the door to find Eckhardt on the other side for a meeting with Catherine. She overheard them speaking about where she would end up: most certainly in the hands of Eckhardt.\nJosie brought firewood into the Blue Pine Lodge the next morning and fainted when she saw Andrew, alive and well.\nCooper came to speak to her about her activities in Seattle, Josie insisting that she ran from Jonathan at the airport and had nothing to do with his murder. He told her to be at the station that evening, or else he must arrest her. After Cooper left, Catherine came in and told her that Eckhardt wished to meet with her later in the evening. Josie feared for her life and Catherine revealed a gun to her, which Josie took.\nLater, she was visited by Andrew, who brought her a drink. She apologized, though he said that he had long since forgiven her, pinning all of the blame for his \"death\" on Eckhardt. He implored Josie to meet with Eckhardt.\n \nShe met with Eckhardt and after a fight, she shot him. He fell dead as Agent Cooper arrived. Josie and the agent aimed their guns at each other, and she all but confessed to his attempted murder and the murder of Jonathan. Harry then came in with his gun drawn, commanding her to drop hers. She asked for his forgiveness and clutched her pistol to her chest, then died. Josie then screamed from an end table's wood knob that she was apparently trapped in.\nHer autopsy by Doctor Will Hayward found that she weighed only 65 pounds. Days later, Ben Horne and Pete both saw Josie in wooden objects at the Great Northern.\nAnother 1989\nOn the morning of February 24, Josie hummed in front of her mirror while applying makeup, and listened as Pete departed for a fishing trip.\nTrivia\nShe is between 5'6 and 5'10 tall.\nNon-canon appearance\n\nEpisode 29 deleted scenes\n \nAn unscripted scene which was shot and never used depicted Josie's body in the curtains when Cooper enters and experiences the \"Rooms\" of the Black Lodge. Frank Silva, unaware it had been cut, related the scene in an interview at the first fan Twin Peaks Fest, with further investigation prompted by the crowd's confused reactions.\nRichard Beymer took photographic evidence of Joan Chen's stunt double with multiple shots of her body and head in and out of each side of the curtain.\nBehind the scenes\nJosie was portrayed by Chinese-American actress Joan Chen.\nJosie was originally conceived as an Italian woman named Giovanna Pasqualini Packard. David Lynch's domestic partner at the time, Isabella Rossellini, was to have played her. Rossellini previously appeared in Lynch's Blue Velvet as Dorothy Vallens.\nIn scenes deleted from \"Episode 29\", it is indicated that when BOB killed Josie, possibly out of fear, he took her head along with her soul. This may account for how Josie's body had been only 65 pounds at the time of the autopsy and why her face is dormant in the wood of the Great Northern, as in the drawer knob just after her death and as Pete saw her face on the fireplace.\nChen asked to be written off the show to film Turtle Beach. She has since regretted her decision to leave, and calls the film \"a disaster of a film\" since it was a critical and commercial failure.\nThe Secret History of Twin Peaks states that Josie's autopsy was performed on March 11, 1989. However, when going by how many days pass in the show by the time of her death, Josie would have died around March 20, 1989. \nIn early drafts of Twin Peaks: Fire Walk with Me script, it was mentioned by Jeffries that Judy had a sister, and writer Robert Engels confirmed that this sister could have been Josie. An open letter written by Joan Chen (in character as Josie) to Lynch in 2017, indicated that she too, was aware that Judy was at some point written to be Josie's twin sister.\nLynch had conversations with Chen about potentially reprising her role in The Return, but he didn't ask her back because he couldn't come up with a way for Josie to be a part of the storyline that would make sense, though Chen would have been happy to return.\nJosie's Chinese maiden name Li (李, literally \"plum\"), or Lee, is a common surname in China, while Chun-fung (春鳳, often translated as \"spring-phoenix\") is a common female name. The translation provided in The Secret History of Twin Peaks, \"Upright Autumn Bird,\" is somewhat inaccurate, as it is derived from \"Li-chun\" (立春), a tonally different word that is not normally used as a given name. In addition, \"Li-chun\" (立春) actually means \"upright spring,\" whereas \"upright autumn\" would be \"Li-qiu\" (立秋)."}