{"name": "Judy", "url": "https://twinpeaks.fandom.com/wiki/Judy", "text": "Judy\nFor the social worker, see Judy Swain.\n\"Well now. I'm not gonna talk about Judy; in fact, we're not gonna talk about Judy at all, we're gonna keep her out of it!\"\n ―Phillip Jeffries\nJudy, originally known as Jowday or Joudy, was a mythological entity and powerful negative force studied by the Blue Rose Task Force.\nHistory\n\nOrigins\nIn stories from ancient Sumerian mythology dating to at least 3000 BC, Joudy was the female form of the utukku, an escaped, wandering demon that feasted on human suffering. It was said that if the female and male form (known as Ba'al) ever married while on Earth, the union would produce an even more malevolent being, hastening the end of the world.\nOver time, the being Joudy came to be known as \"Judy.\"\n1980s\nIn 1986, the Blue Rose Task Force leader Phillip Jeffries took an extended posting in Buenos Aires to investigate an apparent international criminal enterprise. In his first month, he identified \"Judy\" as a central person of interest in this investigation, and notified Gordon Cole. Subsequently, Jeffries was not heard from for nearly two years.\nOn February 16, 1989, Jeffries inquired after \"Miss Judy\" at the Palm Deluxe hotel in Buenos Aires. The desk clerk gave him a letter that \"the young woman\" had left for him. The very same day, Jeffries materialized for a few minutes at the FBI office in Philadelphia. During this visit, he initially stated to Cole that he did not want to talk about Judy, but later emphasized that she was \"positive about this,\" and that he had found something \"in Seattle, at Judy's.\"\nA search of Jeffries' hotel room at the Palm Deluxe revealed that the word \"JOUDY\" had been carved into the wall behind the telephone. The name was hidden beneath wallpaper when the room was remodeled in 1997.\nA monkey spoke Judy's name.\nMajor Garland Briggs shared his discovery of Judy with FBI agents Gordon Cole and Dale Cooper, and the three devised an elaborate plan to track it down. Cooper indicated to Cole that, if he disappeared in the course of this plan, they were to do everything possible to find him, as he was attempting to \"kill two birds with one stone.\" Briggs and Cooper both disappeared in early 1989, leaving Cole uncertain as to how, or if, the plan was unfolding.\nExactly when this plan came into being is not stated. Since Cooper does not appear to have met Major Briggs prior to \"Episode 8,\" it may have occurred offscreen between \"Episode 8\" and \"Episode 29.\"\n2010s\nIn October 2016, Dale Cooper's doppelganger found Jeffries at his hiding place at the Dutchman's Lodge, and asked to know who Judy was and whether they wanted something from Cooper. Jeffries replied that he had already met Judy, and manifested a series of coordinate numbers which Cooper wrote down.\nDays later, the original Cooper visited Jeffries, who showed him where he could find Judy. The symbol found in Owl Cave floated out of Jeffries' spout and transformed into an \"8\" symbol, with a bead modulating around its lower half. Finally, it stopped, and Jeffries exclaimed that he had found it. In a burst of electricity, Cooper was transported to the woods outside Twin Peaks on the night of February 23, 1989, where he attempted to lead Laura Palmer to a portal on Blue Pine Mountain.\nAfter crossing with Diane Evans, Cooper traveled to Odessa, Texas, and came across Eat at Judy's, a coffee shop. Cooper later met one the waitresses at Judy's, Carrie Page, who he believed was actually Laura Palmer.\nBehind the scenes\nIn early drafts of Twin Peaks: Fire Walk with Me script, it was mentioned by Jeffries that Judy had a sister, and writer Robert Engels confirmed that this sister could have been Josie Packard. An open letter written by Joan Chen (in character as Josie) to David Lynch in 2017, indicated that she too, was aware that Judy was at some point written to be Josie's twin sister.\nShowtime's closed-captioning for Fire Walk with Me erroneously states that the monkey saying Judy's name is speaking with Jeffries' voice.\nIn Twin Peaks (2017), Judy's actual nature is revealed. The closed captioning for \"Part 17\" gives the ancient spelling as \"Jowday,\" which was confirmed by producer Sabrina Sutherland and co-author Mark Frost who stated it to be more correct than Joudy.\nEtymology\nThere have been some online attempts to find a Chinese source for the name, frequently tied to the word 叫 (jiào), which sounds similar to an emphatic \"jow\" and means \"to name, to call\" or \"named, called\". However, most of these attempts—like 叫得 (jiàode)—have the wrong pronunciation (\"jow.duh\") and are ungrammatical, without any actual meaning in Chinese."}