{"name": "Kenneth_Arnold", "url": "https://twinpeaks.fandom.com/wiki/Kenneth_Arnold", "text": "Kenneth Arnold\nKenneth Arnold was a businessman and pilot who claimed a UFO sighting in 1947.\nBiography\nOn June 24, 1947, Arnold set out in search of a United States Marine transport that had been lost in late 1946. He claimed that, during his flight near Mt. Rainier, Washington, he spotted nine \"saucer-like\" aircraft. Upon landing in Yakima, Arnold questioned locals about the aircraft, but turned up nothing.\nThe following morning in Pendleton, Oregon, Arnold learned from an unidentified man from Ukiah that he had also seen the flying objects.\nArnold's UFO sighting soon made headlines around the world, gaining him unwanted fame to the point where his business suffered and curious people would crowd him in public. This ultimately caused him to regret making his report, remarking, \"If I saw a ten-story building flying through the air I would never say a word about it.\"\nFollowing the incident, he was interviewed on three occasions by military personnel and by CBS newsman Edward R. Murrow, during which he stated his belief that if the aircraft were not manufactured by the Army Air Forces, that they must be of extraterrestrial origin.\nOn July 30, after receiving a call from Ray Palmer, offering him $200 to write an article about a UFO sighting in Tacoma, Arnold flew to Tacoma and checked into the Winthrop Hotel, where a reservation for Room 502 was waiting for him.\nThat evening, he met with Fred Crisman and Harold Dahl, who provided metallic fragments that had been dropped by the UFOs. They decided to share the story with Arnold's friend, United Airlines pilot Emil J. Smith, who also claimed to have seen strange aircraft. He additionally contacted Military Intelligence officer Douglas Milford and FBI agent Frederic Nathan, who had previously questioned him.\nThe next day, Arnold flew to Seattle to retrieve Smith and return to Tacoma, where they met with Crisman and Military Intelligence investigators Captain Davidson and Lieutenant Brown.\nAt 12:30 AM, Arnold received a phone call from reporter Paul Lantz from the Tacoma Times, warning Arnold about the meeting taking place at the hotel, described in great detail by an anonymous source. Davidson and Brown suggested they take some fragments in order to launch a full investigation, to which Arnold complied.\nThe next morning, a distraught Crisman informed Arnold that the B-25 containing Davidson and Brown had caught fire and crashed shortly after take-off. Crisman later told Arnold that Lantz had contacted him, saying that an anonymous source claimed that the B-25 had been sabotaged or shot down, and that the Marine transport Arnold had been searching for suffered the same fate.\nLantz joined the group at the hotel and gave detail about the anonymous informant, the investigation into the B-25 crash, and Dahl's absence from the meeting. A stringer for the United Press, Ted Morello, called the group to confirm details about their meeting in regards to Davidson and Brown, and said that an anonymous source told him to tell Arnold and Smith that the \"same thing could happen to them,\" causing Crisman to flee the hotel.\nAbout an hour later, a note was delivered to the hotel room, informing Arnold and Smith that the hotel services were suspended due to the formation of a strike. Fearful of surveillance, they locked the room's doors, turned on the faucets, and turned the radio to maximum volume to drown out their quiet conversation.\nAt some point during the day, Arnold left the hotel room to buy the evening edition of the Tacoma Times, which contained Lantz's article on the B-25 crash on its front page. Morello called them at 5:30 with another message from the informant, but Arnold and Smith decided to meet Morello about the matter at the KMO radio station. There, Morello told them that the informant told him that Crisman had been taken into custody by the military and was being taken to Alaska by an Air Force transport.\nSmith unsuccessfully tried to confirm the claim of Crisman's whereabouts, prompting Morello to advise that they leave Tacoma until the situation \"blew over.\" Arnold and Smith went to the address given to them by Dahl, finding it deserted.\nFollowed by a black Buick sedan, Arnold and Smith drove to McChord Field, where they met with an Army Intelligence major who took the remaining metallic fragments.\nArnold then flew Smith back to Seattle before setting off to return Boise. Along the way, after stopping in Pendleton for fuel, Arnold reached fifty feet in altitude and his engine suddenly stopped. He managed to land the plane without being harmed and discovered that the fuel valve had been shut off, something only he would have been capable of doing. After turning it back on, his engine started perfectly. After repairs were made to his plane, he returned home safely.\nIn spring 1948, Arnold wrote an article for Ray Palmer's Fate magazine recounting the events in Tacoma.\nIn 1952, Arnold published a book, The Coming of the Saucers. He later unsuccessfully ran for lieutenant governor of Idaho in 1962 and died in 1984.\nBehind the scenes\nKenneth Arnold (March 29, 1915 – January 16, 1984) was an American businessman and aviator who was the first person in modern history to claim to have made a UFO sighting.\nDavid Patrick Kelly provided Arnold's voice in his interview and Fate article in the audiobook edition of The Secret History of Twin Peaks."}