{"name": "KPJK", "url": "https://twinpeaks.fandom.com/wiki/KPJK", "text": "KPJK\nKPJK was a radio station, located about fifteen miles away from Los Alamos, New Mexico.\nHistory\nOn the night of August 5, 1956, the station was playing the song \"My Prayer\" by the Platters. One of the Woodsmen entered the station, crushed the receptionist's head and began doing the same with the disc jockey; interrupting the broadcast, he took the microphone and began repeating the following mantra over and over:\n\"This is the water and this is the well. Drink full and descend. The horse is the white of the eyes and dark within.\"\nListeners reported hearing \"electrical or mechanical word sounds\" for six minutes after the station went off the air; many locals reported severe disturbance in their pets or livestock. While hearing the mantra numerous people fell unconscious, including a young girl listening in her bedroom. The Woodsman seemingly stopped only after the hatchling climbed down the girl's throat; he then proceeded to crush the DJ's skull and exited the radio station.\nWhen the sounds stopped the station went to dead air, and all of the people regained consciousness. Policemen were solicited by listeners who tried to call the station to no avail, and, upon visiting the station, concluded that the gruesome murders were victims of \"extreme blunt force trauma\".\nSarah Novack, then thirteen years old, was one of the two people named in the news reports out of an estimated dozen: she was found unconscious by her parents in her room and came to senses while she was being taken to the hospital, in the backseat of the family car. Emergency doctors found nothing wrong with the girl, as with the other people they examined that night, and she was released after a cursory examination.\nBehind the scenes\nThe scenes inside the KPJK station were filmed in a specially constructed set. Upon visiting the set for the first time, series' director David Lynch stated that he envisioned a simple set for one shot, but instead they had built an authentic radio station, which he joked could be on the air by the following week."}