{"name": "L._Ron_Hubbard", "url": "https://twinpeaks.fandom.com/wiki/L._Ron_Hubbard", "text": "L. Ron Hubbard\nLafayette Ronald Hubbard was a United States Navy officer and science fiction writer who founded Scientology.\nBiography\nHubbard served in World War II, commanding two anti-submarine ships in the Pacific theater. Combat stress caused him a myriad of health issues, including ulcers, conjunctivitis, bursitis, and problems with his eyes and feet.\nIn the military intelligence community, Hubbard acquired a dishonest reputation and his discharge was eagerly anticipated.\nFollowing the war, Hubbard lived in Los Angeles and pursued a career as a science fiction writer, penning various short stories and novels for small publishing companies. In August 1945, a group of acquaintances introduced him to a Pasadena-based group that included Jack Parsons.\nHubbard and Parsons became friends and during a period of financial difficulty, Hubbard was invited to stay at Parsons' home, the Parsonage, alongside several others. There, he soon discovered that Parsons was a follower of Thelema, a religion modeled on the teachings of the late Aleister Crowley, a friend and mentor to Parsons.\nHubbard attended a Thelema gathering, witnessing various illicit activities. During this gathering, he secretly recorded a conversation between himself and Parsons, in which they discussed Crowley, alchemy, and the similarities between magick and Parsons' work. Hubbard noticed that Parsons wore an inscribed ring. Parsons softly spoke \"the magician longs to see\" and commented that he sensed spirits within the home's wood, then abruptly excused himself from the exchange to attend to his guests. Hubbard left the home after midnight.\nFor two years, Hubbard and Parsons worked together on a ritual, the Working of Babalon, with the goal of summoning the goddess Babalon and the \"Moonchild\" from the Roswell, New Mexico desert.\nAfterward, Hubbard swindled Parsons out of his life savings as well as Parsons' girlfriend, Sara \"Betty\" Northrup, with whom he purchased a yacht and settled in Miami, Florida. He married Northrup before officially divorcing his first wife. Parsons eventually attempted to sue Hubbard, but Hubbard threatened to expose that Parsons began seeing Betty when she was only 17.\nOn October 17, 1949, Hubbard was interviewed by Congressman Richard Nixon of the House Un-American Activities Committee, to whom he disclosed details of the Thelema gathering.\nIn 1950, Hubbard published Dianetics. Borrowing elements of Thelema, the book became the basis of his own religion, Scientology.\nBehind the scenes\nL. Ron Hubbard (March 13, 1911 – January 24, 1986) was a science fiction and fantasy writer best known for the foundation of the Church of Scientology."}