{"name": "Lana_Budding_Milford", "url": "https://twinpeaks.fandom.com/wiki/Lana_Budding_Milford", "text": "Lana Budding Milford\nLana Milford (née Budding) was a seductive woman known to charm almost any man around her, particularly the brothers Dougie and Dwayne Milford.\nBiography\n\nMarriage to Dougie Milford\nClaiming to be 19 years old and allegedly from Georgia, 25-year-old Lana Budding joined the Twin Peaks Savings and Loan in 1989, allegedly to see how rich Douglas Milford was.\nLana was married to Milford on March 17, 1989, at the Great Northern Hotel. However, Dougie's brother, Dwayne Milford, insisted that she was only marrying him for his money and his newspaper.\nAt the reception, she met FBI Special Agent Dale Cooper, who solved the Laura Palmer murder case.\nThe next morning, she ran from her room at the hotel, screaming, as her husband had died in bed of an apparent heart attack.\nDeputy Hawk comforted her as she mourned her husband. Mayor Milford chided her, calling her a \"sexual adventuress\" and that she would \"burn in hell\" for Dougie's death. After Dwayne was escorted out, she claimed to have been cursed since her prom night, when her date - who had braces - had his jaw lock up on him after they kissed and had to have it broken in three places for it to be corrected. Deputy Hawk told her that her curse needed a cure.\nShe later told stories to Hawk, Harry, Dick, Andy, and Doctor Hayward, who had all been taken by her charms.\nDoctor Lawrence Jacoby later found that Lana was not cursed, but possessed a heightened sexual drive. As they left to go bowling, they were confronted by Dwayne, who was armed with a shotgun. Cooper had she and Dwayne settle matters privately in the conference room. Meanwhile, the rest of the men stood outside until they came in to find her kissing Dwayne, who then announced that they would be adopting a child.\nMiss Twin Peaks Contest\nA few days later at the Double R Diner, Lana told Dwayne that she wanted to win the Miss Twin Peaks Contest, and believed he could make this so, as he was one of the judges.\nLater, she served the wine at Dick's wine-tasting event.\nA day before the pageant, Dwayne came to tell her that Norma Jennings and Dick had been confirmed as the other judges for the contest and they plotted a way for her to definitely win.\nThe morning before the pageant, Tim Pinkle taught her and the rest of the women in the Miss Twin Peaks Contest some choreography. During a break, she approached Dick and asked him to help her \"find something in the storage room.\"\nAt the contest, she performed a dance of \"contortionistic jazz exotica.\"\nAfter the winner was announced as Annie Blackburn, she looked at Dwayne in utter shock.\nAftermath\nSix months after Dougie's death, Lana left Twin Peaks after receiving an insurance payout. She resurfaced in the Hamptons and briefly dated a Fifth Avenue-based real estate mogul. In the mid-1990s, Lana encountered Donna Hayward at a public function; a photograph of the two was featured in the Twin Peaks Post.\nEventually, Lana married a hedge fund manager. She was last known to reside in Antigua, where her new husband dropped dead during a morning jog, and she predictably made off with the cash. Tammy Preston was unable to find any trace of Lana after this event, noting she was said to have drifted toward the south of France.\nThe Archivist surmised that she could have been an assassin hired by somebody from Milford's past, but had no evidence to prove this.\nBehind the scenes\nDuring his The Secret History of Twin Peaks book tour, Mark Frost said at each convention that Lana was Miss Twin Peaks 1989 despite the fact that Annie was the clear winner in Episode 28. This is later explained in Twin Peaks: The Final Dossier as Lana having won as the runner-up following Annie's disappearance."}