{"name": "Laura_Palmer", "url": "https://twinpeaks.fandom.com/wiki/Laura_Palmer", "text": "Laura Palmer\n\"Everybody knew she was in trouble... but we didn't do anything. All you good people! You want to know who killed Laura? You did! We all did!\"\n ―Bobby Briggs\nLaura Palmer was the daughter and only child of Leland and Sarah Palmer of Twin Peaks, Washington. Laura was found murdered, at the age of seventeen, on the morning of February 24, 1989, an event that shook the small town to its core and prompted an investigation by FBI agent Dale Cooper.\nBiography\n\nPre-conception\nFollowing the 1945 Trinity nuclear test in White Sands, New Mexico, a gold orb containing Laura's image was sent to Earth by Senorita Dido and the Fireman.\nEarly life\nDelivered by Doctor Will Hayward, Laura was born on July 22, 1971, in the town of Twin Peaks, Washington, the only child of Leland and Sarah Palmer.\nLaura was baptized by Clarence Brocklehurst, who also instructed her in Sunday school. Laura would comment that Brocklehurst talked too much.\nOn her twelfth birthday, Laura received a diary and, from her father, a pony whom she named Troy. From the age of twelve, she began to be molested by BOB.\nThe following night, she had a nightmare that she was near Pearl Lakes and BOB was singing to her as a wind blew at her. Her cat, Jupiter ran into the woods and BOB lifted his hands, stopping the wind. She began to feel a burning heat between her legs and BOB began to sing in her mother's voice. He said \"Laura, you are home,\" and she woke up. Laura slept through much of the next morning, hooting like an owl at some point. Her older cousin, Maddy arrived later in the day.\nAlong with her best friend, Donna Hayward, Laura spent much time with Maddy during the following days. They built a fort in the Palmers' backyard, where they discussed boys and tried cigarettes, the latter which made Laura feel mature. She also tried on some of Maddy's clothes, Maddy telling Laura that they made her look like Audrey Horne, whose father, Benjamin Horne seemed to neglect in favor of Laura.\nSoon, Laura began to try to resist thinking about sex and try to be good, so that BOB would stop attacking her. However, she found this difficult to do as she would only think about it more, as she began to go through puberty.\nIn September of 1983, she discovered that someone had been reading her diary, so she stopped writing in it until the next October, having found a hiding place for the diary. During the times between entries, her trust in people had dwindled and she discovered that Troy had been given to her by Benjamin Horne, not by her father. Her cat was also hit and killed by a car.\nA little over a week later, Laura and Donna met three older Canadian boys who introduced them to marijuana, something which Laura happened to enjoy. Laura also danced for the boys. More than a week after this, the girls met a new set of young men who got them drunk and went skinny dipping with them. During this time, Laura managed to seduce the boys.\nA few weeks later, she saw a vision of 1400 River Road, and she rode there with Troy. When Laura arrived, it turned out to be an abandoned gas station. Margaret Lanterman, or, the \"Log Lady\" was waiting and told Laura of several things she knew about her and of owls.\nNights later, Laura had a nightmare of a rat trying to bite her foot off until she bit it off herself. She blamed this dream on her activities with the older boys and once again said she would try to resist her mature thoughts. Another nightmare followed the next month where she saw her diary appearing and disappearing on peoples' laps and when they read it, they turned into rats. She did not write again until April 1985, still struggling with her thoughts.\nIn June, she recounted the ways BOB would sexually abuse her, and on her birthday the following month, she tried to lure him—as the \"bad Laura\"—from the woods to no avail. An owl swooped down in front of her as she left.\nWeeks later, Laura went on a date with Bobby Briggs and they had sex inside of an abandoned barn. He told her that he loved her, but she did not openly reciprocate these feelings, as she was trying to suppress the \"good Laura.\" She laughed at him until he cried. Laura then vowed to reveal to the world who BOB was once she found out. Bobby later called her and apologized.\nOver a month later, Bobby took Laura to a party being thrown by Leo Johnson, who Bobby warned her to never sleep with, for he was into \"weird shit.\" At this party, she performed oral sex on a young woman and she tried cocaine for the first time, soon becoming addicted. During the time following this, she had dreams of BOB and of her father discovering her activities at the party.\nIn November 1987 , after Leo gave her a supply of drugs following an orgy, she encountered BOB in her room. A month later, she began tutoring Johnny Horne three times a week for drug money. Donna also began to date Mike Nelson, whom Laura did not think too highly of, especially when he began to join Bobby in selling cocaine for Leo, as she did not want Donna to get involved with this lifestyle. By this time, she had also begun to \"party\" with Jacques Renault, who later gave her a supply of drugs for Christmas.\nOn New Year's Eve, Laura and Bobby had a sexual encounter, Laura realizing that she did indeed have romantic feelings for him as she managed to remove all of the bad thoughts from her head. By this point, Laura began to believe that BOB was a creation of her own mind, and she figured that she had by then slept with at least forty people.\nIn February 1987, whilst hitchhiking to Jacques' cabin, Laura was taken to a motel. She entertained a group of men and managed to escape after hitting one over the head with a bottle.\nBy March, her friendship with Donna was deteriorating and she neglected Troy to the point of him having to be put down by the border police. She was soon working the perfume counter at Horne's Department Store with Ronette Pulaski, and took photos for Flesh World.\nOn her sixteenth birthday, Laura found out that she was seven and a half weeks pregnant, unsure of who the father was. Weeks later, she had an abortion.\nLaura had become sober at this point and the department store manager, Emory Battis, offered her a position as a hostess at One Eyed Jacks. She subsequently relapsed. Also during this time, she began to work for the Double R Diner as part of the Meals on Wheels service, and she began giving English lessons to Chinese immigrant Josie Packard. During her Meals on Wheels route, she met Harold Smith who became a friend to her.\nLaura began an additional diary and in it, would present herself being as innocent as the town of Twin Peaks thought she was.\nFinal year and murder\nIn February 1988, in the Red Diamond City Motel, Teresa Banks came to Ronette Pulaski and Laura with money from a man who chickened out of his planned foursome with them. Laura observed Teresa's ring when she adjusted her hair.\nDuring one of her nights working at One Eyed Jacks, Laura was caught using cocaine by the brothel's madame, Blackie O'Reilly, who warned her that this behavior would get her dismissed. Laura vowed that one day, she would tell the world about Benjamin Horne, who was secretly the brothel's owner.\nOn her birthday, six months before her death, she began to consult psychiatrist Doctor Lawrence Jacoby. It was possibly intentional that Laura's age was recorded by Doctor Jacoby as being 18, as the fact that she was a patient of his was not to her parents' knowledge. Being his patient, she began to record audio tapes for him.\n \nThe next year, on February 5, James Hurley gave Laura half of a heart locket after they began a secret relationship.\n \nThen on February 12, Laura went on a picnic with James and Donna.\nOne day, later in the month, Laura walked to school with Donna, passing their boyfriends, on the way, the boys declaring Mike to be \"the man.\" \nWhen they arrived at school, she stopped briefly with James, then went into the restroom, where she snorted cocaine before heading to class.\nAt 2:30, she secretly met James and said that she was \"long gone\" like a \"turkey in the corn.\" James requested her to never leave and they shared a kiss. On the way out from school, Laura and Donna encountered Bobby, who was angry over the fact that he had not known her whereabouts for the previous hour. However, she easily calmed him down and they went to Donna's house, where they discussed James and Bobby, the former being \"the one.\"\nLaura went home and to her room, where she looked into her diary and noticed pages had been ripped out.\nLaura's mother then came home from the store and Laura frantically asked for the car, claiming to have forgotten her books. She nearly took the cigarette she caught from her mother's mouth, but her mother advised her that she would never become a smoker if she did not start.\n \nShe went to Harold Smith's home and told him that BOB was responsible for the missing pages, though he told her that BOB was not real. She then told him about her history of BOB coming for her since she was 12 years old. She said \"fire walk with me,\" briefly getting a corpse-like face, and then burst into tears. She had him hide the diary before she left, saying she did not know when she could come back.\nWhen Laura came home, her mother had figured out that she lied about the books. She told her mother that she had to see Bobby, which frustrated her as she always wanted the truth from her daughter.\nIn the dining room, Laura's father trudged in, loudly declaring that he was hungry. He then taught them how to introduce themselves in Norwegian, as potential business partners from Norway were coming.\nThat night, Laura got into a semi-truck to \"party\" with a trucker.\nThe next day, she loaded up a Meals on Wheels delivery with assistance from the Double R Diner's Shelly Johnson, then saw an elderly woman with a young boy wearing a mask. The woman gave her a painting and the boy said that the \"man with the mask\" was looking for her diary in its hiding place. Laura then told Shelly she could not do the Meals on Wheels delivery and frantically left for home.\nWhen she arrived, she went to her room, where she saw BOB searching her hiding spot and she ran out of the house, hiding in a neighbor's bushes. She looked back at her house and saw her father leaving. She tearfully feared that her father may have actually been BOB, but she tried to deny it. She then went to the Hayward home.\nWhen Laura came crying to Donna, the latter said that she worried Laura did not want to be around her because she was uptight, but Laura assured her that even just thinking about her made her happy. They went inside and Donna got Laura's opinion on whether she should sleep with Mike. However, Laura cast doubts that Donna actually had any feelings for him. Donna then asked her mother for a muffin, and her father then came in, trying to perform a magic trick. Laura then lit a cigarette and Doctor Hayward questioned why he let her do this. Mrs. Hayward then brought out huckleberry muffins for the girls. Doctor Hayward then read Laura a \"secret message\" for her: \"The angels will return, and when you see the one that's meant to help you, you will weep with joy.\" Laura's father then called the house and she went to return home.\nWhen she arrived, her father sat at the dinner table. He insisted that she had not yet washed her hands and examined them, noting one fingernail in particular. He then asked about her necklace - half of a heart. He insisted that it was not from Bobby and he frightened Laura, with her mother coming to her aid. Leland then told her to wash her hands, which she got up and did in tears.\nThat night, when she was sitting at the desk in her room, her father came in, crying, and told her that he loved her, kissing her on the head before going back to his room. She then began to cry and looked at a painting of an angel, asking, \"is it true?\" She then looked at the painting given to her by the old woman and hung it up before she went to sleep.\nAs she slept, she heard a man's voice saying \"don't take the ring.\" She turned to see a woman named Annie in her bed. Annie told Laura \"the good Dale is in the Lodge and can't leave\" and to write it in her diary. Annie then disappeared and a ring appears in her hand, the same one Teresa had worn. She got up and started to leave her room, noticing herself appearing in the painting. However, she was then back in bed. Laura heeded Annie's words and wrote down what she had been told in her diary.\n \nShe woke in the morning and took the painting down. That evening, Laura made herself a drink with plans to go out and Donna came, asking where she was going, but Laura said she was not going with her. She went to the Roadhouse where she encountered the Log Lady.\nShe went inside, where a blonde singer performed onstage. Laura watched her and broke down into tears. She soon began to smoke a cigarette and nodded to Jacques Renault, who sent two men to her table, wishing to pay for her services as a prostitute. However, Donna came over, the men wondering if she was \"part of the deal,\" which Laura denied, but Donna's actions insisted that she join them.\nLaura and Donna traveled with the men up to Canada, Laura having a good time. When they arrived, one of the men (identifying himself as Buck) gave her some cocaine.\nThe group went to the Power and the Glory, where they met with Jacques. Laura danced with Buck, who removed her shirt. Ronette Pulaski soon joined them and Jacques came to them. They talk about Teresa Banks and Jacques invited the girls up to his cabin later in the week.\nLaura and Ronette then sat in a booth, receiving oral sex from Buck until Ronette pointed out Donna, topless with Laura's shirt tied around her waist. This caused Laura to become upset, saying she did not want her to wear her clothes, and that she wanted to go home.\nThe next morning, at the Hayward home, Donna questioned why Laura lived the way she did. Leland then came to pick up Laura for breakfast and along the way, they were followed by a man recklessly driving a camper. Laura said she smelled something burning - the car's engine. The man drove around the block and stopped next to Laura and Leland, shouting \"you stole the corn!\" among other incoherent-seeming statements, including \"it's your father!\" to Laura. She was frightened as they stopped at a mechanic. They both sat and talked about the man. She then asked her father if he had come home the previous week, which he denied until Laura said she thought she saw him and he admitted that he came home briefly to take aspirin on Friday.\nLater, Laura sat in her room and thought about the ring she had seen in her dream, as well as on the man's finger, and previously on Teresa's finger. She later put a plastic bag with a key inside in her diary.\nDuring breakfast the next morning, Leland came through the dining room to remind Laura and her mother that it was Johnny Horne's birthday. Johnny was a mentally handicapped boy that Laura had tutored.\nAt school, she met Bobby, who said there was a big score of cocaine to get that night. At night, they drank in woods, also taking what little cocaine they had left until the drug supplier showed up. He said he was sent by Jacques and showed a bag of cocaine before drawing a gun. Bobby pulled out his own gun and killed him. Laura began teasingly insisting that he killed Mike, much to his anger.\nLater that night, she received a call from her Doctor Jacoby, wondering why she did not see him the previous day, which she said was because she was with Johnny. He asked her to make him a tape and she said she might the following day. He asked her to send him a kiss and she hung up.\nThe next day, Bobby had her store $10,000 in a safety deposit box while he went out to the woods to test the dealer's product. She continued to tease him that he killed Mike.\nLater, James showed up outside the Palmer home and Laura went to him. He asked where she had been the previous night, sure that it was drug-related. He asked when he could see her, but Leland showed up and Laura said she had to go. James then left.\nShe went inside and BOB spoke to her through the ceiling fan above the stairs and she slowly grinned at it until her mother asked her if she had seen her blue sweater, which she was wearing. This caused Sarah to cry, believing she was having a mental breakdown.\nIn the evening, Laura sat in her room, snorting cocaine. When she was in bed, she heard the hallway fan turn on. BOB then came in through her window and he began to assault her while she asked him who he was until his face turned into her father's.\nLater that night, she had a dream that she was in a red room with a small man in red and an old man. She tried to speak to the old man, but her words came out strange. She walked over to him and whispered the secret of BOB in his ear.\nAt breakfast the next morning, Laura did not eat much and did not wish to speak with her parents. She left the dining room and when Leland followed, she told him to stay away from her. She had trouble making it through the school day, the world seeming to spin around her.\nAt some point in the day, she wrote a diary entry stating that she would die that night.\nAt 5:00 in the afternoon, she went to Josie Packard's home. Laura commented to Josie that she understood how she felt about her husband's death that had occurred a year and a half prior. She left after an hour.\n \nShe complained to her mother about asparagus that evening and asked to go to Bobby's to do homework. She went to the Briggs home and was let into the house by Mrs. Briggs and went down to the basement, \"where belongs.\" Bobby told her that the cocaine from the dealer was actually a baby laxative. After giving her the cocaine from his private stash, Bobby walked her out of the house.\nWhen home, she told her mother goodnight, then went to her room, using the cocaine Bobby gave her. Her phone rang, with James calling. She arranged to meet him in fifteen minutes. She looked at the angel painting again and left through her window, hiding as she watched her father enter their house. James then came for her and they rode away to the woods. She told him about the murder Bobby committed and began to act strangely. She said that he did not know her, and even Donna did not.\nJames began to take Laura home, but she jumped off of his bike. In tears, she told him she loved him and ran off into the woods, where Jacques, Leo, and Ronette waited near a cabin. There, they engaged in sex and cocaine, with Jacques tying her up, despite her protests against it. Leo let Jacques' bird Waldo out of its cage and it started to peck her shoulders. As she screamed about Waldo, Leo placed a poker chip in her mouth, saying \"bite the bullet baby, bite the bullet.\" Laura bit off part of the poker chip and ingested it.\nShe requested Leo to untie her, but he angrily refused, before storming off to his red Corvette and speeding away. A drunk Jacques stumbled out of the cabin, only to be knocked unconscious by Leland Palmer, inhabited by BOB, who hit him over the head with an empty beer bottle.\n \nLeland took Laura and Ronette to an abandoned, secluded train car. BOB placed a mirror in front of Laura's face, in which she briefly saw BOB and screamed as he taunted her. Hoping to save Laura and Ronette, Mike raced to the train car, managing to pry open the door. Ronette escaped through the open door, and moments before BOB slammed it shut, Mike threw a ring to Laura, which she placed upon her finger. This enraged BOB, who could not inhabit Laura's body, for the ring prevented him from doing so. Consumed with rage, BOB bludgeoned Laura to death with a hammer, just as he had done to Teresa Banks. He placed a small piece of paper with the letter 'R' printed on it beneath Laura's left ring finger, then left a note written in Leland's blood, reading \"FIRE WALK WITH ME.\" He then wrapped her body in plastic and sent it afloat into a river.\nMurder investigation\n \nLaura's body was found the next day, February 24, by Pete Martell and was identified by Doctor Hayward and Sheriff Harry S. Truman.\nLater, her father came and identified her body. Her mother noted that the last time they saw each other was around 9:00 the previous night and that Laura's final words to her were \"good night,\" and that she had received a phone call.\nFBI Special Agent Dale Cooper arrived in town and examines her body at the Calhoun Memorial Hospital, finding a small piece of paper with the letter 'R' under the nail on her left ring finger. Her diary was also examined, containing a safety deposit box key. A videotape of Laura and Donna was also found, filmed by James at their picnic. In the video, she wore her half of the heart necklace.\nIn the evening, James told Donna about his activities with Laura the night before. He says that she seemed like a different person and said there were things about her not even Donna knew, and that Bobby had killed someone. James said that she wrapped her arms around his neck, screaming \"I love you,\" before running away. James and Donna buried his half of the heart necklace since the authorities believed it was in possession of the killer. However, after they left, Doctor Jacoby came and dug up the necklace to have it as a keepsake of Laura.\nThe day after her body was discovered, Laura's autopsy results were presented by Doctor Hayward, who only assisted due to an emotional attachment to Laura since he had delivered her and she was his daughter's best friend. Instead, Hayward had Joe Fielding perform the autopsy. The results revealed the time of death to have been between midnight and 4:00 AM, the cause of death was a loss of blood, bite marks were on her shoulders and tongue, and lesions were on her wrists, ankles, and upper arms. It was also found that she had sexual relations with at least three men within twelve hours before her death and that her killer also attacked Ronette.\nJames confirmed to Cooper and Truman that he filmed the video of she and Donna, but denied knowing who the missing half of the necklace was given to.\nDoctor Jacoby later listened to a tape made by Laura and took James' half of her heart necklace out of a coconut in his office.\nThe following night, she was seen in a dream by Agent Cooper. When Cooper asked if she was Laura, she answered that she felt like she knew her \"but sometimes arms bend back.\" A little man then described her as his cousin and being full of secrets. When the little man began dancing, she went to Cooper and kissed him, and whispered in his ear the name of her killer. However, Cooper had forgotten the name by morning.\nAgent Cooper then learned that morning that Laura had worked at the perfume counter at Horne's Department Store, the same place as Ronette Pulaski.\nA fight later broke out between Albert Rosenfield and Doctor Hayward over Laura's body, Rosenfield wishing to hold it for further analysis while Hayward wanted to release it to the family for Laura's funeral. When Agent Cooper and Sheriff Truman interfered, the body was released. Laura's cousin, Maddy Ferguson then arrived for Laura's funeral.\nRosenfield delivered his findings to Agent Cooper and Sheriff Truman: traces of cocaine were found in the plastic bag inside her diary and she was addicted to the substance; two different kinds of twine were used on her wrists and arms and she had been tied up twice; industrial strength soap particles were found on the back of her neck, as the killer had washed his hands and kissed her after she had died; claw marks and bites were on her neck and shoulder; and a small plastic particle was found in her stomach.\nAt the funeral, Bobby and James got into a fight and Leland broke down, throwing himself onto Laura's casket.\nOn March 10, Laura's killer struck again, this time murdering Maddy just before she intended to go home.\nTwo days later, Benjamin Horne had been arrested by the sheriff's department, with Sheriff Truman convinced that he had done it. However, Agent Cooper did not agree and called a gathering to the Roadhouse of several people. By the use of \"magic,\" he remembered the name Laura had whispered into his ear in his dream.\nLeland was taken back to the station and while under control of BOB, he confessed to killing Teresa, Laura, and Maddy. Soon, BOB slammed Leland's head into a metal door and ceased control over him, causing Leland to express guilt for all of his actions. However, Laura forgave him as he passed away.\nBlack Lodge\n \nLaura appeared to Cooper in the Red Room, where she sat next to the little man and greeted Agent Cooper, saying \"I'll see you again in 25 years. Meanwhile,\" and disappeared after doing the gesture of \"tree\" in sign language.\nIn the Black Lodge, her doppelganger appeared to Cooper and screamed at him after saying \"meanwhile\" and doing the \"tree\" gesture as well. In another room, she took Annie Blackburn's place and screamed at him again, then had her place taken by Windom Earle.\n \nLater, Laura appeared in the Red Room, with FBI Special Agent Dale Cooper placing his hand on her shoulder as she saw an angel and cried while smiling and laughing.\nIn late 2016, Laura appeared to Agent Cooper in the Lodge and told him he could \"go out now.\" He asked her if she was Laura Palmer, and just like in the dream they both had many years before, she answered, \"I feel like I know her, but sometimes my arms bend back.\" Then when he asked her if she was Laura Palmer, she confirmed and explained that she was alive and dead at the same time. She then removed her face, revealing an intense light behind it, then replaced it. Cooper then asked her when he could leave, then she walked over to him and kissed him before whispering in his ear, just like in the dream. Suddenly, Laura began screaming and a force pulled her up.\nLaura was later seen crying in a vision had by FBI Deputy Director Gordon Cole.\nAnother 1989\nOn the night of February 23, 1989, after abandoning James and running into the woods, Laura encountered Dale Cooper, recognizing him from her dream. He took her hand and promised to lead her home. As they approached an opening on Blue Pine Mountain, which led to the Fireman's home, she disappeared, and Cooper heard her screaming over a billowing sound.\nThe Twin Peaks Post reported on Laura's disappearance, which remained an unsolved case until at least 2017. The FBI, represented by the younger Dale Cooper, arrived to conduct an investigation but apparently failed to turn up any sign of her. One year to the day later, Laura's father Leland shot himself in his car by White Tail Falls.\nCarrie Page\nMain article: Carrie Page\nGuided by intuition, Dale Cooper crossed with Diane Evans and began searching for Laura. He followed clues leading to Eat at Judy's coffee shop in Odessa, Texas, and then to the home of one of its waitresses, Carrie Page. Knocking on the door, he was stunned to see that she resembled an older Laura Palmer, and haltingly explained that it was very important they go to her old house in Twin Peaks, Washington. Looking to get out of the city, Carrie agreed.\nWhen they arrived, it seemed as though the Palmer family had never lived at the house, which had a new owner. Carrie heard the voice of Sarah Palmer calling Laura's name, and screamed in terror.\nNon-canon appearances\n\nInternational Pilot\nLaura appears in a room with red drapes, where she sits and joins hands with a little man. When Cooper asks if she is Laura, to which she answers she feels like she knows her \"but sometimes arms bend back. The little man describes her as his cousin and being full of secrets. When the little man begins dancing, she goes to Cooper and kisses him, and whispers in his ear.\nBetween Two Worlds\nNote: The canonicity of this featurette is ambiguous rather than not officially canon.\nLaura describes her experience in the Lodge to David Lynch.\nBehind the scenes\nThe character of Laura—and the series as a whole—was partially inspired by the 1944 film Laura, which, in turn, was based on the 1943 novel of the same name. Laura focuses around the murder investigation of a young woman named Laura Hunt, and important to the investigation is a photo of her and her diary, much like Twin Peaks employed years later. Additionally, Laura was heavily inspired by actress and model Marilyn Monroe. Laura's death itself drew inspiration from the 1908 unsolved murder of 20-year-old Hazel Drew, whose body was found floating in a pond, dead from a blow to the head.\nLaura was played by actress Sheryl Lee, who also played Maddy Ferguson. She was given the role of Maddy after David Lynch was impressed by her performance while filming the picnic videotape.\nLee reprised the role in the 2017 revival.\nTrivia\nCards released during the show's run and The Secret Diary of Laura Palmer state her birthdate as July 22, 1972. However, since the show states her death to have been February 24, 1989, this would make her 16 at the time of her death, when it is explicitly stated that she was 17 years old. Because of this, this birthdate cannot be assumed as canon.\nAlso, in The Secret History of Twin Peaks, there is a document written by Jacoby after Laura's death that gives her age as 18. However, this could be explained by either Laura or Jacoby lying about the former's age."}