{"name": "Laura_Palmer%27s_secret_diary", "url": "https://twinpeaks.fandom.com/wiki/Laura_Palmer%27s_secret_diary", "text": "Laura Palmer's secret diary\nLaura Palmer's secret diary held revealing secrets about her abuse from BOB and other town secrets. She also kept a second diary that portrayed her as the \"perfect\" girl that the town knew.\nShe gave it to Harold Smith before she died (following her discovery that someone had torn pages out), and he mutilated it prior to his suicide, but left pages for Donna Hayward at Mrs. Tremond's home.\nKnown pages\nRead by Harold:\nBut still I'm afraid to tell her of my fantasies and my nightmares; sometimes she's good at understanding, other times she just giggles, and I don't have the nerve to ask why things like that are funny to her. So I feel badly again and shut up about it for a long time. I love Donna very much, but sometimes I worry that she wouldn't be around me at all if she knew what my insides were like. Black and dark, and soaked with dreams of big, big men and different ways they might hold me and take me into their control.\nLess than two weeks before her death, from Harold's mutilated diary:\nSomeday I'm gonna tell the world about Ben Horne. I'm gonna tell them who Ben Horne really is.\nHard to read page next to the ones Laura saw ripped off before giving the diary to Harold, followed by the following:\nDear Diary,I spent the afternoon with Dr. Jacoby at his office. He wanted to see me and go over what I had said to him on my tapes. He wanted to hear more about James Hurley and the fact that I had mentioned going sober because of him. I told him James was some one I had known for a long time, although not so well. I told him I had fallen in love with his purity and the idea that if I was strong enough I could let James take me\nLaura's father, Leland, ripped pages from the diary and showed them to Laura the night she died. He abandoned them at Glastonbury Grove and they faded by the time they were found by Deputy Hawk.\nThe pages left by Harold for Donna:\nFebruary 22nd. Last night I had the strangest dream. I was in a red room with a small man dressed in red and an old man sitting in a chair. I tried to talk to him. I wanted to tell him who BOB is because I thought he could help me. But my words came out slow and odd. It was frustrating trying to talk. I got up and walked to the old man. Then I leaned over and whispered the secret in his ear. Somebody has to stop BOB. BOB's only afraid of one man, he told me once. A man named Mike. I wonder if this was Mike in my dream. Even if it was only a dream, I hope he heard me. No one in the real world would believe me.\nFebruary 23. Tonight is the night that I die. I know I have to because it's the only way to keep Bob away from me. The only way to tear him out from inside. I know he wants me. I can feel his fire. But if I die he can’t hurt me anymore.\nTwenty-five years after the murder, four pages were still missing. Three were found in a stall door at the sheriff's station, possibly hidden by Leland when he was interrogated for the murder of Jacques Renault:\nThey've never listened to my cries and I never wanted them to anyway. But there is this - This came to me in a dream last night....\"My name is Annie. I've been with Dale and Laura (me??!!!). The good Dale is in the lodge and he can't leave. Write it in your diary.\"That's what she said to me.\nThere I was with a plastic pumpkin full of money and the clothes that Nancy brought. She's bending my ear with all sorts of non-sense. I can't make out what she's trying to say but I take it all in as best I can.I sure didn't need a mask today. Some Halloween!\nThe moon has been high in the sky for hours now I can't sleep!It's 1:30 A.M. I'm crying so hard I can hardly breath. NOW I KNOW IT ISN'T BOB. I KNOW WHO IT IS.\nBehind the scenes\nThe diary was released in 1990 between season 1 and 2 as the novel The Secret Diary of Laura Palmer, written by Jennifer Lynch, daughter of Twin Peaks co-creator, David Lynch."}