{"name": "Lawrence_Jacoby", "url": "https://twinpeaks.fandom.com/wiki/Lawrence_Jacoby", "text": "Lawrence Jacoby\nDr. Lawrence Jacoby was a highly eccentric psychiatrist who grew up in Hawaii and remained fascinated by it. Jacoby was seeing Laura Palmer as a patient prior to her murder.\nJacoby's license was revoked following the investigation into Laura's death and years later, he began to host a webcast under the name \"Dr. Amp.\" \nBiography\n\nEarly life\nAs a child in 1939, Jacoby's family moved from Twin Peaks, Washington to Hawaii, where his father was stationed with the United States Navy. His parents divorced the next year, and he remained in Hawaii with his mother (who changed her name from Esther to Leilani), while his father and brother returned to Twin Peaks.\nIn Hawaii, he attended Punahou School and the University of Hawaii Medical School.\nGreatly interested in native cultures' views on mental illness, alternative medicine, and shamanism, Jacoby would spend much of his college education doing field work in the South Pacific and South America, where he would seek out semi-isolated aboriginal tribes, and, after earning their trust (which according to Jacoby at one point involved getting into a short-lived marriage to the daughter of a chief), participate in their shamanistic rituals which often involved the use of psychoactive drugs. In the late 1960s, Jacoby wrote several research articles and eventually a book based on his experiences, the latter titled The Eye of God: Sacred Psychology in the Aboriginal Mind. Said writings attracted quite a bit of attention and controversy amongst his colleagues, making Jacoby a rather notorious figure in the American field of psychology in for the rest of the 1960s and well into the 1970s.\nIn 1981, he moved back to Washington following his mother's death to study Native American tribes and to care for his brother, who had been diagnosed with multiple sclerosis. He established a psychiatry practice in his hometown of Twin Peaks.\nLaura Palmer's murder\nSix months prior to her death, Laura Palmer had secretly begun seeing Dr. Jacoby for therapy. Laura would record tapes for him about her thoughts and experiences. On February 21, 1989, Jacoby called her, saying that she had missed an appointment, and she said that this was due to her visiting Johnny Horne on his birthday. He asked her to make him a tape and she said maybe the following day. He then asked for her to send him a kiss, but she hung up.\nTwo days later, Laura was found dead. At the hospital, Jacoby excitedly told its staff about a fish he had caught until he saw Sheriff Harry S. Truman and a man in a suit on the elevator. He rushed to them, but the door closed and he took the stairs to meet them. He noted that Laura's death was a terrible tragedy and he was introduced to the man in the suit, FBI Special Agent Dale Cooper. He said that Laura was a patient of his and wanted to assist them in the morgue, which the lawmen did not allow, as it was against procedure. He also said that Laura's parents did not know that she had been seeing him.\nBelieving that Leo Johnson was involved in Laura's murder in some capacity, Jacoby staked out Leo's residence that evening, and even shadowed him in his own car when he went out for a night drive in his red Corvette. Although he lost Leo's trail when he drove into the woods, Jacoby happened to spot Laura's best friend, Donna Hayward, and secret boyfriend, James Hurley driving by on James' motorcycle. Following the couple unseen as they went deeper into the woods, he saw them talking about something, but he was too far away to make out what they were saying. He then watched them as they buried half of a heart necklace given to James by Laura. Waiting until Donna and James had left the area, Jacoby went over and dug up the necklace and took it as a keepsake.\n \nThe next day, in his office, Jacoby played a tape made for him by Laura. He took the necklace out of a coconut and began crying.\nTwo days later, he coaxed Johnny Horne into removing his headdress for Laura's funeral.\nJacoby did not attend the funeral but went to the cemetery at night to leave some flowers on her grave, where he encountered Agent Cooper. He called himself a terrible person, saying he did not truly care for his patients until Laura, so he could not bring himself to come to the funeral. He promised Cooper that he would do whatever he could to help the investigation.\n \nJacoby sat in the sheriff's station conference room with Agent Cooper the following day, doing magic tricks with golf balls. Cooper asked him if Laura had been seeing him due to her cocaine problem, but he did not answer the question, citing doctor-patient confidentiality, and insisted on a less specific question. Jacoby was then asked if Laura's problems were sexual, to which he answered that he believed that every problem is of a sexual nature, before telling Cooper about the ancient Hawaiians using the ginger plant in the same way Laura used cocaine. He then admitted to Cooper that, although Laura had chosen to confide in him, there had still been a lot of things she had kept secret from him, and he had not been able to break down the walls surrounding these secrets. The sheriff entered and asked him if Laura ever discussed Bobby Briggs or James Hurley, to which he responded that they were boys and Laura was a woman. Cooper stated that Laura had sex with three men the night she was murdered, and asked Jacoby if he was one of them. Amused by the direct question, Jacoby denied that it was the case, but mentioned that on the night of the murder, he had been following a man Laura had spoken to him about, that drove a red Corvette. Cooper then let him go.\nA day later, he met with the Briggs family for a counselling session, where they discussed Bobby's behavior. A bit into the session, Jacoby told Bobby's parents that he need to speak to Bobby alone, explaining to the confused Major Garland Briggs that he would need to see each of them individually. Now alone with Bobby, he questioned him about his relationship to Laura. Although Bobby was resistant to these questions at first, Jacoby got him to open up when he revealed that he knew that Bobby had cried after the first time he had sex with Laura and that Laura had responded by laughing at him. Bobby tearfully confessed to him that Laura had wished to die and said he believed Laura had a secret that made her want death. He also learned that Laura corrupted Bobby, making him sell drugs to provide for her addiction.\nThe following evening, Jacoby watched Invitation to Love in his office when he got a phone call from someone claiming to be Laura. Though he was incredulous, she told him to go to his door. Taking his gun from his drawer before opening the, he found an envelope with a videotape inside. He played it, seeing \"Laura\" holding the latest newspaper. He picked his phone back up and \"Laura\" told him to meet her at Sparkwood and 21 in ten minutes. But Jacoby quickly studied the tape again and noticed the park's gazebo in the background of the video and so he drove there instead.\nHe soon arrived at the park and watched \"Laura\", but before he could make contact with her, he was assaulted from behind by someone. As he was repeatedly beaten by his assailant, he suffered a heart attack from the shock. As the assailant made a quick escape, he watched helplessly as \"Laura\" left with James and Donna. He was later taken to the hospital, rambling incoherently.\nWhile never identified onscreen, Mark Frost stated that Jacoby's attacker was Leland Palmer, who – while possessed by BOB – was fearful that Jacoby would attack Maddy, so assaulted him.\nThe next day, he laid in his hospital bed as Sheriff Truman and Agent Cooper arrived. When questioned on how he came into possession of Laura's necklace, he recounted following James and Donna and digging up the necklace they had buried. He also noted that the last time he saw Laura, she seemed to have made peace with herself and was ready to die. He was also questioned if he saw anything when Jacques Renault was killed in the hospital the previous night. He noted having smelled scorched engine oil.\nTwo days later, he laid in his hospital bed, which was then filled with Hawaiian decor. He introduced Agent Cooper and Sheriff Truman to his wife, Eolani, who massaged him. He had Truman hold a stone as Cooper hypnotized him. Cooper asked him what he saw the night Jacques Renault was killed and he described the murder, stating that he knew the culprit: Leland Palmer.\nAfter his release from the hospital, he went to his home in Hawaii to recover.\nLater work\nFollowing the funeral for Leland Palmer a week later, Jacoby returned to Twin Peaks and attended the reception. Palmer had died in custody after being arrested for the murder of his daughter. Major Briggs approached Jacoby, welcoming him back to town.\nHe and Ed Hurley later convinced the staff at Twin Peaks High School to admit Ed's wife, Nadine, into the student body since she believed she was a teenager, following a suicide attempt.\nDays later, Jacoby observed Benjamin Horne, who operated a miniature Civil War re-enactment, believing himself to be General Robert E. Lee.\nHe later went to the sheriff's station, where he dismissed any curses within Lana Milford that lead to the death of her husband, Dougie Milford, despite claims by Milford's brother, Dwayne. Instead, he said that she had a heightened sexual drive. As they left to go bowling, they were confronted by Dwayne, who was armed with a rifle. Cooper commanded the mayor and Lana to have a private discussion. Meanwhile, the rest of the men stood outside until Cooper gave them the go-ahead to enter, where they found Lana kissing Dwayne, who announced that they would be adopting a child.\nAfter hearing Ben muse about Stonewall Jackson, Jacoby told Audrey and Jerry that his experiment in showing Ben to the public did not help his mental state. When Audrey requested he return Ben to the \"real world,\" he suggested they re-enact the surrender at Appomattox.\nAt the surrender, Jacoby played General Grant and surrendered, despite the historical inaccuracy. Ben then collapsed, then came to, believing his Civil War to have been a dream.\nDays later, Jacoby sat down with Ed and Nadine Hurley, so the former could ask the latter for a divorce. However, she was confused, as she believed they were only dating.\nAt the Hurley home a few days later, Nadine showed some of her wrestling highlights to Dr. Jacoby, Ed, Norma, and Mike. Jacoby said he had gathered them together, as he felt the divorce would be easier if all parties involved discussed their feelings. Ed told Nadine that he and Norma planned to get married, to which Nadine responded that she and Mike would be doing the same.\nThe following day, Jacoby brought Sarah Palmer to the Double R Diner to speak to Major Briggs.\nOn March 18, 1989, Jacoby sent a letter to the Washington State Medical Review Board, admitting his failure in handling the Laura Palmer case, specifically confessing that he had missed the obvious signs that Laura had been suffering sexual abuse at the hands of her father, and declared he was willing to accept any punishment they saw fit to bestow upon him for his actions. Less than a week later, the Review Board decided to revoke Jacoby's medical license and he returned to Hawaii to work on his memoirs.\nAt the invitation of \"an unspecified band member\" of the Grateful Dead, Jacoby spent most of 1994-95 on the road with the band, ostensibly employed as a \"senior spiritual advisor\". His tour with the band would eventually come to an end upon the death of lead guitarist and singer Jerry Garcia in August 1995.\nBetween 1996 and 1998, Jacoby took up residence in Amsterdam, as a member of a \"sketchy progressive think tank\" called the \"Zonderkop Institute\", headed by a noted Dutch eccentric and coffee shop owner named Dr. Jost Peopjes. Jacoby's involvement with the \"Institute\" came to an end, when most of its members bought heavily into the Y2K panic and isolated themselves in a \"secure and unspecified\" location in northern Sweden as a result. Jacoby decided against joining them, and instead returned to the United States, where he settled down in Florida.\nDuring the 2000 Presidential Election, Jacoby volunteered as a vote counter during the \"hanging chad\" portion of the election. During his free time, he offered lay counsel to distraught Ralph Nader supporters, which eventually lead him to write an article on what he named the \"defiant liberal denial syndrome\". As his article managed to gain quite a bit of traction in progressive media circles, Jacoby started to take an interest in political activism. This interest would be reinforced less than a year later, when he happened to be in New York on the day of the 9/11 attacks, as a participant in a conference on shamanism. In the days following the attacks, Jacoby spend time as a volunteer, comforting the wounded and traumatized. His experiences would lead him to believe that the United States and the world at large where entering a \"Kali Yuga\", a hinduist dark age.\nIn 2003, Jacoby returned to Twin Peaks, where he bought a used mobile home and a cheap acre of land on White Tail Peak, and took up residence there. Uninterested in reconnecting with the community in Twin Peaks, Jacoby kept a low profile, only entering town about once a week after dark for supplies. The only person he would maintain any direct contact with during this time was his old friend, Jerry Horne.\nJacoby would spend the next couple of years learning about Internet and its workings, during which he developed an alter ego, which he named \"Dr. Amp\". In 2006, shortly after reaching the age of seventy, he launched The Dr. Amp Blast, an internet radio program he transmitted live five days a week, one hour a night, and then offered as a downloadable podcast after each broadcast. Preaching a message of progressive political activism, anti-authoritarianism, self-enpowerment and new-ageism, with a heavy conspiracy-theorist bend, Jacoby managed to quickly gather himself an audience which grew into a small, but devoted fanbase, especially within his native Twin Peaks. His popularity would eventually begin to spread beyond the regional into the national following the burst of the housing bubble in 2009, where his program's message of hope, activism, and defiance struck a cord with many newly dissolute Americans.\nIn spite of his broadcast's increasing popularity, very few natives from Twin Peaks had realized that Jacoby was the man behind the show, before he started doing video broadcasts in 2012, where the true face of Dr. Amp was finally revealed to the world at large. Following his rising profile, Jacoby would receive several offers from mainstream media outlets to commercialize The Dr. Amp Blast, but he would reject them all as he had saved up enough money to support his rather modest lifestyle indefinitely.\nRetirement\n \nIn late 2016, Jacoby still lived in his mobile home atop White Tail Peak, where he continued to broadcast as \"Dr. Amp,\" delving into various corporate conspiracies and advertising his wares. The program's viewers included Jerry Horne and Nadine Hurley.\nOn one occasion, Jacoby ordered a set of shovels and spray-painted them gold. On a subsequent broadcast, Jacoby advertised his golden shovels to his viewers so that they could shovel themselves \"out of the shit and into the truth,\" with each shovel running $29.99 plus shipping. While making a significant amount of money off this business, Jacoby is noted to anonymously donate the vast majority of these profits to charitable and progressive political organizations.\nJacoby later drove by Nadine Hurley's store, Run Silent, Run Drapes and spotted one of his shovels in the window. He stopped to visit with her, recounting the last time he had seen her seven years prior at a supermarket during a storm. The two shared a flirtatious glance.\nNot long after, rumors suggested that Nadine and Jacoby may have started dating.\nPersonality\nJacoby was known for keeping cocktail umbrellas marked with dates of influential events that affected him. He is also a keen surfer. A recognizable trait of the Doc's were his glasses - one lens of which was blue, the other red.\nBehind the scenes\nJacoby was played by actor and dancer Russ Tamblyn. He previously appeared with co-star Richard Beymer in the 1961 musical film, West Side Story. This association was what led to Tamblyn's casting as Jacoby.\nTamblyn reprised the role in the 2017 revival.\nTrivia\nThe character of Dr. Jacoby is partially inspired by ethnobotanist and philosopher Terence McKenna.\nDr. Jacoby has appeared in two episodes of General Hospital.\nThere is also a blooper reel featuring Dr. Jacoby available online.\nAlthough Jacoby's appearance in General Hospital is not considered canon in Twin Peaks, the show could be considered to be part of the Tommy Westphall Universe.\nIn Twin Peaks: Access Guide to the Town, one of the players on the 1968 Twin Peaks High School football team is identified as Jim Jacoby. It is unknown if there is any relation between Jim and Lawrence Jacoby.\nThe beginnings of Jacoby's scenes in Part 5 and 12 are the same footage.\nThere is an oblique reference to Dr. Jacoby in the television series Fringe, where one of the main characters, Dr. Walter Bishop, dons a similar pair of red and blue glasses and explains, \"These were created by an old friend of mine, Dr. Jacoby from Washington State.\"\nGallery\n\nTwin Peaks (2017)\n"}