{"name": "Leland_Palmer", "url": "https://twinpeaks.fandom.com/wiki/Leland_Palmer", "text": "Leland Palmer\nLeland Palmer was an attorney, with his primary client being local businessman Benjamin Horne. He was well-known and respected in the town of Twin Peaks. Together with his wife Sarah and his daughter Laura, his family seemed to be the perfect family, but when Laura was murdered, Leland's psychological foundations began to crumble. He experienced multiple nervous breakdowns and remained unstable for some time.\nBiography\n\nEarly life\nLeland was born an only child.\nAs a boy near his grandfather's vacation home near Pearl Lakes, he met a neighbor named Robertson, or \"BOB\" who would flick matches at Leland whilst taunting him with \"you wanna play with fire, little boy?\" BOB, an evil spirit, possessed Leland.\nLeland graduated from the University of Washington in 1966. During his third year, he was editor of the university's Law Review, and he became especially knowledgeable in International Corporate Law.\nHe married his college sweetheart, Sarah Novack in 1968. They had one child, a daughter named Laura, in 1971.\nHe and Sarah organized the Twin Peaks Timber Players in 1974, which annually held three summer performances staged at Twin Peaks High School.\nMurders\nIn 1988, while observing an issue of Flesh World, he called prostitute Teresa Banks, saying that he really liked her picture and wanted to party with her. She told him to meet her at the Red Diamond City Motel in room 123. After hanging up, he looked at her picture in the magazine, it reminding him of his daughter.\n \nLater, after chickening out of his planned threesome with Teresa and her friends—due to one of them being his daughter—Teresa called him, having discovered his identity. Later, possessed by BOB, he tracked Teresa to the Fat Trout Trailer Park and murdered her.\nOne evening the next year, Leland trudged into the dining room of his home, loudly declaring to his wife and daughter that he was hungry. He then taught them how to introduce themselves in Norwegian, in order to greet Norwegian businessmen that were due to arrive in town.\nLeland stopped by his house the following day while on break, apparently to take an aspirin, but while possessed by BOB, he found Laura's secret diary and removed pages. He then left and headed out to work. Later, he came home for dinner and Laura came to the dining room. He insisted that she had not yet washed her hands and he examined them, noting one fingernail in particular. He then asked about her necklace - half of a heart. He insisted that it was not from Bobby and he frightened Laura, with her mother coming to her aid. Leland then told her to wash her hands.\nWhile getting ready for bed that night, Leland began to cry and he went to Laura's room. He told her he loved her and kissed her on the head before going to bed.\nA few mornings later, Leland picked up Laura from the Hayward home to take her out for breakfast, and when he saw Laura and Donna together, he was reminded of seeing Laura and Ronette together on a bed at the motel a year earlier. Along the way to breakfast, they were followed by a man recklessly driving a camper. Laura said she smells something burning - the car's engine. The man drove around the block and stopped next to Laura and Leland, shouting \"you stole the corn!\" among other incoherent-seeming statements, including \"it's your father!\" to Laura.\nThey stopped at a mechanic and Leland had a flashback involving Teresa Banks.\nHe snapped back into reality, and he and Laura both sat and spoke about the man. He has another flashback of when he discovered that Teresa's friends were Ronette and Laura and he chickened out of \"partying\" with them.\nLaura then asked Leland if he had come home the previous week, which he denied until she said she thought she saw him, and he said that he came home briefly to take aspirin on Friday.\nLater at night, he flashed back again to murdering Teresa Banks.\nHe came down to the dining room the next morning to remind his family that it was Johnny Horne's birthday, then leaves for work.\nThe following night, he drugged his wife and turned on the staircase fan. He was then revealed to Laura to be BOB's host, who had come in through Laura's window to assault her.\nAt breakfast the next morning, Laura did not eat much and did not wish to speak with her parents. She left the dining room and when Leland followed, she told him to stay away from her.\nLater, he came home and glanced in the bushes, hearing a noise.\nSoon after he went inside, he stared out the window as James Hurley drove away from the house with Laura. BOB took control, following her to a cabin, where she was engaging in sex and cocaine with Jacques Renault, Leo Johnson, and Ronette. When Jacques came out, he knocked him out.\nHe took Laura and Ronette to a train car, where he murdered Laura, begging BOB to not make him do it. He wrapped her body in plastic and sent her along the river. He then went to the Black Lodge, where Mike demanded his garmonbozia. BOB pulled the blood from Leland's shirt and threw it on the ground.\nInvestigation of Laura's murder\nThe next morning, Leland sat on a couch in front of a fireplace at the Great Northern Hotel, speaking to Benjamin Horne about the papers for the Norwegian businessmen to invest in his country club Horne planned to build on the land where the Packard Sawmill then stood. Leland pointed out that they had not yet acquired the land, but Ben insisted that the mill would be through within a year. Palmer then attended a conference with Norwegians about the Ghostwood Estate until he received a call from his wife and he excused himself. He answered the phone, his wife asking if Laura was with him, which he denied and she sounded worried, saying that she was not home in the morning and also did not know where Laura's boyfriend, Bobby was, so Leland said Laura must be with him. He then saw Sheriff Harry S. Truman arrive and ask to see him. Stunned, he slowly lowered the phone with his wife sobbing on the other end as Truman took off his hat. He stood and asked the Sheriff if his news concerned Laura, which Truman confirmed. Realizing his daughter was dead, he dropped the phone and began sobbing, his hand tightly grasping the Sheriff's jacket.\nHe went with Sheriff Truman to the hospital, where Doctor Will Hayward was waiting for him to identify the body. He tearfully confirmed it as Laura as soon as he saw her face.\nLeland later sat in Laura's room with Deputy Hawk, who searched for potential evidence, including Laura's diary.\nHe went to his wife the next day to tell her that Laura's best friend, Donna Hayward had come. He told Donna to try to not upset Sarah. When his wife began screaming, he came back into the room to console her.\nThe following day, Leland turned on the record player at his home and picked up a photo of Laura, beginning to spin around in circles with it, causing him to cry and scream. His wife came in and tried to stop him, but he declared that they must dance for Laura. When they broke the picture frame, cutting his hand, he began rubbing his blood over the photo.\nLeland sits on his couch the next day, watching Invitation to Love when Sarah's niece, Madeleine Ferguson arrived for Laura's funeral. They hugged and she told him she was sorry about Laura.\n \nAt Laura's funeral, Leland broke down and threw himself onto her casket.\nLeland went to the Great Northern in the evening and he began dancing but broke down and was escorted out by Deputy Hawk and FBI Special Agent Dale Cooper.\nThe next morning, as his wife described a vision she saw of a gray-haired man, Leland reminded her about the vision she had of a hand digging up Laura's necklace.\nLeland went to Ben Horne's office the next day, wishing to help with Icelandic potential business partners to occupy his mind, but Ben insisted he go home to rest. He then began crying, stating he was afraid to leave town when Ben also suggested a vacation.\nHe later went back to the Great Northern, where a gathering was taking place for the Icelandic businessmen. As Jerry Horne made an announcement, swing music began playing, causing Leland to have a breakdown and he began tearfully dancing alone until he was joined by Catherine Martell. However, he stopped dancing and began just crying, which Catherine imitated as a dance move, causing everyone in attendance to join in.\nLeland sat on his couch in the dark as he noticed Maddy sneak out of the house.\nAccording to Mark Frost, Leland followed Maddy to the park, where he attacked Doctor Lawrence Jacoby, under the possession of BOB, out of fear that Jacoby would attack Maddy. The assailant is never identified onscreen.\nHe then went to the sheriff's department, having heard that Laura's killer had been arrested. He asked Truman to confirm this, but the sheriff insisted it is just a suspect and excused himself. Doctor Hayward came to him and tells him he should have been home with Sarah, then left. Leland then said \"hospital\" and left the station.\nHe went to the hospital and set off the fire alarm before going to Jacques Renault's room and smothering him to death with a pillow. It is unclear if he killed him to avenge Laura or if, as believed by Cooper, it was to prevent any incriminating testimony.\nLeland went to his living room the next morning, with his hair having turned completely white, happily singing \"Mairzy Doats.\"\nSinging the same song, he went to Ben Horne's office to announced that he was \"back and ready.\"\nLater, he joined his family at the Haywards to hear a poem about Laura written by Harriet Hayward as Gersten Hayward played the piano. Doctor Hayward asks about his hair and Leland said that it simply happened overnight and with it, his mood had improved. He then got up and had Gersten play \"Get Happy\" so he could sing. However, he sped up the rhythm and soon fainted.\nLeland went to Ben's office the next day to say that they should soon call the Icelanders now that the mill had burned down, but found that the Horne brothers were already doing just that. He saw a police sketch of a long-haired man on an end table and recognized the man as the man from his childhood who lived next to his grandfather. He hurried out to tell the sheriff.\n \nHe went to the sheriff's station to inform the lawmen about the man in the sketch, that the man lived near his grandfather's summer house near Pearl Lakes and had the name Robertson. He would flick matches at him whilst saying \"you wanna play with fire, little boy?\"\nLeland later comforted Maddy as she was upset over the town treating her as if she was Laura. Sheriff Truman and Cooper then showed up to arrest him for the murder of Jacques.\nLeland was taken to the interrogation room at the sheriff's station and waived his right to an attorney. Sheriff Truman asked him about his activities at the hospital and he tearfully confessed to killing Jacques. Sometime during his stay at the station, he may have stashed pages from Laura's diary in a bathroom stall door, possibly for fear of being frisked.\nHe was taken before Judge Clinton Sternwood. However, the prosecutor, Daryl Lodwick was not present, so the proceedings were delayed until the next morning.\nJudge Sternwood called Leland's hearing into session at the Roadhouse, where Leland pleaded not guilty. Lodwick proposed that he be denied bail due to the seriousness of the crime, along with it being premeditated by Leland in his current state of mind. Sheriff Truman spoke for the defense, which ultimately led to Leland's release on bail until his trial.\nHe and Ben went to the latter's office the next day, Ben wanting Leland back at work while Jerry was on the road. Leland was appreciative of this and Ben told him of new potential investors from the Orient and Leland delivered a potential plan to get the investors on board.\nLater in the evening, in the Great Northern Timber Room, he sang \"Getting to Know You\" from The King and I\nThe following morning, Maddy came to tell Leland and Sarah that she would be returning home to Missoula.\n \nIn the evening, Leland looked into a mirror and straightened his tie, his reflection being that of BOB. Maddy came downstairs, complaining of something burning. Leland grabbed her and began to beat her and dance with her while saying and crying Laura's name. He then yelled, \"Leland says you're going back to Missoula, Montana!\" and slammed her head into a painting, killing her. He then placed a small piece of paper under her finger and stored her body in a golf bag.\nLeland played golf in his living room the next morning when Donna and James came to say goodbye to Maddy, but he told them that he took her to the bus station 20 minutes prior and that she was disappointed that they did not come to tell her goodbye. He was then called upstairs by his wife and came back down telling them to write to her. They left and Leland went to a mirror to straighten his tie, the reflection of BOB staring back. He went to the closet to get his jacket and golf bag - containing Maddy's body - and left.\nAt the Great Northern, he danced around the Timber Room with a golf club. Agent Cooper and Sheriff Truman came to tell him that Ben had been arrested for Laura's murder. He left the room and feigned sobbing, which soon turned into grinning laughter until Cooper followed him. When Cooper left with Truman, Leland laughed once again and danced once more.\nLeland drove recklessly while singing until he was stopped by Agent Cooper and Sheriff Truman. He claimed that his driving was caused by being distracted by thoughts of Ben. He also said that around 10:00 the night Laura died, Ben took a phone call, where he mentioned a \"dairy,\" which Cooper supposed to actually have been \"diary.\" When Truman was occupied by a call from Lucy Moran, Leland offered to show Cooper his golf clubs. He prepared to hit the special agent with a club but was unable to when he and Harry left in a rush. Leland got back into his car and adjusted his mirror, BOB staring back at him once again.\nDonna came to his home the next day to deliver a tape for Maddy of a song she recorded with Donna and James. She then revealed to him that Laura had another diary, which had been in the possession of a man named Harold Smith, who had since committed suicide. He approached Donna and the phone rang with a call from Maddy's mother. He told Donna that Maddy did not return home, but she had nothing to worry about. He left the room for lemonade, taking the time to straighten his tie in front of a mirror with BOB staring back.\nHe went to Donna with lemonade, first stroking her hair before she noticed him. Insisting that Maddy was fine, he put on a record and went to her to dance. She accepted, but he soon violently pulled her to him until they were interrupted by the doorbell. Leland let Sheriff Truman in, who said there had been another murder and he needed Leland's help.\nLeland went to the roadhouse with Truman, where Cooper said they were possibly being met by the killer. After the floor was cleared and more people arrived, including Leo Johnson and the already-present Ben Horne, Cooper said that the killer was in the room, and he would determine his identity with \"magic.\" An old waiter entered and approached Cooper with a piece of Beaman's gum. Leland commented that this brand of gum was a kind he enjoyed as a boy, and the waiter responded, \"That gum you like is going to come back in style.\" Cooper said that Ben Horne was to be brought back to the station, with Leland as his lawyer.\nAs Ben was taken to interrogation, Leland was instead pushed into the room by Cooper and Truman. This caused BOB to become rage-filled within Leland.\nHe was then restrained by Truman, who read him his rights. Through Leland, BOB laughed and howled as he was interrogated, confessing to the murders of Laura and Maddy. Satisfied with the confession, the lawmen left.\n \nHe began reciting, \"Through the darkness of futures past, the magician longs to see. One chants out between two worlds, fire walk with me. I'll catch you with my death bag. You may think I've gone insane, but I promise I will kill again!\" The sprinkler system then went off and BOB slammed Leland's head into the door. The lawmen frantically entered. With BOB gone from his being, Leland tearfully expressed his guilt over Laura's death, wishing to be forgiven. He then told the lawmen about his being possessed by BOB as a boy and the nature of this since then, that he was unable to control it and would not remember his actions. He also confessed that he was forced to kill Teresa Banks as well. As he began to fade, Cooper comforted him and he saw Laura, who had forgiven him for his acts under the command of BOB. He then died in the special agent's arms.\nThree days later, he was buried next to Laura.\nIn the red room\n \nCooper later encountered a grinning black-haired doppelganger of Leland in the Black Lodge, who said, \"I did not kill anybody.\" He then smiled to Cooper's doppelganger.\nIn late 2016, on two occasions, Leland appeared to Cooper and told him to find Laura.\nAnother 1989\nOn the evening of February 23, Leland glared at Laura menacingly from the window of their home as she jumped on James Hurley's motorcycle. The same evening, however, Laura disappeared, never to be seen again. Her case was investigated by the sheriff's department and the FBI, but no leads were found on her whereabouts.\nOne year to the day after she disappeared, Leland shot himself while sitting in his parked car near White Tail Falls.\nRelationships\n\nBOB\nIt was difficult to tell when Leland was truly in control of himself or when he was being possessed by BOB. It was unclear if Leland killed Jacques Renault on his own to avenge Laura or to cover his tracks since he was a witness, Cooper theorized. Leland seemed lost from that point onward: he was no longer able to stop BOB and was completely taken over which was physically manifested by his hair turning white and a dramatic change in behavior with his maniacal dancing. The changes from this point helped Dale Cooper to finally identify him as BOB's \"host.\"\nNon-canon appearances\n\nInternational Pilot\nThis section only covers the alternate ending presented in the International Pilot.\nLeland calls Lucy Moran, trying to get a hold of Sheriff Truman. He tells Lucy that Sarah believes she saw the killer in Laura's room. She tells him that she will contact the Sheriff and Deputy Hawk.\nSaturday Night Live sketch\nLeland (played by Phil Hartman) goes to Agent Cooper's room at the Great Northern to thank him after Leo Johnson confesses to Laura's murder. He hugs him, saying he will miss him and asks Cooper to dance with him. However, the agent says Laura's killer is still at large. Leland has a breakdown and leaves.\nBehind the scenes\nRay Wise plays Leland and reprised the role in the 2017 revival."}