{"name": "Leo_Johnson", "url": "https://twinpeaks.fandom.com/wiki/Leo_Johnson", "text": "Leo Johnson\nLeo Abel Johnson was a trucker who also moonlighted as Twin Peaks' primary source of narcotics, which he obtained from the Renault brothers, and trafficked it over the Canadian/US border for distribution in Twin Peaks. Because of his criminal versatility, Sheriff Harry S. Truman had never been able to obtain any evidence of his criminal dealings.\nLeo was married to Shelly, one of the waitresses at the town diner. Due to his volatile temper, he regularly beat her for both real and imagined transgressions, ranging from her infidelity with high school footballer Bobby Briggs to his dissatisfaction with the way she washed the kitchen floor. Shelly once said Leo married her with the intention of having a maid he wouldn't have to pay.\nBiography\n\nCriminal background\nAccording to his criminal record, Johnson made an illegal u-turn in April 1986.\nIn November of the next year, Leo was arrested for drunk and disorderly conduct.\nWhile in Twin Peaks, Washington, Johnson met Shelly McCauley, who was then a junior in high school. Three weeks after their initial meeting at the Roadhouse, the two were married by a local justice of the peace.\nLeo was incarcerated in Hungry Horse, Montana on February 9, 1988. In September of that year, he was arrested for aggravated assault, but the charges were dropped.\nAt some point, he sent an ad into Flesh World containing a picture of his truck.\nOn a day in mid-February 1989, Leo abused his wife, lecturing her on how to clean the house. Bobby Briggs then called, requesting a shipment of cocaine to sell, but Leo refused, as Bobby owed him $5,000.\nLeo, Jacques Renault, and Ronette Pulaski met Laura near a cabin on the night of February 23, where they engaged in sex and cocaine. At some point during the night, Leo hit Jacques in the head with a bottle and Jacques used Leo's shirt to soak up his blood. Jacques tied Laura up against her will and after he had his way with her, she requested Leo to untie her, but he angrily refused after seeing Jacques unconscious outside. He got his belongings out and drove away.\nLaura Palmer investigation\n \nThe next morning, Laura was found dead on the shore of Black Lake, wrapped in plastic. Later, as Shelly watched news coverage on Laura's death, Leo examined the ash tray at his home, noticing that there were different types of cigarette butts. When he questioned her, Shelly said she just smoked whatever she found at the diner, but he advised that she start smoking one brand from then on, and threatened her life if she did not so as he said.\nLeo was cleaning his truck the next day when Shelly came out to him. When she said she had finished doing laundry, he gave her another load and commanded her to do it then. When Norma Jennings arrived to take Shelly to work, Leo told his wife to save him a piece of pie, for he possibly planned to go by the diner.\nLater, he frantically searched for the shirt Jacques had used but did not find it.\nHe later cut open a football as Shelly got home. He put a bar of soap into a sock and questioned her about his missing shirt before beating her.\nLeo went to the woods the next night to see Bobby Briggs and Mike Nelson, who owed him $10,000, but was told that Laura had the money. He said that he knows Shelly had been cheating on him, but he did not say if he knew with whom. He then told them to \"go out for a pass\" and threw the football in which he left some of the drugs they had paid for.\nThe next day, he was visited by Sheriff Harry S. Truman and FBI Special Agent Dale Cooper, who questioned him about Laura Palmer, but he denied knowing her personally. He also denied having a criminal record, but this was quickly refuted by Cooper. He said he was on the road at the time Laura was killed and said that his wife would confirm this.\nHe later received a call from Jacques Renault, who informed him that his brother, Bernard, was in trouble and requested Leo to pick him up. He left as Shelly got back from work.\nLeo met with Benjamin Horne in the woods the next night and showed him the body of Bernard Renault, saying that he killed him. They then arranged to have Leo burn down the Packard Sawmill.\nLeo came home the next night and loaded gas cans into his pickup truck. He was then beaten and threatened by Hank Jennings before he went inside. He commanded Shelly to get him a beer, but when she asked him what happened, he angrily shoved her to the floor and she pulled out a pistol. As he stalked toward her, she shot him in the arm and he fled.\nFrom his pickup truck, Leo spied on Bobby going to the Johnson home to see Shelly, who welcomed him with a hug. He aimed a rifle, waiting for a shot at Bobby, but heard a radio transmission from the sheriff's department regarding a bird and he quickly got inside his truck.\nHe later went outside the sheriff's station and shot Jacques's bird, Waldo.\nThe following night, he entered his home as Shelly washed her hair in the kitchen sink. When she reached for her towel, Leo grabbed her and took her to the mill, where he tied her up and brought gasoline into the building. He set the bomb and showed it to Shelly, noting his plans to kill Bobby before the bomb went off in an hour.\nLeo went to his home and waited. Bobby soon arrived, looking for Shelly. As he tried to kill Bobby with an ax, Leo was shot through his living room window. Unable to move, Leo watched the TV, where a character was shot in Invitation to Love.\nCatatonia\nAfter being found by Deputy Andy Brennan, Leo was taken to the hospital and was hooked up to tubes, the bullet having been lodged in his spine. It was removed, but it was feared that he was possibly paralyzed.\nLeo returned home days later as an invalid confined to a wheelchair. He was pushed through his home by Bobby, who bumped him into several objects as Leo was only capable of sitting, staring, and moaning.\nBobby and Shelly later threw a party, celebrating his current condition as he sat and breathed into a kazoo. Bobby brought over a cake and Leo fell into it.\nThe following day, he sat in his wheelchair at his kitchen table and began to scream. He then spat and said, \"New shoes.\"\nHe later continued to spit and say \"new shoes\" as Bobby and Mike broke the heel off of one of Leo's boots and found a micro-cassette.\nLeo was wheeled into the roadhouse two days later, where Agent Cooper used \"magic\" to determine the identity of Laura's killer: Leland Palmer.\nLeo was used the next day to prop up a mirror used by Bobby as he put on one of Leo's suits.\nShelly later brushed his teeth. When she went to answer a call from Bobby, Leo moved.\nA few days later, Leo was fed by Shelly and he spat on her.\n \nLater at night, he was standing on his own and grinned at Shelly as the power to their house fluctuated.\nAs Shelly tried to escape their home, Leo managed to keep her inside. He picked up an ax and prepared to kill her, but was stopped by Bobby. Leo pinned him against the wall with the ax handle but was then stabbed in the leg by Shelly. He escaped through a hole cut in the plastic covering the home's unfinished wall.\nLeo wandered through the woods until he found a cabin and went inside, where a man named Windom Earle welcomed him in.\nWith Windom Earle\nLeo woke the next morning to find that Earle had found his criminal history. Leo stood, but Earle knocked him down and pinned him, declaring Leo to be a pawn to him and he placed a shock collar on him.\nEarle forced him to transcribe a poem and showed him pictures of Donna, Shelly, and Audrey, asking which one would be his queen.\nOver the next two days, he was further used by Earle as a sort of servant, including making arrows for him and bringing him his belongings such as his slippers, pipe, and a newspaper.\nLeo sat by while Earle listened in on a conversation at the sheriff's station through a bugged bonsai plant. Earle had Leo pick a card from a deck and announced that the winner of the Miss Twin Peaks Contest would die.\nThe following day, Earle told Leo about a good place called the White Lodge and an evil place called the Black Lodge.\nLater, Leo gave Rusty Tomasky—a youth lured to the cabin by Earle's promises of beer—a sip of beer while he was inside of a large chess pawn constructed by Earle. Earle then got out a crossbow and told Leo to get him an arrow. However, he refused and was promptly shocked by his collar until he complied. Earle then fired the arrow at Rusty, killing him.\nThe next day, Earle told Leo that he wished to question Major Garland Briggs, who previously worked with him on Project Blue Book.\nLater, Earle told Leo about the dugpas and how much he would have appreciated them. He spotted the card with Shelly's face on it and said her name. Earle asked Leo if he would mourn her death, perhaps even help him kill her if she won Miss Twin Peaks. Leo denied this and points the shock collar remote at Windom, who backed away, feigning fear until Leo shocked himself.\nIn a horse costume, he and Earle later incapacitated Briggs.\nLeo watched as Earle interrogated Briggs, then was commanded to put him to bed.\nLeo was chained up in the cabin by Earle, with Major Briggs, who was still dazed and confused from having been drugged by Earle, by his side. He managed to reach a desk containing a key, but it was to Briggs' restraints. He freed him and shook him awake, telling him to save Shelly. As Briggs made his escape, Leo gazed at the card with Shelly's face. Earle returned to discover that Briggs was gone. He quickly concluded that Leo had freed him, and expressed insincere regret that Leo had betrayed him like that. Earle then mockingly told him that, in spite of everything, he had grown rather fond of him and that he had been a great assistant and sounding board, but it was time for them to part ways. He then waved a bag in front of Leo while grinning.\n \nLater, Earle left the cabin for good, with a nest of tarantulas above Leo's head, ready to fall if he were to let go of a string between his teeth.\nEventually, Leo, while still on the floor of the cabin, was fatally shot five times in the chest by an unknown assailant. His body was discovered by the FBI along with Earle's hideout, and an autopsy was performed by Albert Rosenfield on April 1, in which he stated the killer stood \"Bureau style,\" judging by scuff marks near the cabin's door. Due to this evidence, Rosenfield theorized that Earle was responsible.\nAnother 1989\nOn the night of February 23, Leo waited for Laura Palmer on a fire road near the intersection of Sparkwood and Highway 21, along with Jacques Renault and Ronette Pulaski. However, Laura never appeared.\nDuring the course of the night, Leo, Jacques, and Ronette ended up visiting an abandoned train car in the nearby woods. Ronette was found the next morning wandering along a rail bridge into Idaho. In the following days, Leo was questioned in relation to Laura's disappearance, but was never indicted.\nNon-canon appearances\n\nSaturday Night Live sketch\n \nLeo (played by Chris Farley) confesses to murdering Laura and is brought to Agent Cooper's room at the Great Northern, ready to do his time, but also demanding a beer.\nLeland comes in to thank Cooper for finding the man who killed Laura, but the agent says the murderer is still at large. Audrey Horne then comes in and Leo interrupts to show Cooper photos of him about to kill Laura, killing Laura, and wrapping Laura's body in plastic. The agent is still unconvinced.\nCooper picks up a rock, saying that if he breaks the window with it, Leo is innocent. He throws the rock and breaks the window, but this only irritates Leo, who says that he sent Cooper several notes in which he confessed to the crime.\nAs Sheriff Truman and Deputy Andy escort him out, Cooper asks who had shot him one night at the hotel, and Leo confesses.\nBehind the scenes\nLeo was played by Eric Da Re, son of Twin Peaks casting director Johanna Ray and actor Aldo Ray, the latter having been originally cast in David Lynch's 1984 film Dune, until he was replaced by Patrick Stewart due to his alcoholism.\nIn the original script for Episode 29, Deputy Hawk and Major Briggs come to the cabin and Leo smiles when he sees them, which then causes the tarantulas to fall. Leo's screams and gunfire are then heard.\nTrivia\nIn Twin Peaks: Access Guide to the Town, a photo of Twin Peaks High School's 1968 football team identifies a John Johnson. It is unknown if he has any relation to Leo.\nIn The Secret History of Twin Peaks, although agent Tamara Preston explicitly stated Ray Palmer not to be related to the Palmer family of Twin Peaks and President Truman not to be related to the Truman family, she did not write anything about a possible link between 'Liver-Eating' Johnson and Leo Johnson's family. Incidentally, a picture of a mountain man is seen in Leo Johnson's house in Episode 6.\nGallery\nLeo's truck in a Flesh World ad"}