{"name": "Location_Guide", "url": "https://twinpeaks.fandom.com/wiki/Location_Guide", "text": "Location Guide\nFor descriptions of locations seen in the show, see Twin Peaks, Washington\n\"Location Guide\" is a featurette originally released in the 2007 DVD set, Twin Peaks: Definitive Gold Box Edition. It was later re-released in the Blu-ray sets, Twin Peaks: The Entire Mystery and Twin Peaks: From Z to A.\nAs the title states, it is a guide to finding the real-life filming locations seen in Twin Peaks and Twin Peaks: Fire Walk with Me.\nThe locations shown are:\nWelcome sign at SE Renig Rd., .25 Mile West of 428th & Renig, North Bend, WA\nBlue Pine Lodge kitchen and exterior where Laura was found and Great Northern interiors at the Kiana Lodge 14976 Sandy Hook Rd. NE, Poulsbo, WA\nLaura's log\nPackard Sawmill at Weyerhaeuser Paper Mill 7001 396th Dr. SE Snoqualmie, WA\nSheriff's station at Weyerhaeuser Paper Mill offices 7001 396th Dr. SE Snoqualmie, WA\nGreat Northern Hotel exterior at Snoqualmie Falls, Salish Inn and spa, 6501 Railroad Ave., Snoqualmie, WA\nRonette's bridge at 396th Dr. and SE Renig Rd., Snoqualmie, WA\nDouble R Diner at Twede's café (formerly Mar-T) 137 West North Bend Way, North Bend, WA\nThe Roadhouse at Colonial Inn 4200 Preston Fall City Rd. SE Fall City, WA\nA short interview segment with Phoebe Augustine is seen in the segment for Ronette's bridge.\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}