{"name": "Log_Lady_introductions", "url": "https://twinpeaks.fandom.com/wiki/Log_Lady_introductions", "text": "Log Lady introductions\n \nThe Log Lady introductions are a series of short monologues by Catherine E. Coulson in character as Margaret Lanterman (the Log Lady), intended to introduce each episode of Twin Peaks (1990–91). The vignettes were written and directed by David Lynch in 1993 for the syndicated re-airing of the series on the Bravo network.\nIn each short, the Log Lady, sitting in her cabin and holding the log, speaks to the camera, usually touching obliquely on the plot or theme of the accompanying episode.\nText\n\nPilot\n\"Welcome to Twin Peaks. My name is Margaret Lanterman. I live in Twin Peaks. I am known as the Log Lady. There is a story behind that. There are many stories in Twin Peaks. Some of them are sad, some funny. Some of them are stories of madness, of violence. Some are ordinary. Yet they all have about them a sense of mystery – the mystery of life.\nSometimes, the mystery of death. The mystery of the woods. The woods surrounding Twin Peaks.\nTo introduce this story, let me just say it encompasses the all – it is beyond the \"fire\", though few would know that meaning. It is a story of many, but begins with one – and I knew her.\nThe one leading to the many is Laura Palmer. Laura is the one.\"\nAired on June 11, 1993. The line \"Laura is the one\" is used again by the Log Lady in Part 10.\nEpisode 1\n\"I carry a log, yes. Is it funny to you? It is not to me. Behind all things are reasons. Reasons can even explain the absurd.\nDo we have the time to learn the reasons behind human beings' varied behavior? I think not. Some take the time. Are they called detectives? Watch, and see what life teaches.\"\nAired on June 18, 1993.\nEpisode 2\n\"Sometimes ideas, like men, jump up and say, 'Hello!' They introduce themselves, these ideas, with words – are they words? These ideas speak so strangely.\nAll that we see in this world is based on someone's ideas. Some ideas are destructive, some are constructive. Some ideas can arrive in the form of a dream. I can say it again: Some ideas arrive in the form of a dream.\"\nAired on June 25, 1993.\nThe dialogue may refer to Cooper's dream.\nEpisode 3\n\"There is a sadness in this world, for we are ignorant of many things. Yes – we are ignorant of many beautiful things. Things like the truth. So sadness in our ignorance is very real. The tears are real. What is this thing called a tear? There are even tiny ducts – tear ducts – to produce these tears should the sadness occur.\nThen the day when the sadness comes. Then we ask, 'Will the sadness which makes me cry, will the sadness that makes me cry my heart out, will it ever end?' The answer, of course, is yes. One day, the sadness will end.\"\nAired on July 2, 1993.\nEpisode 4\n\"Even the ones who laugh are sometimes caught without an answer. These creatures who introduce themselves, but we swear we have met them somewhere before, yes? Look in the mirror. What do you see? Is it a dream, or a nightmare? Are we being introduced against our will? Are they mirrors? I can see the smoke. I can smell the fire. The battle is drawing nigh.\"\nAired on July 9, 1993.\nEpisode 5\n\"I play my part on life's stage. I tell what I can to form the perfect answer. But that answer cannot come before all are ready to hear, so I tell what I can to form the perfect answer. Sometimes my anger at the fire is evident. Sometimes it is not anger, really – it may appear as such, but could it be a clue? The fire I speak of is not a kind fire.\"\nAired on July 16, 1993.\nThe dialogue likely refers to her telling the log's witness statement on Laura's murder to the Sheriff's Department.\nEpisode 6\n\"Beauty is in the eye of the beholder. Yet there are those who open many eyes. 'Eyes are the mirror of the soul,' someone has said, so we look closely at the eyes to see the nature of the soul. Sometimes when we see the eyes – those horrible times when we see the eyes – eyes that have no soul, then we know a darkness. Then we wonder: where is the beauty? There is none, if the eyes are soulless.\"\nAired on July 23, 1993.\nThe dialogue may refer to One Eyed Jacks.\nEpisode 7\n\"A drunken man walks in a way that is quite impossible for a sober man to imitate, and vice versa. An evil man has a way, no matter how clever. To the trained eye, his way will show itself.\nAm I being too secretive? No. One can never answer questions at the wrong moment. Life, like music, has a rhythm. This particular song will end with three sharp sounds, like deathly drumbeats.\"\nAired on July 30, 1993.\nThe dialogue refers to Cooper being shot three times and also possibly to Leland Palmer showing his evil side while killing Jacques Renault.\nEpisode 8\n\"Hello again. Can you see through a wall? Can you see through human skin? X-rays see through solid, or so-called solid objects. There are things in life that exist, yet our eyes cannot see them. Have you ever seen something startling that others cannot see? Why are some things kept from our vision? Is life a puzzle?\nI am filled with questions. Sometimes my questions are answered. In my heart, I can tell the answer is correct. I am my own judge. In a dream, are all the characters really you? Different aspects of you? Do answers come in dreams?\nOne more thing. I grew up in the woods. I understand many things because of the woods. Trees standing together, growing alongside one another, providing so much. I chew pitch gum. On the outside – let's say, of the Ponderosa pine – sometimes pitch oozes out. Runny pitch is no good to chew. Hard, brittle pitch is no good. But in between these exists a firm, slightly crusted pitch with such a flavor. This is the pitch I chew.\"\nAired on August 6, 1993.\nThe dialogue refers to Cooper's cryptic vision of the Giant and her chewing gum at the Double R.\nEpisode 9\n\"As above, so below. The human being finds himself, or herself, in the middle. There is as much space outside the human, proportionately, as inside.\nStars, moons, and planets remind us of protons, neutrons, and electrons. Is there a bigger being walking with all the stars within? Does our thinking affect what goes on outside us, and what goes on inside us? I think it does.\nWhere does creamed corn figure into the workings of the universe? What really is creamed corn? Is it a symbol for something else?\"\nAired on August 13, 1993.\nThe dialogue describes the nature of creamed corn. It also parallels one of the Man from Another Place lines from Twin Peaks: Fire Walk with Me: \"Going up and down. Intercourse between the two worlds.\" It also is similar to a line from Mrs. Tremond cut from the movie script: \"Why not be composed of materials and combinations of atoms?\".\nEpisode 10\n\"Letters are symbols. They are building blocks of words, which form our language. Languages help us communicate. Even with complicated languages used by intelligent people, misunderstanding is a common occurrence. We write things down sometimes – letters, words – hoping they will serve us and those with whom we wish to communicate. Letters and words, calling out for understanding.\"\nAired on August 20, 1993.\nThe dialogue probably refers to BOB's printed letters under the fingernails of his victims, one being found on Ronette during the episode.\nEpisode 11\n\"Miscommunication sometimes leads to arguments, and arguments sometimes lead to fights. Anger is usually present in arguments and fights. Anger is an emotion, usually classified as a negative emotion. Negative emotions can cause severe problems in our environment and to the health of our body.\nHappiness, usually classified as a positive emotion, can bring good health to our body, and spread positive vibrations into our environment. Sometimes when we are ill, we are not on our best behavior. By ill, I mean any of the following: physically ill, emotionally ill, mentally ill, and/or spiritually ill.\"\nAired on August 27, 1993.\nThe dialogue may refer to Leland's illness state.\nEpisode 12\n\"Sometimes nature plays tricks on us and we imagine we are something other than what we truly are. Is this a key to life in general? Or the case of the two-headed schizophrenic? Both heads thought the other was following itself. Finally, when one head wasn't looking, the other shot the other right between the eyes, and, of course, killed himself.\"\nAired on September 3, 1993.\nThe dialogue may refer to Leland relationship with BOB.\nEpisode 13\n\"Sometimes we want to hide from ourselves. We do not want to be us. It is too difficult to be us. It is at these times that we turn to drugs and alcohol or behavior to forget that we are ourselves. This is – of course – only a temporary solution to a problem which is going to keep returning, and sometimes these temporary solutions are worse for us than the original problem.Yes, it is a dilemma. Is there an answer? Of course there is. A wise person once said with a smile, the answer is within the question.\"\nAired on September 10, 1993.\nThe dialogue probably refers to Gerard temporarily subduing Mike with his use of the haloperidol drug.\nEpisode 14\n\"A poem as lovely as a tree.\nAs the night wind blows, the boughs move to and fro; the rustling, the magic rustling that brings on the dark dream. The dream of suffering and pain; pain for the victim, pain for the inflicter of pain – a circle of pain, a circle of suffering.\nWoe to ones who behold the pale horse.\"\nAired on September 17, 1993.\nThe dialogue likely refers to the pale horse seen by Sarah Palmer and the golden circle mentioned by Mike.\nEpisode 15\n\"Food is interesting; For instance, why do we need to eat? Why are we never satisfied with just the right amount of food to maintain good health and proper energy? We always seem to want more and more. When eating too much the proper balance is disturbed, and ill health follows. Of course, eating too little food throws the balance off in the opposite direction, and there is the ill health coming at us again. \nBalance is the key. Balance is the key to many things. Do we understand balance? The word 'balance' has seven letters. Seven is difficult to balance, but not impossible – we are able to divide. There are, of course, the pros and cons of division.\"\nAired on September 24, 1993.\nEpisode 16\n\"So now the sadness comes. The revelation. There is a depression after an answer is given. It was almost fun not knowing. Yes, now we know. At least we know what we sought in the beginning. But there is still the question, why? And this question will go on and on until the final answer comes. Then the knowing is so full there is no room for questions.\"\nAired on October 1, 1993.\nThe dialogue possibly refers to how David Lynch wanted to not reveal the killer, but was pressured to do so by the show producers.\nEpisode 17\n\"Complications set in--yes, complications. How many times have we heard: 'it's simple'. Nothing is simple. We live in a world where nothing is simple. Each day, just when we think we have a handle on things, suddenly some new element is introduced and everything is complicated once again.\nWhat is the secret? What is the secret to simplicity, to the pure and simple life? Are our appetites, our desires undermining us? Is the cart in front of the horse?\"\nAired on October 8, 1993.\nThe dialogue probably refers to the many plotlines developing now that Laura's investigation is now over.\nEpisode 18\n\"Is life like a game of chess? Are our present moves important for future success? I think so. We paint our future with every present brush stroke.\nPainting. Colors. Shapes. Textures. Composition. Repetition of shapes. Contrast. Let nature guide us. Nature is the great teacher. Who is the principal?\nSometimes jokes are welcome. Like the one about the kid who said: 'I enjoyed school. It was just the principal of the thing.'\"\nAired on October 15, 1993.\nThe dialogue probably refers to Windom Earle's ongoing chess game with Cooper.\nEpisode 19\n\"Is a dog man’s best friend? I had a dog. The dog was large. It ate my garden, all the plants, and much earth. The dog ate so much earth it died. Its body went back to the earth. I have a memory of this dog. The memory is all that I have left of my dog. He was black and white.\"\nAired on October 22, 1993.\nThe dialogue probably refers to the Dead Dog Farm.\nEpisode 20\n\"My husband died in a fire. No one can know my sorrow. My love is gone. Yet, I feel him near me. Sometimes I can almost see him. At night when the wind blows, I think of what he might have been. Again I wonder: why? \nWhen I see a fire, I feel my anger rising. This was not a friendly fire. This was not a forest fire. It was a fire in the woods. This is all I am permitted to say.\"\nAired on October 29, 1993.\nEpisode 21\n\"The heart -- it is a physical organ, we all know. But how much more an emotional organ -- this we also know. Love, like blood, flows from the heart. Are blood and love related? Does a heart pump blood as it pumps love? Is love the blood of the universe?\"\nAired on November 5, 1993.\nThe dialogue may refer to Cooper's relationship with Caroline Earle revealed in the episode.\nEpisode 22\n\"A death mask. Is there a reason for a death mask? It is barely a physical resemblance--in death, the muscles so relaxed, the face so without the animating spark. A death mask is almost an intrusion on a beautiful memory. And yet, who could throw away the casting of a loved one? Who would not want to study it longingly, as the distance freight train blows its mournful tone?\"\nAired on November 12, 1993.\nThe dialogue probably refers to the death mask left by Windom in Cooper's room.\nEpisode 23\n\"A hotel. A nightstand. A drawer pull on the drawer. A drawer pull of a nightstand in the room of a hotel. What could possibly be happening on or in this drawer pull? How many drawer pulls exist in this world? Thousands, maybe millions? What is a drawer pull? \nThis drawer pull - why is it featured so prominently in a life or in a death of one woman who was caught in a web of power? Can a victim of power end, in any way, connected to a drawer pull? How can this be?\"\nAired on November 19, 1993.\nThe dialogue refers to Josie Packard being trapped in a wooden drawer knob.\nEpisode 24\n\"Sometimes, well let’s say all times, things are changing. \nWe are judged as human beings on how we treat our fellow human beings. How do you treat your fellow human beings? \nAt night, just before sleep, as you lay by yourself in the dark, how do you feel about yourself? Are you proud of your behavior? Are you ashamed of your behavior? \nYou know in your heart if you have hurt someone, you know. If you have hurt someone, don’t wait another day before making things right. The world could break apart with sadness in the meantime.\"\nAired on November 26, 1993.\nThe dialogue probably refers to Benjamin Horne's efforts to become a good man.\nEpisode 25\n\"The beautiful thing about treasure is that it exists. It exists to be found. How beautiful it is to find treasure. Where is the treasure, that when found, leaves one eternally happy? I think we all know it exists. Some say it is inside us--inside us one and all. That would be strange. It would be so near. Then why is it so hard to find, and so difficult to attain?\"\nAired on December 3, 1993.\nEpisode 26\n\"Pie. Whoever invented the pie? Here was a great person. In Twin Peaks, we specialize in cherry pie and huckleberry pie. We do have many other types of pie, and at the Double R Diner, Norma knows how to make them all better than anyone I have ever known.\nI hope Norma likes me. I know I like her and respect her. I have spit my pitch gum out of my mouth onto her walls and floors and sometimes onto her booths. Sometimes I get angry and do things I'm not proud of. I do love Norma's pies. I love pie with coffee.\"\nAired on December 10, 1993.\nEpisode 27\n\"There are clues everywhere, all around us. But the puzzle maker is clever. The clues, although surrounding us, are somehow mistaken for something else. And the something else, the wrong interpretation of the clues, we call our world. Our world is a magical smoke screen. How should we interpret the happy song of the meadowlark or the robust flavor of a wild strawberry?\"\nAired on December 17, 1993.\nEpisode 28\n\"A log is a portion of a tree. At the end of a crosscut log -- many of you know this -- there are rings. Each ring represents one year in the life of the tree. How long it takes to a grow a tree!\nI don't mind telling you some things. Many things I, I musn't say. Just notice that my fireplace is boarded up. There will never be a fire there.\nOn the mantelpiece, in that jar, are some of the ashes of my husband.\nMy log hears things I cannot hear. But my log tells me about the sounds, about the new words. Even though it has stopped growing larger, my log is aware.\"\nAired on December 24, 1993. In this intro, Margaret holds the log directly in front of her, instead of the usual position cradled in her arms. She turns the end of the log to the camera while talking about crosscut logs. For once the camera moves to another part of the cabin, showing the fireplace where the opening is covered by plywood, and later the mantel where is a vase, a pipe stand, and some old pictures.\nEpisode 29\n\"And now, an ending. Where there was once one, there are now two. Or were there always two?\nWhat is a reflection? A chance to see two? When there are chances for reflections, there can always be two--or more. Only when we are everywhere will there be just one.\nIt has been a pleasure speaking to you.\"\nAired on December 24, 1993. Throughout the dialogue, the camera has been slowing zooming in until only the Log Lady's face is framed. As she finishes speaking, the camera continues to zoom in. As it gets closer and closer, the Log Lady looks nervously up, down, and to her left, before staring straight ahead as the camera moves in through her left glass frame. As the iris of her left eye fills the screen, the screen turns completely white, then a hissing sound is heard, and finally a 'door slamming' sound as the screen turns from white to black.\nThe dialogue probably refers to doppelgangers.\nProduction staff\nCatherine E. Coulson as Margaret Lanterman (uncredited)\nWritten and directed by David Lynch (uncredited)\nvteTwin PeaksTwin Peaks\n\"Pilot\"\n\"Episode 1\"\n\"Episode 2\"\n\"Episode 3\"\n\"Episode 4\"\n\"Episode 5\"\n\"Episode 6\"\n\"Episode 7\"\n\"Episode 8\"\n\"Episode 9\"\n\"Episode 10\"\n\"Episode 11\"\n\"Episode 12\"\n\"Episode 13\"\n\"Episode 14\"\n\"Episode 15\"\n\"Episode 16\"\n\"Episode 17\"\n\"Episode 18\"\n\"Episode 19\"\n\"Episode 20\"\n\"Episode 21\"\n\"Episode 22\"\n\"Episode 23\"\n\"Episode 24\"\n\"Episode 25\"\n\"Episode 26\"\n\"Episode 27\"\n\"Episode 28\"\n\"Episode 29\"\nTwin Peaks (2017)\n\"Part 1\"\n\"Part 2\"\n\"Part 3\"\n\"Part 4\"\n\"Part 5\"\n\"Part 6\"\n\"Part 7\"\n\"Part 8\"\n\"Part 9\"\n\"Part 10\"\n\"Part 11\"\n\"Part 12\"\n\"Part 13\"\n\"Part 14\"\n\"Part 15\"\n\"Part 16\"\n\"Part 17\"\n\"Part 18\"\nInternational Pilot\nTwin Peaks: Fire Walk with Me (The Missing Pieces)\nLog Lady introductions\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}