{"name": "Lucy_Brennan", "url": "https://twinpeaks.fandom.com/wiki/Lucy_Brennan", "text": "Lucy Brennan\nLucy Brennan (née Moran) was the receptionist at the Twin Peaks Sheriff's Department.\nAfter a lengthy on-and-off relationship with Deputy Andy Brennan, the couple married and raised a son, Wally Brando.\nBiography\nLucy attended Tacoma High School and Mrs. Smith's School of Secretarial Science.\nBy February 1989, Lucy had been in an on-and-off-again relationship with Deputy Andy Brennan. During a break, she went out with Dick Tremayne.\nOne day, Lucy called Andy and Sheriff Harry S. Truman over the intercom to let them know that Josie Packard claimed she heard a prowler. Harry, apparently being summoned for one of his regular rendezvous with Josie, left Andy in the room. Lucy continued speculating over what the prowler may have been, not realizing Harry had already left the room, resulting in her screaming with surprise when he showed up right in front of her. Andy, hearing this scream, ran to see what the trouble was, while Lucy continued to speak over the intercom asking if he was still there. She then left her desk and they ended up colliding in the hallway.\nOn the morning of February 23, Lucy patched through a call from Pete Martell to Sheriff Truman after he discovered the body of Laura Palmer wrapped in plastic.\n \nLater, she received a call from Andy, who helped find a train car where the murder took place. He told her to tell Harry that he did not cry and she tried to comfort him.\nShe later listened in to a conversation between Bobby Briggs and Mike Nelson, who planned to beat a biker with the initial 'J.' When she went to report her finding to FBI Special Agent Dale Cooper, he was already steps ahead of her, as he saw the reflection of a bike in Laura's eye in a video taken of her.\nShe later patched through a call from Doctor Will Hayward to Sheriff Truman regarding his daughter, Donna sneaking out.\nWhen Donna was seen at the Roadhouse, Truman told her to send two backup units and to tell Hayward that his daughter was safe. When Truman brought in James Hurley for questioning, he had Lucy prepare an arrest form and she set out an arrangement of donuts for Cooper and Truman. After Truman recommended to Cooper that he stay at the Great Northern Hotel, Lucy gave him directions.\nWhen Agent Cooper arrived at the sheriff's station in the morning, she ate breakfast and told him that she got him jelly donuts and that Sheriff Truman was waiting for him in the conference room.\nLucy later received a long-distance call from FBI Agent Albert Rosenfield for Cooper and she handed over the phone to him.\n \nThe following day, she assisted Sheriff Truman and Deputy Hawk in setting up a bottle sixty feet and six inches from where she was standing, per Agent Cooper's orders. She offered all of the men coffee, to which they all enthusiastically accepted and Cooper highly approved of it. She watched Cooper's presentation of Tibet and a method he had derived from them to determine what individuals with the initial 'J' could have been involved in the case. He had Lucy put check marks next to the names when the bottle was hit. The rock for Doctor Lawrence Jacoby hit the bottle but did not break it. When the \"Jack with one eye\" on the list was determined to possibly mean the casino One Eyed Jacks, Lucy removed it from the list. Then when the rock was thrown for Leo Johnson was thrown, the bottle broke. Later, Albert Rosenfield arrived in Twin Peaks and impatiently had Lucy inform Agent Cooper of his arrival.\nLucy went with Sheriff Truman to the Great Northern Hotel the next morning to meet with Agent Cooper, who had stated to Harry that he knew who killed Laura Palmer. However, he did not remember the name of the killer.\nThe following day, Lucy intently watched Invitation to Love when Harry and Andy came. The sheriff asked her \"what's going on?\" and she responded with the events of the television show, but he clarified that he meant at the station and she told him Cooper was waiting in the conference room with Doctor Jacoby. When he went, Andy stays behind, asking why he could not spend the previous night with her, but she ignored the question and asked if he would be having coffee.\nLater, she paged Agent Cooper when his superior, Regional Bureau Chief Gordon Cole called, followed by a call from Hawk.\nLucy was told by Harry to look through files confiscated from the Lydecker Veterinary Clinic and to pull out the names of all of the bird owners. When Andy told her about a mishap he had with his gun, she brushed him off.\nThe next day, Lucy called in sick.\nAndy came to see her at her desk the day she returned to work, but she again did not wish to engage in conversation with the deputy. He left when she got a phone call from her doctor. Agent Cooper then arrived, commenting on her being out sick the previous day. She later went to the conference room when it was found that the myna bird, Waldo, had been shot.\nThe next day, Lucy watered the plants at the sheriff's station as Ed Hurley and Deputy Hawk talked about Andy's heroic actions of saving the life of Sheriff Truman. Impressed, she went to the kitchen area, where Andy joined her, closing the divider behind him. They kissed until Lucy announced that she was pregnant. She went back to her desk and received a call apparently from Leo Johnson, who asked for the sheriff and said to check out James Hurley, who was an \"easy rider.\" When Sheriff Truman returned to the station, she told him about this phone call.\nAfter Agent Cooper was brought to the hospital with a gunshot wound, she stood over him with Doctor Hayward and Sheriff Truman as he came to in the morning. Truman told her to inform him that Leo Johnson had been shot, Jacques Renault was strangled, Shelly Johnson and Pete Martell had suffered smoke inhalation, Catherine Martell and Josie Packard are missing, and Nadine Hurley was in a coma from overdosing on sleeping pills. With Truman, she followed Cooper, who had left his hospital bed to resume work, against Hayward's wishes.\nBack at the station, Phillip Gerard came to sell Sheriff Truman some shoes but departed when Lucy told him that Harry was busy. Donna later showed up to see James.\nAgent Cooper later had Lucy and Andy go through copies of Flesh World to find a picture of Teresa Banks, whose murder the previous year had clear similarities to Laura Palmer's.\nShe was present in the conference room as Cooper went over the events that occurred the night Laura died. She smiled proudly as Andy stood up to Albert Rosenfield and his insults.\nThe following day, a fly buzzed around the receptionist's desk, much to Lucy's annoyance. Andy came in and reveals to her that he is sterile and asked how she was having a baby under this circumstance. She leaned closer to him, and while he assumed to be receiving a kiss, Lucy pulled a piece of tape off of Andy's head and shut the window.\nShe later patched through a phone call from Benjamin Horne. The station received another call, this time from someone who refused to reveal their identity, wishing to speak to Sheriff Truman. She hung up.\nLucy overheard Agent Cooper telling James to stop trying to solve Laura's murder on his own. He also checked on her as she figured out how many words contained the letters found under the fingernails of Teresa Banks, Laura Palmer, and Ronette Pulaski. Hawk came to check on her work just before Dick arrived to take her out to lunch. Hawk gave him the cold shoulder and left before they went to lunch at the Double R Diner.\nAt the diner, Dick bored Lucy with his talking about his work and the way he used his fork. She then displayed her annoyance with the fact that he had not called her in weeks despite how exciting their relationship had become. He then discussed a way to make it up to her and she proposed a maternity dress, informing him of her pregnancy.\nShe collided with Andy in a hallway at the station the next day. She noticed that he had an issue of Flesh World and was on his way to the bathroom. Disgusted, she shoved the book at him and left in a huff to the receptionist's desk.\nLucy was later approached by Andy and was still upset over catching him with the magazine. Agent Cooper came and dismissed Andy so he could talk to Lucy about her behavior as of late. She complained about the things she did not like about Andy and explained her relationship with Dick Tremayne, which had while she and Andy were on a break. He asked if she wanted to get back with Andy, but she did not know and became upset, then left the area.\nLater, she drank a coffee during a storm as Judge Clinton Sternwood arrived at the station and greeted her, asked for a hug, and noticed that she was upset. Sheriff Truman then arrived, followed by Agent Cooper. The three men went as Dick arrived, saying that he was ashamed of his own behavior and gave her $650 for an abortion. This upset her and she kicked him out of the station, giving his money back.\nLucy went to Sheriff Truman in the morning to tell him that she would be leaving to see her sister, Gwen in Tacoma, as she and her husband had a baby the previous week. She reluctantly left, escorted by the sheriff.\nShe returned to Twin Peaks a few days later with her sister, and they went to the sheriff's station, Gwen carrying her son Carl and discussing an infection she had. Lucy asked Hawk if he had seen Andy, but he shook his head.\nLater, Andy came to the sheriff's station and saw Lucy holding her nephew, which caused him to faint. She held ice to his head as Gwen rambled on and interrupted Andy's wishes to talk with Lucy in private until they told Gwen to shut up. She went away and Andy told Lucy that he could very well be the father of her child, as he had his sperm re-counted.\nAndy went to her the next day, wishing to talk about their child, but she confirmed to him that it may not have been his.\nDick came to see her at the station and she took him to a room with Andy, where she told them she wanted full cooperation from both of them throughout her pregnancy. This occurred as Leland Palmer confessed to his daughter's murder and subsequently died in custody.\nDick announced to her the next day that he had quit smoking and wished to speak about the baby while Lucy changed fluorescent light bulbs. Andy intervened, stating that there should not be any fighting between them.\nAs Agent Cooper prepared to leave Twin Peaks, he gave Lucy his best wishes for her and the baby and wished to be invited to her wedding. However, Cooper was stopped by Special Agent Roger Hardy, who told him he had been suspended from the FBI.\nA couple of days later, Lucy sat down with Judy Swain, Andy, and Dick. Judy was the case manager for Nicky Needleman, an orphan who was under Dick's care and may have been traumatized by his parents' mysterious deaths.\nDick came back to the station in the evening and passed by her to speak with Andy.\nLater she answered a call for Truman but discovered that the sheriff and all of the other men at the station had been taken by the charms of Lana Milford.\nThe next day, Lucy overheard a conversation between Andy and Dick, but they were gone when she came to investigate. She was instead met by Cooper, who had assigned her to search newspapers for a chess deal of any information about a Windom Earle.\nLater at night, Lucy explained to Truman that the station's power was out due to a bomb in the woods.\nThe following day, Andy informed Lucy that he and Dick believed that Nicky murdered his parents when he was six years old, but Lucy did not believe the boy to be capable of this.\nLater, Major Garland Briggs stumbled in, wishing to speak to the sheriff, and he collapsed. After he came to and was taken to Harry's office, Lucy brought him water.\nIn the evening, Doctor Hayward forced her, Andy, and Dick together for a meeting. The doctor shot down the accusations that Nicky murdered his parents, informing them that the boy was conceived by a rape, his mother died in childbirth, and his adoptive parents were killed in a car accident.\nA couple of days later, Sheriff Truman had Lucy call Pete to the station and to check the newspaper for any chess moves by Windom Earle.\nDuring Pete's work, he had Lucy and Andy start playing chess. She became frustrated when he moved one of his knights without doing the \"little hook thing,\" as he believed it was optional, though Pete corrected him. She then put Andy in check.\nLater in the evening, Lucy appeared as a model in the fashion show for the Stop Ghostwood campaign.\nThe next morning, Andy dropped through the ceiling in front of Lucy's desk, preparing for the Sheriff's Department's trip to Owl Cave. She had him promise he would be careful.\nLucy went to Dick's wine-tasting event the next day, again sponsored by the Stop Ghostwood campaign. There, she became fed up with Dick's snootiness.\nThe day after the wine-tasting, she asked Andy for advice on her speech for the upcoming Miss Twin Peaks Contest and told him that the next day, she would choose whether he or Dick would act as her baby's father, regardless of who it belonged to biologically.\nIn the morning, Lucy and the rest of the women participating in Miss Twin Peaks were taught some choreography by Tim Pinkle. At the contest that night, Lucy displayed her talent for dance.\nAs the judges decided on the winner, Lucy took Andy and Dick aside to announce to them that she had chosen Andy as the father of her child. Dick congratulated Andy and then went to make his vote for Miss Twin Peaks. Andy told Lucy that he was excited for his responsibility of being a father, but excused himself to talk to Agent Cooper. Following Annie Blackburn's win, chaos ensued.\nBack at the station, Andy asked Lucy if she was scared, and she confirmed this by expressing her worry that the lights at the Roadhouse were going out and that she was afraid that the same thing would happen in a hospital elevator when she was in labor. Andy declared that if this happened, he would be with her and help her have the baby inside the elevator. They shared a kiss and, for the first time, said \"I love you.\"\nLater life\nLucy had her baby, a son, on Marlon Brando's birthday, and although Andy wanted to name him Marlon, the name Wally was decided on. Andy and Lucy married at some point over the next twenty-five years and both retained their jobs in the sheriff's department.\nA man in a suit came to the station one day, asking to speak to Sheriff Truman, but he did not know whether he wanted to talk to the one who was sick, or the one who was fishing. He gave Lucy his card and left.\n \nLater, Hawk—by then promoted to Deputy Chief—called Lucy and Andy to the conference room and told them that, according to the Log Lady, there was something missing from the files he brought to the room that somehow pertained to Agent Cooper, who had gone missing since before Wally was born.\nLucy and Andy further investigated the files, but could not figure out what was missing. While meeting with Hawk, Lucy pointed out that a chocolate bunny was missing from the evidence and admitted that she had eaten it years before to relieve gas. Hawk soon brought them to the conclusion that they were not looking for the bunny.\nLater, after a phone conversation with Sheriff Frank Truman about the thermostat, she became frightened when he suddenly entered the station. Andy comforted her, trying to explain cell phones and reassured her. Soon after, Wally arrived at the station to pay his respects to Harry and give his blessing for Lucy and Andy to turn his room into a study.\nLucy later called Frank—who was in Hawk's office—to inform him that his wife, Doris, was on her way.\nLucy and Andy later shopped for a chair online, arguing over whether to get it in red or beige, Lucy arguing for the latter. Andy soon decided to let Lucy have the decision her way. However, she ordered the red chair.\nDeputy Chad Broxford later came to Lucy's desk, commenting on the weather. She recounted to him a story when Andy thought a clock had stopped and they did not realize what time it was. She then watched as Chad went out to retrieve the mail.\nFBI Deputy Director Gordon Cole later called the station and she transferred him to Sheriff Truman.\nFollowing the department's trip to Jack Rabbit's Palace, Lucy provided a woman they found with clothing.\nLucy transferred the Log Lady's final call to Hawk, who later announced to Lucy, Andy, Bobby, and Frank that Margaret had died.\nAndy later brought Cooper's doppelganger inside the station, believing him to be the real Dale Cooper. However, Lucy then received a call from the real Cooper and transferred him to Sheriff Truman. She made her way to Truman's office, where she shot and killed the doppelganger, commenting that she now knew how cell phones worked.\nShe witnessed BOB being pulled out of the doppelganger's body as the real Cooper arrived and BOB was shattered by Freddie Sykes. Cooper told all who were present that he hoped to see them again and that things would change, as the past dictated the future.\nNon-canon appearances\n\nInternational Pilot\nThis section covers only the alternate ending in the International Pilot.\nAt her home, she plays with a paddle-ball as Andy plays trumpet. She gets a phone call from Leland Palmer, who is trying to contact Sheriff Truman. He tells her that his wife believes she saw Laura's killer. She says she will contact Truman and Deputy Hawk as soon as she hangs up. Lucy hangs up the phone, then calls Sheriff Truman in his cruiser to tell him about Leland's call.\nShe then calls Agent Cooper to tell him of Leland's call. He tells her to have Harry get the sketch of the killer and go to the hospital.\nGeorgia Coffee Commercials\n\nLost\nWhen Cooper and Ken decide to discuss a case over coffee, Lucy brings some in, but Cooper rejects this coffee for a can of Georgia Coffee, which he suggests to them.\nA Mystery of \"G\"\nWhen Cooper suggests the same again, Lucy brings in several cans of Georgia Coffee.\nBehind the scenes\nLucy is played by Kimmy Robertson, who reprised the role in the 2017 series.\nTrivia\nHer last name is given as \"Morgan\" in the credits of the pilot episode.\nLucy buys all of the books for the Bookhouse Boys, her favorite being The Stand by Stephen King."}