{"name": "Maddy_Ferguson", "url": "https://twinpeaks.fandom.com/wiki/Maddy_Ferguson", "text": "Maddy Ferguson\nMadeleine \"Maddy\" Ferguson was the niece of Sarah Palmer who came to Twin Peaks for the funeral of her cousin, Laura Palmer. Maddy was several years older than Laura, but otherwise looked identical, excluding Maddy's dark hair and bookish glasses.\nBiography\n\nEarly life\nMaddy was the daughter of Beth, who lived in Missoula, Montana. She was the niece of Sarah Palmer and the cousin of Sarah's daughter, Laura.\nThe script for \"Episode 2\" identifies Maddy's father's name as Donald.\nGrowing up, Maddy was very close with Laura, so close that many would believe them to be sisters. When Maddy was sixteen, she had a boyfriend and she introduced Laura to cigarettes, and also let her try on her clothes.\nThe Secret Diary of Laura Palmer indicates that Maddy knew and befriended Donna Hayward, although they seem to first meet during the series itself.\nMaddy attended Missoula High School and by 1989, she worked for an insurance company.\nLaura's murder investigation\n \nAfter Laura was found murdered in February 1989, Maddy arrived in Twin Peaks for the funeral. She greeted her uncle Leland and told him she was sorry about Laura.\n \nThe next day, as Deputy Andy Brennan sketched a man Maddy's aunt Sarah saw in a vision, Maddy served tea to Sheriff Harry S. Truman and later went to the Double R Diner to pick up an order for her aunt and uncle. There, she met James Hurley.\nShe went to the diner the next day and met James, who introduced her to Laura's best friend, Donna Hayward. She learned that the two were doing their own investigation into the murder and wished for Maddy to find a hiding place in the Palmer house that Laura had spoken of before. The three then left the diner together.\nLater that night, having found Laura's hiding place, Maddy crept down the stairs with a box, which contained a tape.\nShe listened to the tape at with James and Donna at the latter's home the next morning. In it, Laura expressed to Doctor Lawrence Jacoby how easy it was to speak into the recorder and went on to mention a coconut connected with secrets. They noticed that the tape for the night Laura died was missing and James supposed Jacoby had it, and he suggested they went to Jacoby's office later in the night by luring him out with a \"phone call from Laura.\"\nLater, Maddy snuck out of the Palmer home to meet James and Donna in the park. She donned a blonde wig, making her look exactly like Laura. James called Jacoby and handed the phone to Maddy, who recited quotes from Laura's tape and told Jacoby she wished to see him at Sparkwood and 21 in ten minutes. She waited at the phone while James and Donna went to Jacoby's office.\nMaddy wandered around the park, waiting for Donna and James, who soon arrived to pick her up. They went back to Donna's house, where they listened to Laura's tape, in which she noted James to be sweet, but dumb, and mentioned a \"mystery man\" who drove a red corvette. James said that Jacoby did not kill Laura, but Donna asked how he got Laura's necklace.\nMaddy sat on the couch the next morning at the Palmer home, talking with her aunt, who asked if she missed her mother. However, Maddy avoided the question and told her about a dream she had, but was interrupted by Leland, who entered with his hair having turned completely white. She looked down at the floor and it began to appear to her as if it was stained with blood.\nShe meets with Donna at the Double R and gave her a pair of Laura's sunglasses. Maddy then broke her own eyeglasses, saying she hated them. She asked about James being arrested and if they were responsible for a heart attack suffered by Doctor Jacoby. She then told Donna about Leland's hair changing color.\nIn the evening, she joined Leland and Sarah at the Hayward home, where Gersten Hayward played the piano and Harriet Hayward presented a poem about Laura. There, Donna informed her that she had gotten Laura's Meals on Wheels route and was to start the next day.\n \nAt Donna's house the next evening, Maddy sang a song along with James and Donna. As the song finished, she exchanged glances with James, upsetting Donna and causing her to run out of the room. As James chased Donna and the latter received a phone call, Maddy saw a long-haired man stalk behind the couch and climb over it.\nThe following day, she went to the diner with James, where they discussed Donna's strange behavior. As James expressed his wishes to sometimes leave town, she comforted him by placing a hand on his, just as Donna entered and misinterpreted her action. Donna angrily told James about a much better man she met while working the Meals on Wheels route before storming out of the diner.\nJames later came to the Palmer home, clearly upset. He explained that his alcoholic mother had shown up. Maddy held him just as Donna showed up, once again misinterpreting their actions and leaving.\nMaddy expressed to Leland that she felt like she had fallen into a dream since she showed up and that everyone seemed to treat her as if she was Laura. Sheriff Truman and Agent Cooper then arrived to arrest Leland for the murder of Jacques Renault, a suspect in Laura's murder.\nMaddy met with Donna at the diner the next day to discuss their relationships with James. Donna changed the subject to Laura's secret diary, which was in the possession of Harold Smith.\nMaddy attended her uncle's hearing for the murder of Jacques the following evening. Leland was released on bail until his trial after a statement by Sheriff Truman.\nShe met with Donna and they planned their way to get the diary from Harold's apartment.\nShe then went to the diner to get a coffee and encountered James. He asked if she had seen Donna, which she denied and quickly left with the coffee to go to Harold's apartment, where she hid outside in the bushes. She soon saw Donna's signal for her to go inside and she did so. She was silently told by Donna where to find the diary hidden in Harold's bookshelf. However, she was caught and an upset Harold cornered them.\nAfter scratching his own face with a gardening tool, Harold expressed his disappointment in Donna betraying his trust. James then burst through the door and got the girls out, but Harold managed to take the diary back.\nShe went to the lake the next day and was joined by James, who determined that his feelings for Maddy were purely because of Donna, and Maddy spoke of her mental link to Laura and her belief that James and Donna should be together. She also told him that she would be returning home the next day. She kissed him on the cheek and said her goodbyes to him.\nShe went out to the living room in the morning to tell her aunt and uncle that she would be going back to Missoula.\nMurder\n \nIn the evening, she went down to the living room, smelling something burning and found Sarah on the floor. Leland switched between himself and the long-haired man Maddy saw and began beating her, then dancing with her. This culminated with him proclaiming, \"Leland says you're going back to Missoula, Montana!\" and slamming her head into a painting, killing her. He then placed a small piece of paper with the letter 'O' under her left ring finger and wrapped her body in plastic, which was discovered the following night.\nLeland was quickly arrested for Maddy's murder, having done so while possessed by the spirit known as \"BOB.\" However, he died in custody.\nHer doppelganger, with white irises, later appeared to FBI Special Agent Dale Cooper in the Black Lodge, telling him to \"watch out\" for her cousin.\nMark Frost suggested that Maddy would not have been murdered in the new version of events resulting from \"Part 17.\"\nBehind the scenes\nMaddy was portrayed by Sheryl Lee. The character was created when David Lynch was so impressed by Sheryl Lee's performance as Laura while filming the picnic tape and wanted to have her on the show regularly.\nMaddy's full name comes from two characters in Alfred Hitchcock's 1958 film Vertigo. The female lead character is named Madeleine and the male lead has the last name, Ferguson. Kim Novak also plays two characters in the film, much like Sheryl Lee did in Twin Peaks.\nGallery\n"}