{"name": "Mansion_room", "url": "https://twinpeaks.fandom.com/wiki/Mansion_room", "text": "Mansion room\n\"Where is this? Where are we?\"\n ―Dale Cooper\nA mansion room overlooking the purple sea was visited by Dale Cooper during his escape from the red room.\nThe \"mansion room\" is the name used by director David Lynch for this set during filming.\nProperties\nThe room had an arched ceiling and a curved sofa sitting before a large hearth, and at least two doors set on opposite sides. A window led onto a small balcony, which looked down on a vast purple body of water. A blue rose sat on a table beside a giant panel resembling a wall socket. This socket, at various times, seemed to \"connect\" to a cigarette lighter in Mr. C's car, and then to the wall socket of an empty home in Rancho Rosa Estates, Las Vegas.\nIn the back of the room, a ladder led to a hatch, which would deposit the traveler on a tiny box floating in the middle of space. On top of this \"spaceship\" was a bell-shaped machine, like those found in the Fireman's home.\nHistory\nAfter disappearing from a glass box in New York City, Dale Cooper fell through space, and soon saw a blooming purple mass in front of him. He fell onto the balcony and made his way inside the room, which was suffused with a purple aura, causing time to stutter and reverse. He found a woman with no eyes sitting before the fire, who touched his face and tried to speak, but could only make chirping sounds. Suddenly, something began banging on the two doors, and Naido urged him to be quiet. As it continued, the wall panel, which was labeled \"15,\" lit up and began humming. Cooper approached the panel, but Naido rushed over and pulled him away, waving her hand to indicate it was not safe. Instead, she led him to the rear ladder and climbed onto the roof.\n \nOutside, Naido pulled a lever on the bell-shaped device and was electrically shocked, throwing her off the ship into nothingness. After a moment, Cooper noticed the face of Major Garland Briggs floating past in the darkness, which said the words: \"Blue Rose.\"\nUpon returning to the room, Cooper found that the purple aura had disappeared, along with the skipping. Sitting on the sofa now was an American girl, who turned to look at Cooper, and then at her digital watch, which turned to 2:53. Cooper approached the wall socket again, which now had the number \"3.\" As the banging started again, the girl told Cooper that when he got \"there,\" he would already be there, and that he should leave before her mother came. As he neared the outlet, Cooper was jolted off his feet, forced headfirst into the outlet. His shoes fell off as he entered fully, landing on the floor.\nPhillip Jeffries' mechanism was situated in a room with a similar design to the mansion room, possibly the same one.\nIt is possible the room is part of the Fireman's home, although it does not appear to exist in black and white."}