{"name": "Margaret_Lanterman", "url": "https://twinpeaks.fandom.com/wiki/Margaret_Lanterman", "text": "Margaret Lanterman\n\"This is 'now,' and now will never be again.... We come from the elemental, and return to it. There is change, but nothing is lost. There is much we cannot see – air, for instance, most of the time – but knowing our next breath will follow our last without fail is an act of faith. Is it not? Dark times will always come, as night follows day. A dark age will test us all, each and every one. Trust and do not tremble in the face of the unknown. It shall not remain unknown to you for long. Robert knows this now, as will we all in the sweet by-and-by.\"\n ―Margaret Lanterman, 1986\nMargaret Lanterman (née Coulson), better known as the Log Lady, was known as such for carrying a cut log with her that she claimed had an agency to be able to perceive events. To most residents in the town, she was perceived solely as mentally ill as she often spoke in nonsequiturs. However, aside from her confusing speech patterns, she was a shaman who was able to interact with the spiritual world through the log that accurately described multiple events. Members of the Bookhouse Boys including Sheriff Harry S. Truman and Deputy Hawk recognized the Log Lady as having connections with the spiritual world, with Hawk mentioning that the log held many spirits within it.\nBiography\n\nEarly life\n \nIn her childhood, Margaret attended school at Warren G. Harding Elementary. In third grade, she met Robert Jacoby, who would become a life-long friend of hers. Jacoby noted that Margaret was unusually tall for her age, a trait that would follow her throughout life, and was a bit awkward and reserved towards her peers as a result, but he also noticed that beneath her quiet surface, she was quite intelligent and dignified.\nOn the evening of September 8, 1947, Margaret suddenly disappeared alongside classmates Carl Rodd and Alan Traherne during a school outing. The three children would reappear just as suddenly the next day, September 9, and none of them could offer any coherent account for the hours they have been gone. Margaret, alongside the two other children, was brought to the Calhoun Memorial Hospital. There, she was examined by Dr. Dan Hayward, who noted that she, like the two boys, experienced intense thirst and hunger following her disappearance, but he chalked this up to the fact that they had been lost in the wilderness for several hours. He also noticed that had a pattern of raised skin on the back of her right knee, forming three triangles. Hayward tried to question her about them, but though she complained of feeling slight pain where the marks were, she could apparently not remember where and how she got them. Hayward also noted in his report that Margaret had asked him if he thought \"the owl would be coming back,\" though she would not elaborate on what she meant by this. Hayward speculated that this strange question might be down to her memory being fuzzy as children tended to block out traumatic experiences, though he found it rather strange that the two boys did not seem to remember any details about the night either.\nMargaret returned to normal life afterward, but Jacoby quickly discovered that his friend had been marked somehow by whatever experience she had undergone, noticing that after the incident she became less playful and more quiet, internal, and watchful. Though he tried to get Margaret to talk about what had happened, she would not confide in him, but he sensed that she remembered more than she was willing to share.\nMargaret attended Twin Peaks High School and graduated in 1958. Jacoby remained friends with Margaret during their years in the high school, and even dated her a couple of times. He noticed that during this time, she kept her serious demeanor from her childhood and appeared observant and self-contained when compared to her adolescent peers. He also noted that she felt no need to engage with artificial entertainment, such as films and books, and appeared puzzled by other people's attempt to escape reality through them. Jacoby remembered one curious incident though, where he had taken Margaret out to see the science-fiction film Invaders from Mars. Margaret had been unusually deeply affected by the film, and she and Jacoby had a long conversation afterwards about the possibility of life on other planets. Jacoby noticed that during the conversation, she had insisted on using the term \"life from other places\" and had wondered what interest \"they\" had in us. \nAfter high school, Margaret attended Evergreen University, majoring in Forestry and Wildlife Management. She hoped that her degree could help her find employment in the U.S. Forest Service, but, much to her disappointment, the only job that the Forest Service offered to female applicants at the time was secretarial work. Instead, she took up a job at the Twin Peaks Town Library. She also took up an interest in environmental protection, and would spend a portion of her free time raising money for the Sierra Club.\nThrough her work for the Sierra Club, she eventually met Samson \"Sam\" Lanterman. She and Sam fell in love and got married, but Margaret was almost immediately widowed, as Sam was a volunteer fireman and was called out to a forest fire during their wedding reception. The very same evening, Sam perished in the fire after falling into a burning ravine. The following day, she cut a log from a Douglas fir that had fallen during the fire.\nIn late 1983, Margaret was visited by 12-year-old Laura Palmer and told her of owls and several things she knew about her.\nMurder of Laura Palmer\n \nOn February 18, 1989, Margaret briefly encountered Laura Palmer outside the local roadhouse. Putting her hand to her log and then the stunned Laura's forehead, Margaret intoned: \"When this kind of fire starts, it is very hard to put out. The tender boughs of innocence burn first, and the wind rises, and then all goodness is in jeopardy.\"\nMargaret cried and cradled her log the night of February 23 as Laura was murdered.\nThe next day, she attended a conference held by FBI Special Agent Dale Cooper, who announced the bureau's takeover of the murder investigation of Laura's murder. Margaret flickered the lights, shushing the citizens in attendance.\nThe next day, she drank coffee at the Double R Diner when she was greeted by Agent Cooper. She overheard him speaking about Laura and went to him, saying her log saw something the night of the murder. She told him to ask it, but he said nothing and she left.\nThe Log Lady attended Laura Palmer's funeral two days later.\n \nA few days later, Deputy Hawk, Sheriff Harry S. Truman, Agent Cooper, and Doctor Will Hayward came to her cabin, where she had been waiting for them. She invited them in for tea and cookies and said they were two days late. She told them about her husband, who was a logging man, who \"met the devil\" in the form of fire the day after their wedding. Hawk then commented that \"The wood holds many spirits.\" She said that her log saw something the night Laura was killed and presented it to Agent Cooper, who asked it what it saw. Margaret talked for it: \"my log\" described darkness, laughter, owls flying, two men, two girls, flashlights in the woods over the ridge, quiet, and then the footsteps of a man. And then, not long after, she alleged that the log heard the screams of a girl further up over the ridge.\nShe sat at the Double R Diner several days later, chewing gum, which she spat out and stuck to the wall.\nMargaret returned to the diner the next day and sat next to Major Garland Briggs. Norma Jennings poured her a cup of coffee and requested her to start properly disposing of her gum. She then swallowed her current wad of gum and asked for a bear claw. She observed the Major's medals, asking him if he had any pride for his medals, which he denied. Her log then told her a message for Briggs, which she translated to \"Deliver the message,\" which Briggs understood the meaning of.\nShe went to Agent Cooper and Sheriff Truman days later to tell them, \"There are owls in the Roadhouse\" and confirmed to Cooper that something was happening. She went to the Roadhouse with them, where she ate many peanuts.\n\"The opening to a gateway\"\nThe Log Lady attended the wedding of Dougie Milford and his new bride, Lana. She commented that she \"just Milford weddings.\"\nMargaret went to the diner a few days later, where she saw Major Briggs, who had a pattern of three triangles behind his ear. She went to the sheriff's station with Briggs, and they told Cooper about the markings on them, hers of the two mountains surrounding Twin Peaks. She also recalled having heard a call of an owl when she received the marking as a girl. Margaret also said she heard the sound before her husband died.\nMargaret ate at the diner the next day when Agent Cooper entered with his loud, nearly-deaf superior, Regional Bureau Chief Gordon Cole. She observed as Cole admired Shelly's beauty, and he declared that he could hear Shelly speak, despite his hearing problems. He described it as a miracle, and Margaret asked what was wrong with miracles, declaring her pie to be a miracle.\nMargaret attended the Miss Twin Peaks Contest, where choreographer Tim Pinkle cried with joy on her shoulder, upon seeing the contestants. The Log Lady was impersonated by Windom Earle, who was seeking to abduct the winning girl, who turned out to be Annie Blackburn.\nMargaret went to the sheriff's station, where Pete Martell accused her of stealing his truck. However, Cooper said Windom Earle was responsible. She brought a jar to Agent Cooper with oil, which her husband had retrieved and called \"an opening to a gateway.\"\nLater life\nIn September 2016, Margaret appeared to be weak and required the use of an oxygen mask. She called the sheriff's department and relayed a message from her log to Deputy Chief Hawk: something was missing and Hawk must find it, something related to Agent Cooper, who had since gone missing. She added that the way Hawk would find it had something to do with his heritage.\nShe later called Hawk on his cell phone and told him, \"the stars turn and a time presents itself,\" and made an offer for him to stop by her cabin for pie and coffee.\nMargaret later called Hawk again with another message, telling him about the presence of electricity and its fading glow. She went on to say that the Truman brothers were Hawk's brothers, as well as the other good men he associated with. She said that the circle was almost complete and for him to \"watch and listen to the dream of time and space. It all comes out now, flowing like a river. That which is and is not.\" Her message culminated in her saying, \"Laura is the one.\"\nAfter feeling that Hawk had found something, Margaret called him again, telling him that there was \"fire\" where he was going.\nShe called Hawk once more to announce that she was dying and told him to remember all that she had ever told him, particularly for him to watch for \"the one.\" She soon passed away and the light inside her cabin went out.\nNon-canon appearances\n\nSaturday Night Live sketch\nThe Log Lady (played by Jan Hooks) goes to Agent Cooper's room at the Great Northern after Leo Johnson confesses to Laura's murder. She tells Cooper that her log says Leo did it and she leaves.\nGeorgia Coffee Commercials\n\nLost\nThe Log Lady shows up at the Twin Peaks Sheriff's Department to confirm Agent Cooper's praises for Georgia Coffee.\nCherry Pie\nShe shows up at the Double R Diner to again confirm the praise for Georgia Coffee.\nA Mystery of \"G\"\nShe shows up once again to confirm praises for the coffee at the sheriff's station.\nThe Rescue\nWhen Cooper prepares to enter the Black Lodge to find Asami, Margaret says to \"watch.\"\nPlaying Lynch\nIn David Lynch's project, Psychogenic Fugue, actor John Malkovich plays various roles from Lynch projects, including the Log Lady and Dale Cooper. Among images posted prior to the project's announcement was an advertisement for Lanterman's Essential Oils, presumably related to Margaret Lanterman.\nLanterman's Essential OilsJohn Malkovich as the Log LadyJohn Malkovich as the Log Lady\nBehind the scenes\nThe Log Lady was played by Catherine E. Coulson, who was previously involved in production of David Lynch's Eraserhead (while married to its star, Jack Nance) and played the titular character in his short film, The Amputee.\nThe idea for the Log Lady was conceived by Lynch in the 1970s, when he had intended to do a television series called I'll Test My Log with Every Branch of Knowledge. He presented the concept in such terms, some of it was reused while other ideas were scrapped:\n\"It's a half-hour television show starring Catherine as the lady with the log. Her husband has been killed in a forest fire and his ashes are on the mantelpiece, with his pipes and his sock hat. He was a woodsman. But the fireplace is completely boarded up. Because she now is very afraid of fire. And she has a small child, but she doesn't drive, so she takes cabs. And each show would start with her making a phone call to some expert in one of the many fields of knowledge. Maybe on this particular day she calls a dentist, but she makes the appointment for her log. And the log goes in the dental chair and gets a little bib and chain and the dentist X-rays the log for cavities, goes through the whole thing, and the son is also there. Because she is teaching her son through his observations of what the log is going through. And then sometimes they go to a diner and they never get to where they're going. That was the idea.\"\nCoulson briefly parodied her role as the Log Lady on the USA Network series Psych in \"Dual Spires,\" the series' Twin Peaks tribute episode that featured numerous Twin Peaks actors. In the scene, she appears to be talking to a log, weirding out series protagonists Shawn and Gus: it eventually turns out she was actually talking to her grandson, to which Shawn and Gus express relief.\nCoulson appeared posthumously in the 2017 series. Lynch revealed in an interview that her scenes were shot mere days before Coulson passed away, remarking, \"Certain things came together just in the nick of time.\"\nTrivia\n \nWhen the series was syndicated to Bravo, Lynch created new Log Lady introductions for each episode. They range in length from under a minute to about three minutes.\nInterestingly, Margaret's scar presented in The Secret History of Twin Peaks is the marking on Major Briggs as rearranged by Agent Cooper, not of the Log Lady.\nHer husband is thought by some to be the Woodsman seen in the Meeting Room with other members of The Black Lodge.\nIt is thought that the spirit of her husband resides in her log due to Hawk's comment about the \"wood holding many spirits\" and seeing how Josie's soul is trapped in a wood knob in the Great Northern Hotel. It can be noted that it was not the personal opinion of the Log Lady's performer Catherine Coulson who considered that the log was more of memento of the Log Lady's late husband.\nThe Curious Woman in the Fat Trout Trailer Park has the same sweater as her, indicating perhaps a Deer Meadow alter-ego, as the town itself is shown as a twisted version of Twin Peaks in the movie.\nThe rule book for the Twin Peaks Murder Mystery Game erroneously states that Margaret witnessed Laura's murder rather than her log being a witness."}