{"name": "Marie_Schlurman", "url": "https://twinpeaks.fandom.com/wiki/Marie_Schlurman", "text": "Marie Schlurman\nMarie Schlurman was a childhood friend and love interest of Dale Cooper.\nBiography\nMarie was first introduced in Cooper's tapes as the sister of his friend Bradley. She was fourteen and lived next door to the Coopers. Dale saw her dancing suggestively through her window and she continued to do this on at least one other night, during which she took off her shirt and Dale saw her in her underwear, causing his first experience of sexual arousal.\nShe expressed an attraction to Cooper and allowed him to tie her up in order to practice his knot-tying skills for the Boy Scouts. She then tied him up, but he easily escaped.\nHowever, she later told Cooper that she could not talk to him until he was older. He subsequently followed her and saw her kissing a boy named Daren Seedler. Ten days later, Dale invited her to a party, but she declined and by this point, always had the shades in her room closed.\nMarie was deeply effected by the death of Bobby Kennedy, after which she opened her shades and stood nude in her window as she looked into Cooper's room. Days later, she French-kissed Cooper as the train carrying Kennedy's body passed through Philadelphia and she ran away with tears in her eyes.\nShe left for a family vacation to national parks a little under a week later and returned in about two months, and was quite clearly a changed person. She was now a flower child and criticized Dale's plan to join the FBI and that his \"heart was rotten and that would never achieve nirvana.\"\nMonths later, Marie suffered from an overdose at school and when Cooper visited her in the hospital, she revealed that she tried to kill herself by \"taking too many pills\" and offered him sexual favors if he helped her escape. He refused on the grounds of scout law, which angered her.\nShe later shaved her head and wrote a letter, apologizing to Dale and telling him that she had befriended a poet who had previously jumped off a bridge, breaking his legs in eleven places.\nThe next time Cooper spoke of Marie was months later, as she visited him while he was sick and was wearing a cheerleader outfit. She said that she was recovering and that she had found Jesus after the poet she met had committed suicide.\nCooper later received a drawing of Marie holding baby Jesus for Valentine's Day, but commented that he was not sure what to think of it.\nShe later showed some disapproval for the Apollo 11 mission and said that the astronauts might meet God on the moon, and He would tell them to go back where they belong.\nAfter the moon landing, she went outside and Dale joined her as they looked at the moon until she requested him to pray with her, though he continued to watch the moon as her eyes were closed.\nAfter the death of Dale's mother, Marie tried to comfort him by saying his mother was with God, but he was resistant to this and told her he would \"knock her goddamn teeth out\" if she spoke one more word.\nOn Dale's sixteenth birthday, she gave him a card with a dog on it.\nThe next Summer, Dale and his father went on a trip with the Schlurmans to the Poconos. On Independence Day, when the two were left alone, Marie ran into the woods, leaving a trail of her clothing. After they met, they had a sexual encounter after Cooper told her he believed in God, but they were interrupted when a rocket landed and exploded near them, causing a fire.\nTen days later, Marie dove off of a swimming platform and hit her head at Promised Land Lake and drowned, as nobody else was in the area. Her last words to Cooper were \"Thanks for saving my sneakers.\"\nShe was buried three days later in a silver coffin on a day with large, white clouds in the sky."}