{"name": "Mayfair_Hotel", "url": "https://twinpeaks.fandom.com/wiki/Mayfair_Hotel", "text": "Mayfair Hotel\nThe Mayfair Hotel was a hotel in Buckhorn, South Dakota.\nIt housed the temporary headquarters of the Blue Rose Task Force while they investigated the apparent resurfacing of Dale Cooper.\nHistory\n\n2016\nOn September 29, Albert Rosenfield and Constance Talbot enjoyed a dinner together, to the amusement of Gordon Cole and Tammy Preston. Later that night, Albert knocked on the door of Gordon's room, interrupting him while he drawing; Cole experienced a vision of Laura Palmer crying and heard Sarah Palmer shouting her daughter's name before seeing Albert. Albert showed Gordon a text received from Diane Evans, which was apparently sent by Mexico and to which she responded that they have Hastings. Agent Preston walked in and showed Albert and Gordon a picture of Cooper's doppelganger with a man in a lab coat in the room with the glass box.\nOn September 30, Albert Rosenfield and Gordon Cole convocated Agent Preston in a lounge; as they shared some wine from Gordon's personal cellar, Albert briefed Tammy on the Blue Rose task force and asked her to join, to which she replied affirmatively. Subsequently, they called in Diane Evans and Albert proposed her to be \"deputized\" temporarily, under payment and out of curiosity to know what happened to her friend Cooper; she accepted. Following the meeting, Diane drank a cocktail in the hotel's bar and answered a text from Cooper's doppelganger, informing him that her colleagues didn't ask about Las Vegas yet. Albert visited Gordon Cole, interrupting his date with a French woman; after she left, Albert reported on Diane's outcoming text.\nOn October 1, Gordon called Sheriff Truman and came to know about the retrieval of the missing pages from Laura Palmer's secret diary, which suggested the existence of two Coopers. Albert told Preston about the first Blue Rose case. Gordon walked in and called for a coffee break, only to be disturbed by the hotel's window cleaner. Diane entered the room and was asked whether Cooper mentioned Major Briggs in his last appearance, which she refused to confirm. Gordon mentioned that a ring from Janey-E to Dougie in the stomach of the supposed corpse of Major Briggs; Diane recognized the names as those of her estranged half-sister and her brother-in-law. Gordon called the Las Vegas FBI division and told Randall Headley to look for the Joneses in relation to a double homicide. Diane left and Gordon shared with Albert and Tammy the information he received from Sheriff Truman. He then proceeded to tell them of a Monica Bellucci dream he had, which was followed by his recollection of Phillip Jeffries' appearance in the FBI's headquarters in February 1989.\nOn October 2, in the hotel's bar, Diane received a text from Cooper's doppelganger, which prompted her to text him a set of numbers. She proceeded to confess to Gordon, Albert and Tammy what happened on the last night during which she saw Cooper. As she spoke, she grew increasingly terrified; she concluded by saying that she was not herself and that she was at the Sheriff's Station; she took out a revolver, but was shot in the chest multiple times by Albert and Tammy, causing her to vanish from the room.\nStill shocked by Diane's disappearance, Cole informed Albert and Tammy about a plan which he set in motion years prior with Cooper and Major Briggs to capture an evil identity known as Judy. He apologized to Albert, then expressed his doubt about the plan working, since they were supposed to hear from Cooper by that point. The phone in the hotel room rang, and Agent Headley informed Cole that Cooper (under the name of Dougie Jones) was in a hospital but already left. Bushnell Mullins took the phone and reported to Gordon a message from Cooper: \"I am headed for Sheriff Truman's. It is 2:53 in Las Vegas, and that adds up to a ten, the number of completion.\" Gordon thanked him and closed the phone; Tammy gathered information on Douglas Jones, including the explosion of his car and his electrocution. Gordon told Albert and Tammy that he knew where Cooper was going, and the three of them left the hotel.\nBehind the scenes\nThe scenes in the hotel and the establishing shots were shot on location at the Mayfair Hotel, a Hotel at 115 East Third Street in Pomona, California.\nThe scene with the French woman in the hotel was the final scene shot to feature Gordon Cole and Albert Rosenfield, thus it serves as Miguel Ferrer's final time playing his character before his death in 2017."}