{"name": "Meriwether_Lewis", "url": "https://twinpeaks.fandom.com/wiki/Meriwether_Lewis", "text": "Meriwether Lewis\nCaptain Meriwether Lewis was the co-commander of the Corps of Discovery, alongside William Clark.\nBiography\n\nEarly life\nLewis grew up in Virginia and knew Thomas Jefferson since childhood. In his youth, Lewis had much contact with Native Americans and would often advocate on their behalf.\nCorps of Discovery\nIt was Lewis' relations with the indigenous people that prompted Jefferson – then President of the United States – to select him to lead the Corps of Discovery, a secret expedition across the Louisiana Purchase. Lewis hand-picked his former commanding officer William Clark as his co-commander.\nWhile preparing for the expedition, Lewis studied various physical sciences among other subjects at the American Philiosophical Society library in Philadelphia, Pennsylvania.\nOn June 13, 1805, Lewis recorded in a diary entry that he saw two identical mountains that he likened more to ramparts than nature.\nIn September 1805, after splitting up the expedition, Lewis was retrieved by Reubin Fields to meet Chief Twisted Hair of the Nez Perce tribe, on orders from Clark. Lewis asked the chief about a map he had drawn of a nearby area to the north where a river flowed between two mountains and into a waterfall. Twisted Hair told him that white people lived in this area and had given him three strange artifacts, among these a ring. Lewis asked him further about the ring and Twisted Hair pointed to the symbol on it and told him something that the expedition's Shoshone guide Sacagawea could only translate as being something about an owl and a \"spirit world\" the tribe worshiped. The chief then allowed Lewis to take the ring. Lewis recounted this experience in a letter to Jefferson, dated September 25, in which he also surmised that Twisted Hair was withholding more information and stated his intent to explore the area in the map drawn by Twisted Hair.\nDuring this time, Lewis corresponded with Jefferson through letters, the first of which were straightforward, but eventually went on to be strange and sometimes unintelligible ramblings. Among these were rants about \"the secret deep within the color red,\" the \"mysterious force B. Franklin had stumbled upon,\" and the fragmented description of an encounter with a \"silent man.\" Following this, Lewis' writing appeared to have returned to normal, but he wrote that he \"should have heeded his warning.\" Jefferson surmised that \"his\" referred to either Twisted Hair or the \"silent man.\"\nLewis reunited with Clark on October 3 and wrote to Jefferson, stating the expedition's intent to head west and recorded that none of the men who accompanied him northward remembered any of it and he himself had trouble recalling the events. In the letter, he also said that he \"could have returned it to the chief,\" but decided to keep it. Jefferson was clueless as to what \"it\" referred to. In 2016, FBI Special Agent Tamara Preston suggested this referred to the ring given by Twisted Hair.\nFreemasonry and governorship\nUpon returning to Washington, D.C. in 1807, Lewis was appointed as governor of the Upper Louisiana Territory, fulfilling the position in St. Louis. He soon organized and financed the Missouri Gazette.\nIt is believed, at some point, that Thomas Jefferson initiated Lewis into Freemasonry.\nOn September 21, 1808, Lewis announced through the Gazette the founding of the first Masonic Lodge in St. Louis, Lodge III, with him as its master. Soon after this, Lewis initiated Clark into the lodge.\nDeath\nIn October 1809, Lewis set forth from St. Louis to Washington, D.C. to protest the State Department's refusal to reimburse him for state expenses paid out of his personal funds. He planned to publish his and Clark's journals that he had organized, for which he would collect money agreed upon via contract prior to when he assumed his governor position. His other intention with this trip was to deliver evidence to Jefferson and his successor, James Madison, of treachery by General James Wilkinson. Lewis' initial route was to travel downriver to New Orleans, then to his destination, but he became concerned that Wilkinson would learn of this plan. As a result, he abandoned the route at Fort Pickering and set off by horseback through Tennessee, accompanied by Major James Neely.\nAccording to a potentially forged letter dated two years after Lewis' death and allegedly written by Major Gilbert Russell to Jefferson, Lewis was deranged upon his arrival at Fort Pickering and had by that point attempted suicide twice. Prompted by a third attempt, Russell incarcerated Lewis until he was of sound mind to resume the journey.\nOn October 10, Lewis stopped at Grinder's Stand, an inn along the Natchez Trace. According to Priscilla Grinder, Lewis became agitated and later paced back and forth whilst smoking a pipe, ranting about his \"enemies,\" and fiddling with a small leather pouch. Later in the evening, he refused the bed Grinder prepared for him and instead resorted to a pallet facing the inn's front door, keeping his pistols nearby.\nAt about 3:00 AM, Grinder stated that she was awoken by sounds of a struggle, culminating in two gunshots and Lewis crying, \"Oh Lord!\" and soon called for her help and water. She maintained that she then saw him – through cracks in her cabin wall – crawling about in the moonlight.\nAt dawn, Grinder woke Lewis' servants, who found him alive, in a pool of blood, having been shot in the head and abdomen and slashed in the throat and arms. Lewis reportedly begged to be mercifully killed by his rifle shortly before succumbing to his wounds.\nNeely supervised a swift burial and reported Lewis' death to Jefferson on October 18, having determined it to be suicide, which Jefferson accepted and became publicly accepted. In the weeks following Lewis' death, Gilbert Russell wrote to Jefferson, referring to the death as \"murder.\"\nInvestigations into death\nA local Tennessee county made an inquiry into Lewis' death, its residents claiming that Priscilla Grinder, her husband, and \"parties unknown\" murdered him. However, the charges were dropped due to the jury's \"fear of retribution.\"\n \nIn 1848, a United States congressional committee ordered an investigation into his death, during which his remains were exhumed. A doctor hired by the committee viewed the well-preserved body and concluded that \"Governor Lewis certainly died at the hands of an assassin.\" The committee further erected a monument over Lewis' grave.\nIn 1989, an archivist gained permission from the Masonic Grand Lodge to perform DNA testing on a bloodstained apron Lewis was wearing at the time of his death. This test determined that there was blood on it from Lewis and two unidentified persons.\nIn the 20th century, descendants of Lewis requested that his remains be exhumed once again for forensic study. A grand jury was convened in Tennessee in 1996, which found that the remains should be exhumed in order to determine the exact cause of Lewis' death. The National Park Service initially denied the request, but agreed in 2008 before switching their position again in 2010, declining the exhumation request on the grounds that it would cause \"untold damage\" to a cherished historic monument.\nIn a monologue to Sheriff Frank Truman, Wally Brando expressed that his motorcycle travels often put him in mind of Lewis and Clark.\nBehind the scenes\nMeriwether Lewis (August 18, 1774 – October 11, 1809) was an American explorer, soldier, and politician, best known for co-commanding the Corps of Discovery Expedition from 1804 to 1806.\nDavid Patrick Kelly narrated Lewis' writings in the audiobook version of The Secret History of Twin Peaks."}