{"name": "Mike_Nelson", "url": "https://twinpeaks.fandom.com/wiki/Mike_Nelson", "text": "Mike Nelson\nThis is an article about Bobby's friend. For the spirit/entity of the same name, see Mike.\nMike Nelson was a student at Twin Peaks High School during the 1988-89 school year. He was close friends with Bobby Briggs and briefly dated Donna Hayward and Nadine Hurley. Nelson was on both the high school football and wrestling teams, and also dealt drugs with Bobby.\nBiography\n\nLaura's murder\nOn a day in February 1989, Mike and Bobby sat in the latter's car, Mike worrying about their short cocaine supply, as they owed $10,000 to Leo Johnson. Their respective girlfriends Donna Hayward and Laura Palmer passed by on their way to school, Mike and Bobby declaring that Mike was \"the man.\"\nOn the morning of February 24, Mike was in the locker room at the high school when Sarah Palmer called, trying to find out where her daughter, Laura, was. He later stood in a hallway as Bobby arrived and it was announced to the school that Laura had been found dead.\n \nLater in the day, he went to Ed Hurley's gas station, where Donna was. He angrily said that he had been looking all over town for her, as he thought she should have been with him to support Bobby, who was being questioned about Laura. This angered Hurley and Mike told him to mind his own business. He commanded Donna to go to the sheriff's station and he left.\nHe waited at the sheriff's station for Bobby after his questioning but waited, as Donna had just been taken in. Bobby also said that they were going to beat up a biker with the initial 'J' and the boys went outside.\nIn the evening, he went with Bobby to see Donna, who was not home despite a curfew instated for minors. Donna's father requested him to help find her. Mike immediately suspected she had gone to the Roadhouse, so they headed there and waited for her. When she arrived, he angrily grabbed her but was intervened by Ed as well as other bar patrons.\nAfter being arrested, they saw James Hurley being taken to a cell and they barked at him.\nMike sat in his cell with Bobby the next morning, saying that Leo called, asking where half of the money Bobby owed him was. Bobby said it was in Laura's possession and that she was supposed to hand it over that day. They then argued over how they would get the $10,000 they owe. They watched as James was then escorted back to his cell by Deputy Hawk after an interrogation.\nLater on, they sat in the interrogation room across from Sheriff Harry S. Truman when FBI Special Agent Dale Cooper came in. Mike insisted that their fight at the Roadhouse was purely self-defense, and they were released. The special agent also told them that if anything happened to James, they would be immediately considered suspects. Mike later drove with Bobby past the Hayward home and saw James' bike outside.\nMike and Bobby went to the woods the following day to pick up a supply of cocaine, left in a football by Leo. However, it was not all there and Leo revealed himself. After a talk about the money, Leo told them to \"go out for a pass\" and threw the football, landing on the hood of the car Mike and Bobby brought.\nMike attended Laura's funeral. When James and Bobby charged at each other, he joined but was restrained by Deputy Hawk.\nA little bit under two weeks later, Mike went to the Johnson home with Bobby, where Leo was now a wheelchair-bound invalid. They broke the heel off of a boot belonging to him and found a micro-cassette inside.\nRelationship with Nadine\nMike walked down the hallway at school a few days later, greeting Donna as he passed by, having broken up by this point. Nadine Hurley also greeted him, believing that she was a teenager once again following a suicide attempt. He later worked out in the weight room when Nadine went to a nearby leg press and began lifting 600 pounds with total ease. The wrestling coach then entered and offered to her a place on the wrestling team. As a result, the next day, he was asked to wrestle Nadine and was defeated with ease as she asked him out for a date. Following this, he went to Donna and asked her to act as though they are still dating, in order to halt Nadine's advances.\nThe next day, he stared at a newspaper at the Double R Diner when Nadine showed up, wanting to share a meal with him. He angrily told her he was not interested in her, though she did not back away and he kissed her. However, Mike changed his mind within the next few days, and the two booked the honeymoon suite at the Great Northern Hotel, under the names Mr. and Mrs. Hinkman. When they checked out of the hotel in the morning, he commented that their stay was \"unbelievable.\"\nMike went with Nadine the next day to the Roadhouse so she could sign up for the Miss Twin Peaks Contest. Bobby saw them together and pulled Mike aside to voice his concerns for their relationship. Mike insisted that the reason he was attracted to her was because of her sexual maturity combined with her superhuman strength.\nAt the Hurley home on the day of the contest, Nadine showed some of her wrestling highlights to Mike, Ed, Norma Jennings, and Doctor Lawrence Jacoby. Jacoby told them he had gathered them together because he believed Ed and Nadine's divorce would be easier when all parties involved discussed their feelings. Ed told Nadine that he planned on marrying Norma, causing Nadine to say that she and Mike would be doing the same and she crushed Mike's hand.\nFollowing the chaos at the Miss Twin Peaks Contest, Doctor Hayward patched up Mike. He declared his love for Nadine and tried to kiss her, but she told him to get out, having apparently returned to her adult mental state. Mike apologized to Ed.\nLater life\nTwenty-five years later, at his place of employment, Mike looked over the resume and application forms from Steven Burnett. He called Burnett into his office to inform him that his resume was inadequate and the forms were not filled out correctly.\nBehind the scenes\nMike was played by American actor Gary Hershberger, who reprised the role in the 2017 series.\nMike was illustrative of the theme of duality that pervaded Twin Peaks. He was, with Bobby, one of two duos in the series named \"Mike\" and \"Bob,\" the other being Mike (the one-armed man) and BOB.\nCo-author Mark Frost stated that Mike and Bobby remained friends over the years and were on the same bowling team."}