{"name": "Mike", "url": "https://twinpeaks.fandom.com/wiki/Mike", "text": "Mike\nFor the Twin Peaks resident of the same name, see Mike Nelson.\n\"We lived among the people... I think you say, convenience store? We lived above it. I mean it like it is, like it sounds... I, too, have been touched by the devilish one. Tattoo on the left shoulder... oh, but when I saw the face of God, I was changed... Took the entire arm off. My name is Mike. His name is Bob.\"\n\"Mike\" was a spirit who could inhabit a human host, similar to BOB, who was once his partner in crime and familiar. Mike claimed to have had a religious epiphany and parted ways with BOB, cutting off his own arm to rid himself of a tattoo that read \"Fire walk with me,\" which symbolized being touched by \"the devilish one.\" While he inhabited traveling salesman Phillip Michael Gerard, Mike engaged in a years-long campaign against BOB whose purpose and motivations were unclear.\nBiography\n\nPhillip Gerard\n\"In another time, another culture, he may have been a seer, a shaman priest. In our world, he's a shoe salesman and lives among the shadows.\"\n ―Dale Cooper\nPhillip Michael Gerard (born February 6, 1938) was an itinerant salesman from Spokane, Washington. Gerard's middle name came from his uncle. He attended Spokane Voc/Tech High School.\nWhen questioned, Gerard claimed that his left arm had once borne a tattoo of the word \"MOM\" and he had lost it in a car accident near Memphis, Tennessee when he was selling pharmaceuticals. By February 1989, he worked for Circle Brand Boots and was based out of the Timber Falls Motel in Twin Peaks, Washington. He described local veterinarian Bob Lydecker as \"just about best friend in the world.\"\nBy 1989, Gerard took regular doses of haloperidol, which suppressed the influence of Mike and prevented him from gaining full control of Gerard's body. His awareness and understanding of Mike's presence was unclear.\nConflict with BOB\nIn one of Dale Cooper's dreams, Mike explained that he had spent several years as BOB's willing accomplice, living with him above a convenience store, until Mike \"saw the face of God\" and cut off his left arm, ridding himself of a tattoo that read \"Fire walk with me.\" Afterwards, he claimed to have devoted himself to stopping BOB.\n \nAnother being encountered in the red room described itself as the arm, apparently related in some way to Gerard's severed arm.\nIn February 1989, Mike sat in front of a circle of candles, chanting \"fire walk with me,\" and putting out the candles. Soon thereafter, Mike harassed Leland Palmer - BOB's host - in a road rage incident, where he accused Leland of \"stealing the corn\" from above the convenience store. Wearing the ring, he shouted to Laura that BOB was her father, but Leland drowned him out by revving their car's engine and then sped away.\n \nOn the night of Laura's murder, Mike ran through the woods after BOB, who had abducted Laura and Ronette Pulaski. After Ronette managed to pry open the door to the train car where she and Laura were being held, Mike threw the ring inside, and Laura put it on. This somehow forced BOB to kill Laura instead of possessing her as he had planned. Afterward, Mike and the arm confronted BOB in the red room, demanding that BOB return his garmonbozia. In response, BOB threw a great amount of blood from Leland onto the floor.\nLaura Palmer investigation\nDuring the following two days, Gerard went to the Calhoun Memorial Hospital, where he was spotted by FBI Special Agent Dale Cooper, Sheriff Harry S. Truman, and Deputy Hawk.\nSubsequently, he was seen as Mike in a dream had by Agent Cooper, in which he explained that he lived with BOB above a convenience store and that he had cut off his arm, which had a tattoo.\n \nGerard was in room 101 at the Timber Falls Motel when Sheriff Truman and Agent Cooper kicked the door in a few days later. He answered their questions, explaining that he had been to the hospital to see Bob Lydecker and had lost his arm in an automobile accident several years prior, none of which corresponded with what the one-armed man had said in Cooper's dream. The mention of Lydecker Veterinary Clinic, however, led Cooper to discover the store where the twine used to bind Laura Palmer before her murder had been purchased.\nSeveral days later, Gerard went to the sheriff's station with a sample case of shoes for Sheriff Truman, who was busy.\nReturning at a later time in the week, he showed Sheriff Truman pairs of shoes. He spotted a sketch of the long-haired man, which seemed to startle him. He excused himself to take his medication.\nHe went to the bathroom and took his medication, which caused him to thrash about and tell BOB that he knew he was near and was after him.\n \nGerard was brought to the sheriff's station by Deputy Hawk and to Sheriff Truman's office to be questioned a few days later. He was later taken to the conference room with Cooper, Truman, Hawk, and FBI Regional Bureau Chief Gordon Cole. He complained that he needed his medicine and could \"feel the change.\" Cooper noted that his medicine drug combo contained elements found in haloperidol, a drug treating schizophrenia or multiple personalities. Cooper refused to give him his medicine and he changed into the inhabiting spirit, Mike. He explained Gerard as being his host and described BOB as his familiar and as a sort of parasitic spirit that fed on fear and pleasures. He then explained the removal of his arm after seeing the face of God and expressed his purpose to stop BOB. He stated that the true face of BOB can be seen only by \"the gifted and the damned\". He also said that BOB had been near for nearly forty years and that he was in a large house made of wood, with many rooms, which Cooper determined to be the Great Northern Hotel.\nIn the morning, after a coffee with the sheriff's department, he was taken to the hotel, where one-by-one, he was brought guests to determine if they were BOB. He had a seizure when Benjamin Horne entered the room.\nUnder watch by the sheriff's department, Mike slept at the Great Northern until his arm's stump began shifting and he awakened, commenting, \"He's close\" and requested a glass of water from the nurse at his bedside. When she left, he rose from his bed, hit a deputy that came inside, and escaped out an open window.\nHe was brought back to the station by Hawk, and to the interrogation room, where Benjamin Horne was present for questioning in the murder of Laura Palmer. Mike said BOB was not near, but Harry charged Horne with the murder. He was then taken back to the hotel.\nThe following day, with Gerard dehydrated and in need of his medicine, Agent Cooper tried to get his attention. He soon did and told Mike about a dream he had concerning Laura. Mike described his relationship with BOB and a golden circle—Cooper's ring—that he gave to a Giant. He insisted that the Giant was the only way to find Laura's killer and that he had been given all of the clues he needed. Mike then apparently fell asleep.\nIn the red room\nWhile trapped within the red room, Cooper was confronted by The Man from Another Place who asked, \"Do you know who I am?\" Cooper shook his head to which The Man From Another Place responded, \"I am the arm,\" referring to Mike's arm.\nMike appeared to Cooper in the Lodge 25 years later, asking \"is it future or is it past?\" and telling him that someone was there. He disappeared when Laura Palmer approached Cooper.\nHe appeared to him again soon after, repeating the same question before leading him to the arm, which had since evolved. After the arm spoke to Cooper, Mike led him out of the room and disappeared.\nMike later bore witness to Dougie Jones's sudden transportation to the red room, remarking he had been created for a purpose. After Jones collapsed into a seed, Mike took the ring from his remains and placed it back on the table, sensing that something was wrong.\nHe later appeared in a vision to Cooper, who in a catatonic state had taken Jones' identity, and told him he had been tricked. He warned Cooper that now either he or his doppelgänger must die.\nMike again appeared to Cooper, urging him to wake up and to not die. He appeared to him again later, but did not say anything.\nHe appeared to Cooper again when he finally awoke and informed him that his doppelganger had not returned to the Lodge and gave him the ring. Cooper also requested Mike to make another duplicate of himself with a strand of his hair and a seed. He later witnessed Diane Evans's tulpa appear in the Red Room and informed her she had been manufactured, only to get cursed out by her before she disappeared like Dougie had.\nSometime later, he met Cooper in the basement of The Great Northern, where he repeated the \"Fire Walk With Me\" poem and then led him up some stairs and into the room above the convenience store, where Cooper met Jeffries.\nNon-canon appearances\n\nInternational Pilot\nThis section covers the alternate ending in the International Pilot. See the Pilot section for the events that occur prior to it.\nMike calls Agent Cooper, commenting that it is a strange night and that there is something in the air. He also says that he knows who killed Teresa Banks and of the \"stitches with the red thread.\" Mike tells Cooper that he is at the hospital and hangs up.\nHe awaits Cooper and Sheriff Truman in the room where they had examined Laura Palmer's body. He recites \"Through the darkness of future past, the magician longs to see, one chants out between two worlds, fire walk with me,\" and tells them that his name is Mike and that he lived above a convenience store with a man named BOB. He says that he was in the elevator earlier, looking for BOB. He says he had a tattoo on his shoulder but cut the arm off when he saw the face of God. Sheriff Truman shows him a police sketch of a balding man and Mike says it is not BOB. He is then shown a sketch of a long-haired man, which Mike identifies as BOB and says that he is in the basement.\nAfter Agent Cooper and Sheriff Truman, Mike makes his way down to the basement, where BOB calls to him. Mike hears BOB promise to kill again, and he draws a gun, shooting BOB dead, which then causes him a great pain as he collapses to the ground.\nBehind the scenes\nMike/Gerard was played by American actor Al Strobel, who reprised the role in the 2017 series. Strobel was cast in the pilot as an homage to the television series The Fugitive. When David Lynch decided to incorporate the character into the International Pilot ending, he was so impressed with Strobel's performance that he gave him a recurring role.\nThe script for \"Episode 16\" strongly implies that the character dies after his final testimony: \"Gerard goes slack in arms. 'Mike' is gone. Cooper holds Gerard's limp body. He looks at Doc.\"\nWhereas BOB is seen both in his \"true\" guise (Frank Silva) and as Leland Palmer (Ray Wise), Mike has, to date, seemingly only appeared in the form of his host Phillip Gerard. Strobel is credited as \"Phillip Gerard\" in Twin Peaks (2017), and the name \"Mike\" is not mentioned at any point in the series."}