{"name": "Mrs._Tremond", "url": "https://twinpeaks.fandom.com/wiki/Mrs._Tremond", "text": "Mrs. Tremond\nNot to be confused with the second Mrs. Tremond or Alice Tremond.\n\"I requested no creamed corn! Do you see creamed corn on that plate?\"\nMrs. Tremond, also known as Mrs. Chalfont, was an elderly woman who lived with Pierre, supposedly her grandson, at the Fat Trout Trailer Park in Deer Meadow, and later in Twin Peaks, Washington.\nBiography\nThe old woman sat next to Pierre in a dirty room above a convenience store, where a number of spirits were having a meeting, including BOB, the arm, two woodsmen, the electrician, and a jumping man. She was silent, looking sternly at BOB and the arm as they talked at a table.\nAs early as August 1987, the old woman went by the name \"Mrs. Tremond\" and, seemingly bedridden, lived with Pierre in an apartment next door to Harold Smith in Twin Peaks' Low Town neighborhood. On August 23, Laura Palmer brought her dinner as part of her first Meals on Wheels run.\nIn February 1988, the old woman was living in a trailer in Fat Trout Trailer Park with her \"grandson\" at the time of Teresa Banks' death. At that time, they apparently went by the name \"Chalfont,\" which was also the name of the two people living there before them. Teresa Banks' missing ring was found by Chet Desmond beneath their trailer. By the time Dale Cooper arrived to investigate Desmond's disappearance, the trailer had disappeared.\n \nIn February 1989, the week before Laura Palmer's death, Mrs. Tremond and Pierre appeared to Laura outside the Double R Diner to give her a painting of a room above the convenience store that she said would \"look good on wall.\" Later, she appeared in Laura's dream inside the room shown in the picture, beckoning her through an open door.\nIn March 1989, Donna Hayward visited her home with a Meals on Wheels delivery for her, having picked up Laura's route after her death. Mrs. Tremond uncovered her food and was visibly disturbed to see her meal, saying she had requested no creamed corn. After directing Donna to look at the plate, the corn disappeared and appeared in the hands of her \"grandson,\" whom Mrs. Tremond said had been \"studying magic.\" She told Donna that she should talk to Harold, who had been Laura Palmer's friend. Disconcerted, Donna left.\nWhen she returned to the apartment with Dale Cooper days later, Donna found a completely different woman by the same name living there, and no trace of the elderly woman or the little boy.\nIn an unknown year, a Mrs. Chalfont sold the Palmer house in Twin Peaks to Alice Tremond.\nBehind the scenes\nThe old woman, identified as \"Mrs. Tremond\" in \"Episode 9\" and as \"Mrs. Chalfont\" in the end credits of Twin Peaks: Fire Walk with Me, was portrayed by actress Frances Bay.\nGallery\nMrs. Tremond/ChalfontMrs. Tremond in the painting"}