{"name": "Nadine_Hurley", "url": "https://twinpeaks.fandom.com/wiki/Nadine_Hurley", "text": "Nadine Hurley\nNadine Hurley (née Butler) was the wife of \"Big\" Ed Hurley and was well known in Twin Peaks for her ferocity and eccentricity. Nadine wore a patch over her left eye, having lost it in a hunting accident on her honeymoon. \nNadine exercised regularly and, following a coma, developed excess adrenaline that gave her phenomenal physical strength.\nBiography\n\nEarly life and marriage\nNadine had a crush on Ed Hurley throughout high school, despite his relationship with Norma Lindstrom. The spring after graduation, after Norma had cheated with Hank Jennings, Ed took Nadine to a small Montana town near Great Falls. There, while in a half-drunk state, he decided to marry her. On their honeymoon, they went hunting and a piece of buckshot fired by Ed ricocheted off of a rock and hit her in the left eye, causing her to lose it.\n\"The Ballad of Big Ed and Norma and Nadine,\" a journal attributed to Hawk Hill, provided a different background to Ed and Nadine's relationship:\nIn late 1984, Nadine brought her father's tractor to Big Ed's Gas Farm for repairs. However, Ed accidentally backed his tow truck into the tractor. He came to her aid and she fainted in his arms, hugging him when she came to. After Ed repeatedly asked her if she was okay, she kissed him and the two quickly became infatuated with each other.\nThey married three weeks later at the Chapel-in-the-Woods, with all of the Bookhouse Boys in attendance, and the reception being held at the Grange Hall. Not long after, Nadine learned of Ed's previous relationship with Norma, prompting her to become jealous.\nThe next fall, Ed went on a hunting trip with Harry S. Truman and she followed, unknown to them. When she disturbed a group of ducks, Ed shot at them and a buckshot pellet hit Nadine in the eye. The guilt-ridden Ed attentively nursed her back to health.\nOn a day in February 1989, Nadine and Ed went to the Double R Diner for coffee, but she changed her mind and ran when she saw Norma Jennings, Ed's high school sweetheart.\nDrape runners and suicide attempt\nOn February 24, Nadine yelled at Ed to get the drapes she had ordered. Later, after Ed picked up the drapes, she yelled at him to hang them up. After he hung them, she obsessively tests them out.\nShe encountered Norma at the Twin Peaks General Store the next day, having bought cotton balls to silence her drape runners.\nThe following day, she exercised when her husband came in and tripped over her drape runners she had laid out. Angered at his apparent ruining of her silent drape runners, she continued working out, bending the machine.\nWhen Ed came home that night, Nadine tackled him with a hug and presented her now-silent drape runners, which she said were achieved by Ed accidentally dripping grease on the cotton balls earlier.\nNadine kissed Ed before Laura's funeral the next day and told him about her crush on him from when he was dating Norma in high school. Ed's nephew, James then arrived, but said that he was not going to the funeral.\nA few days later, Nadine watched Invitation to Love and ate bonbons when Ed came home. She cried as her drape runner patent had been denied. As a result, she attempted suicide by overdosing on pills. Ed found her and called an ambulance. She was taken to the hospital, where she was comatose for a few days, and broke several restraints in this state due to an abnormal amount of adrenaline. She woke when Ed sang \"On Top of Old Smoky\" to her, and her mind had reverted to when she was a teenager.\nBack to school\nNadine was brought home from the hospital two days later but did not recognize James and wondered where her parents were. She went to the kitchen to get something to drink, then came back, having torn off a cabinet's door. She spent the next few days in high spirits with Ed, including a visit to the diner, where she broke a milkshake glass.\nSeveral days later, Nadine attended the reception following the funeral of Leland Palmer, who had died in custody after being arrested for the murder of his daughter, Laura Palmer. She noticed her shiny shoes, wondering if anyone could see up her skirt due to the reflection.\nFollowing her admission into the high school student body, under the suggestion of psychiatrist Doctor Lawrence Jacoby, she attended cheer tryouts, where she threw a boy while performing a corkscrew.\nThe next day, she went to Donna Hayward's locker to ask if she was still seeing Mike Nelson and is excited when she said that she was not. When Mike passed by, she greeted him, but he mostly ignored her.\nLater in the weight room, she approached Mike, who was working out. She went to a leg press and began lifting 600 pounds with total ease. The wrestling coach then entered and offered her a place on the wrestling team.\nThe coach told his athletes about Nadine's rights to be on the team and asked Mike to wrestle with her to prove her value on the team. She easily triumphed over him while asking him out for a date.\nThe next day, Nadine went to the diner where she found Mike staring at a newspaper. She asked him to share a meal with her, which he was resistant to. However, she did not back down and kissed him.\nShe went home to find Ed being attacked by Hank Jennings, who she easily subdued.\nShe went to the bedroom at her home a couple of days later, breaking the door off its hinges on her way in. She got into bed with Ed and Norma, telling them about her disqualification from the wrestling tournament and apologized to Norma about Hank. She got up and told them that she knew about their relationship and that it made her feel better about her activities with Mike.\nNadine came home early from school the following day to tell Ed that she and Mike were in love and that she and Ed must break up.\nThe next day, she sat with Doctor Jacoby and Ed, the latter who wished to have a divorce, but Nadine does not understand, as she believed they were only dating. She then noticed her blindness in her left eye, apparently having gone unnoticed, despite her eyepatch.\nNadine and Mike later went to the Great Northern Hotel, where they booked the honeymoon suite under the names Mr. and Mrs. Hinkman. She and Mike checked out of the hotel in the morning, Mike calling their night \"unbelievable.\"\nNadine entered the Miss Twin Peaks Contest and days later, Tim Pinkle taught choreography to Nadine and the rest of the women participating in the pageant.\nLater, she showed her wrestling highlights to Ed, Nadine, Mike, and Dr. Jacoby. Jacoby said he had gathered them, finding \"breakups\" easier when everyone involved could talk it out. When Ed told her that he planned on getting married to Norma, she said that she and Mike were getting married as well, and she crushed Mike's hand.\nFollowing Annie Blackburn's win at the contest, chaos ensued and a sandbag was dropped on Nadine's head. Following the chaos, Doctor Will Hayward patched her up. She came to with Mike declaring his love for her. She looked at him and he tried to kiss her, but she asked him who he was and told him to leave, now having returned to her adult mental state. She also questioned Ed why Norma was there.\nTwenty-five years later\nOver the course of the next twenty-five years, around 1995/1996, Nadine opened a drapes store, Run Silent, Run Drapes.\nOne night, when Nadine was doing her books in the back office of the store, she was surfing the net and stumbled across an episode of \"Dr. Amp's\" nightly rant, hosted by her former therapist, Dr. Jacoby. She was hooked immediately and embraced the entire Dr. Amp lifestyle: drinking the Dr. Amp hemp protein shakes, doing the Dr. Amp's \"Walking in Nature Program\" and followed his rigorous \"Crusade for Political Renewal\" by donating to a variety of nonprofit charities he supports.\nBy late 2016, Nadine had bought herself a mail-order golden shovel, and a few more for people on her Christmas list, and installed one of the shovels like a holy relic in the display window of her drapery store. Nadine's enthustiastic turned religiously devoted viewing of \"Dr. Amp\" restored her to a balanced, happy, and functional life.\nWhile driving by Run Silent, Run Drapes on one of his weekly nocturnal supply runs, Dr. Jacoby saw the spotlight golden shovel Nadine proudly had hanging in her store window and stopped by and visited with his former client. She expressed her admiration for his program and he recounted the last time he had seen her seven years prior at a supermarket during a storm. The two shared a flirtatious glance.\nShe later marched to Big Ed's Gas Farm – gold shovel in tow – to tell Ed that she had changed and despite the love she has for him, she had been a \"selfish bitch\" to him all these years and kept he and Norma apart due to her own jealousy. Nadine had now come to realize that the only reason she and Ed had stayed together was Ed's guilt. Nadine proclaimed that she is fine now and is \"shoveling way out of the shit\" (Dr. Amp's slogan). Defining \"true love\" as giving the other person what makes them happy, Nadine freed Ed from their obligatory matrimonial bonds, giving him her blessing to be with Norma.\nNot long after, Norma and Ed got married and rumors suggested that Nadine and Jacoby may have started dating.\nNon-canon appearances\n\nSaturday Night Live sketch\nAfter the Laura Palmer case is solved when Leo Johnson confesses, Nadine (played by Jan Hooks) goes to Agent Cooper's room at the Great Northern, asking him to take her silent drape runner to the patent office in Washington, D.C. She then leaves.\nBehind the scenes\nNadine was played by Wendy Robie, who reprised the role in the 2017 series.\nTrivia\nCards released during the show's run and The Secret History of Twin Peaks give her birthdate as January 25, 1950. However, since the show takes place in 1989 and she is explicitly stated to be 35, this date cannot be considered canon.\nThe Secret History of Twin Peaks also gives her maiden name as Gertz, when it is explicitly stated in the show to be Butler. It could be theorized that \"Gertz\" or \"Butler\" is actually a middle name."}