{"name": "Naido", "url": "https://twinpeaks.fandom.com/wiki/Naido", "text": "Naido\n\"We need to get her down the mountain. She's very important, and there are people that want her dead.\"\n ―Andy Brennan\nNaido was an eyeless woman who resided in a structure on the purple sea, connected to the missing FBI secretary Diane Evans.\nBiography\nAfter vanishing from the glass box in New York City, Cooper found himself outside a structure set in the middle of a large body of water. Inside, Naido sat in front of a fireplace as Agent Cooper approached her. She did not speak, only letting out a breathy noise and signaling Cooper to be quiet when something began banging on the door to their room. She kept him away from a mechanism in the wall and led him up to the roof, where it became clear that they were in a tiny vessel in an expanse of stars. Naido pulled a lever and received an electric shock, throwing her into the dark void surrounding them.\nFollowing a message from the late Garland Briggs, members of the Twin Peaks Sheriff's Department visited a location on Blue Pine Mountain on October 1 and discovered Naido lying on the ground, naked. As Deputy Andy Brennan held her hand, a vortex appeared in the sky, and he disappeared. After an encounter with the Fireman, Brennan reappeared, holding Naido in his arms, and told the others that they needed to keep her safe and secret.\nAndy and Lucy Brennan placed Naido in an empty cell at the sheriff's station, giving her one of Lucy's bathrobes. As she continued to emit strange chirping noises, a drunk in the cell nearby began mimicking her, causing Deputy Chad Broxford to scream at them to be quiet. James Hurley and Freddie Sykes, arrested for inciting a brawl at the Roadhouse, were bewildered by her appearance and behavior.\nThe next morning, Naido grew frantic as Dale Cooper's doppelganger approached the sheriff's station. After a failed escape attempt by Deputy Broxford, Andy Brennan rushed into the holding area and shouted that he needed to take the prisoners upstairs. In Sheriff Truman's office, Naido witnessed a violent confrontation between BOB and Freddie, which ended when Freddie shattered BOB's orb into several pieces. The real Dale Cooper approached Naido and touched her hand. Her face changed into a pink mass and then broke open, revealing a window into the red room. A fleshy mass materialized and opened to reveal the face of Diane Evans, who had been replaced by a twin over twenty years before. The real Diane materialized in the office where Naido had been, wearing her clothing.\nBehind the scenes\nNaido is portrayed by Nae Yuuki, who previously made a notable appearance delivering a surreal monologue to Laura Dern's character in David Lynch's film Inland Empire.\nEtymology\nThe name \"Naido\" is a near-anagram for \"Diane,\" substituting an \"O\" for an \"E.\" Omitting these vowels, they are reverse spellings of one another.\nIn Japanese Buddhism, the term naidō (内道) literally translates to \"Inner Path,\" simultaneously describing \"inner teachings\" or \" within the path\" of nature and righteousness. Although the character 道 is most associated in the West with Chinese Taoism, it is used in East Asia to describe similar concepts in Shintoism and Buddhism, which has been studied by both Lynch and Frost.\nIn the now-extinct Tambora language, \"naido\" is the word for \"black.\" The language was spoken by the Tambora, a culture native to Sumbawa Island in Indonesia that was wiped out in the 1815 eruption of Mount Tambora.\nIn Spanish \"naido\" is \"odian\" (they hate) reversed."}