{"name": "New_York_skyscraper", "url": "https://twinpeaks.fandom.com/wiki/New_York_skyscraper", "text": "New York skyscraper\n\"- Whose place is this?- I heard a billionaire. Some anonymous billionaire.\"\n ―Tracey Barberato and Sam Colby\nA near-windowless brick skyscraper was located in New York City and reportedly owned by an anonymous billionaire.\nThe skyscraper's penthouse was allocated for placement of the glass box, surrounded by seven cameras pointing at it and other sorts of equipment. A guard was posted outside of the room containing the box.\nHistory\nAn unidentified man was hired to watch the box until being replaced by student Sam Colby. The man reportedly saw something in the box, but did not disclose the details to Colby.\nOne evening, Sam Colby watched the box and changed the SD card in one of the cameras when an intercom called for him to do so. He sat back down until he was called out for a delivery from Tracey Barberato, who had brought him coffee. She asked to go back into the room with him, but with the security guard watching, he told her she could not. When he put in the door code on a keypad to re-enter the room, she tried looking over his shoulder, but he caught her doing so. Tracey left and Sam went back into the room with his coffee, sitting back down to watch the glass box.\n \nOn the next day, Sam changed another camera's card. Upon hearing the sound of the elevator, he realized that Tracey had come and went to meet her. While Sam left the room, Dale Cooper appeared inside the glass box before being transported out. Tracey had brought coffee for Sam again and this time, the security guard was not anywhere to be seen, so Sam took Tracey into the room with him. He admitted that he did not know who owned the building and said that his job was to watch the glass box for something to appear inside. After a few moments of sitting down and watching the box, they began to make out and soon after they started having sex, a ghostly figure appeared in the box. The figure broke out and slaughtered them.\n \nWhen the structure was discovered, FBI agent Tamara \"Tammy\" Preston was instructed to oversee the investigation of the murders; on September 26, she presented her findings to Albert Rosenfield and Gordon Cole. The New York Police Department was unaware of the existence of the penthouse and did not know the name of its owner. Although multiple guards were on duty at all times, none of them could provide evidence. Sam and Tracey were ID'd, but their bodies did not show outer prints, DNA or fiber to investigate. Hundreds of digital files were found and confiscated from SD cards kept in safes in the room: most of them consisted of hours of the glass box as shown from different angles, with blurred shapes passing in front of the camera for a few frames. The night of the murder, one of the multiple cameras caught a glimpse of the ghostly figure, which faded as soon as it moved.\nOn September 29, Tammy showed Albert and Gordon a photo taken from one of the earlier SD cards, depicting Cooper's doppelganger talking to a scientist in front of the glass box.\nGallery\nSkyscraper exteriorHallGuard postHallwayRoomRoomRestroomGlass box equipment\nBehind the scenes\nThe exterior of the skyscraper is computer generated and not an actual building.\n The most similar skyscraper in New York is Long Lines Building (33 Thomas Street)."}