{"name": "Norma_Jennings", "url": "https://twinpeaks.fandom.com/wiki/Norma_Jennings", "text": "Norma Jennings\nNorma Jennings (née Lindstrom) owned the Double R Diner, and was the organizer of Meals on Wheels, formerly with Laura Palmer.\nBiography\nNorma was the high school sweetheart of Ed Hurley, but in 1969—the spring after graduation—she cheated on him with Hank Jennings one weekend, so he decided to marry Nadine Butler while in a partially inebriated state. Norma quickly married Hank in April, and they honeymooned in Hollywood, where they got tickets to The Tonight Show. Also that month, she began working at the Double R Diner.\nShe graduated from Twin Peaks Community College, earning a degree in Home Economics.\nAlso in 1969, Norma won the first annual Miss Twin Peaks Contest.\n\"The Andrew Packard Case\" and \"The Ballad of Big Ed and Norma and Nadine,\" attributed to Dale Cooper and Hawk Hill, respectively, offer an alternate story behind Ed and Norma's relationship and her marriage to Hank:\nImmediately following high school, when Ed left for deployment during the Vietnam War, the two began regularly exchanging letters. Meanwhile, Norma attended community college and formed a bond with Hank Jennings over their supposed mutual sadness over Ed's absence. The pair began having lunch together regularly and the following November, had Thanksgiving together. By this time, Norma had stopped receiving letters from Ed. Unknown to her, Ed was still writing her every day, but all of his letters were intercepted by Hank.\nAt Twin Peaks' annual Christmas tree lighting, Hank proposed to Norma and she accepted. The pair were married at the Chapel-in-the-Woods and honeymooned in San Francisco, attending a taping of The Tonight Show. After the honeymoon, Norma returned to work on her degree in nursing, but ultimately dropped out to run the Double R after her father became ill with heart disease.\nA year after Ed returned from Saigon, he stopped in at the diner and the pair engaged in an awkward conversation until Hawk decided to intervene. From this point, Ed began regularly visiting the diner.\nOne night, after Ed married Nadine Gertz, he visited Norma at the Double R and the two had a more heartfelt conversation than their previous talks since Ed's return. Ed, distraught over Norma not responding to his letters, prompted Norma to figure out Hank's deception years before. Ed began to visit the diner more regularly and the two would often hold long conversations.\nIn August of 1987, Norma began a Meals on Wheels service at the Double R Diner with the help of high school student Laura Palmer. In September of that year, Hank was convicted for vehicular manslaughter, so she and Ed began an affair.\nWhile working the counter at the Double R on a day in February 1989, Ed and Nadine came in for coffee. Upon seeing Norma, Nadine became angry and dragged Ed right back out, though not before Ed and Norma shared a look of longing.\nNorma asked waitress Shelly Johnson to help Laura load up her Meals on Wheels delivery, as another waitress, Heidi was suffering from a bloody nose.\nWhen Shelly came back inside to tell Norma that Laura ran away, they noticed the entire diner was empty. Norma had Shelly cover Laura's route, then sat down in one of the booths and cried. Ed came back in and went to her and they planned to get together.\nLater, Norma and Ed sat in a truck listening to music and discussing their relationship.\n \nOn the morning of February 24, Norma poured Bobby Briggs—Laura Palmer's boyfriend—a cup of coffee after he commented to late-to-work Heidi that he thought Germans were always on time. Norma told him she thought he only cared about making time. Bobby left with waitress Shelly—married to Leo Johnson—and on the way out, played a song on the jukebox, commenting to Norma that he would be seeing her in his dreams. She responded, \"not if I see you first.\" She watched them out the window, suspecting that they were seeing each other.\nLaura was later found murdered, deeply affecting the town.\nIn the evening, she met with Ed. They discussed their feelings for each other and her intention to leave Hank.\nNorma went to the Twin Peaks General Store the next day and encountered Nadine, who had bought cotton balls to make her drape runners silent.\nLater at the diner, Norma served a cherry pie to FBI Special Agent Dale Cooper, whom she was introduced to by Sheriff Harry S. Truman as having taken over the investigation into Laura's death. Cooper asked her about Laura's involvement with the Meals on Wheels program and then asked her for two more pieces of pie.\nEd came to the diner the following day and she served him a cup of coffee. He said that he was in trouble with Nadine for ruining her drape runners. When Audrey Horne arrived later, she served her a cup of coffee as well.\nShe discussed Hank's probable release the next day with his parole officer, who said that he had been a model prisoner. She said that she could provide him a job at the diner if he were to be released.\nNorma later attended Laura's funeral and in the evening, she served Agent Cooper a slice of huckleberry pie with vanilla ice cream and coffee.\nShe met with Hank before his hearing was to take place and he insisted that he was a changed man. At the hearing, Norma said that she could give Hank a job at the diner.\nWhen Shelly arrived at work, the two discussed their respective problematic relationships and their plans to deal with them. She then offered to Shelly a beauty day for the two of them. She then received a call from Hank's parole officer, informing her that he would be released.\nNorma went to Ed's gas station the following day to inform him that Hank would be returning. They both discussed their difficulties to tell their respective spouses their wishes to separate from them and agreed to not call each other for a while.\nAfter a day of beauty with Shelly, she came into work with her and was stopped by Hank, then released. He stated his intentions to repair their relationship and she gave him a job washing dishes.\nFor the next couple of days, she heard Hank talk about his sorrows in prison life, including his mattress in prison and that he dreamed about her \"night after night.\" He spoke of his hope to make a life with her and the diner and he kissed her, much to Norma's reluctance.\nAt the diner the next day, she delivered a note to Donna Hayward and then visited Shelly in the hospital—having suffered smoke inhalation from a fire at the Packard Sawmill—promising to bring her food due to the hospital's lack of anything good. She went by Nadine's room, where she saw Ed holding his comatose wife's hand after she attempted suicide.\nNorma went back to the diner, where Hank asked about Shelly, but Norma said she could not talk. She then received a call from Donna, who wished to pick up Laura's Meals on Wheels route.\nMargaret Lanterman entered the diner the next day and Norma greeted her, pouring a cup of coffee. She requested that Margaret dispose of her gum in a more respectful manner than she had, having recently stuck it on the diner's wall.\nNorma talked on the phone at the diner a couple of days later with Louie at the Great Northern Hotel, who informed her that restaurant critic M.T. Wentz would be coming to Twin Peaks. Hank took some money from the register to pick up decor for the diner.\nA man arrived, who they believed to be Wentz. She seated him and he ordered a cheeseburger cooked medium, along with a Coke and fries.\nShelly tearfully told her a few says later that she would have to quit her job to take care of Leo, who had become an invalid after being shot through the spine. Norma reassured her that the diner would be fine without her and that she would be welcome back whenever she was ready. Ed and Nadine then entered, the latter having reverted to an 18-year-old state of mind. A milkshake was brought out for Nadine and she broke the glass.\nNorma's step-mother, Vivian, made a surprise visit to the diner and introduces her to her new husband, Ernie Niles. When her step-mother mentioned how nice the diner looked, Norma tells her that it was in preparation for the food critic. Her step-mother and step-father then left for their room at the Great Northern and Norma found a newspaper, where Ernie wrote: \"$1000 Houston by 3 points!\" Hank came to the diner after being absent for 48 hours, which frustrated her.\nAt dinner with her step-mother, Ernie, and Hank, she excused herself from the table for a moment and her step-mother joined her. When they returned, Hank made a toast to Vivian and Ernie.\nThe next day, Norma's step-mother was disgusted with the omelet she had been served and suggested to Norma a new recipe.\nAfter the funeral of Leland Palmer, Norma attended the reception at the Palmer home. Leland had been arrested for Laura's murder and died in custody three days prior.\nShe later took away the tablecloths from the diner tables, following a negative review from M.T. Wentz, her step-mother questioning this and revealing that she was the critic.\nThe following day, Norma served a slice of pie to FBI Special Agent Roger Hardy, who said that he had heard much about it since Cooper's time in the town. Hank then came to the diner with Ernie after a hunting trip. She told Ernie that her step-mother had returned to Seattle and that he should do the same.\nA day later, she and Ed reminisced about when they made life plans together when they were young, then the following morning,\nNorma refilled Ed's coffee and he slid her a tip along with a note saying \"We need to talk.\"\nAs she left, she saw Hank, who asked her where she was going. She said she was off to run errands and that leaving him there to run the diner was a sort of test for him.\nShe went to Ed's house and expressed her love for him and her wish to be with him and they kissed. She later left after Donna came searching for Ed's nephew James.\nThe following day, Norma brought extra potatoes out to Ed, who was having a discussion with Doctor Will Hayward. After the doctor left, she went to tell Ed about Hank being in the hospital from having a tree fall on him, though Ed clarified that Hank was actually beaten up by Nadine. She also told him that Hank would be charged with a parole violation and Ed called for a celebration, not caring who would find out about their relationship.\nIn the morning, Norma laid awake in bed with Ed, talking about the twenty years that had passed since the time they separated. Nadine came in, breaking the door off the hinges on her way. She got into bed and told them about her disqualification from the wrestling tournament and apologized to Norma for beating up Hank. Nadine got up to leave and told them that she knew about their relationship and that it made her feel better about her relationship with Mike Nelson.\nShe later cleaned at the diner as Shelly came, having been attacked by the then-mobile Leo. Shelly asked for her job back, and Norma was happy to oblige. Sheriff Truman then took Norma aside to tell her that Hank would be put in jail for the attempted murder of Leo and his various parole violations.\nThe next day, Norma talked on the phone with her sister, Annie, who was to arrive in Twin Peaks the following day, after leaving a convent. She found an envelope with Shelly's name on it and gave it to her. Inside, Shelly found part of a poem and an invitation to the Roadhouse later that night. Ed then came into the diner and took her into his arms, asking her to marry him.\nShe went to Hank's cell at the sheriff's station to ask him for a divorce. He told her he wished to change, but also begged for her to make up an alibi for him on the night Leo Johnson was shot. She refused, causing him to refuse the divorce, to which she responded, \"I'd rather be his whore than your wife\" and left.\nNorma greeted Annie when she arrived at the diner the next morning and introduced her to Shelly.\nShe later showed an advertisement for the Miss Twin Peaks Contest to Shelly, who did not wish to compete.\nNorma made pies for the Contest, for which she had signed on as a judge. She told Shelly and Annie that she expected to see one of them win the title of Miss Twin Peaks, which she had won twenty years prior.\nLater—alongside the other judges, Mayor Dwayne Milford and Dick Tremayne—she observed Tim Pinkle teaching choreography to the contestants. She turned their attention from them, trying to determine the qualities they were looking for in Miss Twin Peaks, believing the major factor to be originality.\nAt the Hurley home, Nadine showed Norma, Ed, Mike, and Doctor Lawrence Jacoby some of her wrestling highlights. Jacoby said that he had gathered them together, as he believed divorces were easier when all parties involved could state their feelings. Ed told Nadine that he and Norma were planning to marry, and she announced that she and Mike would be doing the same.\nAfter Annie was named Miss Twin Peaks, chaos ensued at the contest.\nBack at the Hurley home after the chaos, Doctor Hayward patched up Nadine and Mike, the former having been hit in the head by sandbags. Nadine came to, having apparently returned to her adult state of mind, and questioned why Norma was there.\nLater life\nAs of late 2016, Norma still owned the Double R, which she had turned into a franchise called Norma's Double R, though the original diner still remained simply \"Double R Diner.\" She also owned Sweet Loaf bakery, where Shelly's daughter Becky worked. One day, as she was sorting through business documents, she watched as Becky came in to the diner and asked her mother for money. Norma noted to Shelly that this was the third time in two weeks and urged Shelly to help her daughter rather than enable her.\nAfter Becky took Shelly's car, armed with a gun, Shelly called Norma, who suggested she call Bobby. Later, as Shelly, Bobby, and Becky discussed Becky's situation with her husband Steven, Norma listened in and silently prodded Becky to apologize to Shelly.\nShe later had dinner with Ed and they were joined by Bobby until Walter Lawford – Norma's romantic and business partner – joined her to discuss business. Walter shared with Norma the profit reports of the Norma's Double R franchise. He also gave her business advice for the flagship diner, which Norma disagreed with, wishing to stick to her traditional practices and pie recipe ingredients.\nLater, Ed came to the diner again, telling Norma that circumstances had changed and they could be together. However, Norma apologized to him, as she was to meet with Walter. She advised Walter to buy her out, to take over the franchise and leave her with the flagship diner, where she had found a family. A baffled Walter left, telling Norma that she was making a mistake. She joined Ed, who asked her to marry him. They embraced with a kiss and Norma accepted his proposal.\nNot long after, Ed and Norma got married. Ed's nephew, James, played a song he wrote on his guitar during a civil ceremony conducted by the Big Log near the old train station. All of their friends – half the town, including Andy and Hawk – were in attendance.\nBehind the scenes\nNorma was played by American actress, Peggy Lipton, who reprised the role in the 2017 series. She was also known for her role as Julie Barnes in the television show The Mod Squad, which also starred Clarence Williams III, who appeared with her in one Twin Peaks scene as Roger Hardy.\nThe original script of \"Episode 1\" states that Norma has a cousin named Sue who runs a beauty shop in downtown Butte."}