{"name": "One_Eyed_Jacks", "url": "https://twinpeaks.fandom.com/wiki/One_Eyed_Jacks", "text": "One Eyed Jacks\nOne Eyed Jacks was a brothel and casino located in Canada, near the Washington border.\nHistory\nSometime around 1984, Benjamin Horne bought the establishment and at some point put madame Blackie O'Reilly in charge. Horne also assigned Emory Battis – the manager of Horne's Department Store – to recruit girls from the department store's perfume counter to work in the brothel. Horne and his brother Jerry would regularly have a coin toss to \"break in\" the newest girl at One Eyed Jacks.\nBattis hired Laura Palmer and Ronette Pulaski in August of 1987. Laura was later fired due to her cocaine use.\nFollowing Laura's murder, Audrey Horne infiltrated the brothel as a working girl as an attempt to assist in FBI Special Agent Dale Cooper's investigation. She nearly ended up sleeping with her father, and thus discovered that he was the owner.\nAudrey – after being caught speaking to Cooper in the phone – was drugged with heroin and used by Jean Renault as a bargaining tool for Ben to point Agent Cooper into a trap, as Renault wanted Cooper dead for the deaths of his brothers, Jacques and Bernard.\nHorne arranged for Cooper to go to One Eyed Jacks with the assignment of delivering ransom money and rescuing his daughter. However, Horne assigned Hank Jennings to follow Cooper and bring back the money along with Audrey.\nHorne's plan ultimately failed when Cooper was assisted by Sheriff Harry S. Truman and Deputy Hawk in rescuing Audrey without any need for the ransom money. During the operation, Blackie was killed by Jean Renault. This operation would lead to Cooper being suspended from the FBI, due to suspicion about his motives and possible connections to the deaths that occurred during the rescue and a drug smuggling operation at the brothel, led by Renault, who also employed Royal Canadian Mounted Police Officer Preston King.\nRenault further employed Jennings and Ernie Niles in the drug trafficking operation and effectively took over One Eyed Jacks from Horne.\nStaff\nBenjamin Horne – owner (c. 1984 – March 1989)\nJean Renault – owner (March 1989)\nBlackie O'Reilly – madame (– March 1989)\nJacques Renault – croupier (– March 1989)\nLawrence – croupier (by March 1989) \nLaura Palmer – prostitute (August 1987 – October 1988)\nRonette Pulaski – prostitute (August 1987 –)\nBehind the scenes\nThe name is significant because \"One Eyed Jacks\" is the name of a movie that was originally intended to be directed by Stanley Kubrick, who Lynch has frequently cited as an influence and a reason why he started to direct. The film One Eyed Jacks, which was eventually directed by Marlon Brando, also features Twin Peaks actor Hank Worden in a minor role. Finally, \"One-Eyed Jack\" is a euphemism for \"penis.\""}