{"name": "Owl_Cave", "url": "https://twinpeaks.fandom.com/wiki/Owl_Cave", "text": "Owl Cave\nThe Owl Cave was a cave within Ghostwood National Forest, part of a chain of lava tubes connected to dormant volcanoes. Named for the many owls which inhabit it, it is significant for its ancient Native American petroglyphs, carved into its stone walls. \nHistory\nOwl Cave was long-known to natives, who carved a petroglyph into the cave's walls. Among the Native American tribes that used the cave were the Flathead tribe, who stored pelts, held meetings, and eluded their enemies inside. They would say that the cave was visited by the \"Beyond\" and that there were messages left there.\nThe cave was not discovered by settlers until the late nineteenth century when it was found by a man named Denver Bob Hobbes and his companion, Wayne Chance, according to Chance's journals.\nIn the 1920s, the cave became a popular locale for lovers to get away. One contemporary newspaper stated, \"There were enough hopes and dreams in that cave to make Ali Baba green with envy.\"\nIn the spring of 1933, the Phelan Gang escaped into the cave after committing a robbery, but surrendered when the gang's leader, Milo Phelan became afraid of the dark and built a fire.\nIn 1948, while on the campaign trail, President Harry S. Truman visited the cave, becoming an honorary member of the Flathead tribe. Shortly thereafter, the Circulars took control of the cave and attempted to rename the cave \"Elk Cave,\" but nobody outside of this group accepted the new moniker.\nUntil 1989, the cave no longer held much interest to any local individuals. That year, Owl Cave became a centerpiece in an investigation by the Twin Peaks Sheriff's Department and FBI Special Agent Dale Cooper.\nBy accident, Deputy Andy Brennan struck a pickax at a petroglyph on the wall, while shooing an attacking owl away. The petroglyph that was struck operated a hidden mechanism and revealed a pole in the cache with another petroglyph on it. Windom Earle noted that the petroglyph on the pole was upside down, so he turned the pole to upright the symbol. Turning the symbol operated another hidden mechanism which toppled part of the cave wall to reveal the Owl Cave Map/Calendar.\nIt was found that the cave held secrets to entering the fabled Black Lodge.\nOwl Cave Map/Calendar\n \nAn ancient Native American petroglyph is carved into the stone wall of Owl Cave. It shows the location of the gateway to the Lodges. The gateway itself only exists at certain points in space and time, given by the details of the map and the calendar.\nOn the petroglyph (probably drawn by the Native Americans) can be seen:\nTwo humans, one tall and the other small.\nTwo mountains\nA waterfall\nA lake\nMany circles one being the sun and the other the moon.\nA circle of trees\nA fire with an upside down ring symbol inside which itself looks like one or two childishly drawn birds.\nBy superimposing the map with the map of Twin Peaks, especially bodies of water, the location to the gateway can be deduced. It is Glastonbury Grove, the circle of 12 sycamore trees.\nSome of the circles are planets, but the \"Four-H club\" is a superposition of Jupiter and Saturn astrological symbols, which indicates a precise planetary position: during the Jupiter and Saturn conjunction. The conjunction is associated with big changes in power and fortune, Jupiter being expensive in its influence and Saturn being contractive, the conjunction is an intensification with the potential for great changes.\nOn the painting can also be seen a puddle of oil near the circle of trees. Oil is also an opening to the gateway.\nBehind the scenes\nWhen Windom Earle's computer makes part the glyph blinking red are the location of the White Tail Falls, Black Lake and Pearl Lakes from the Access Guide but it gives no indications of where Glastonbury Grove should be. Indeed, the drawing of the circle of trees is at the other side of where it is in Twin Peaks: Access Guide to the Town.\nDespite dialogue, the circle only has eleven trees, not twelve.\nThe planets on the map seem to be:\n♅ Left to the human figures is Uranus\n♆ Above the small man is Neptune\n♂︎ Left to the fire is Mars\n♃ Right to the fire is Jupiter\n♄ Right to the circle of trees is Saturn\n☿ Left to the Sun is Mercury\n♀︎ Right to the Sun is Venus\n♇ Next to the waterfall is Pluto\n♁ Next to the bottom symbol is Earth\nContrary to dialogue, there is no superposition of Jupiter and Uranus on the map.\nThe symbol for conjunction is seen under the Sun and under the circle of trees.\nThe symbol at the top right and the bottom right are apparently lifted from petroglyphs from the Torrey Creek, Wind River, Wyoming inhabited by the Shoshone tribe. The bottom symbol is interpreted to be associated with wokaimumbic a giant man-eating owl from the Shoshone culture."}