{"name": "Packard_Sawmill", "url": "https://twinpeaks.fandom.com/wiki/Packard_Sawmill", "text": "Packard Sawmill\nPackard Sawmill was an industrial facility in the town of Twin Peaks. \nHistory\nThe mill was founded in the late 1880s by James Packard on two acres by Black Lake Falls with eight employees. After an altercation with Kwakiutl Indians over the land, the mill was built, and its saw was originally powered by the water above the falls it was built next to.\nThe original mill's structure was razed in 1922 and was rebuilt across 25 acres by James’ son, Thomas. The employment had grown to 100 people by 1924.\nThe mill's primary competitor was the Martell Mill (which had existed for three years longer), but the Packard Mill, under the capable management of Thomas Packard, eventually ended up buying the Martell Mill in 1933 and closed it in 1939.\nIn 1935, the mill was temporarily shut down due to a labor dispute.\nThomas' sister, Daisy managed the mill during World War II. Daisy introduced mechanical barkers, a skyhook cable car, and a wigwam burner.\nThomas' son Andrew took over the mill in 1948 and continued to make the mill more efficient with the introduction of a chainsaw in the 1950s, and computerizing the plant's machinery by 1972. Under Andrew Packard, the mill increased production by twenty-five percent.\nFollowing Andrew's apparent death in 1987, the mill was inherited by his widow, Josie Packard, and his sister Catherine ran it along with her husband Pete Martell. During this time, it was the only major facility in Twin Peaks to challenge Benjamin Horne's monopoly on the economy of Twin Peaks.\nIn 1989, the Packard Sawmill was partially destroyed by a fire. The fire was caused by a bomb set up by Leo Johnson, who was working for Horne, who later acquired the land, only to have it end up back in Catherine's hands, then finally back to his own, following his plans to conserve the surrounding woodlands.\nAlthough management assured the mill workers that it would resume operations, Catherine soon closed the mill and sold it to Horne, devastating Twin Peaks' economy. The surviving part of the mill remained standing as of late 2016.\nBehind the scenes\nHarley Peyton admits that the network's insistence of revealing Laura Palmer's killer and Joan Chen (Josie Packard)'s departure created challenges while writing the mill storyline.\nThe remains of the mill are seen in Part 9, which places the mill across from the sheriff's station. This contradicts the map of Twin Peaks given in Twin Peaks: Access Guide to the Town, which places the mill on the northern edge of town and the sheriff's station in the center."}