{"name": "Parsonage", "url": "https://twinpeaks.fandom.com/wiki/Parsonage", "text": "Parsonage\n\"I've often felt there were spirits in this wood...\"\n ―Jack Parsons\nThe so-called \"Parsonage\" was the mansion of Jack Parsons, located on Orange Grove Boulevard in Pasadena, California. During the 1940s, it doubled as the headquarters and gathering place for the West Coast \"lodge\" of Thelema, which Parsons led.\nHistory\nThe house was built by lumber baron Arthur Fleming, an early benefactor of the nearby California Institute of Technology, using lumber sourced from the region around Twin Peaks, Washington.\nParsons purchased the mansion in 1943 with the windfall from the success of the Jet Propulsion Laboratory, and hosted several gatherings attended by Thelema adherents and other laboratory employees. At Parsons' invitation, writer L. Ron Hubbard took up residence in the Parsonage in August 1945 and soon thereafter attended one of these gatherings, later recalling:\n\"A strange, incense-laden air of debauchery, populated by a motley assemblage of leftists, bohemians and hangers-on, attended by a cadre of attractive young JPL secretaries, all of them swept up into a kind of fever cult. Many of the guests wore colorful, erotic masks, and a few were in elaborate Egyptian costumes or masks with distorted animal faces. Disturbing atonal music played from somewhere and prompted much uninhibited dancing, and by that I don't mean the jitterbug. In some back rooms, I have no doubt, there was rampant drug use. I caught the unmistakeable tang of reefer wafting throughout the upper floor and I believe the punch they were serving may have been laced with a home-brewed mind-altering substance, perhaps absinthe. In many of these rooms, not even behind closed doors, sexual hijinks abounded. I'm no prude, but I've never felt more Episcopalian in my life.\"\nLate at night, Parsons and Hubbard spoke at length in a room decorated with pagan artwork and a life-sized statue of Pan, discussing Parsons' late mentor Aleister Crowley, alchemy, and the similarities between Parsons' chosen field and the practice of magic. Hubbard noted that Parsons was worrying an inscribed ring of some sort, and at one point intoned \"the magician longs to see\" and remarked that he had always sensed spirits in the walls of the house. Finally, he abruptly said that he needed to attend to the other guests and excused himself.\nAfter Parsons was accused of selling state secrets to a foreign government, he was terminated by JPL and forced to sell the Parsonage. By 1952, the mansion had been demolished to make way for an apartment complex.\nBehind the scenes\nThe real Parsonage was located at 1003 South Orange Grove Avenue, Pasadena, California."}