{"name": "Part_12", "url": "https://twinpeaks.fandom.com/wiki/Part_12", "text": "Part 12\nNot to be confused with Episode 12.\n\"Part 12\" is the twelfth episode of the 2017 series of Twin Peaks and the forty-second episode of the franchise as a whole. It aired on July 30, 2017.\nPlot\n\"Let's rock.\"\n ―Diane Evans\nIn Buckhorn, Albert, Tammy, and Gordon have a drink and the men quietly inform Tammy about Project Blue Book and more specifically the Blue Rose cases, thus inducting her into the Blue Rose task force among the ranks of Albert, Jeffries, Desmond, and Cooper. Diane soon joins them and they offer her an official position in the investigation; she agrees to this by saying “Let’s Rock”.\nJerry runs out of the woods and into a clearing.\nSarah Palmer buys alcoholic beverages and cigarettes at a grocery store. She also inquires about an unfamiliar jerky being sold at the store. She warns them of men coming and suffers a breakdown.\nCarl Rodd stops a trailer park resident, Kriscol, asking him about his income and gives him $50, saying not to pay his rent for the month.\nCooper is taken outside by Sonny Jim to play catch, but ends up just being hit by Sonny Jim's throw.\nHawk goes to Sarah's home. He hears a noise inside, which Sarah dismisses as something in the kitchen. Hawk ensures her that if she needs anything, to call him.\nMiriam lays unconscious in a hospital bed at Calhoun Memorial Hospital.\nDiane responds to a text message asking \"Las Vegas?\" with \"THEY HAVEN'T ASKED YET.\"\n \nFrank visits Benjamin Horne, telling him of Richard committing the hit-and-run and his subsequent attempted murder of Miriam. Benjamin reflects on Richard's troubled past and shows Cooper's hotel key to Frank, which he had intended to give to Harry as a memento. Frank leaves with the key, remarking on the coincidence that they are currently reopening a case involving Cooper. After Frank leaves, Ben tells Beverly about Richard and his father, who bought him a bike when he was a child. He then has Beverly arrange to pay for Miriam's medical expenses.\nGordon tells a French woman one of his \"war stories\" until Albert shows up, dismissing the woman, who takes her time leaving Gordon's room. Albert reports on Diane's received and sent text messages.\n \nHutch and Chantal stake out Dwight Murphy's home, assassinating him as he arrives home and is discovered by his son.\nJacoby broadcasts another Dr. Amp show with Nadine Hurley watching from her store.\nAudrey Horne argues with her husband Charlie, saying that they need to go to the Roadhouse to look for her lover Billy; he has been missing for two days and Audrey recently had dreamed of him bleeding from the mouth and nose. Charlie complains that he has too much paperwork and recommends they start searching tomorrow morning; Audrey calls him spineless then suggests they call Tina — supposedly the last person to see Billy. After much arguing over their potential divorce, Charlie calls Tina and begrudgingly agrees to go to the Roadhouse after. He receives some grave news, but blankly refuses to tell Audrey anything about the conversation.\nDiane goes to the bar and searches the coordinates she saw in Albert's photo of Ruth Davenport's arm, finding that they lead to Twin Peaks.\nAt the Roadhouse, Chromatics perform \"Saturday.\" In a booth, Abbie and Natalie talk about their friend Angela, concerned about her new infatuation with Clark, who had previously been seen going out with Mary. Trick joins them, shaken by the experience of being driven off the road by a driver heading the wrong way.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Dale Cooper\nIn Alphabetical Order\nElizabeth Anweis as Abbie\nChrysta Bell as FBI Agent Tammy Preston\nRichard Beymer as Benjamin Horne\nScott Coffey as Trick\nAna de la Reguera as Natalie\nLaura Dern as Diane Evans\nSherilyn Fenn as Audrey Horne\nMiguel Ferrer as FBI Agent Albert Rosenfield\nRobert Forster as Sheriff Frank Truman\nPierce Gagnon as Sonny Jim Jones\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nAshley Judd as Beverly Paige\nLuke Judy as Warden Murphy's son\nDavid Patrick Kelly as Jerry Horne\nSheryl Lee as Laura Palmer\nJennifer Jason Leigh as Chantal Hutchens\nSarah Jean Long as Miriam Sullivan\nDavid Lynch as FBI Deputy Director Gordon Cole\nBerenice Marlowe as French Woman\nZoe McLane as Check-Out Girl\nClark Middleton as Charlie\nJames Morrison as Warden Dwight Murphy\nJohnny Ochsner as Bag-boy\nBill O'Dell as Kriscol\nWendy Robie as Nadine Hurley\nTim Roth as Gary \"Hutch\" Hutchens\nHarry Dean Stanton as Carl Rodd\nRuss Tamblyn as Dr. Lawrence Jacoby\nGrace Zabriskie as Sarah Palmer\nChromatics:\nRuth Radelet\nAdam Miller\nJohnny Jewel\nNat Walker\nStunt Double: Trampas Thompson\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Stars and Stripes Forever\"\nWritten by John Phillip Sousa\nPerformed and arranged by the U.S. Army Band\n\"Saturday\"\nPerformed by Chromatics\nWritten by Adam Miller and Johnny Jewel\nCourtesy of Italians Do It Better\nNotes\nWendy Robie is credited as \"Wendie\".\nThe scene with the French woman in the hotel was the final scene shot to feature Gordon Cole and Albert Rosenfield, thus it serves as Miguel Ferrer's final time playing his character before his death in 2017."}