{"name": "Part_4", "url": "https://twinpeaks.fandom.com/wiki/Part_4", "text": "Part 4\nNot to be confused with Episode 4.\n\"Part 4\" is the fourth episode of the 2017 series of Twin Peaks, and the thirty-fourth episode of the franchise as a whole. It was released on the Showtime Anytime app on May 21, 2017 and aired on May 28, 2017.\nPlot\n\"...brings back some memories.\"\n ―Bobby Briggs\nAt the Silver Mustang casino, Agent Cooper continues to win the jackpot at every slot machine he uses, earning him the nickname \"Mr. Jackpots.\" He is approached by Bill and Candy Shaker, who believe he is Dougie Jones. He repeats Bill saying \"home,\" and he is told where Dougie lives. As Cooper starts to leave, he is taken to the casino office, where he is given his winnings and a limo is called to get to Dougie's home.\nCooper directs the limo driver with the details he knows about Dougie's house that Bill Shaker gave him. He gets out of the limo and stands with the driver until Dougie's wife, Janey-E angrily approaches and slaps him as Dougie had been away for three days. She takes him inside, angry with him until she discovers his money from the casino, which she states can be used to pay off their debts.\nCole visits with Bill Kennedy as he waits to meet with Denise Bryson, who is now the FBI Chief of Staff. He informs her about the situation with Cooper being in a federal prison in South Dakota. Bryson displays doubts about Cole's decision to bring Agent Preston with him, but Cole reminds Denise of the support he has given her throughout her career. Denise voices her support and Gordon leaves.\nLucy talks on the phone with Sheriff Frank Truman about the thermostat. Truman then walks into the station, which scares Lucy, causing her to fall backward in her chair, apparently due to her not understanding cell phones. Truman gets an update from Maggie and the deputies on events that occurred while he was away fishing. He talks to Deputy Bobby Briggs about the drug overdose of Denny Craig, surmising it to be due to designer Chinese drugs, though Bobby does not believe the drugs are coming from Canada. Andy explains cell phones to Lucy and reassures her before going to see Sheriff Truman.\nTruman meets with Hawk about the message from Margaret's log with Deputy Chad Broxford present. Andy and Lucy enter and defend the Log Lady from Chad's remarks until the sheriff dismisses him. Bobby comes in and sees a photo of Laura, which causes him to become emotional. Bobby notes that Cooper was the last person to see his father alive, which Truman and Hawk were unaware of, but he does not know what Cooper and his father discussed. Deputy Jesse Holcomb enters to announce the arrival of Andy and Lucy's son, Wally Brando. The Brennans excitedly leave and Holcomb says Wally intends to share his respects to the sheriff.\nWally - dressed like Marlon Brando in The Wild One - greets Frank and tells him he hopes for the recovery of Frank's brother, Harry S. Truman and gives his parents his blessing to turn his room into a study. When Lucy asks him to tell them about his travels, he goes on a speech, speaking with a Marlon Brando impression. After this, Truman awkwardly goes inside.\nCooper sits on Dougie's bed and Mike faintly appears to him to say that he was tricked and holds up a small golden orb. Mike tells him that one of them must die, then Cooper feels the need to urinate, so Janey-E takes him to the bathroom and he relieves himself. He looks at himself in the mirror and Janey-E dresses him, but leaves the tie up to him as she wakes Dougie's son, Sonny Jim, and makes breakfast. Sonny Jim gives Cooper and thumbs-up and Cooper imitates it.\nWith Dougie's tie over his head, Cooper goes to the breakfast table, where Sonny Jim helps him sit down and eat his pancakes. Janey-E brings him some coffee and he takes a sip. He spits it out due to the heat and grins, saying \"Hi!\"\nConstance Talbot shows Chief Boyd and Detective Macklay the results of the male John Doe found in Ruth Davenport's apartment, but she is blocked access to the victim's identity and records, which require military authorization.\nCole arrives in South Dakota Airport with Agents Preston and Rosenfield and they are greeted by two FBI agents, one driving them to the prison where Cooper's doppelganger is being held. They are presented with the contents found in his trunk: cocaine, a machine gun, and a dog leg. They then interview Cooper's doppelganger, who claims he has been working undercover with Phillip Jeffries since his disappearance and that he was on his way to inform Cole about his activities when he had his car accident.\nOn the way out, Cole suggests giving Cooper his phone call and to keep him informed about it. Cole dismisses Preston so that he and Albert can speak privately. Albert admits to Cole that he authorized Jeffries to give Cooper information about their \"man in Colombia\" several years before, after Phillip said Cooper needed the information urgently. A week after Albert did this, the man had been killed. They then discuss the meeting with Cooper, feeling that something is wrong. They admit to each other that they do not understand the situation, classifying it as a Blue Rose. They discuss a certain person to bring to Cooper, and Albert notes that he knows where she drinks.\nAt the Roadhouse, Au Revoir Simone play \"Lark.\"\nCredits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJane Adams as Constance Talbot\nDana Ashbrook as Deputy Bobby Briggs\nChrysta Bell as FBI Agent Tammy Preston\nBrent Briscoe as Detective Dave Macklay\nMichael Cera as Wally Brando\nRichard Chamberlain as Bill Kennedy\nDavid Dastmalchian as Pit Boss Warrick\nDavid Duchovny as Denise Bryson\nMiguel Ferrer as FBI Agent Albert Rosenfield\nRobert Forster as Sheriff Frank Truman\nPierce Gagnon as Sonny Jim Jones\nBrett Gelman as Supervisor Burns\nHarry Goaz as Andy Brennan\nJames Grixoni as Deputy Jesse Holcomb\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nStephen Kearin as FBI Driver\nDep Kirkland as Chief Mike Boyd\nJay Larson as Limo Driver\nSheryl Lee as Laura Palmer\nDavid Lynch as FBI Deputy Director Gordon Cole\nKarl Makinen as Inspector Randy Hollister\nJames Morrison as Warden Dwight Murphy\nSara Paxton as Candy Shaker\nJohn Pirruccello as Deputy Chad Broxford\nLinda Porter as Lady Slot-Addict\nKimmy Robertson as Lucy Brennan\nAl Strobel as Phillip Gerard\nEthan Suplee as Bill Shaker\nSabrina S. Sutherland as Floor Attendant Jackie\nJodee Thelen as Maggie\nNaomi Watts as Janey-E Jones\nAu Revoir Simone:\nHeather D'Angelo\nErika Forster\nAnnie Hart\nUncredited\nTyler Malik as FBI Agent\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Take Five\"\nWritten by Paul Desmond\nPerformed by The Dave Brubeck Quartet\nUsed by Arrangement with Desmond Music Company and Derry Music Company\nAll rights reserved.\n\"Lark\"\nWritten and performed by Heather D'Angelo, Erika Forster, and Annie Hart\nPublished by Only Ponies, Touch Of Spring, Triple Keyboard Action (ASCAP)\nCourtesy of Our Secret Record Company\nTrivia\nDuring the fingerprint matching sequence, the bottom right section of the screen is just the output of the `hexdump` program which goes on forever until 'Ctrl-C' is pressed to stop it. This is done on a Mac or Linux by entering the following in a Terminal: hexdump -C /dev/urandom | while true; do read LINE; echo $LINE; sleep .05; done"}