{"name": "Part_7", "url": "https://twinpeaks.fandom.com/wiki/Part_7", "text": "Part 7\nNot to be confused with Episode 7.\n\"Part 7\" is the seventh episode of the 2017 series of Twin Peaks and the thirty-seventh episode of the franchise as a whole. It aired on June 18, 2017.\nPlot\n\"There's a body all right.\"\n ―Dave Macklay\nJerry Horne wakes up in the woods, extremely stoned from his last bout of drug use. He calls Ben, frantically claiming someone stole his car and he does not know where he is.\nAt the Twin Peaks Sheriff's Department, Hawk shows Frank the pages he found in the bathroom door, which he discovered were three of the four missing pages from Laura's secret diary given by Laura to Harold Smith. One of the pages details an encounter Laura had with Annie Blackburn in a dream, where she told her that \"the good Dale is in the lodge and can't leave.\" Another page details Laura knows \"it isn't BOB,\" which Hawk sees as evidence that Leland found and hid the pages during one of his visits to the station, likely when he was being interrogated for the murder of Jacques Renault. Hawk is puzzled by the claim that Cooper could not leave the Lodge, as Harry himself saw Cooper leave the Black Lodge with Annie: the only explanation that whoever left the lodge was not \"the good Cooper.\" Frank tries calling Harry to ask what he thinks, but decides against it after learning Harry's condition has gotten worse.\nAndy interrogates a local farmer regarding his truck, the same one Richard Horne accidentally killed a young boy with earlier. The farmer refuses to explain who was driving the truck at the time of the incident, but arranges a meeting with Andy to explain everything.\nFrank Skype-calls Doc Hayward, who is off fishing. Doc recalls that he brought Cooper into the hospital because he was acting \"strange.\" An hour later he saw Cooper leaving Intensive Care, fully-dressed and with a strange expression. He ponders whether Cooper was checking in on Audrey Horne, who was still comatose after the bank explosion.\nLieutenant Cynthia Knox arrives in Buckhorn, where she meets with Detective Macklay. Initially treating the discovery of the prints as another by-the-books case, she is shocked to learn that Major Briggs' prints actually came from a body. Constance Talbot shows her the body, which she notes belonged to a man in his late 40s and died within the last few days. Lieutenant Knox calls Colonel Davis about this development, who points out that Major Briggs would have to be in his 70s if he died recently. Lieutenant Knox informs the Buckhorn staff that it will most likely not be their investigation for long. Meanwhile, a mysterious dark man walks past the morgue.\nAlbert reports to Gordon he could not get a word in to Diane about Cooper before she cursed him out. Gordon and Albert meet with Diane and a younger man at her apartment, where she coldly receives them. Gordon explains they need Diane to come to South Dakota to identify the imprisoned Cooper, as they suspect something is wrong with him. Diane reluctantly joins them.\nOn the flight to South Dakota, Tammy shows Gordon and Albert her analysis of the imprisoned Cooper's prints. Though they are a match, someone at the prison had to reverse the prints to get it: not only does the Cooper in prison say the backwards word \"yrev,\" but his prints are also backwards. Gordon praises Tammy's hard work.\nDiane arrives at the prison, where she meets with the doppelganger. Diane asks if he remembers the last night they saw each other, which the doppelganger correctly states was at her house. Easily realizing he is not the real Cooper, Diane becomes emotional and shuts down the meeting. On their way out, Gordon tells Warden Murphy to keep Cooper imprisoned until he hears from the FBI. Outside the prison, Diane tells Gordon that there is something missing from this Cooper that makes her certain it is not the Dale Cooper she knew. Gordon asks her what happened when she and Cooper last met, which she states she will tell him about some other time. As the doppelgänger is led back to his cell, he tells a guard to tell Warden Murphy he needs a meeting with him in his office \"about a strawberry.\"\nAndy waits at the meeting place for the farmer, who is over a half-an-hour late. Unbeknownst to him, the farmer's truck is still at his house with the door wide open. His informant a no-show, Andy leaves.\nThe doppelganger meets with Warden Murphy, who threatens him with a gun. The doppelgänger informs him about the dog legs: one was in his trunk, the other three were sent out to people who could pose a threat to Warden Murphy if anything bad were to happen to the doppelganger. When Murphy asks the doppelganger how he knows about this, he names \"Joe McCluskey.\" Murphy puts down the gun and asks what he wants. The doppelganger requests a car for himself and Ray Monroe with \"a friend in the glove compartment\" that night. He tells Warden Murphy that he will never see him again, and no one will ever hear anything more about Joe McCluskey or \"Mr. Strawberry.\"\nAs Janey-E waits outside the office, Cooper scribbles on his desk while Anthony Sinclair tries to find out what he was talking to Bushnell Mullins about. A group of three detectives come in to ask him about Dougie's car, just as Janey-E comes in to retrieve him. Janey-E ends up holding the bulk of the conversation for Cooper. The detectives explain the car was involved in an explosion that killed some members of a car-theft gang. The detectives leave, somewhat intimidated by Janey-E.\nAs the couple leave the building, Janey-E tells Cooper that she settled the gambling debt, and notes that they will be using his jackpot money for Sonny Jim. Ike \"the Spike\" suddenly approaches them with a gun drawn. Cooper immediately springs into action, grabbing Ike's arm and sending it to the ground, where it harmlessly fires off a shot into the pavement. He then karate chops Ike's neck while Janey-E chokes the would-be assassin. The evolution of the arm appears to Cooper, insisting that he \"squeeze hand off!\" Cooper ends up squeezing Ike's hand so much a piece of skin becomes stuck to the gun, before with another karate chop Ike painfully retreats. Various witnesses are interviewed about the incident, all expressing disbelief at Dougie Jones' actions. A forensic investigator removes the piece of Ike's skin from the gun.\nAt the Great Northern Hotel, Ben Horne and Beverly Paige try to find out where a mysterious ringing noise is coming from. Beverly then gives him an old Great Northern key that came in the mail, with Ben commenting they switched to cards long ago. He then realizes the key belongs to Room 315, the room Special Agent Dale Cooper was shot in. Beverly is ignorant about both Cooper and the murder of Laura Palmer, which Ben expresses amusement at. Beverly then returns to her home where she meets with her sick husband Tom. Tom is suspicious about her recent whereabouts, which frustrates Beverly.\nAt the Roadhouse, after all the customers have left, a man sweeps the floor while Jean-Michel Renault tends to the bar as Booker T & the M.G.'s \"Green Onions\" plays. Renault receives a call about two prostitutes he sent to a customer, only to learn that the prostitutes were fifteen years old. He denies any responsibility for wrongdoing.\nThe doppelganger makes his exit from the prison with Ray Monroe as Warden Murphy watches.\nLate at night at the Double R Diner, Heidi and Shelly serve customers while Norma goes through some paperwork. A man runs in and asks if anyone has seen Billy before running out again.\nCredits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJane Adams as Constance Talbot\nStephanie Allynne as Soccer Mom\nMädchen Amick as Shelly\nChrysta Bell as FBI Agent Tammy Preston\nRichard Beymer as Benjamin Horne\nBrent Briscoe as Detective Dave Macklay\nLarry Clarke as Detective T. Fusco\nLaura Dern as Diane Evans\nHugh Dillon as Tom Paige\nEdward 'Ted' Dowling as Farmer\nJudith Drake as Nurse\nEric Edelstein as Detective \"Smiley\" Fusco\nMiguel Ferrer as FBI Agent Albert Rosenfield\nRebecca Field as Another Mom\nRobert Forster as Sheriff Frank Truman\nWarren Frost as Doc Will Hayward\nIvy George as 5-Year-Old Girl\nHarry Goaz as Deputy Andy Brennan\nGeorge Griffith as Ray Monroe\nAndrea Hays as Heidi\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nErnie Hudson as Colonel Davis\nJesse Johnson as Younger Man\nAshley Judd as Beverly Paige\nDavid Patrick Kelly as Jerry Horne\nDavid Koechner as Detective D. Fusco\nSheryl Lee as Laura Palmer\nPeggy Lipton as Norma Jennings\nDavid Lynch as Deputy Director Gordon Cole\nRiley Lynch as Bing\nMark Mahoney as Prison Guard\nKarl Makinen as Inspector Randy Hollister\nJames Morrison as Warden Dwight Murphy\nDon Murray as Bushnell Mullins\nWalter Olkewicz as Jean-Michel Renault\nAdele René as Lieutenant Cynthia Knox\nElena Satine as Rhonda\nTom Sizemore as Anthony Sinclair\nNaomi Watts as Janey-E Jones\nChristophe Zajac-Denek as Ike \"The Spike\" Stadtler\nStunt Double: Ryan Sturz\nUncredited\nWilliam Clouter as sweeping man\nGabriel Lane as Woodsman\nUnknown performer as evolution of the arm\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Sleep Walk\"\nWritten by Santo Farina, John Farina, and Ann Farina\nPerformed by Santo and Johnny\nUsed by permission of Carbet Music, Inc.\n\"Green Onions\"\nWritten by Al Jackson Jr., Stephen Cropper, Booker T. Jones, and Lewie Steinberg\nPerformed by Booker T. and the M.G.'s\nCourtesy of Atlantic Recording Corp.\nNotes\nThis episode was dedicated to the memory of Warren Frost.\nThe floor sweeping scene was unscripted.\nThe customers change during the credits was intentionally made by Lynch but Frost is unaware of the meaning.\nProduction errors\nGordon Cole makes a mistake when quoting Cooper's Double, saying \"I'm very very happy to see you again old friend\" although the actual line was \"It's yrev very good to see you again old friend\".\nThe closed captioning erroneously indicates that Bing asks for \"Bing,\" instead of \"Billy.\" This was later fixed in the DVD and Blu-ray releases."}