{"name": "Part_15", "url": "https://twinpeaks.fandom.com/wiki/Part_15", "text": "Part 15\nNot to be confused with Episode 15.\n\"Part 15\" is the fifteenth episode of the 2017 series of Twin Peaks and the forty-fifth episode of the franchise as a whole. It aired on August 20, 2017.\nPlot\n\"There's some fear in letting go.\"\n ―Margaret Lanterman\nNadine Hurley walks along the street, proudly displaying her gold shovel. She reaches Big Ed's Gas Farm and tells Ed that she has changed, having come to the realization that he only stayed with her due to his guilt, so she decides to \"free\" him, giving her blessing for him to pursue Norma. She then leaves a shocked Ed at the Gas Farm.\nEd goes to the Double R Diner to whisk away Norma, but she apologizes as Walter joins her. Crushed, he sits down and orders a coffee from Shelly, adding \"and a cyanide tablet.\" Norma tells Walter to take over the franchise and to leave her with the flagship diner, as she wishes to spend more time with the family she has made through the diner. Baffled, Walter tells her she has made a mistake and leaves. Norma goes to Ed and he asks her to marry him. They embrace and Norma agrees to Ed's proposal as Shelly watches with glee.\nCooper's doppelganger drives down a dark road, reaching a convenience store, where a woodsman leads him to a room above it meeting another woodsman by a mechanism and a Jumping Man. He requests Phillip Jeffries and is led to a motel. A woman approaches and unlocks a room door for him. Inside the motel room, he meets with Jeffries, speaking through a steam-emitting mechanism. The doppelganger asks about Jeffries sending Ray to kill him and confirms that Jeffries had not contacted him at the motel, and that the person who did had sent Ray. He reflects on Jeffries' appearance at the FBI headquarters and questions him about Judy, who Jeffries' says \"Cooper\" has already met. Jeffries then gives him a set of coordinates. A phone rings as the doppelganger continues questioning Jeffries. As the mechanism disappears, the doppelganger answers the phone, but is promptly teleported outside the convenience store, and finds that the line is dead. \nLeaving the phone booth, he is confronted by an armed Richard Horne, who knows him as an FBI agent from a photo his mother Audrey kept. \"Cooper\" quickly disarms him and tells him to join him in the truck. He then sends a text, reading, \"Las Vegas?\" before leaving with Richard. The convenience store emits electricity and smoke before it disappears.\nCyril Pons walks through the woods with his dog as Steven and Gersten Hayward hide in the shadow of a large tree. Steven has a gun with him and is contemplating suicide, while Gersten tries to console him. Pons sees them, and Gersten runs to a different hiding place before hearing a gunshot. Pons reaches the trailer park and tells Carl about the situation. They look over at Steven and Becky's trailer, with the window still broken from their last fight.\nAt the Roadhouse, the crowd dances to \"Sharp Dressed Man\" as James and Freddie approach Renee's table. Chuck, her husband, attacks him and Freddie comes to his aid with his gloved fist, knocking Chuck and his friend out. James urges the crowd to contact 9-1-1 for the men Freddie incapacitated.\nWilson brings Headley to a Douglas and Jane Jones and their family that have been brought in for questioning. However, these are not the correct Joneses, as they have multiple children.\nTodd tells Roger to find Anthony Sinclair just before they are both assassinated by Chantal.\nAt the Twin Peaks Sheriff's Department, Hawk and Bobby lock up James and Freddie. James takes notice of Naido.\nChantal and Hutch eat in their van.\nJaney-E brings Cooper a slice of cake, reflecting on their life since they became friends to the Mitchum brothers. As he eats, Cooper observes and experiments with objects on the table, particularly a TV remote. He turns on Sunset Boulevard and hears Gordon Cole's name spoken in it, startling him. He then looks over at an electrical outlet and crawls toward it, sticking a fork inside and causing a blackout.\nMargaret calls Hawk, telling him that she is dying. He expresses his condolences, but she speaks to him about death and tells him to remember everything that she has told him and to watch for \"the one\" under the moon at Blue Pine Mountain. Hawk quietly says goodbye as she hangs up.\nFrank sits in the conference room, soon joined by Bobby, Lucy, Andy, and Hawk, who has assembled them to mourn Margaret, who has passed away. The light inside her cabin goes out.\nAudrey and Charlie prepare to leave for the Roadhouse, though Audrey delays them, commenting that Charlie now seems like a different person to her. Charlie takes off his coat and Audrey attacks him.\nAt the Roadhouse, The Veils perform \"Axolotl\" as two men remove Ruby from her booth. She crawls on the floor and screams.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as\nDale Cooper\nDale Cooper (doppelganger)\nIn Alphabetical Order\nJay Aaseng as Drunk\nJoe Adler as Roger\nMädchen Amick as Shelly Briggs\nDana Ashbrook as Deputy Bobby Briggs\nDavid Bowie as Phillip Jeffries\nCatherine Coulson as Margaret Lanterman (The Log Lady)\nOwain Rhys Davies as Agent Wilson\nEamon Farren as Richard Horne\nSherilyn Fenn as Audrey Horne\nJay R. Ferguson as Special Agent Randall Headley\nMiguel Ferrer as FBI Agent Albert Rosenfield\nPatrick Fischler as Duncan Todd\nRobert Forster as Sheriff Frank Truman\nNathan Frizzell as Voice of Phillip Jeffries\nMark Frost as Cyril Pons\nPierce Gagnon as Sonny Jim Jones\nHarry Goaz as Deputy Andy Brennan\nGrant Goodeve as Walter Lawford\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nCaleb Landry Jones as Steven Burnett\nSheryl Lee as Laura Palmer\nJennifer Jason Leigh as Chantal Hutchens\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nClark Middleton as Charlie\nCasey O'Neill as Skipper\nJohn Pirruccello as Deputy Chad Broxford\nKimmy Robertson as Lucy Brennan\nWendy Robie as Nadine Hurley\nTim Roth as Gary \"Hutch\" Hutchens\nRod Rowland as Chuck\nCarlton Lee Russell as Jumping Man\nMalachy Sreenan as Bosomy Woman\nHarry Dean Stanton as Carl Rodd\nJR Starr as MC\nJessica Szohr as Renee\nJake Wardle as Freddie Sykes\nNaomi Watts as Janey-E Jones\nAlicia Witt as Gersten Hayward\nCharlyne Yi as Ruby\nNae Yuuki as Naido\nThe Veils:\nFinn Andrews\nSophia Burn\nUberto Rapisardi\nStunt Double: Cody Thornbury\nIn Memory of Margaret Lanterman\nUncredited\nChristian Calloway as woodsman\nCecil B. DeMille as himself (stock footage)\nWilliam Holden as himself / Joe Gillis (voice)\nStan Johnson as himself / 1st Assistant Director (stock footage)\nGabriel Lane as woodsman\nAnthony Marcacci as woodsman greeting Cooper\nGloria Swanson as herself / Norma Desmond (stock footage)\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"I've Been Loving You Too Long\"\nWritten by Otis Redding and Jerry Butler\nPerformed by Otis Redding\nCourtesy of The Monterey International Pop Festival Foundation\n\"Summer Night\"\nWritten by Angelo Badalamenti and David Lynch\nPerformed by Thought Gang\n\"Sharp Dressed Man\"\nWritten by Billy Gibbons, Dusty Hill, and Frank Beard\nPerformed by ZZ Top\nCourtesy of Warner Bros. Records\n\"Threnody for the Victims of Hiroshima\"\nWritten by Krzysztof Penderecki\nPerformed by Warsaw National Philharmonic\nCourtesy of Universal Music\n\"Axolotl\"\nWritten by Finn Andrews, Jaime Meline, and Wilder Zoby\nPerformed by The Veils\nCourtesy of Nettwerk Music Group"}