{"name": "Part_13", "url": "https://twinpeaks.fandom.com/wiki/Part_13", "text": "Part 13\nNot to be confused with Episode 13.\n\"Part 13\" is the thirteenth episode of the 2017 series of Twin Peaks and the forty-third episode of the franchise as a whole. It aired on August 6, 2017.\nPlot\n\"What story is that, Charlie?\"\n ―Audrey Horne\nThe Mitchum brothers and their assistants take Cooper to Bushnell Mullins' office, celebrating and bearing gifts for Mullins. Anthony Sinclair hides from the brothers as he fearfully calls Duncan Todd, who gives him one day to kill \"Jones.\"\nDelivery men bring a gym set for Sonny Jim and a new car to the Jones home as Janey-E happily looks on. Janey-E and Cooper later watch Sonny Jim play on his new gym set.\nCooper's doppelganger arrives at the farm as Ray and his associates watch him on security camera. They bring him to their location and he says he is there to see Ray. He is told that Renzo is the leader of the men, as he is undefeated in arm-wrestling. The doppelganger likens this practice to children's games and challenges Renzo, wagering Ray. After much toying with his opponent, the doppelganger wins, then kills him with a brutal punch to the face. \n \nAs the group' new leader, he is granted his request to be alone with Ray who – after being shot in the leg – tells him the details of his contract from Phillip Jeffries to kill the doppelganger. He reveals Jeffries sent him after the doppelganger as he has \"something inside\" that he wants. Ray takes out the green ring, saying that he was supposed to put it on him after killing him. Ray says a mysterious prison guard gave it to him before he was released; he is instructed to put it on. Meanwhile, Richard Horne joins the group as they watch Ray hand over the coordinates. Ray shares Jeffries' last known location — a supposed non-existent place called “The Dutchman’s”— then the doppelgänger kills him. The ring disappears from his finger and appears in the red room, followed by himself. Mike places the ring on its pedestal.\nThe Detectives Fusco look over the results of \"Douglas Jones\"' fingerprint as an altercation takes place in the next room. The report confirms Dougie is a former FBI agent and just recently escaped from a South Dakota prison. They find this laughable, and discard the info. Meanwhile, Sinclair comes to see the two detectives he's been committing fraud with looking for poison.\nHutch and Chantal drive, discussing Mormons.\nJaney-E takes Cooper to work in the new car. Sinclair waits nervously for \"Dougie\" and takes him to get coffee. After taking a sip, Cooper wanders over to observe the shop's pie as Sinclair laces his coffee. He returns and touches dandruff on Sinclair's jacket. Sinclair breaks down, leaving with the poisoned coffee. Cooper takes Sinclair's coffee and is brought a slice of pie. Sinclair pours the coffee into a urinal and throws the cup in the trash before apologizing to \"Dougie.\"\nAt the Double R Diner, Shelly gets a phone call from Becky, who says that Steven has been absent for two days and she is worried about him. Shelly invites her daughter to the diner for pie.\nIn Mullins' office, Sinclair tearfully confesses his activities with Todd and thanks Dougie for showing him the right path.\nBobby goes to the diner and visits with Ed and Norma. He describes to them that he came across some belongings of his father. Walter Lawford soon shows up causing Ed and Bobby move to another booth. Walter reports on the franchise progress of the diner, saying that she is selling her pies too cheap, though she disagrees with the franchise stores' practices compared to the flagship store. He suggests the name of the diner be changed to Norma's Double R, which she does not approve of. They agree to go out to celebrate the rest of success, which goes noticed by Ed.\nAt Run Silent, Run Drapes, Nadine is visited by Jacoby after he spotted one of his shovels in the window. He expresses his admiration for the decoration and she praises him and his show. They reflect on their last meeting at a supermarket during a storm. \nA drunk Sarah watches an old boxing match repeat itself over and over.\nA near-hysterical Audrey demands Charlie to tell him what Tina had told him. He instead offers to go to the Roadhouse with her to look for Billy. An indecisive Audrey breaks down, and Charlie asks if he needs to end her story. Audrey asks “What story is that, Charlie? Is that the story of the little girl who lived down the lane?”\n \nAt the Roadhouse, an MC introduces James Hurley, who performs \"Just You\" as a clearly moved Renee watches.\nEd sits alone at Big Ed's Gas Farm.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nAlon Aboutboul as Head Mover\nKate Alden as RR Diner Waitress\nMädchen Amick as Shelly Briggs\nDana Ashbrook as Deputy Bobby Briggs\nJim Belushi as Bradley Mitchum\nKelsey Bohlen as Backup Singer #2\nRachael Bower as Backup Singer #3\nJohnny Chavez as Crooked Partner\nLarry Clarke as Detective T. Fusco\nFrank Collison as Muddy\nGiselle DaMier as Sandie\nChristopher Durbin as The Farm Accountant\nEric Edelstein as Detective \"Smiley\" Fusco\nEamon Farren as Richard Horne\nSherilyn Fenn as Audrey Horne\nPatrick Fischler as Duncan Todd\nPierce Gagnon as Sonny Jim Jones\nGrant Goodeve as Walter Lawford\nGeorge Griffith as Ray Monroe\nRobert Knepper as Rodney Mitchum\nDavid Koechner as Detective D. Fusco\nVirginia Kull as Szymon Waitress\nAndrea Leal as Mandie\nSheryl Lee as Laura Palmer\nJennifer Jason Leigh as Chantal Hutchens\nPeggy Lipton as Norma Jennings\nMalone as Man in Urinal\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nDerek Mears as Renzo\nClark Middleton as Charlie\nDon Murray as Bushnell Mullins\nJelani Quinn as Desk Sergeant\nWendy Robie as Nadine Hurley\nTim Roth as Gary \"Hutch\" Hutchens\nJohn Savage as Detective Clark\nAmanda Seyfried as Rebecca (Becky) Burnett\nAmy Shiels as Candie\nTom Sizemore as Anthony Sinclair\nJR Starr as MC\nJessica Szohr as Renee\nRuss Tamblyn as Dr. Lawrence Jacoby\nNaomi Watts as Janey-E Jones\nGrace Zabriskie as Sarah Palmer\nUncredited\nLara Flynn Boyle (performer, \"Just You\")\nAl Strobel as Phillip Gerard (hand in Red Room)\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Dance of the Swans\" from Swan Lake\nComposed by Pyotr Ilyich Tchaikovsky\nCourtesy of Bobkind, Inc.\n\"Just You\"\nMusic by Angelo Badalamenti\nLyrics by David Lynch\nPerformed by James Marshall\n\"Eastern European Symphonic Mood No. 1\"\nWritten and performed by Dean Hurley\nPublished by Team Hurley (ASCAP)\nAdministered by Downtown Music Publishing\nNotes\nDana Ashbrook noted at Comic-Con that the scene with Bobby, Ed, and Norma at the diner was the first scene he shot for the new series, though he did this accidentally by looking over at Everett McGill before realizing the episode had not aired yet.\nProduction errors\nFrost was not aware of any possible meaning behind the visual glitch at the end of the episode with Ed's cup.\nTwo shots of Cooper outside the Lucky 7 as seen by Anthony are showing the same extras going to the building two times and some others discussing at a different place."}