{"name": "Part_11", "url": "https://twinpeaks.fandom.com/wiki/Part_11", "text": "Part 11\nNot to be confused with Episode 11.\n\"Part 11\" is the eleventh episode of the 2017 series of Twin Peaks and the forty-first episode of the franchise as a whole. It premiered at San Diego Comic-Con on July 21, 2017 and aired on July 23, 2017.\nPlot\n\"There's fire where you are going.\"\n ―Margaret Lanterman\nThree boys play catch. As one of them goes to retrieve the ball, he sees a bloodied Miriam Sullivan crawling out of the brush.\nBecky receives a frustrating call concerning Steven, then begs her mother for her car. She takes a pistol from beneath the couch and Shelly arrives. Becky quickly runs to the car with the gun and starts driving with Shelly hanging onto the hood until she is flung off. Carl sees her and whistles for Bill to ride back into town. Shelly calls Norma, asking for advice and is advised to call Bobby. Carl contacts Maggie, who patches them through to Bobby. Shelly tells him about the situation.\nBecky enters an apartment building and is told that he just left and she fires the gun at the door several times. Steven hides from Becky in a stairwell next to Gersten Hayward.\nIn Buckhorn, Hastings leads the FBI and Detective Macklay to the location where he claimed to see Major Briggs. Albert and Gordon spot a woodsman after Bill tells Preston about his activity in the house he brought them to. Cole and Albert approach the house and Cole sees a hurricane-like vortex in the sky and raises his arms. As he starts to pass through the vortex, Cole sees a group of woodsmen standing on a staircase before Albert pulls him back and the vortex disappears. Albert then finds what he presumes to be Ruth Davenport's body and takes a picture of numbers written down her arm. Diane sees a woodsman approach Macklay's car, but stays silent. Hastings is killed when his head is inexplicably crushed; when Macklay's screams summon the FBI agents, Cole looks into the car and simply says “He’s dead”.\nAt the Double R Diner, Bobby, Shelly, and Becky discuss Becky's situation with Steven as Norma listens in. Her parents advise that she leave him. As Shelly and Becky embrace, Red comes to see Shelly and they plan a get-together. A gunshot suddenly rings out and Bobby goes to investigate, seeing that a child inside of a van had shot it. Deputy Holcomb comes to take over the situation. Bobby investigates a woman's car after she repeatedly honks, finding an angry woman and a sick girl inside.\nHawk and Frank discuss their destination given by Major Briggs. While looking over Hawk's map, Frank focuses on many mysterious symbols, including a campfire and black corn - Hawk says the fire represents a modern-day utility such as electricity, the black corn represents sustenance, and the two can be combined to create “black fire”. Frank also inquires about a bizarre symbol hovering above the mountains (also found on the doppelganger's playing card and on Major Briggs' message) but is advised that he does not want to know about it. Lucy patches through a call from Margaret, who knows that Hawk found something. She tells them that there is fire where he is going. Deputy Holcomb enters, asking if Frank wants to see his new car.\nGordon's hand shakes and he requests to see Albert's photo of the coordinates on Ruth's arm. He asks what the coordinates are, but as Albert answers, they are interrupted by Preston and Macklay bringing donuts and coffee. Macklay tells them that the body was confirmed as Ruth's, but there was no trace of Briggs' head or any leads on Hastings' death. Gordon and Albert tell them about the woodsman, whom Diane says she might have seen exit Macklay's car. Gordon describes his vision of the dirty, bearded men.\nAt Lucky 7 Insurance, Bushnell Mullins calls \"Dougie\" into his office and Phil Bisby brings him along with coffee. Mullins tells Cooper that his work has revealed organized crime business as well as corrupt police. He says that the Mitchum brothers called him, wishing to meet with \"Dougie\" and Mullins prepares a check for the brothers to cover for their hotel, which was brought down by an accidental fire and not arson.\nRodney eats an afternoon breakfast and is soon joined by his brother. Bradley tells him that he had a dream about killing Dougie Jones, anxious for their meeting.\nAs he is escorted by Mullins, Cooper sees Mike in the red room in the doorway of a bakery and starts walking to him. He returns with a box and Mullins takes him to the limousine hired to take him to the meeting, driven by the same driver who took him home from the Silver Mustang Casino.\nThe Mitchum brothers wait for \"Jones\" and Bradley further describes his dream, particularly noting that Rodney's cut from Candie was healed. Bradley rips off Rodney's bandage, revealing that the cut is, indeed, healed. Cooper soon arrives and is assisted out of the limo by its driver. Bradley sees the box that \"Dougie\" holds, saying it was in his dream and that they cannot kill him because of what it may contain, according to his dream. Rodney asks if there is a cherry pie in the box, which Bradley confirms, meaning that \"Dougie Jones\" is not their enemy. He frisks him, finding the check for $30 million to cover for their damages, overjoying them.\nThe brothers take Cooper to dinner and toast to Dougie. Cooper takes notice of the piano player, who begins playing a piece as the lady slot-addict from the Silver Mustang Casino enters with her son Denver, revealing that he inadvertently helped her reconnect with her son and thanks him for it. Mandie, Sandie, and Candie are brought in and Candie comments on the traffic on the Strip. They have another toast and Candie brings another piece of pie to Cooper.\nEpisode credits\n\nStarring\nKyle MacLachlan as Dale Cooper\nIn Alphabetical Order\nMädchen Amick as Shelly Briggs\nDana Ashbrook as Deputy Bobby Briggs\nChrysta Bell as FBI Agent Tammy Preston\nJim Belushi as Bradley Mitchum\nBrent Briscoe as Detective Dave Macklay\nCatherine Coulson as Margaret Lanterman (The Log Lady)\nGiselle DaMier as Sandie\nLaura Dern as Diane Evans\nJosh Fadem as Phil Bisby\nMiguel Ferrer as FBI Agent Albert Rosenfield\nRobert Forster as Sheriff Frank Truman\nTravis Frost as Boy Playing Catch\nBalthazar Getty as Red\nJames Grixoni as Deputy Jesse Holcomb\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nCaleb Landry Jones as Steven Burnett\nLaura Kenny as Woman in Car\nRobert Knepper as Rodney Mitchum\nJay Larson as Limo Driver\nAndrea Leal as Mandie\nSheryl Lee as Laura Palmer\nMatthew Lillard as William Hastings\nPeggy Lipton as Norma Jennings\nSarah Jean Long as Miriam Sullivan\nDavid Lynch as FBI Deputy Director Gordon Cole\nDon Murray as Bushnell Mullins\nPriya Diane Niehaus as Sick Girl\nCharity Parenzini as Carrie\nElias Parenzini as Ralph\nLinas Phillips as Russ\nLinda Porter as Lady Slot-Addict\nKimmy Robertson as Lucy Brennan\nMarv Rosand as Toad\nAmanda Seyfried as Rebecca (Becky) Burnett\nAmy Shiels as Candie\nTom Sizemore as Anthony Sinclair\nHarry Dean Stanton as Carl Rodd\nMary Stofle as Ruth Davenport\nAl Strobel as Phillip Gerard\nCynthia Lauren Tewes as Neighbor\nJodee Thelen as Maggie\nAlicia Witt as Gersten Hayward\nHelena Barrett as Stunt Double (Becky)\nKirsten Foe as Stunt Double (Shelly)\nUncredited\nSmokey Miles as Piano player\nUnknown performers as two boys playing catch\nUnknown performer as Bill\nUnknown performer as Denver\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Frank 2000\"\nWritten by Angelo Badalamenti and David Lynch\nPerformed by Thought Gang\n\"Viva Las Vegas\"\nWritten by Mort Shuman and Doc Pomus\nPerformed by Shawn Colvin\nCourtesy of Columbia Records\n\"Threnody for the Victims of Hiroshima\"\nWritten by Krzysztof Penderecki\nPerformed by Warsaw National Philharmonic\nCourtesy of Universal Music\n\"Heartbreaking\"\nComposed and performed by Angelo Badalamenti\nScript differences\nA moment in the opening scene of Shelly's shoes flying off as she is thrown from the hood of the car was not planned: while shooting the first take stunt double Kirsten Foe's shoes came loose while she was falling off the car, with the resulting image impressing David Lynch so much a further shot of Mädchen Amick as Shelly retrieving her shoes was filmed."}