{"name": "Part_14", "url": "https://twinpeaks.fandom.com/wiki/Part_14", "text": "Part 14\nNot to be confused with Episode 14.\n\"Part 14\" is the fourteenth episode of the 2017 series of Twin Peaks and the forty-fourth episode of the franchise as a whole. It aired on August 13, 2017.\nPlot\n\"We are like the dreamer.\"\n ―Monica Bellucci\n \nIn Buckhorn, South Dakota, Cole calls the Twin Peaks Sheriff's Department. Lucy Brennan answers, recognizing Cole's voice and she connects him to Frank. After Cole expects Harry, Frank explains his brother's whereabouts and tells him about the pages from Laura Palmer's diary that were found that suggested the existence of two Coopers.\nAlbert tells Preston about the first Blue Rose case, when a woman named Lois Duffy was arrested by Cole and Jeffries after murdering a doppelgänger of herself. After learning the doppelgänger said the phrase “I am like the Blue Rose“ before vanishing into thin air, Tammy deduces a blue rose is an unnatural, conjured object — also known as a ”Tulpa”.\nCole enters, followed by Diane. Cole asks her if Cooper mentioned Major Garland Briggs the last time they saw each other, which she confirms. Albert explains the fate of Briggs, noting Dougie Jones' ring found in Briggs stomach. Diane recognizes the name Janey-E as belonging to her half-sister, who is married to a Douglas Jones in Las Vegas. Tammy calls the FBI in Las Vegas and Cole tells them that the Joneses are wanted in relation to a double homicide. Diane leaves and Cole informs Albert and Tammy about the Twin Peaks Sheriff's Department's find. He then tells them about a dream he had about Monica Bellucci, who, in the dream, he met at a cafe, where Cooper was, but Cole could not see his face. They had coffee and Monica said \"we are like the dreamer who dreams and lives inside the dream,\" which Cole understood. This was followed by \"but who is the dreamer?\" He says that Monica indicated him to look back and he saw himself on February 16, 1989, the day of Jeffries' brief re-appearance, and particularly notes Jeffries asking who he thought Cooper was.\n \nBobby, Hawk, Andy, and Frank arrest Chad for his criminal activities. Bobby then leads the way to Jack Rabbit's Palace and they follow the instructions left by the Major. After Hawk instructs the others to put soil in their pockets, they move further into the woods — they come across a foggy clearing and find a nude eyeless woman. Frank tells the others the time is 2:53 — a portal forms above them and Andy is transported inside after holding the woman's hand. He appears before a tall man, who calls himself the Fireman. A smoking apparatus appears in Andy's hands, which directs his attention to the ceiling. A series of scenes flash in the ceiling: a white figure regurgitating BOB, Woodsmen, a high school girl screaming, Laura, angels, the eyeless woman, two Coopers, a telephone, himself and Lucy, and a utility pole. The apparatus disappears out of Andy's hands, and he is transported back out to the woods. He appears back at Jack Rabbit's Palace, where the other lawmen wait. He carries the woman and tells them that she is important and must be kept under their watch, leaving the others bewildered on.\nAndy and Lucy help the woman settle in a jail cell as Chad yells out insults. Andy and Lucy leave and the woman makes noises, repeated by a drunk in another cell, much to Chad's annoyance.\nJames and Freddie take a break at their job, the latter displaying great strength in his gloved hand. James inquires about the glove, which Freddie says is a \"part of him\" and that he cannot remove it without bleeding. He explains that after having a life epiphany one night, he was transported into a void and encountered the Fireman, who told him of the glove and that it would give his hand an immense “pile-driving” power. He was told to go to Twin Peaks to find his destiny. James later enters the Great Northern Hotel's furnace room and hears the same whistling noise Ben and Beverly had discovered days earlier.\nSarah goes to a bar, where she is propositioned by a trucker. She refuses his advances, but when he persists and makes threats, she opens her face – revealing darkness behind it – and takes a bite out of his throat, killing him.\nAt the Roadhouse, Sophie and Megan discuss Billy, who was seen in the yard of Megan and her mother, Tina, and who entered the kitchen, bleeding from his nose and mouth before suddenly leaving. Lissie performs \"Wild West.\"\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJay Aaseng as Drunk\nEric Ray Anderson as Bartender\nDana Ashbrook as Deputy Bobby Briggs\nChrysta Bell as FBI Agent Tammy Preston\nMonica Bellucci as herself\nDavid Bowie as Phillip Jeffries\nRobert Broski as Woodsman\nOwain Rhys Davies as Agent Wilson\nLaura Dern as Diane Evans\nErica Eynon as Experiment (Part 8 stock footage)\nJay R. Ferguson as Special Agent Randall Headley\nMiguel Ferrer as FBI Agent Albert Rosenfield\nRobert Forster as Sheriff Frank Truman\nNathan Frizzell as Voice\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nSheryl Lee as Laura Palmer\nDavid Lynch as FBI Deputy Director Gordon Cole\nShane Lynch as Megan\nJames Marshall as James Hurley\nJohn Paulsen as Trucker\nJohn Pirruccello as Deputy Chad Broxford\nKimmy Robertson as Lucy Brennan\nFrank Silva as Bob (Part 8 stock footage)\nJR Starr as MC\nEmily Stofle as Sophie\nCarel Struycken as The Fireman\nJake Wardle as Freddie Sykes\nNae Yuuki as Naido\nGrace Zabriskie as Sarah Palmer\nLissie:\nLissie\nEric Sullivan\nLewis Keller\nJesse Siebenberg\nIn memory of David Bowie\nUncredited\nLorna MacMillan as angel\nMélita Toscan du Plantier as Monica Bellucci's female friend\nUnknown performers as Woodsmen (Part 8 stock footage)\nUnknown performer as Window cleaner\nUnknown performer as Screaming girl (Pilot stock footage)\nUnknown performer as Monica Bellucci's male friend\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Wild Wild West\"\nPerformed by Lissie\nWritten by Elisabeth Maurus and Curt Schneider\nCourtesy of Lionboy Records"}