{"name": "Part_3", "url": "https://twinpeaks.fandom.com/wiki/Part_3", "text": "Part 3\nNot to be confused with Episode 3.\n\"Part 3\" is the third episode of the 2017 series of Twin Peaks, and the thirty-third episode of the franchise as a whole. It was released on the Showtime Anytime app on May 21, 2017 and aired on May 28, 2017.\nPlot\n\"Call for help.\"\n ―Dale Cooper\nAgent Cooper descends through a void and drops into a nondescript area with a purple hue. He looks upon a body of water then goes through a set of windows to a room, where an eyeless woman sits in front of a fireplace. He asks her where they are, but she does not speak, instead making breathy noise. As a loud pounding occurs, she signals Cooper to be quiet. He spots a mechanism in the wall and examines it, but the woman keeps him away from it and instead leads him up a ladder. They reach the roof that floats in a void. The woman pulls the lever on a mechanism on the roof and receives an electric shock, causing her to fall into the void. Cooper looks down and sees Major Garland Briggs' head floating and saying \"blue rose.\" He climbs back down the ladder and sees another woman sitting in front of the fireplace. Cooper approaches her and as her watch struck 2:53, the mechanism on the wall begins humming.\nCooper's doppelganger drives and begins to experience discomfort. The cigarette lighter in his car begins to evidently exert electrical force. Agent Cooper approaches the mechanism in the wall and the woman tells him \"When you get there, you will already be there.\" The doppelganger continues to be uncomfortable as Agent Cooper is taken inside the mechanism, which leaves his shoes behind. The doppelganger loses control of his car and wrecks on the side of the road. He begins gagging but holds his hands tightly over his mouth as he watches the cigarette lighter and red drapes faintly appear in front of his car.\nInside a house for sale, Dougie Jones sits with Jade, who notes that something is wrong with his arm, on which he wears the ring on one of his fingers. Jade goes to shower and Dougie gets out of bed before falling as the doppelganger continues to hold his mouth. Dougie crawls to the house's living room, where an electrical socket exerts electrical force. He vomits and is transported to the red room. The doppelganger then vomits up garmonbozia and passes out.\nInside the red room, Mike tells Dougie that he was manufactured by someone for a purpose that has now been fulfilled. Dougie's hand begins to shrink, the ring falls off his finger, and his head pops into the form of a black cloud. A clean gold orb floats out of his shirt and the black cloud forms into a head-shaped object that Mike shields his eyes from. The object appears to start to produce an orb of its own as electrical sounds are heard. Suddenly, the clean gold orb appears and seems to attack the head-shaped object. The clean gold orb is left on the chair, which Mike picks up along with the ring, which he places back on its pedestal.\nAgent Cooper is transferred through the electrical socket near where Dougie vomited and materializes. Jade believes he is Dougie, but Cooper is not responsive, appearing to be in a sort of trance with no memory. He leaves the house with Jade as a group of men wait to ambush him, believing he is still inside. Cooper unintentionally escapes death after dropping his Great Northern Hotel key on the floor of the car and bending over to pick it up. One of the men, Gene, places a tracker on Dougie's car as a boy watches through his home's window across the street, while his drug-addicted mother repeatedly yells \"one-one-nine!\" and takes a pill with whiskey. Highway patrolmen approach the doppelganger's crashed car and one of them, Billy, becomes seriously sick after sticking his head in the car.\nBack at the Twin Peaks Sheriff's Department, Hawk, Andy, and Lucy sort through the files to find what is missing that relates to Hawk's heritage. A guilty Lucy points out that she had eaten a chocolate bunny from the evidence years before in order to relieve gas. Andy asks if chocolate bunnies have anything to do with Hawk's heritage, and it is eventually settled that the missing bunny is not what they are looking for.\nLawrence Jacoby spraypaints his shovels gold.\nJade drops Cooper off at the Silver Mustang Casino, giving him $5 telling him to call for help. When she tells him to go out of the car, he recalls Laura telling him he can go out. He goes into the casino, clearly struggling. He goes to a security guard and says \"call for help.\" The guard directs him to get change for his $5. With his change, he goes out to the casino floor. He notices a gambler call out \"Hello!\" when he receives a jackpot, so Cooper repeats this as he starts playing slot machines, following an image of the red room floating above various machines and winning the jackpot at every one.\nAt the FBI headquarters, along with other personnel, Deputy Director Gordon Cole and Agents Albert Rosenfield and Tamara Preston discuss a murder case with several objects that may identify the killer. He assigns all of the personnel except Preston to begin work on the case. Preston then presents to them the deaths of Sam Colby and Tracey Barberato along with the glass box containing a ghostly figure. Cole is then informed that he has a call related to Cooper. They schedule a meeting in the Black Hills at 9:00 the next morning.\nAt the Roadhouse, the Cactus Blossoms perform \"Mississippi.\"\nCredits\n\nCast\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger) / Dougie Jones\nIn Alphabetical Order\nPhoebe Augustine as American Girl\nChrysta Bell as FBI Agent Tammy Preston\nDon S. Davis as Major Garland Briggs\nJohn Ennis as Slot Machine Man\nMiguel Ferrer as FBI Agent Albert Rosenfield\nBrian Finney as Security Guard\nMeg Foster as Cashier\nHailey Gates as Drugged-out Mother\nHarry Goaz as Deputy Andy Brennan\nTravis Hammer as First Trooper\nStephen Heath as Second Trooper\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nSheryl Lee as Laura Palmer (Part 2 stock footage)\nDavid Lynch as FBI Deputy Director Gordon Cole\nJosh McDermitt as Wise Guy\nLinda Porter as Lady Slot-Addict\nKimmy Robertson as Lucy Brennan\nSawyer Shipman as Little Boy\nAl Strobel as Phillip Gerard\nSabrina S. Sutherland as Floor Attendant Jackie\nRuss Tamblyn as Dr. Lawrence Jacoby\nBill Tangradi as Jake\nGreg Vrotsos as Gene\nNafessa Williams as Jade\nNae Yuuki as Naido\nThe Cactus Blossoms:\nJack Torrey\nPage Burkum\nJoel Paterson\nBeau Sample\nAlex Hall\nStunt Double:\nMark Norby\nKiralee Hayashi\nUncredited\nErica Eynon as Experiment\nKate Romero as Shari Skadden\nRobert L. Wilson as Chris Rummel\nJose Rosete as FBI Agent next to Shari Skadden\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Dream Recall\"\nWritten and Performed by David Lynch and Dean Hurley\n\"Mississippi\"\nWritten by Jack Torrey\nPublished by Jumping Gemini (ASCAP)/Hello Central Music (ASCAP)\nAdministered by Words & Music, a division of Big Deal Music\nCourtesy of Red House Records"}