{"name": "Part_6", "url": "https://twinpeaks.fandom.com/wiki/Part_6", "text": "Part 6\nNot to be confused with Episode 6.\n\"Part 6\" is the sixth episode of the 2017 series of Twin Peaks and the thirty-sixth episode of the franchise as a whole. It aired on June 11, 2017.\nPlot\n\"Don't die.\"\n ―Mike\nCooper observes the statue until an officer takes him home due to the law against loitering in the area.\nJaney-E makes him a sandwich and tells him that she will make a doctor's appointment for him. She has him go say goodnight to Sonny Jim until she opens an unmarked envelope delivered to their home, containing a photo of Dougie with Jade. She reprimands \"Dougie\" until they receive a phone call from the individuals to whom Dougie owes money. She plans to meet them at the park the next day.\nMike appears to Cooper, urging him to wake up and to not die. Small sections of light begin to appear on Dougie's case files including near the names of the insurer Anthony Sinclair. Cooper marks them with scribbles, zig-zags, and other lines.\nAlbert goes to Max Von's Bar, where he meets with Diane Evans.\nRichard Horne snorts a drug and meets with Red to discuss the trafficking of a drug called \"Sparkle.\" Red makes a threat to make sure Horne does not double-cross him and does a magic trick with a dime.\nUpset, Horne drives as Carl Rodd heads into Twin Peaks from the Fat Trout Trailer Park with Mickey and Bill.\nHeidi and Shelly talk to Miriam Sullivan at the Double R Diner and Sullivan leaves a tip that Heidi and Shelly feel that she cannot afford, so they plan to treat her.\nHorne, still upset from his encounter with Red drives, speeding and illegally passing traffic, which causes him to run over and kill a child. Carl witnesses this and after seeing a golden aura float from the child's body, he goes to comfort the mother.\nDuncan Todd sits in his office and a red box appears on his computer screen. He closes it out and goes to the desk behind him, where he opens a safe and removes an envelope with a black circle on the front.\nDougie's destroyed car is towed as authorities investigate, finding the back bumper on the roof of the drug-addicted mother.\nAt a motel, hitman Ike \"The Spike\" Stadtler receives an envelope with a black circle. Inside are photos of Lorraine and of Dougie Jones. With his spike, he stabs the photos.\nCooper goes to Dougie's work, where he is called into Bushnell Mullins' office. While initially confused by Cooper's apparently childish scribblings, he soon seems to understand the meaning behind them.\nJaney-E meets with Tommy and Jimmy and pays them $25,000 of the $52,000 Dougie owes them, stating her reasons to be the Jones' financial situation.\nThe Spike shows up at Lorraine's office and stabs her to death along with two innocent co-workers.\nRichard drives to a field, where he wipes the boy's blood off of his truck's grill.\nInside a restroom, Hawk drops a coin, which rolls into a stall. He picks it up, which causes him to notice a screw missing from the stall door's paneling. He gets a small stepladder and a crowbar and pulls the paneling back to find pages.\nBack at the sheriff's station, Doris comes, upset with Frank about her father's car apparently not being repaired. Deputy Chad makes cruel statements about Doris and hers and Frank's son that committed suicide.\nAt the Roadhouse, Sharon Van Etten plays \"Tarifa.\"\nCredits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dougie Jones\nIn Alphabetical Order\nMädchen Amick as Shelly\nTammy Baird as Lorraine\nRonnie Gene Blevins as Tommy\nJuan Carlos Cantu as Officer Reynaldo\nCandy Clark as Doris Truman\nLisa Coronado as Hit and Run Mom\nJeremy Davies as Jimmy\nLaura Dern as Diane Evans\nJosh Fadem as Phil Bisby\nEamon Farren as Richard Horne\nMiguel Ferrer as FBI Agent Albert Rosenfield\nPatrick Fischler as Duncan Todd\nRobert Forster as Sheriff Frank Truman\nPierce Gagnon as Sonny Jim Jones\nHailey Gates as Drugged-out Mother (Part 3 stock footage)\nBalthazar Getty as Red\nJames Grixoni as Deputy Jesse Holcomb\nAndrea Hays as Heidi\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nJay Jee as Patrol Officer\nSheryl Lee as Laura Palmer\nJeremy Lindholm as Mickey\nSarah Jean Long as Miriam Sullivan\nDavid Lynch as FBI Deputy Director Gordon Cole\nDon Murray as Bushnell Mullins\nJohn Pirruccello as Deputy Chad Broxford\nHunter Sanchez as Hit and Run Boy\nTom Sizemore as Anthony Sinclair\nHarry Dean Stanton as Carl Rodd\nAl Strobel as Phillip Gerard\nJodee Thelen as Maggie\nNaomi Watts as Janey-E Jones\nNafessa Williams as Jade\nChristophe Zajac-Denek as Ike \"The Spike\" Stadtler\nSharon Van Etten:\nSharon Van Etten\nCarolyn Pennypacker Riggs\nJohn Phillip Iron III\nZeke Hutchins\nUncredited\nIme N. Etuk as Red's bodyguard\nUnknown performer as Red's driver\nUnknown performer as Bill\nUnknown performer as Lorraine's co-worker\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Windswept\"\nWritten and performed by Johnny Jewel\nCourtesy of Italians Do It Better\n\"Tarifa\"\nWritten and performed by Sharon Van Etten\nCourtesy of Jagjaguwar\n\"I Am (Old School Hip Hop Beat)\"\nWritten and performed by BluntedBeatz\nCourtesy of Columbia Records\nNotes\nTammy Baird is credited as \"Tammie\".\nIme Etuk, who plays a Red's bodyguard is also the 2nd assistant director.\nA group of fans watching the filming of the episode from across the street can be seen in a shot from inside the Double R as Shelly gives Miriam her coffee.\nAngelo Badalamenti's composition \"Accident/Farewell Theme\" premiering in this episode was composed for the scene before it was shot using Lynch's description via Skype.\nThe following names can be read on Dougie's case files:\nInsurer Anthony Sinclair on every form.\nThe insured Hotel Owner Jake Cavallo on a Burglary claim form.\nThe insured Nancy Deren on a non-waiver agreement.\nInvestigating Officers from Clark County, Nevada: Det. Loomis and Det. Stockton.\nInsured Rod Mitchum and Brad Mitchum on a Commercial Property Owner Perils Chart.\nInsured on a Product liability supplemental application (p-1) form: David Eubank\nInsured on an Adjuster's Status Report: Scott Cameron\nInsured on a Notice of plate glass loss form: Carolyn King\nMost of the names on the case files are of crew members: Jake Cavallo is the art department production assistant, Nancy Deren is a set designer, David Eubank is an A camera first assistant, Scott Cameron is 1st assistant director and Carolyn King is the art department coordinator."}