{"name": "Part_17", "url": "https://twinpeaks.fandom.com/wiki/Part_17", "text": "Part 17\nNot to be confused with Episode 17.\n\"Part 17\" is the seventeenth episode of the 2017 series of Twin Peaks and the forty-seventh episode of the franchise as a whole. It aired on September 3, 2017.\nPlot\n\"The past dictates the future.\"\n ―Dale Cooper\nIn Buckhorn, Gordon, Albert, and Tammy make a toast to the Bureau. Gordon reveals a secret he has kept for 25 years – that before his disappearance, Major Briggs shared with Gordon and Cooper a discovery he made about an entity named Jowday which overtime became Judy. Phillip Jeffries also was aware of the entity and Cooper told Gordon to try and find him if he disappeared. He continues, saying that informant Ray Monroe stated that the doppelganger of Cooper was searching for coordinates.\nAgent Headley calls Gordon to tell him that they caught up with Dougie Jones and Bushnell Mullins reads Cooper's coded message to Gordon, which reveals to him that Cooper is Dougie Jones. Tammy looks up Cooper's activities and Gordon says he knows where he is headed.\nAt the Twin Peaks Sheriff's Department cell block, the drunk sleeps, but wakes up, much to Chad's annoyance. Naido makes sounds as she awakens, rousing James and Freddie and annoying Chad. She reaches up as she continues her noises, aped by the drunk. Meanwhile, Ben receives a phone call concerning his brother Jerry and his whereabouts.\nThe doppelganger reaches the woods outside Twin Peaks, arriving at the coordinates – the same location where the Sheriff's Department found Naido. A portal forms and he is transported to the Fireman's theater where Major Briggs' head floats. The Fireman levitates as the screen shows the Palmer house, then a road in front of the Sheriff's station, where the doppelganger is then transferred. Sensing this, Naido wakes up and the doppelganger approaches Andy, who mistakes him for the original Cooper. Chad removes a cell key from his boot and Andy brings Cooper inside, where he meets Lucy and Frank. Andy recalls the vision of himself and Lucy that the Fireman showed him.\nUsing a key he stashed in his boot, Chad leaves his cell and goes to the armory. The doppelganger goes to Frank's office as Andy gets Hawk. Chad loads a revolver and the drunk peels a bandage off his face. Andy reaches the cell block and Chad aims the revolver at him, taunting him. Freddie punches his cell door open, incapacitating Chad. Lucy then answers the phone at the front desk, and is startled upon hearing the caller identify himself.\nThe doppelganger tells Frank he is in Twin Peaks for unfinished business. Lucy transfers the call from the real Cooper to Frank as he arrives in Twin Peaks. Noticing Frank's stunned silence, the doppelganger draws his gun, as does Frank. But before either can shoot, the doppelganger is shot and apparently killed by Lucy, who remarks that she figured out how cell phones work. \nCooper advises Frank to stay away from the body as Andy brings Freddie, Naido, and James up to the office. Hawk comes and the room begins to darken as woodsmen go to the doppelganger's body to revive him. Cooper arrives with the Mitchum brothers and runs to the office as the woodsmen finish with the doppelganger and BOB – contained inside a black orb – is released from his body and attacks Cooper and Freddie, who punches him, sending him through the ground in a blaze. The orb containing BOB attacks again and Freddie punches it once more, breaking it into pieces.\nCooper places the ring on his doppelganger, who then disappears. The ring reaches the Black Lodge. Cooper receives his hotel room key from Frank, and Gordon arrives. Cooper notices Naido as Bobby arrives, Cooper commenting that Bobby's father was aware of the events taking place. Gordon, Albert, and Tammy enter, followed by Candie, Mandie, and Sandie.\nNaido approaches Cooper and her face reveals the Lodge before peeling back and revealing Diane. They kiss and Diane tells Cooper that she remembers everything. Cooper's superimposed face says \"We live inside a dream\" and he says he hopes to see everyone there again.\nThe room darkens and Cooper, Diane, and Gordon walk through darkness. They walk through the Great Northern Hotel furnace room, following the sound. They reach a door and Cooper advises them not to follow him in.\nHe enters the door and meets Mike, who recites the \"fire walk with me\" chant before being transported to the convenience store. They reach the Dutchman's and meet with Jeffries to discuss the date February 23, 1989. He gives him instructions to find Judy and out of the steam, an Owl Cave symbol turns into two diamonds and then an 8. Cooper is transported out.\nThe night of her death, Laura leaves her home with James as Leland watches. Cooper is transported nearby Laura and James and when he is spotted by her, she screams.\nAfter James starts to take her home, she jumps off the bike and after telling James she loves him, she runs off into the woods as James rides off. Leo, Ronette, and Jacques wait for Laura, but she encounters Cooper, recognizing him from a dream. He reaches out to her and she goes to him. Laura's body disappears from outside Blue Pine Lodge and Cooper tells Laura that they are going home. As Josie does her makeup, Pete kisses Catherine and goes fishing.\nSarah wails inside her home and she tries to destroy Laura's homecoming photo.\nCooper leads Laura through the woods, towards the portal at Blue Pine Mountain, but she disappears and he hears her screams.\nJulee Cruise performs \"The World Spins.\"\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as\nDale Cooper\nDale Cooper (doppelganger)\nIn Alphabetical Order\nJay Aaseng as Drunk\nDana Ashbrook as Deputy Bobby Briggs\nPhoebe Augustine as Ronette Pulaski\nChrysta Bell as FBI Agent Tammy Preston\nJim Belushi as Bradley Mitchum\nRichard Beymer as Ben Horne\nJoan Chen as Josie Packard\nGiselle DaMier as Sandie\nEric DaRe as Leo Johnson\nDon S. Davis as Major Garland Briggs\nLaura Dern as Diane Evans\nJay R. Ferguson as Special Agent Randall Headley\nMiguel Ferrer as FBI Agent Albert Rosenfield\nRobert Forster as Sheriff Frank Truman\nNathan Frizzell as Voice of Phillip Jeffries\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nRobert Knepper as Rodney Mitchum\nPiper Laurie as Catherine Martell\nAndrea Leal as Mandie\nSheryl Lee as Laura Palmer\nDavid Lynch as FBI Deputy Director Gordon Cole\nJames Marshall as James Hurley\nDon Murray as Bushnell Mullins\nJack Nance as Pete Martell\nWalter Olkewicz as Jacques Renault\nJohn Pirruccello as Deputy Chad Broxford\nKimmy Robertson as Lucy Brennan\nCarlton Lee Russell as Jumping Man\nAmy Shiels as Candie\nFrank Silva as Bob\nAl Strobel as Phillip Gerard\nCarel Struycken as The Fireman\nJake Wardle as Freddie Sykes\nRay Wise as Leland Palmer\nNae Yuuki as Naido\nGrace Zabriskie as Sarah Palmer\nJulee Cruise as Herself\nIn Memory of Jack Nance\nUncredited cast\nChromatics as Julee Cruise's band\nUnknown performers as Woodsmen\nUnknown performer as Sergeant Williams\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Sub Dream\"\nWritten and performed by David Lynch and Dean Hurley\n\"The World Spins\"\nMusic by Angelo Badalamenti\nLyrics by David Lynch\nPerformed by Julee Cruise"}