{"name": "Part_5", "url": "https://twinpeaks.fandom.com/wiki/Part_5", "text": "Part 5\nNot to be confused with Episode 5.\n\"Part 5\" is the fifth episode of the 2017 series of Twin Peaks and the thirty-fifth episode of the franchise as a whole. It aired on June 4, 2017.\nPlot\n\"Case files.\"\n ―Dale Cooper\nGene and Jake sit in a car, the former on the phone with Lorraine, reporting on the situation with Dougie Jones. Frustrated, she sends the message \"2\" (leaving 159 characters to type) to her contact \"ARGENT\" which causes a device in Buenos Aires to ring and flash twice with its two red lights.\nConstance Talbot, Detective Macklay, and Detective Harrison observe the John Doe in the morgue. Talbot confirms the decapitation as the man's cause of death and presents a ring found inside the body. On it is an inscription that reads, \"To Dougie, with love, Janey-E.\"\nCooper's doppelganger sits in his jail cell and correctly predicts that his food is coming. He takes his food and goes to the mirror, noting that BOB is still with him.\nAt his place of employment, Mike Nelson calls in Steven Burnett, who has applied for a job. Mike tells him that his resume is inadequate and his forms were filled out incorrectly, then kicks him out.\nSheriff Frank Truman talks to Harry on the phone and is informed by Lucy Brennan that his wife, Doris, is coming to him. Doris tells him about her frustrations, including a leaky pipe.\nJaney-E, Sonny Jim and Cooper leave the Jones home and Janey-E tells Cooper that he had won $425,000. He looks at Sonny Jim and begins to shed tears. On realization that Dougie's car is not there, Janey-E begrudgingly takes Cooper to Dougie's work.\nGene and Jake check on Dougie's car again, which still has not moved. A group of delinquent youths also drive by the car.\nJaney-E drops Cooper off at work and he wanders, following the aim of a statue of a man carrying a revolver. He stands around until Dougie's co-worker, Phil Bisby comes carrying coffee on his way to a board meeting. Following him into the elevator, Cooper takes one of the coffees and begins drinking the \"damn good Joe.\" It was Frank's one who then takes a green tea latte instead while Darren is turned down by Rhonda and Bonnici next to Frank is served the eighth cup carried by Phil.\nAnthony Sinclair tells Cooper that he has covered for Dougie's absence and during the meeting, as Sinclair presents a report. When saying that there was no arson with Littlefield, Cooper blurts out \"He's lying,\" but does not elaborate, causing the boss Bushnell Mullins to have \"Dougie\" meet with him after the meeting. Mullins questions his accusation and gives him case files to assess by the next day.\nRodney and Bradley Mitchum come to the Silver Mustang Casino and in front of Candie, Mandie and Sandie punish Burns for Cooper's win at the casino and replace Burns with Warrick, who they tell to inform them if Cooper ever returns to the casino.\nWhile his mother is passed out on drugs, the little boy living in the home across from Dougie's car goes to examine it. He is shooed away by the gang of youths, arriving in a loud black 1970 Dodge Charger, who try to steal the car. The bomb under Dougie's car explodes, killing several members of the gang, and the boy runs back to his home. Hearing him coming back in, his mother slowly wakes up and stares at the door.\nAn auto detailer informs Jade that he found a set of keys for the Great Northern Hotel in her car. Since they have an address on them, she puts them inside a mailbox for delivery.\nNorma sorts through documents as Heidi is serving and Becky delivers bread to Toad and gets money from Shelly. Norma goes to Shelly, urging her to help Becky rather than continue to enable her. Becky takes the money to Steven and they snort a drug.\nCooper is pushed out of the elevator at the end of the workday and he goes to the statue he saw that morning.\nAt the Twin Peaks sheriff's station, Hawk and Andy continue to sort through files.\nJacoby starts up his webcast he hosts as \"Dr. Amp\" and it is viewed by Jerry Horne—who smokes a joint—and Nadine Hurley. His broadcast ends with an advertisement for his golden shovels that he urges his viewers to buy to shovel themselves \"out of the shit and into the truth.\"\nAt the Pentagon, Lieutenant Cynthia Knox informs Colonel Davis that they have received a match on Major Garland Briggs' fingerprints – the sixteenth match in 25 years – in Buckhorn, South Dakota. Davis doubts the legitimacy of the match but says that if it is indeed truly Briggs that has been identified, that the FBI must be informed.\nThe band Trouble plays at the Roadhouse as Richard Horne smokes underneath a 'no smoking' sign. Employee Federico asks him to quit and the off-duty Deputy Chad Broxford takes over but ends up taking a bribe from Horne. Charlotte, from the next table over with Elizabeth, asks him for a light, but he grabs her and threatens to rape her.\nAgent Preston examines Cooper's file and compares his fingerprints from before his 1989 disappearance and from the doppelganger's booking at the federal prison.\nWarden Murphy gives the doppelganger his phone call. However, the doppelganger dials a number that sets off the prison's alarms and he says \"The cow jumped over the moon,\" before hanging up, stopping the alarms.\nIn Buenos Aires, the device contacted before by Lorraine rings and flashes twice with its two red lights and then shrinks to a kind of seed.\nCooper continues to observe the statue.\nCredits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJane Adams as Constance Talbot\nMädchen Amick as Shelly\nTammie Baird as Lorraine\nChrysta Bell as FBI Agent Tammy Preston\nJim Belushi as Bradley Mitchum\nSean Bolger as Detailer\nBrent Briscoe as Detective Dave Macklay\nWes Brown as Darren\nJuan Carlos Cantu as Officer Reynaldo\nVincent Castellanos as Federico\nBailey Chase as Detective Don Harrison\nCandy Clark as Doris Truman\nGrace Victoria Cox as Charlotte\nGiselle Damier as Sandie\nDavid Dastmalchian as Pit Boss Warrick\nJosh Fadem as Phil Bisby\nEamon Farren as Richard Horne\nRobert Forster as Sheriff Frank Truman\nPierce Gagnon as Sonny Jim Jones\nHailey Gates as Drugged-out Mother\nBrett Gelman as Supervisor Burns\nHarry Goaz as Deputy Andy Brennan\nHank Harris as Prison Tech\nAndrea Hays as Heidi\nGary Hershberger as Mike Nelson\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nErnie Hudson as Colonel Davis\nCaleb Landry Jones as Steven Burnett\nDavid Patrick Kelly as Jerry Horne\nRobert Knepper as Rodney Mitchum\nAndrea Leal as Mandie\nSheryl Lee as Laura Palmer\nJane Levy as Elizabeth\nPeggy Lipton as Norma Jennings\nKarl Makinen as Inspector Randy Hollister\nJames Morrison as Warden Dwight Murphy\nDon Murray as Bushnell Mullins\nJohn Pirruccello as Deputy Chad Broxford\nAdele René as Lieutenant Cynthia Cox\nKimmy Robertson as Lucy Brennan\nWendy Robie as Nadine Hurley\nMarv Rosand as Toad\nElena Satine as Rhonda\nAmanda Seyfried as Rebecca (Becky) Burnett\nAmie Shiels as Candie\nSawyer Shipman as Little Boy\nFrank Silva as Bob\nTom Sizemore as Anthony Sinclair\nBob Stephenson as Frank\nRuss Tamblyn as Dr. Lawrence Jacoby\nBill Tangradi as Jake\nGreg Vrotsos as Gene\nNaomi Watts as Janey-E Jones\nNafessa Williams as Jade\nBlake Zingale as Punk Leader\nTrouble:\nRiley Lynch\nSam Smith\nAlex Zhang Hungtai\nDean Hurley\nUncredited\nTyler Malik as stand-in\nKenneth Welsh as Windom Earle (archive footage)\nUnknown performer as Bonnici\nUnknown performer as Woman in elevator\nUnknown performer as Man across Mullins\nUnknown performer as Woman at meeting\nUnknown performer as Mullins' secretary\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"The Flame\"\nWritten and performed by Johnny Jewel\nCourtesy of Italians Do It Better\n\"Frank 2000\"\nWritten by Angelo Badalamenti and David Lynch\nPerformed by Thought Gang\n\"I Love How You Love Me\"\nWritten by Barry Mann and Larry Kolber\nPerformed by The Paris Sisters\nPublished by Screen Gems-EMI Music Inc. (BMI)\n\"I Am\"\nWritten and performed by BluntedBeatz\n\"Stars And Stripes Forever\"\nWritten by John Philip Sousa\nPerformed and arranged by the U.S. Army Band\n\"Snake Eyes\"\nWritten by Dean Hurley, Riley Lynch and Alex Zhang Hungtai\nPerformed by Trouble\n\"Habit\" and \"Tabloid\"\nWritten and performed by Uniform\nCourtesy of Sacred Bones Records\n\"Windswept\"\nWritten and performed by Johnny Jewel\nCourtesy of Italians Do It Better\nNotes\nThis episode was dedicated to the memory of Marv Rosand.\nAmy Shiels is credited as \"Amie\".\nFrank, Dougie's coworker who discovers he likes green tea lattes, is played by Bob Stephenson, who appeared in Episode 6 as the burger cook at the Double R Diner. This was Stephenson's first acting gig.\nUpon release, Twin Peaks: The Return earned some criticism for earning the \"Empty Cup Award,\" a satirical achievement for television series where actors handle coffee cups that are claimed to be full in the dialogue but are very clearly empty based on how they are handled by the performers. In the case of this episode, however, Kyle MacLachlan was given some praise for being the sole actor to handle his cup as though it were actually full, especially in an episode where a character (Phil Bisby) unrealistically balances two full trays of coffee while running around.\nThe statue in front of Dougie's workplace was not originally part of location and was brought by the production staff. It might be a statue of Donald Lynch, father of David Lynch, since according to the stand-in Tyler Malkin, Lynch talked to it saying \"Hi, Dad\".\nThe numbers input by the doppelganger during his phone call are, using the standard DTMF tones pitched up 2 octaves for offscreen ones:\n16 (pause) 1235789 (computer modem response) 3135378912315 (01189998819991197253 offscreen)\nThis could be interpreted as two numbers dialing to get an outside line from the internal prison phone system, then a 7 digit local number calling a computer set up beforehand with a local number so it would be a free local call and finally a code that triggers a pre-planned, automated hack of the prison systems."}