{"name": "Part_10", "url": "https://twinpeaks.fandom.com/wiki/Part_10", "text": "Part 10\nNot to be confused with Episode 10.\n\"Part 10\" is the tenth episode of the 2017 series of Twin Peaks and the fortieth episode of the franchise as a whole. It aired on July 16, 2017.\nPlot\n\"Laura is the one.\"\n ―Margaret Lanterman\nRichard drives to Miriam Sullivan's, who tells him to leave and has sent a letter about him to the sheriff's department. He angrily breaks into the trailer and savagely beats her. He leaves, calling Deputy Chad and telling him to intercept Miriam's letter.\nCarl plays guitar and sings outside of his trailer and stops when a red mug is thrown through a trailer window by Steven Burnett, who is inside abusing Becky.\nRodney Mitchum is going over paperwork when Candie comes in, tries to swat a fly, and ends up hitting Rodney in the head with a television remote. Bradley comes in as Candie becomes hysterical over wounding Rodney.\nDougie's doctor examines Dale Cooper as Janey-E tells him about his recent behavior. After a physical, he is determined to be in excellent health, delightfully surprising Janey-E, due to Dougie usually being overweight.\nRodney watches the news with Candie, Sandie, and Mandie and sees the report on the arrest Ike \"The Spike\" Stadtler, who they had a hit on. They then see the report on Ike's attack on \"Dougie,\" recognizing him as \"Mr. Jackpots\" from their casino.\nJaney-E watches Cooper eat cake and asks him if he finds her attractive, trying to tempt him. Then they have sex, with Cooper's arms comically flopping on the bed, resulting in Sonny Jim being awoken by Janey-E's screams.\nJacoby broadcasts an episode of his \"Dr. Amp\" show as Nadine Hurley watches.\nIn the morning, Janey-E – in a bright mood from the evening before – takes Cooper to work and Sonny Jim to school.\nJerry, lost in the woods, yells when he loses phone signal.\nChad goes to Lucy's desk and comments that it is a beautiful day, then going out to get the mail as Lucy watches with suspicion. He pockets Miriam's letter outside of Lucy's view and goes back inside, leaving the rest of the mail with Lucy.\nRichard drives, reading a text message from Chad, confirming that he caught the letter from Miriam.\nJohnny sits in front of a talking toy bear while Sylvia goes to the door as Richard arrives at her house, trying to keep him away. He enters anyway and demands money. He starts strangling Sylvia as Johnny helplessly falls over, tied to his chair, squirming on the floor. Richard gets valuables from a safe and takes his grandmother's purse before leaving.\nRoger reports Ike's arrest to Duncan Todd, who then calls over Anthony Sinclair, ordering him to convince the Mitchum brothers that Dougie is working against them, and, if he fails, to kill Dougie.\nAlbert Rosenfield and Constance Talbot enjoy a dinner date as Cole and Preston observe them approvingly.\nAt the Silver Mustang Casino, the Mitchum brothers watch (via security cameras) Sinclair approaching Warrick and stating that he wishes to speak to the Mitchums. They send Candie down to collect Sinclair, which she does with much delay. When she finally brings him to the office, Sinclair lies to the Mitchum brothers that Dougie Jones had cheated them out of their insurance claim for their hotel that burned down due to arson. Back home, they make their plans to deal with Jones.\nCole sits in his hotel room, sketching, then answers the door, seeing a vision of Laura Palmer and hearing Sarah Palmer shouting \"Laura!\" before he notices Albert. Albert shows him Diane's text, saying that it was sent from Mexico, and her response to it saying that they have Hastings. Preston enters and shows them a photo of the glass box in the presence of Cooper's doppelganger and another man.\nSylvia tells Ben about Richard's attack, expecting him to cover for her money stolen by Richard. Ben asks Beverly to have dinner with him.\nThe Log Lady speaks to Hawk over the phone with another cryptic message, particularly noting the Trumans as Hawk's brothers and that \"Laura is the one.\"\nAt the Roadhouse, Rebekah Del Rio performs \"No Stars.\"\nEpisode credits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger) (photo)\nIn Alphabetical Order\nJane Adams as Constance Talbot\nJoe Adler as Roger\nStephanie Allynne as Soccer Mom (Part 7 stock footage)\nChrysta Bell as FBI Agent Tammy Preston\nJim Belushi as Bradley Mitchum\nRichard Beymer as Benjamin Horne\nJohn Billingsley as Doctor Ben\nLarry Clarke as Detective T. Fusco\nCatherine Coulson as Margaret Lanterman (The Log Lady)\nGiselle Damier as Sandie\nJan D'Arcy as Sylvia Horne\nDavid Dastmalchian as Pit Boss Warrick\nEric Edelstein as Detective \"Smiley\" Fusco\nEamon Farren as Richard Horne\nMiguel Ferrer as FBI Agent Albert Rosenfield\nPatrick Fischler as Duncan Todd\nPierce Gagnon as Sonny Jim Jones\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nCaleb Landry Jones as Steven Burnett\nDavid Patrick Kelly as Jerry Horne\nRobert Knepper as Rodney Mitchum\nDavid Koechner as Detective D. Fusco\nAndrea Leal as Mandie\nSheryl Lee as Laura Palmer\nSarah Jean Long as Miriam Sullivan\nDavid Lynch as FBI Deputy Director Gordon Cole\nGreg Mills as Paul\nMoby as Musician\nJohn Pirruccello as Deputy Chad Broxford\nKimmy Robertson as Lucy Brennan\nWendy Robie as Nadine Hurley\nEric Rondell as Johnny Horne\nAmanda Seyfried as Rebecca (Becky) Burnett\nAmy Shiels as Candie\nTom Sizemore as Anthony Sinclair\nSara Sohn as Sheena\nHarry Dean Stanton as Carl Rodd\nRuss Tamblyn as Dr. Lawrence Jacoby\nNaomi Watts as Janey-E Jones\nChristophe Zajac-Denek as Ike \"The Spike\" Stadtler\nRebekah Del Rio as Herself\nUncredited\nGrace Zabriskie as Sarah Palmer\nMick Flowers as Drummer\nNick Launay as Keyboardist\nUnknown performer as henchman (picture)\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Red River Valley\"\nPerformed by Harry Dean Stanton\n\"Slow Dreams\"\nWritten and performed by Johnny Jewel\nCourtesy of Italians Do It Better\n\"Headless Chicken\"\nWritten by Angelo Badalamenti and David Lynch\nPerformed by Thought Gang\n\"Charmaine\"\nWritten by Erno Rapee and Lew Pollack\nPerformed by Mantovani and His Orchestra\nCourtesy of Decca Music Group Ltd.\n\"No Stars\"\nWritten by David Lynch, John Neff, and Rebekah Del Rio\nPerformed by Rebekah Del Rio\nNotes\nThe scene in which Candie smacks Rod in the face with a television remote as she tries to swat a fly was unscripted and a byproduct of an actual on-set accident. A light on the set fell and hit Robert Knepper right below his eye on his cheekbone, and David Lynch devised the scene between Candie and Rod to explain the cut on his face.\nDuring the filming of Cooper and Janey-E's sex scene, Kyle MacLachlan was only given the direction to lie down on the bed and more or less be passive. As it was being shot, his arms began naturally bouncing with the motions of the bed, prompting the director of photography to lean in and whisper, \"Keep doing the arms, it's hilarious!\"\nOne address on the letter is:\nMarvin Marcia\n91846 W Elmford Row Pl.\nTwin \nProduction errors\nThe prop department mistakenly gave Miriam Sullivan the surname \"Hodges\" in her address.\nA visual glitch occurs on the doorknob when Tammy goes to Gordon's apartment.\nWhen Chad stand in front of Lucy's desk, he places his hands on his belt but on the reverse shot, they appear to be on his belly, then, on the next shot, on his belt again."}