{"name": "Part_9", "url": "https://twinpeaks.fandom.com/wiki/Part_9", "text": "Part 9\nNot to be confused with Episode 9.\n\"Part 9\" is the ninth episode of the 2017 series of Twin Peaks and the thirty-ninth episode of the franchise as a whole. It aired on July 9, 2017.\nPlot\n\"This is the chair.\"\n ―Betty Briggs\nCooper's doppelganger walks down a road and takes a bandana from a post.\nAgent Preston passes along a call from Colonel Davis to Gordon Cole, telling him of the discovery of Garland Briggs' body in Buckhorn, South Dakota.\nThe doppelganger arrives where Hutch and Chantal wait for him.\nCole asks Diane to stay with them during their trip to Buckhorn and has the pilot re-route. Preston then receives a call from Warden Murphy, who tells Gordon that \"Cooper\" has left the prison.\nAfter sending a text reading, \"around the dinner table the conversation is lively,\" the doppelganger calls Duncan Todd for an update on a job he was hired to do, then gives Hutch an assignment to kill Warden Murphy.\nCooper and Janey-E wait as Bushnell Mullins gives a statement to the Las Vegas police concerning Dougie and the attack that had been attempted on Cooper. Mullins allows Cooper to take the rest of the day off and says that they will seek answers the next day. The police note that they have absolutely no information about Dougie Jones prior to 1997, leading them to suppose Witness Protection. Detective D. Fusco brings Cooper a second cup of coffee and takes his first cup for it to be analyzed for identifiers. Cooper and Janey-E remain seated, the former observing the American flag in the lobby and a woman's red shoes. He then focuses on an electrical outlet.\nAs the police gather outside the motel where he is staying, Ike \"The Spike\" Stadtler leaves a message for \"J.T.\", saying that he is taking medical leave. He leaves his motel room and is stopped in the hallway by the police.\nAndy and Lucy shop for furniture online, arguing over which color chair to get – Lucy wanting the beige model while Andy wants the red one – until Andy decides to let Lucy have her way, though she decides to order the red chair that he wanted instead.\nLeft unattended, Johnny runs around his home, chased by his mother, until running directly into a wall.\nBobby visits his mother with Frank and Hawk to discuss her husband's activities concerning Cooper before his death. She tells them that she was expecting this visit, as Garland had told her it would happen, but would not explain what it would be about. Per his instructions, she gives them an object that was hidden inside a chair.\nCole, Albert, Diane, and Preston meet Knox and Macklay at the Buckhorn Police Department to view Briggs' body, though Diane stays behind in the lobby and reads a text reading \"AROUND THE DINNER TABLE, THE CONVERSATION IS LIVELY.\" Macklay explains the circumstances of the body being found as they go to the morgue where Talbot waits. Macklay then notes that William Hastings and Ruth Davenport had been blogging about alternate dimensions. Albert notes the incorrect age of the body and Cole pulls him aside and they connect it to Cooper. They return and Talbot shows them Dougie's ring found inside the body, prompting Cole to wish to speak to Hastings.\nJerry, apparently still high, observes his foot, which he is told is not his. He grabs it and falls to the ground.\nChad eats in the conference room as Truman, Hawk, and Bobby come and dismiss him. Frank and Hawk try to open the object given to them by Betty, amusing Bobby, who says they must go back outside to open it. Bobby throws it on the ground, which causes it to make a noise before throwing it down again to open it. Truman removes a slip of paper with directions, which Bobby understands, noting the \"Jack Rabbits Palace\" to be an imaginary place he and his father had during his childhood. Also in the object is the transmission Briggs intercepted with Cooper's name.\nCole and Preston go outside to Diane as Albert is \"indisposed.\"\nHastings cries in the interview room as Preston joins him to question him about his blog, where he claimed to have entered an alternate dimension and met the Major, who had been \"hibernating\" there and told them to get coordinates for him, which Ruth wrote on her hand prior to her death. He identifies a picture of Briggs as the Major he met, who he claimed to have floated up, saying \"Cooper, Cooper.\"\nBen and Beverly again investigate the strange noise in the hotel, which Ben likens to a monastery bell. The two nearly share a romantic moment, but Ben politely refuses, for which Beverly reluctantly commends him.\nHudson Mohawke performs \"Human\" as Ella and Chloe speak at the Roadhouse, speaking about the former being fired from her job for being high. Au Revoir Simone then perform \"A Violent Yet Flammable World.\"\nEpisode credits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJane Adams as Constance Talbot\nDana Ashbrook as Deputy Bobby Briggs\nChrysta Bell as FBI Agent Tammy Preston\nRichard Beymer as Benjamin Horne\nBrent Briscoe as Detective Dave Macklay\nLarry Clarke as Detective T. Fusco\nJan D'Arcy as Sylvia Horne\nDon S. Davis as Major Garland Briggs (photo)\nLaura Dern as Diane Evans\nEric Edelstein as Detective \"Smiley\" Fusco\nSky Ferreira as Ella\nMiguel Ferrer as FBI Agent Albert Rosenfield\nPatrick Fischler as Duncan Todd\nRobert Forster as Sheriff Frank Truman\nHarry Goaz as Deputy Andy Brennan\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nAshley Judd as Beverly Paige\nDavid Patrick Kelly as Jerry Horne\nDavid Koechner as Detective D. Fusco\nSheryl Lee as Laura Palmer\nJennifer Jason Leigh as Chantal Hutchens\nMatthew Lillard as William Hastings\nDavid Lynch as FBI Deputy Director Gordon Cole\nJames Morrison as Warden Dwight Murphy\nDon Murray as Bushnell Mullins\nJohn Pirruccello as Deputy Chad Broxford\nJelani Quinn as Desk Sergeant\nAdele René as Lieutenant Cynthia Knox\nKimmy Robertson as Lucy Brennan\nEric Rondell as Johnny Horne\nTim Roth as Gary \"Hutch\" Hutchens\nCharlotte Stewart as Betty Briggs\nNaomi Watts as Janey-E Jones\nKarolina Wydra as Chloe\nChristophe Zajac-Denek as Ike \"The Spike\" Stadtler\nHudson Mohawke as himself\nAu Revoir Simone:\nHeather D'Angelo\nErika Forster\nAnnie Hart\nUncredited\nUnknown performer as Jerry's foot\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"America the Beautiful\"\nWritten by Samuel A. Ward\nPerformed and arranged by the U.S. Air Force Band\n\"Human\"\nWritten and performed by Hudson Mohawke\nCourtesy of Warp Records\n\"The Chair\"\nComposed and performed by Angelo Badalamenti\n\"A Violent Yet Flammable World\"\nWritten and performed by Heather D'Angelo, Erika Forster, and Annie Hart\nCourtesy of Our Secret Record Company"}