{"name": "Part_8", "url": "https://twinpeaks.fandom.com/wiki/Part_8", "text": "Part 8\nNot to be confused with Episode 8.\n\"Part 8\" is the eighth episode of the 2017 series of Twin Peaks and the thirty-eighth episode of the franchise as a whole. It aired on June 25, 2017.\nA 4K transfer of the episode was included in Twin Peaks: From Z to A.\nPlot\n\"Gotta light?\"\n ―The Woodsman\nCooper's doppelganger and Ray Monroe drive, the former noting that there are three tracking devices on their car. He deactivates them, repurposing them to track a truck in front of them. They discuss where they are headed and the information the doppelganger wants, and he lies to Ray about Darya. \nThey head off the highway to a secluded area. As Ray relieves himself, Cooper demands the information and attempts to shoot Ray, but Ray has unloaded his gun. Ray then shoots the doppelganger with another gun. Ray then sees six dark men gather around Cooper's body, tearing at it, revealing to Ray a black ball with the face of BOB. He runs away and tells Phillip Jeffries that he believes he is dead.\nAt the Roadhouse in Twin Peaks, an MC introduces the Nine Inch Nails. They perform their song \"She's Gone Away.\"\nCooper's doppelganger sits up, alive.\nJuly 16, 1945\nWhite Sands, New Mexico\n5:29 AM (MWT)\nThe world's first atomic bomb is detonated. Images of darkness and various distorted images are seen, followed by nebulae and a convenience store, where dark men arrive and move about outside. A figure appears to regurgitate a substance, where inside are many eggs, a speckled one getting out while the face of BOB can be seen on a black ball rock. \nGolden and red imagery follows, then a purple sea under the Black Lodge, where atop a rock spire is a building. Inside is a woman who listens to a phonograph. ??????? enters as a mechanism in the room makes a noise. He goes upstairs, where he views the preceding events, ascending as a golden cloud forms above his head. The woman enters as a golden orb floats down to her from the cloud. It reaches her hands and the face of Laura Palmer appears. She kisses it and sends it to Earth. \n1956\nAugust 5\nNew Mexico Desert\nAugust 5, 1956, New Mexico desert. A strange creature hatches from a speckled egg and crawls through the desert. A teenage couple walk past a gas station, the girl finding a face-up penny. Two woodsmen descend onto the ground and they stop a car, one of them asking the driver and his wife, \"Gotta light?\" The couple in the car become frightened and they speed away.\nThe young couple reach the girl's home and they share a kiss before she goes inside. One of the woodsmen approaches KPJK radio station, goes inside and kills the receptionist. He then goes to the disc jockey, grabs him tightly by the head and repeatedly broadcasts the words, \"This is the water and this is the well. Drink full and descend. The horse is the white of the eyes and dark within,\" which causes listeners to fall unconscious including a waitress at Pop's Diner, a mechanic in his shop, and the girl. The creature reaches the girl's room and climbs into her mouth. The woodsman ends his broadcast, crushes the disc jockey's skull, and leaves while the neigh of a horse is heard.\nCast\n\nStarring\nKyle MacLachlan as Dale Cooper (doppelganger)\nIn Alphabetical Order\nLeslie Berger as New Mexico Wife\nRobert Broski as Woodsman\nCullen Douglas as Disc Jockey\nErica Eynon as Experiment\nTikaeni Faircrest as Girl (1956)\nGeorge Griffith as Ray Monroe\nTad Griffith as New Mexico Husband\nSheryl Lee as Laura Palmer (golden orb)\nXolo Mariduena as Boy (1956)\nJoy Nash as Senorita Dido\nTracy Phillips as Receptionist\nFrank Silva as Bob\nJR Starr as MC\nCarel Struycken as ???????\n\"The\" Nine Inch Nails:\nTrent Reznor\nAtticus Ross\nMariqueen Maandig Reznor\nRobin Finck\nAlessandro Cortini\nJoey Castillo\nStunt: Tait Fletcher\nUncredited\nStewart Strauss as Woodsman\nChristian Calloway as Woodsman\nGabriel Lane as Woodsman\nUnknown performer as Woodsman circling Ray\nUnknown performer as Woodsman circling Ray\nUnknown performer as Woodsman excising BOB\nUnknown performer as Bomb countdown voice\nUnknown performer as Pop's Diner waitress\nUnknown performer as Mechanic\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"She's Gone Away\"\nWritten by Trent Reznor and Atticus Ross\nPerformed by Nine Inch Nails\n\"My Prayer\"\nWritten by Georges Boulanger and Jimmy Kennedy\nPerformed by The Platters\nPublished by Skidmore Music Co.\nCourtesy of The Island Def Jam Music Group\nUnder license from Universal Music Enterprises\n\"Threnody for the Victims of Hiroshima\"\nWritten by Krzysztof Penderecki\nPerformed by Warsaw National Philharmonic\nCourtesy of Universal Music\n\"Slow 30's Room\"\nWritten and performed by David Lynch and Dean Hurley\nBehind the scenes\nMark Frost on the writing of this episode:\nThe idea obviously — or, well, not obviously — was that we'd never done anything close to what you might describe as a \"Twin Peaks\" origin story, where this pervasive sense of darkness and evil had come from. On the page, we wrote it in great detail. I think it was maybe 12, 15 pages. But as we were putting down the descriptions, I knew David was going to take that as the blueprint for something extraordinary. He ran with it and elevated it to a whole other level...the atomic explosion was probably half a page as written, but I knew that, in David's hands, it could run as long as 10 or 12 minutes, and it would be riveting. It was certainly a narrative departure from what we had done before. There was no question about that. But it needed to stand apart, and it needed to blow your mind. So mission accomplished.\nFilming locations in Washington included North Bend and Olallie for the garage and convenience store, respectively. Pop's Diner was filmed at Chili John's Restaurant in Burbank, California.\nThe music playing during and for a period of time after the atomic bomb blast is, appropriately, \"Threnody for the Victims of Hiroshima,\" a composition by Polish composer Krzysztof Penderecki.\nAccording to the original scripts for Part 8, part of the Woodsman's radio message was originally \"atonal, word-like mechanical sounds\" in addition to the \"This is the water\" refrain.\nTrivia\n \nIn an Inland Empire extra called \"Quinoa,\" Lynch narrates a story in which he encountered creatures he described as \"frog-moths.\" He later confirmed in his Room to Dream autobiography that they appeared in the 2017 series.\nTrent Reznor and his band Nine Inch Nails previously contributed the soundtrack to David Lynch's film Lost Highway. Lynch also directed the music video for their single \"Came Back Haunted.\"\nAlthough his doppelganger makes an appearance, this is the only episode in which Dale Cooper does not appear.\n\"My Prayer\" by the Platters is featured in this episode. Coincidentally, the group had a singer named David Lynch from its formation in 1952 to 1970.\nAlthough it was not made consciously at the time, Lynch likens the nuke with the picture in Henry Spencer's room from Eraserhead.\nThe scene of the Fireman's creating the orb was visually based on a painting by David Lynch. This painting is also similar to Mr Jim's Vision, The Antman and Floating Figure (chalk on paper, 1985). When shooting the scene, the performers were unaware of Laura being part of the scene."}