{"name": "Part_1", "url": "https://twinpeaks.fandom.com/wiki/Part_1", "text": "Part 1\nNot to be confused with Pilot or Episode 1.\n\"Part 1\" is the first episode of the 2017 series of Twin Peaks, the thirty-first episode of the franchise as a whole. It originally aired on May 21, 2017 and was screened alongside Part 2 as a single movie for the Cannes Film Festival.\nA TV-14 edit of the episode was officially released on YouTube alongside Part 2 for a limited time for National Donut Day in early June 2017 and again in August.\nPlot\n\"My log has a message for you.\"\n ―Margaret Lanterman\nCooper sits in the Red Room across from Laura Palmer, who tells him \"I'll see you again in 25 years. Meanwhile,\" and she makes a gesture with her hands.\nTwenty-five years later, an aged Cooper without his FBI lapel pin sits across from a man resembling the Giant, who points his attention to the sounds of a phonograph. He then says \"It is in our house now,\" and \"It all cannot be said aloud now.\" He then tells Cooper to remember \"430\" and \"Richard and Linda. Two birds with one stone.\" He tells Cooper that he \"is far away,\" and Cooper disappears.\nJoe delivers shovels to Lawrence Jacoby.\nIn New York City, Sam Colby watches a glass box with cameras pointed at it. He changes the SD card in one of the cameras when an intercom calls for him to do so. He sits back down until he is called out for a delivery from Tracey Barberato, who has brought him coffee. She asks to go back into the room with him, but with the security guard watching, he tells her she cannot. When he puts in the code to re-enter the room, she tries looking over his shoulder, but he catches her doing so. Tracey leaves and Sam goes back into the room with his coffee, sitting back down to watch the glass box.\nBenjamin Horne tells Beverly Paige to give a refund to a Mrs. Houseman for two nights of her stay after a skunk was in the hotel. Ben's brother, Jerry loudly enters and Ben introduces them and dismisses Beverly. Jerry sits down and the brothers briefly talk.\nLucy Brennan sits at her desk at the Twin Peaks Sheriff's Department and a man in a suit comes, wishing to speak to Sheriff Truman. When Lucy asks whether he wants to speak about insurance with the Sheriff Truman who is sick or the Sheriff Truman who is fishing, he admits that he does not know. He gives her his card and leaves. \nAgent Cooper's doppelganger walks to a house, where he incapacitates a guard. He goes inside, where he greets Otis, in the room also are a thin man and a small disabled man in a wheelchair. The guard enters and tries to attack him, but he knocks him out. Buella enters and the doppelganger asks her for Ray and Darya. She calls them out and they leave with the doppelganger.\nSam changes another camera's card and is brought another delivery of coffee from Tracey. When they find that the guard is not present, Sam takes Tracey into the room. He admits that he does not know who owns the building and says that his job is to watch the glass box for something to appear inside. After sitting down to watch the box, they begin to make out and soon after they start having sex, a ghostly figure appears in the box. The figure breaks out and slaughters them.\nIn an apartment complex in Buckhorn, South Dakota, Marjorie Green goes down the hallway with her dog, Armstrong, who notices a smell coming from the apartment of Ruth Davenport. Marjorie goes to her apartment to report this to the authorities. Police officers Olson and Douglas arrive to investigate. They ask her about any individual that may have a key to Ruth's apartment. They call a locksmith and she soon leads them on a search for the building's maintenance man, Hank Fillmore, who thinks they are there on a call for a crime he committed. Marjorie then reveals that she had a key to the apartment all along. Olson and Douglas search the apartment and find a dead body in the bedroom.\nHank questions Harvey, believing he sent the police to him and they discuss a deal they made until Harvey hangs up.\nConstance Talbot investigates the crime scene as pictures are taken. Detective Dave Macklay arrives and they pull the sheets off of the body, which instead is a male body that does not belong to the head.\nA fragile Margaret Lanterman calls the sheriff's department for Deputy Chief Hawk. She tells him that her log has a message for him: \"Something is missing and you have to find it,\" and that this relates to Agent Cooper. She says that the way he will find it has something to do with Hawk's heritage.\nTalbot analyzes fingerprints found at the crime scene. Upon finding a match, she calls in Detective Macklay. She confirms to him that the head belongs to Ruth Davenport, but there is no match on the body, which belongs to a male. She also says shows that the fingerprints found at the scene belong to Bill Hastings, the principal at the local high school.\nMacklay goes to the Hastings home, where he arrests Bill.\nHawk brings files to the conference room. Andy and Lucy enter and Hawk explains to them about what the Log Lady told him.\nMacklay interrogates Bill with Detective Don Harrison and Police Chief Mike Boyd observing. Hastings says that he did not really know Ruth Davenport, who was the librarian at the school, and he had last seen her a couple months ago. Hastings' story lines up until there is a 45 to 50-minute gap in his activities. He hesitates and says that he had taken his assistant, Betty home during that time after a meeting. He nervously requests to speak to his lawyer before Macklay reveals to him that Ruth Davenport had been murdered and Hastings' fingerprints were found in the apartment. Hastings is then escorted out to a cell and he asks to speak to his wife, Phyllis.\nMacklay and Harrison go to the Hastings home with a group of police officers with a warrant to search Bill's home and car. Inside the latter, they find a piece of flesh.\nThe man resembling the Giant watches the phonograph.\nCredits\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJane Adams as Constance Talbot\nJoseph M. Auger as Delivery Driver\nMelissa Bailey as Marjorie Green\nRichard Beymer as Benjamin Horne\nMichael Bisping as Guard\nBrent Briscoe as Detective Dave Macklay\nBailey Chase as Detective Don Harrison\nCatherine Coulson as Margaret Lanterman (The Log Lady)\nJames Croak as Robby\nKathleen Deming as Buella\nErica Eynon as Experiment Model\nAllen Galli as Man in Suit\nJames Giordano as Officer Douglas\nHarry Goaz as Deputy Andy Brennan\nGeorge Griffith as Ray Monroe\nCornelia Guest as Phyllis Hastings\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nAshley Judd as Beverly Paige\nDavid Patrick Kelly as Jerry Horne\nDep Kirkland as Police Chief Mike Boyd\nNicole LaLiberte as Darya\nSheryl Lee as Laura Palmer\nMatthew Lillard as William Hastings\nChristopher Murray as Officer Olson\nMax Perlich as Hank\nKimmy Robertson as Lucy Brennan\nBenjamin Rosenfield as Sam Colby\nMary Stofle as Ruth Davenport\nCarel Struycken as ???????\nRuss Tamblyn as Dr. Lawrence Jacoby\nRedford Westwood as Otis\nMadeline Zima as Tracey\nIn Memory of Catherine Coulson\nUncredited\nGeoffrey Gould as Forensic photographer\nMichael McGee as Businessman \nSteven James Tingus as Disabled cousin*\nUnknown performer as Screaming girl (Pilot stock footage)\nUnknown performer as Camera Voice over\nUnknown performer as Cabin guard\nUnknown performer as Thin cousin*\n * = In Behind the Curtain, while announcing the completion of their scene, Lynch refers to the cousins as \"Steve\" and \"John\", although he is possibly calling the two actors by their real names.\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"American Woman (David Lynch Remix)\"\nWritten by Kallie North, Jessyca Wilson, Jason White, and Butch Walker\nPerformed by Muddy Magnolias\nPublished by Warner, Chappell, Hanging Vine (BMI), EMI April Music Inc. (ASCAP)\n\"Sub Dream\"\nWritten and Performed by David Lynch and Dean Hurley\n\"Frank 2000\"\nWritten by Angelo Badalamenti and David Lynch\nPerformed by Thought Gang\nBehind the scenes\nThe filming of Sam and Tracey's brutal murder by the Experiment was achieved by spraying actors Ben Rosenfield and Madeline Zima with blood from a hose as the camera zoomed in on them. A further \"dry\" take was also done without the blood at the suggestion of Zima, though the final cut of the episode uses the blood take. Lynch initially planned to also bat them in the face with two large blue balls on sticks, but these are absent from behind-the-scenes footage of the take and Lynch is only shown directing the scene. Neither actor was told or shown what exactly they were reacting to, and all further effects work of the Experiment's attack was done in post-production.\nSam and Tracey's coffee cups are rather obviously empty, based on how they are held by Ben Rosenfield and Madeline Zima. This, along with several other instances in The Return of characters carrying and handling cups that are very clearly empty, earned Twin Peaks an \"Empty Cup Award,\" a satirical award from the online magazine Slate which draws attention to this phenomenon in modern TV.\nTV-14 edit\nA TV-14 version of the episode — edited for language and sexual content — was released for the American region on YouTube for a limited time in observance of National Donut Day in early June 2017. It was released again for a limited time on August 8, 2017.\nTrivia\nLynch considers the piece of meat discovered in the car as just a piece of meat and nothing specific like a tongue or a kidney."}