{"name": "Part_18", "url": "https://twinpeaks.fandom.com/wiki/Part_18", "text": "Part 18\nNot to be confused with Episode 18.\n\"Part 18\" is the eighteenth and final episode of the 2017 series of Twin Peaks and the forty-eighth episode of the franchise as a whole. It aired on September 3, 2017.\nPlot\n\"What is your name?\"\n ―Dale Cooper\nCooper's doppelganger sits in the Black Lodge, surrounded by flames. Mike creates a new Dougie Jones, who shows up at the Jones home, greeted by Janey-E and Sonny Jim.\nCooper leads Laura through the woods and she disappears. Cooper hears her screams.\nCooper sits in the Lodge near Mike, who asks, \"Is it future or is it past?\" Cooper observes the chair Laura sat in and he follows Mike to the evolution of the arm, which asks if it is the \"story about the little girl who lives down the lane.\" Laura whispers in Cooper's ear and she is lifted, screaming, through the Lodge ceiling. Cooper goes to Leland, who tells him to find Laura. He goes through billowing curtains to Glastonbury Grove, where Diane waits and asks if it is really him, which he asks the same of her.\nCooper and Diane drive 430 miles, Diane advising Cooper that their destination will not be what he expects. Upon arrival, he gets out of the car and observes his surroundings. He returns to Diane, confirming that it is the right place. They kiss before driving through a portal, which transports them to a dark road.\nThey reach a motel and Cooper goes inside. While sitting in the car, Diane sees herself briefly before Cooper returns. They enter a motel room and have sex.\nIn the morning, Cooper wakes alone and looks for Diane, finding a note for \"Richard,\" signed by \"Linda,\" telling him that she was gone and not to find her. He leaves the motel, noticing that it and his car are different from those that were there before.\nCooper reaches Odessa, finding a coffee shop called Eat at Judy's. He goes inside and asks the waitress serving him if there was another one who worked there, but he is told that it is the other waitress's day off. He spots a group of men harassing the waitress and advises them to stop. They threaten him and he incapacitates two of them from his seat and has the other stand down. He has the waitress give him the other waitress's address as he places the guns belonging to the men in the deep fryer, warning the staff that the heat could set off the guns. He leaves with the address.\nHe goes to the waitress's home, spotting a utility pole outside with a number \"6\" attached to it. He knocks on the door and the waitress resembling Laura opens it, confused about his calling her Laura. She tells him her name is Carrie Page, but he insists that she is Laura, and offers to take her home in Twin Peaks. Having already been needing to leave town, she agrees to go with him. As she gets ready to leave, Cooper goes inside, seeing a dead man on the couch and a white figurine of a horse.\nThey drive, Carrie reminiscing about Odessa and stopping at a gas station on the way. At one point they notice a car's headlights behind them and wonder if they are being followed, only for it to harmlessly pass them.\nThey reach Twin Peaks, but Carrie does not recognize anything. They arrive at the Palmer home and Cooper knocks on the door, but a stranger answers, not recognizing the name Sarah Palmer and saying that she purchased the home from a Mrs. Chalfont. The woman identifies herself as Alice Tremond and Cooper and Carrie walk away from the home, perplexed.\nLost in thought, Cooper hesitates as they get to the car and turns back in the direction of the house. Sensing something is not right, he asks what year it is. Carrie turns to look at the former Palmer home and hears Sarah shouting \"Laura.\" She suddenly screams like Laura, startling Cooper and causing the lights in the house to go dark.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as\nDale Cooper\nDale Cooper (doppelganger)\nDougie Jones\nIn Alphabetical Order\nMatt Battaglia as Cowboy 3\nLaura Dern as Diane Evans\nFrancesca Eastwood as Texas Waitress Kristi\nPierce Gagnon as Sonny Jim Jones\nHeath Hensley as Cowboy 1\nSheryl Lee as Laura Palmer\nSheryl Lee as Carrie Page\nRob Mars as Cowboy 2\nMary Reber as Alice Tremond\nAl Strobel as Philip Gerard\nNaomi Watts as Janey-E Jones\nRay Wise as Leland Palmer\nGrace Zabriskie as Sarah Palmer\nUncredited cast\nTimothy Reber as Alice Tremond's partner (voice)\nUnknown performer as Body on the couch\nUnknown performer as Judy's cook\nUnknown performers as Judy's elderly customers\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"My Prayer\"\nWritten by Georges Boulanger and Jimmy Kennedy\nPerformed by The Platters\nPublished by Skidmore Music Co.\nCourtesy of The Island Def Jam Music Group\nUnder license from Universal Music Enterprises\nBehind the scenes\nThe episode's final scenes outside the Palmer house were shot in the late hours of October 2 and the early hours of October 3, 2015. Paparazzi footage of the filming, plus reports of the screams that turned out to belong to Carrie Page, served as the first leaks from the set of the series. To prepare for the screams, members of the crew went door-to-door to warn homeowners about the filming.\nOn the meaning of the episode, Mark Frost commented, \"The actions that Cooper takes have consequences, and they're unforeseen and unanticipated, and they open the door to all other sorts of strange and perhaps enigmatic things taking place.\""}