{"name": "Part_16", "url": "https://twinpeaks.fandom.com/wiki/Part_16", "text": "Part 16\nNot to be confused with Episode 16.\n\"Part 16\" is the sixteenth episode of the 2017 series of Twin Peaks and the forty-sixth episode of the franchise as a whole. It aired on August 27, 2017.\nPlot\n\"No knock, no doorbell.\"\n ―Diane Evans\nCooper's doppelganger and Richard drive down a dirt road and make their way to the coordinates that were given to the doppelganger. Jerry sees them and watches as Richard inspects a rock the doppelgänger insists two of the coordinates lead to. Realizing too late that it's a trap, Richard suddenly receives an electric shock and is disintegrated — the doppelganger says \"goodbye, my son.\" He then send a text reading, ”: - ) ALL” and gets in his truck.\nHutch and Chantal wait in their van outside the Jones home. Two FBI cars arrive and the agents find that there is nobody home and they head to Lucky 7 Insurance.\nCooper lays comatose in a hospital bed, Janey-E and Sonny Jim at his side. Mullins arrives, followed by the Mitchum brothers and their assistants, who bring food, then offer to stock the Jones home.\nGordon stands in the hotel at Buckhorn as the machines around him begin to buzz.\nJaney-E takes Sonny Jim to the bathroom, leaving Mullins alone with Cooper. He receives a call about the FBI agents at the insurance office, looking for \"Dougie.\"\nHutch and Chantal sit in their van and idly chat as Agent Wilson and another agent return to the Jones home. A limo arrives followed by a bus, brought by the Mitchums, who go into the house. A Polish accountant approaches Hutch and Chantal, complaining that they are in his driveway. When they refuse to move, he pushes their van with his car. Chantal shoots at him and he returns fire. They then drive away and the accountant continues shooting, killing both of them. The FBI arrest the man as the Hutchens' van catches fire. The Mitchums watch the spectacle with confusion.\n \nMullins hears a noise in the hospital and follows it. Mike appears to Cooper as he wakes up, finally mentally and physically restored to his former self. He tells Cooper that his doppelganger did not return to the Lodge and gives him the ring. Cooper has Mike make another duplicate of himself with a strand of his hair, similar to the seed that Dougie Jones turned into. Janey-E and Sonny Jim arrive, followed by Mullins. Cooper announces that he is leaving the hospital and the doctor lets him go.\nCooper borrows Mullins' handgun and asks him to contact the Mitchum brothers to tell them that he is bringing his family to the Silver Mustang Casino and he needs a plane to Spokane. Cooper gives Mullins a message to read to Cole and he gives his farewells. Cooper leaves with the Jones family as the FBI arrives at the hospital.\nDiane smokes at the hotel bar and receives the text sent by Cooper's doppelganger. Unnerved, she \"remembers\" and responds with a series of numbers: 48551420117163956. She checks her handbag, revealing a gun before walking away from the bar and goes to Gordon, Albert, and Tammy and tells them about the night Cooper's doppelganger visited her.\nShe recounts the evening. A few years after Cooper's disappearance, the doppelgänger abruptly showed up at her house — “No knock, no doorbell”. While she was ecstatic to see him, the doppelganger only wished to know about the FBI's activities rather than speak about his own whereabouts. He leaned in to kiss her, but something went wrong and caused Diane to be fearful. He then smiled at her and raped her. Diane says that he then took her to an \"old gas station\" before suddenly declaring that she is in the sheriff's station. Diane becomes upset, saying \"I'm not me,\" and draws the gun in her purse. Albert and Tammy react in time, shooting her before she abruptly disappears. A horrified Tammy realizes Diane was a tulpa. Gordon questions what she meant by \"sheriff's station.\"\nDiane appears in the red room, where Mike tells her she was manufactured; she responds with “I know. Fuck you.“ Her face breaks open, releasing black smoke and a seed before she disintegrates.\n \nCooper brings Janey-E and Sonny Jim to the casino and the Mitchums take notice of his different behavior. He tells Janey-E and Sonny Jim that he has to leave, but appreciates the time he spent with them. An emotional Sonny Jim doesn't understand; Cooper assures them one day “Dougie” will come back to them. Janey-E realizes the man she believed to be Dougie isn't; she thanks him for his help and kisses him before he goes.\nCooper speaks to the Mitchum brothers about his actual identity on the way to the plane. Initially protesting that while they love Dougie Jones (whom they still think Cooper is), they are 'traditionally not welcome in such places or by such people' as law enforcement. Cooper agrees but asserts that the situation will be different, and that they have hearts of gold, to which Candie enthusiastically agrees.\n \nAt the Roadhouse, the MC welcomes Edward Louis Severson III, who performs \"Out of Sand.\" Audrey and Charlie arrive and order drinks at the bar; while Charlie toasts to them, Audrey stubbornly toasts to Billy. The MC then introduces \"Audrey's Dance\" and the floor clears for her to dance; the crowd sways back and forth to the song as Audrey dances sensually like she used to during her teenage years. A jealous husband cracks a bottle over another person's head, starting a fight. Audrey runs to Charlie, asking him to get her out — suddenly she finds herself in a white room, looking at a mirror. She begins to panic.\nThe Roadhouse band continues to play Audrey's Dance, but in reverse.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as\nDale Cooper\nDale Cooper (doppelganger)\nIn Alphabetical Order\nChrysta Bell as FBI Agent Tammy Preston\nJim Belushi as Bradley Mitchum\nRichard Bucher as Man Hit with Bottle\nScott Cameron as Throwing Man\nJonny Coyne as Polish Accountant\nGiselle DaMier as Sandie\nOwain Rhys Davies as Agent Wilson\nLaura Dern as Diane Evans\nJosh Fadem as Phil Bisby\nEamon Farren as Richard Horne\nSherilyn Fenn as Audrey Horne\nJay R. Ferguson as Special Agent Randall Headley\nMiguel Ferrer as FBI Agent Albert Rosenfield\nPierce Gagnon as Sonny Jim Jones\nDavid Patrick Kelly as Jerry Horne\nRobert Knepper as Rodney Mitchum\nAndrea Leal as Mandie\nSheryl Lee as Laura Palmer\nJennifer Jason Leigh as Chantal Hutchens\nBellina Logan as Female Doctor\nDavid Lynch as FBI Deputy Director Gordon Cole\nClark Middleton as Charlie\nDon Murray as Bushnell Mullins\nTim Roth as Gary \"Hutch\" Hutchens\nAmy Shiels as Candie\nJR Starr as MC\nAl Strobel as Phillip Gerard\nNaomi Watts as Janey-E Jones\nEddie Vedder as Edward Louis Severson III\nStunt Double:\nKoby Azarly\nCassidy Vick Hice\nProduction staff\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Night Electricity Theme\"\nWritten and performed by Dean Hurley\nPublished by Team Hurley (ASCAP)\nAdministered by Downtown Music Publishing\n\"Out of Sand\"\nWritten and performed by Eddie Vedder\nRecorded by John Burton\nJump-Site Studio, Seattle\nCourtesy of Seattle Surf Co. LLC\n\"American Woman (David Lynch Remix)\"\nWritten by Kallie North, Jessyca Wilson, Jason White, and Butch Walker\nPerformed by Muddy Magnolias\nPublished by Warner, Chappell, Hanging Vine (BMI), EMI April Music Inc. (ASCAP)"}