{"name": "Part_2", "url": "https://twinpeaks.fandom.com/wiki/Part_2", "text": "Part 2\nNot to be confused with Episode 2.\n\"Part 2\" is the second episode of the 2017 series of Twin Peaks, the thirty-second episode of the franchise as a whole. It originally aired on May 21, 2017.\nA TV-14 edit of the episode was officially released on YouTube for a limited time in early June 2017 for National Donut Day and later in August.\nPlot\n\"The stars turn and a time presents itself.\"\n ―Margaret Lanterman\nBill Hastings sits nervously in his cell and his wife arrives. She passes along word from George Bautzer that Bill will not be released on bail and he insists that he did not commit the murder of Ruth Davenport, but that he dreamt that he was there. Phyllis insists that he was there and reveals that she knows he had been having an affair with Ruth. He counters that he is aware of her having an affair with George and possibly someone else. She taunts him and Detective Macklay comes to dismiss Phyllis. She starts to leave the station and tells George that Bill is aware of their affair and she leaves alone, requesting George to meet with her later. As Bill sits in his cell, a dark figure sits in another and disappears, leaving its head faintly floating away.\nPhyllis returns home, where Cooper's doppelganger stands in her living room. He comments that she followed human nature perfectly and murders her with George's gun, which he drops just before he leaves.\nIn Las Vegas, Duncan Todd calls Roger into his office and hands him money. He tells him to tell \"her\" that she has the job. Roger asks him why Todd lets \"him\" make him do \"these things.\" Todd then warns Roger to never get involved with people like \"him.\" Roger then leaves.\nCooper's doppelganger eats creamed corn in a restaurant with Jack, Ray, and Darya. They discuss the doppelganger's alleged worry about the following day and information that the doppelganger wants, which Ray promises to get from Hastings' secretary.\nHawk searches the woods and the Log Lady calls him and says \"The stars turn and a time presents itself,\" and offers for him to stop by for pie and coffee. He soon arrives at Glastonbury Grove, where red drapes faintly appear and disappear.\nInside the Red Room, Cooper sits and Mike asks him if it is \"future\" or \"past,\" then tells him someone is there. Laura Palmer comes and speaks to Cooper, telling him he can \"go out now.\" She asks if he recognizes her and when he asks if she is Laura Palmer, she gives the same answer she gave him in the dream he had many years before: \"I feel like I know her, but sometimes my arms bend back.\" When he asks who she is, she confirms that she is indeed Laura Palmer and that she is both dead and alive at the same time. She removes her face, revealing an intense light behind it, then puts it back. He asks her when he can leave and she walks over to him and kisses him before whispering in his ear, just like in his dream 25 years prior. Suddenly, she screams and a force pulls her up. The red drapes blow back and reveal a pale horse and darkness. Mike appears to Cooper again, and again asks him if it is \"future\" or \"past,\" then leads him out of the room. He shows him to the arm, which has evolved into an electric tree with a fleshy mass at the top of it. The arm asks Cooper if he remembers his doppelganger and explains that he must be returned in order for Cooper to be allowed to leave.\nJack closes a garage door, where a car used by Cooper's doppelganger is parked. He gives the doppelganger keys to a different car and the doppelganger grabs Jack's face and strokes it. He goes to a motel, where inside, Darya quickly hangs up the phone and tells him she was talking to Jack. He tells her that Ray never showed up to a planned meeting they had and he borrows Darya's gun before sitting on the bed with her. Holding her, he reveals to her that he killed Jack. Realizing her cover is blown, Darya tries to escape, but he restrains her and plays a recording of the phone call she just had with Ray, revealing that Jeffries had given them a call to kill the doppelganger. She tries to escape again, but he once again restrains her and he confirms to her that he is going to kill her. After another futile attempt to escape his grasp, he punches her in the face and asks her to reveal to him who hired them to kill him, but she claims to not know, but does say they were to be paid $500,000 split between the two of them. As a plea for her life, she says she would not have followed through, but he brushes this off. He says he was supposed to get pulled back into the Black Lodge the following day, but has a plan to prevent this. He asks if Ray got the information from Hastings' secretary and asks if she heard anything about coordinates, but she says she has not, but that the secretary did tell Ray something. The doppelganger pulls an ace card out of his pocket with a strange symbol on it and says that it is what he wants. After one more attempted escape from Darya, the doppelganger kills her. He washes his hands, then contacts who he believes is Phillip Jeffries, but the voice mentions that he met with Major Garland Briggs and says he has called to say goodbye. The voice then says the doppelganger is \"going back in tomorrow\" and he will be with BOB again, then disconnects. The doppelganger logs into an FBI database and downloads files on Yankton Federal Prison, where Ray claims to be. The doppelganger goes to the motel room next door and meets with Chantal Hutchens, asking her to clean up Darya's body and to meet him along with her husband in a few days.\nThe arm says, \"253. Time and time again,\" and repeatedly says BOB's name and to go. Cooper follows Mike out of the room. Mike disappears and he goes down a hallway and to another room. He exits that room to go through another hallway, from where he enters a room where Leland Palmer sits and tells him to find Laura. Cooper exits and the Lodge begins to distort. Mike notes that something is wrong and the arm mentions his doppelganger. Cooper goes back to the hallway and pulls back a curtain, seeing a road where his doppelganger is driving. The Lodge shakes as the arm's doppelganger replaces the statue and roars at him as the chevron floor shifts. The arm's doppelganger says, \"non-exist-ent!\" and Cooper is dropped through the floor and is transported to the glass box in New York City just before Sam Colby and Tracey Barberato are killed. He is then transported back out.\nSarah Palmer watches footage of lions killing an African buffalo.\nAt the Roadhouse, the band Chromatics performs \"Shadow\" as Shelly has drinks with her friends and James Hurley enters the bar with Freddie Sykes, looking at Shelly's friend, Renee. From the bar, Red makes eye contact with Shelly while Jean-Michel Renault serves drinks.\nCredits\n\nCast\n\nStarring\nKyle MacLachlan as Dale Cooper / Dale Cooper (doppelganger)\nIn Alphabetical Order\nJoe Adler as Roger\nMädchen Amick as Shelly\nSteve Baker as Jack\nBrent Briscoe as Detective Dave Macklay\nGia Carides as Hannah\nCatherine Coulson as Margaret Lanterman (The Log Lady)\nNeil Dickson as George Bautzer\nPatrick Fischler as Duncan Todd\nBalthazar Getty as Red\nGeorge Griffith as Ray Monroe\nCornelia Guest as Phyllis Hastings\nMichael Horse as Deputy Chief Tommy \"Hawk\" Hill\nNicole LaLiberte as Darya\nSheryl Lee as Laura Palmer\nJennifer Jason Leigh as Chantal Hutchens\nMatthew Lillard as William Hastings\nJames Marshall as James Hurley\nWalter Olkewicz as Jean-Michel Renault\nBenjamin Rosenfield as Sam Colby (Part 1 stock footage)\nFrank Silva as Bob\nAl Strobel as Phillip Gerard\nJessica Szohr as Renee\nJake Wardle as Freddie Sykes\nRay Wise as Leland Palmer\nGrace Zabriskie as Sarah Palmer\nMadeline Zima as Tracey (Part 1 stock footage)\nChromatics:\nRuth Radelet\nAdam Miller\nJohnny Jewel\nNat Walker\nStunt Double: Courtney Farnsworth\nIn Memory of Frank Silva\nUncredited\nCeleste Cook as Roadhouse patron \nAlex Reyme as Roadhouse patron \nStewart Strauss as Woodsman\nKenneth Welsh as Windom Earle (archive footage)\nUnknown performer as the arm\nUnknown performer as \"Phillip Jeffries\" (voice)\nCrew\nSee: Twin Peaks (2017) § Production staff\nFeatured music\n\"Shadow\"\nPerformed by Chromatics\nWritten by Adam Miller, Johnny Jewel, and Nat Walker\nFrom the album Dear Tommy\nCourtesy of Italians Do It Better\nTV-14 edit\nA TV-14 version of the episode — edited for language and sexual content — was released on YouTube for a limited time in the American region in both June and August 2017.\nNotes\nThe FBI ID used by the doppelganger is kdhg\nTo log into Yankton Federal Prison, the doppelganger inputs the following\norganisation: mkeuouc-q\nname: eeuoubp3x\nID number: 398715015787412\nAmong the downloaded diagrams are the blueprint of a DCR power plant, the layout for a 1000 Megawatt Fusion powerplant and the floor plan of the second floor of TRANCOM Olympus City Office.\nThe scene of Hawk investigating the Lodge's entrance is not a flashforward.\nWhen Cooper's Double kills Phyllis Hastings, a warping effect is added as a dark red shape seemingly leaves her head at the top right corner of the screen\nProduction errors\nWhen Sam is replacing the SD card, a shot shows him with the shirt he had the previous day.\nWhen at the Bang Bang, at the end of the episode, when cutting back and forth between Shelly, and James, Shelly is shown to be drinking beer out of a bottle, then she is shown to be drinking beer out of a can."}