{"name": "Paul_Lantz", "url": "https://twinpeaks.fandom.com/wiki/Paul_Lantz", "text": "Paul Lantz\nPaul Lantz was a police beat reporter for the Tacoma Times.\nBiography\nIn his youth, Lantz survived a serious case of polio.\nAfter being contacted with the story by Fred Crisman, Lantz published an article on June 22, 1947, which described an incident near Maury Island, where Harold Dahl claimed to have seen six UFOs and recovered fragments dropped by one of them.\nOn July 31, Lantz called Kenneth Arnold at the Winthrop Hotel to warn him that an anonymous source was aware of a meeting taking place between Arnold, Crisman, Emil J. Smith, and Military Intelligence officers Captain Davidson and Lieutenant Brown.\nLater that night, a B-25 carrying Davidson and Brown crashed. Lantz was informed by the anonymous source that the aircraft had been either sabotaged or shot. Lantz relayed this information to Crisman. As Lantz penned an article about the crash, Crisman informed Arnold and Smith, who summoned Lantz to the hotel.\nHe informed them of his impending article and told them that the anonymous caller would only stay on the line for thirty seconds or less and that the military had sealed off the crash site. Lantz's article was published in the August 1 evening edition of the Tacoma Times.\nOn August 8, Lantz published a story of a chemistry professor's analysis of fragments found during the Maury Island Incident.\nThe next fall, on a Sunday afternoon, Lantz and his wife were visited by two men dressed in black suits, identifying themselves as FBI agents. The men argued with Lantz, demanding that he cease from publishing stories connected to the Maury Island incident, but he ultimately refused.\nLantz died suddenly on January 10, 1948. Some accounts stated that he died from a \"short unspecified illness\" while his death certificate cited meningitis.\nBehind the scenes\nPaul Lantz (April 24, 1918 – January 10, 1948) was a reporter for the Tacoma Times who wrote several articles concerning the 1947 Maury Island incident.\nDavid Patrick Kelly narrated Lantz's articles in the audiobook version of The Secret History of Twin Peaks."}