{"name": "Pete_Martell", "url": "https://twinpeaks.fandom.com/wiki/Pete_Martell", "text": "Pete Martell\nPeter \"Pete\" Martell was the manager of the Packard Sawmill. He found the body of murdered homecoming queen Laura Palmer.\nBiography\nIn a Romeo and Juliet-type story of rival families, Pete married Catherine Packard in 1958. Their romance was very short-lived and they never had children, although there were rumors that a pregnancy was what caused the wedding.\nIn 1968, he was noted as the Twin Peaks High School football team's \"number one booster.\"\nOn a day in February 1989, Josie—widow of Catherine's brother Andrew—and Pete explained to Dell Mibbler why two-by-fours were not exactly two inches by four inches, justifying it by pointing out that the dollar was not worth what it used to be.\nMurder of Laura Palmer and mill troubles\nPete headed out to fish on the morning of February 24. As he heard a foghorn, he looked around and saw an object in the distance, what seemed to be plastic. He approached it and saw that it was a dead female, indeed wrapped in plastic.\n \nHe ran inside to call Sheriff Harry S. Truman to tell him about his discovery. When Sheriff Truman arrived with Doctor Will Hayward and Deputy Andy Brennan, he watched as the body was identified as the town's homecoming queen, Laura Palmer.\nLater, at the mill, Pete counted two-by-fours and four-by-eights as his wife was fighting with Josie, who wanted to shut the mill down for the day due to Laura's death and the disappearance of mill worker Janek Pulaski's daughter, Ronette. Josie ordered him to shut it down, but Catherine said not to. He listened to Josie and ordered \"Shorty\" to pull the plug.\nHe later attended the conference where Special Agent Dale Cooper announced the FBI's takeover of Laura's murder investigation.\nThe next day, Pete gutted a fish as Josie greeted him and thanked him for standing up for her during the argument with Catherine the previous day. He told her to forget it and said Catherine was wrong. Sheriff Truman arrived with Agent Cooper to see Josie and Pete poured the lawmen some coffee.\nHe soon burst in, telling the lawmen not to drink the coffee, for there was a fish in the percolator, which he then washed out.\nPete sat on Catherine's bed the following day, polishing his boots. She asked him why Agent Cooper had been there and he slipped to Josie the key to a safe containing the mill's ledger. He angered Catherine and went to his room.\nPete attended Laura's funeral the next day.\nLater in the evening, he saw Catherine hide something in a drawer's hidden compartment and asked her if he had seen his tackle box, but she told him that she knew that he and Josie got into the safe. He then went to check the truck for the tackle box.\nHe looked through the mail the next day, telling Josie about his shift. She served him a turkey sandwich and he offered her to join him for a fishing competition. After she accepted, he went to bed.\nPete went with Catherine to a party held for Icelandic businessmen the next day at the Great Northern Hotel. There, he drank a mug of milk and spoke to Einar Thorson about Iceland being above the timberline.\nThe following day, he saw Sheriff Truman observing a fish he just got back from Tim and Tom's Taxidermy, though he noted it was much bigger when he caught it.\nHe entered the main office at the mill the following day as Catherine desperately searched through the file drawers for the account ledger, which she thought he had stolen for Josie. The two reflected on their marriage, and Catherine declared her need for Pete to embrace the feelings he still had for her so he could help her. With happy tears, he embraced her.\nHe helped Catherine search their library for the ledger and he found his old high school yearbook. He reminisced about Midge Jones until Catherine asked him what he was doing. She then received a phone call and had him leave the room.\nMill fire and aftermath\nThat night, the sawmill was set ablaze and Pete noted that Catherine's car is parked outside of it. He put on a pair of safety goggles and went inside with a fire extinguisher, searching for his wife.\nThe next day, having been hospitalized for smoke inhalation after his search for Catherine turned up nothing, Pete sat in his hospital bed, examining the food. However, he could not smell it with his oxygen mask, so he took it off, but then frantically put it back on after sniffing the food.\nHe was taken home by Sheriff Truman and he commented that smoke inhalation felt like \"somebody taped lips to the tailpipe of a bus.\" They discussed Josie, who was nowhere to be found. Pete read a letter from her, where she note that she had to leave on emergency business in Seattle. Harry informed him that Catherine had not been found. Pete reflected on the \"plain hell\" Catherine was to live with and the \"little bit of heaven\" that once existed between them.\nJosie returned home a few days later, carrying many shopping bags and boxes and Pete informed her of Catherine's death.\nHe was later introduced to Josie's cousin, Jonathan, and went to get him coffee.\nAt the Great Northern's Timber Room two days later, he heard Leland Palmer perform \"Getting to Know You,\" which Pete identified as being from The King and I. He asked a strange Asian man if he liked musicals and admitted that Fiddler on the Roof made him \"weep like a little baby.\"\nHe made himself a sandwich and milk the next night, but found that the strange man from the night before had entered his home and gave him a big kiss. He was first angered by this, but the man then revealed his identity to be Catherine. Overjoyed, Pete hugged her.\nPete went to the sheriff's station the next day, where Harry observed a woodpecker from his office. He told him that Josie was gone again and left a note. However, the two were confused when Harry mentioned Josie's assistant, named Mr. Lee, whom Pete was told as being her cousin, Jonathan. Cooper then came on official business and left with the sheriff.\nHe went to the holding cells, where Benjamin Horne was being held for the murder of Laura Palmer. Pete presented to him a tape containing a message from Catherine, telling him that she would testify his alibi if he signed over the mill and Ghostwood Estates to her. Pete laughed and kissed the cassette player, fully in love with Catherine again.\nDays later, Pete attended the reception following the funeral for Leland Palmer, who had died in custody after being arrested for his daughter's murder. After a fight broke out between Dwayne and Dougie Milford, Pete and Doctor Hayward explained to Agent Cooper the ongoing feud between the two brothers.\nPete attended the wedding of Dougie Milford and Lana Budding the following day. He was very uncomfortable sitting with the bitter Major Milford at the reception and commented on the music.\nThe next day, Pete poured wine for himself and Catherine and toasted with \"A Drinking Song\" by Yeats. Catherine called Josie - now a maid for the Martells - to tell her that they were ready for their appetizers. However, Pete insisted that this was unfair to Josie.\nLater life\nDays later, he complains that he forgot to have Josie buy hot dogs. Catherine entered, asking if he wondered how she survived the mill fire. When he became intrigued, she led him to the next room, where Andrew Packard himself stood, alive and well, which flabbergasted Pete. It was explained to him that a man named Thomas Eckhardt had tried to kill Andrew, and they foresaw it, so they took measures to fake his death.\nPete brought in Josie's dry cleaning the following day as Cooper got coffee. When the phone rang for Josie, he handed over the clothes to the special agent.\nHe was later employed by the sheriff's department to assist in a case involving chess and headed by Agent Cooper, who wished to have a stalemate while losing the least amount of pieces possible.\nLucy called Pete to the station the next day, per Sheriff Truman's request. He then brought breakfast to Andrew, arranged to look like a dog's face. The men were amused by this, but Catherine was not, and she asked Pete to bring her salt and pepper. He then left for the sheriff's station.\nHe observed the chessboard at the sheriff's station, trying to figure out the next possible move.\nIn the evening, he sat with Catherine in their living room, and there was banging on their door. He got up to answer and let Sheriff Truman in, who was looking for Josie. Pete and Catherine told him that she went to the Great Northern to see Thomas Eckhardt.\nThe next day, Pete sleeplessly examined all of the possible stalemates, telling Cooper that one could not lose less than six pieces. The agent told Pete to make sure the royalty were protected.\nDays later, Pete mourned Josie, who died during her visit to the Great Northern. Catherine came in and asked him to open a black box, which he deemed to be a puzzle box that could take years to open.\nHe meets with Will Hayward and Dwayne Milford, as they were the Judging and Rules Committee of the then-upcoming Miss Twin Peaks Contest. Ben Horne addressed to the committee, suggesting that the theme of the speeches be the contestants' ideas on how to save the forests. After Horne leaves, Lana Milford is called up as the first candidate for the contest.\nFollowing the tryouts for Miss Twin Peaks, Pete came home, finding Sheriff Truman and Catherine trying to open the box. He tried to take it and ended up dropping it, which caused part of the box to slide out - another box, which had the phases of the moon on it.\nPete went to the Great Northern the following day, where he greeted Audrey Horne, then commented in front of the fireplace, \"Josie, I see your face.\" He then gave Audrey a ride to the airport.\nAt the airport, Pete watched as Audrey greeted her love, John Justice Wheeler. The two young lovers boarded Wheeler's jet. As Pete wiped away a tear, he experienced a strange sensation in his right arm and his right hand mysteriously began to shake. \nWhile waiting for Audrey, Pete eventually fell asleep in his truck and was awoken by Wheeler's jet taking off. Audrey then approached him, mentioning that Jack had promised to take her fishing, so Pete said that he had some tackle in his truck.\nThe following day, Pete and Andrew tried to open the last, metallic box that was contained inside the puzzle box. Frustrated, Andrew decided to shoot it with a revolver, revealing a key, which Catherine placed in a cake saver.\nHe went to the sheriff's station after the Miss Twin Peaks contest to report that the Log Lady had stolen his truck. However, Agent Cooper said she did not and that she would arrive momentarily. She soon did and Pete asked her where his truck was. Cooper told him again that she did not steal it, but that it was Windom Earle who did.\nPete came home to find Andrew near the cake saver and later accompanied him to the Twin Peaks Savings and Loan with the key, where clerk Dell Mibbler was shocked to see Andrew alive. Mibbler led them to a safety deposit box, past Audrey, who had chained herself to the vault door out of civil disobedience. Upon opening the safety deposit box, a bomb from Thomas Eckhardt was triggered. Pete died in the explosion and his body was found on top of the injured Audrey, apparently having either attempted to shield her or his body landed on her.\nAnother 1989\nOn February 24, 1989, Pete told Catherine he was going fishing and headed down to the shore of Black Lake.\nRelationships\n\nCatherine Martell\nPete and Catherine came from rivaling families. What started as a \"summer's indiscretion\", developed into a marriage on the rocks, that from Pete's perspective never should have happened. Catherine, being a ruthless, stubborn, and determined woman, never made anything easy for Pete (whom she felt was a useless, soft old fool). Regardless of Catherine's verbal abuse and lack of love, Pete did seem to harbor some genuine, nostalgic affections for his wife until the very end.\nJosie Packard\nPete loved Josie, and appeared to have a sort of fatherly role in their relationship, often helping her with her English and entertaining her.\nBehind the scenes\nPete was played by Jack Nance, who previously played the main character, Henry Spencer, in David Lynch's feature film debut, Eraserhead, alongside Charlotte Stewart (Betty Briggs in Twin Peaks) and subsequently appeared in Lynch's Dune, Blue Velvet, Wild At Heart, and Lost Highway."}