{"name": "Phillip_Jeffries", "url": "https://twinpeaks.fandom.com/wiki/Phillip_Jeffries", "text": "Phillip Jeffries\nFor the imposter, see Phillip Jeffries (impostor).\n\"Cooper, meet the long-lost Phillip Jeffries! You may have heard of him from the academy!\"\n ―Gordon Cole\nPhillip Jeffries was an agent of the Federal Bureau of Investigation who disappeared while on assignment in Buenos Aires, Argentina in 1987.\nBiography\n\nEarly life and career\nPhillip Jeffries was born in Virginia to an old aristocratic family.\nJeffries went through FBI training with Gordon Cole at Quantico, where the two graduated as the top agents in 1968. By all accounts, Jeffries was a phenomenally gifted law enforcement officer; Cole once wrote, admiringly, that \"This world wasn't enough for him.\"\nFollowing the official closure of Project Blue Book, Jeffries was assigned to head the Blue Rose task force, per Cole's suggestion. The task force got its name following a 1975 case in Olympia, Washington, which Cole and Jeffries investigated. The suspect, Lois Duffy, appeared to have killed another, identical Lois Duffy, who said \"I'm like the blue rose,\" before dying and disappearing.\nIn early 1983, Jeffries accompanied Cole to Twin Peaks, supposedly in order to investigate the construction of the Listening Post Alpha facility by the U.S. Air Force on Blue Pine Mountain that Mayor Dwayne Milford and a number of locals were concerned about. Milford's concerns were allayed after a \"thorough\" investigation determined the facility was part of the new \"Star Wars\" defense program.\nDisappearance\nIn 1986, the Blue Rose Task Force leader Phillip Jeffries took an extended posting in Buenos Aires to investigate an apparent international criminal enterprise. In his first month, he identified \"Judy\" as a central person of interest in this investigation, and notified Gordon Cole. Subsequently, Jeffries was not heard from for nearly two years.\n \nOn February 16, 1989, Jeffries visited the Palm Deluxe hotel in Buenos Aires, Argentina, where he asked the desk clerk if \"Ms. Judy\" was staying there. The clerk gave him a letter, which he said \"the young lady\" had left for him. Jeffries proceeded to the lobby elevator.\n \nThe same morning, at 10:10 a.m., Jeffries suddenly appeared out of an elevator in the Philadelphia office of the FBI after being missing for two years, wearing the same clothes he had worn at the hotel. He hurried to the office of his former superior, Regional Bureau Chief Gordon Cole and started raving in a loud and disturbed manner, rambling about Judy while also insisting that she not be discussed, and referring at one stage to Special Agent Dale Cooper and yelling “Who do you think this is, there?\" Jeffries went on to narrate in an abstract fashion where he had been since his disappearance, discussing a discovery \"in Seattle at Judy's,\" a meeting he witnessed above a convenience store, and an important ring.\nCole had Albert try to figure out how Jeffries got into the building, while Cooper, noticing the lights flickering, ran back out into the hallway. As Jeffries continued his rant, Cole tried to call for back-up. Jeffries looked at a nearby calendar and was shocked to realize it was February 1989. When Cole looked up from his intercom, Jeffries had vanished.\n \nAs BOB laughed, Jeffries reappeared in Buenos Aires in a hotel stairwell, screaming and unable to speak. His sudden return scorched a nearby wall and startled a hotel maid and bellhop. Very soon after this, Jeffries disappeared, this time seemingly permanently. Both Gordon and Albert would claim to have forgotten this event in the following years.\nA search of Jeffries' room at the Palm Deluxe revealed that he had apparently carved the word \"JOUDY\" into the wall behind the telephone. The word was covered up by a new layer of wallpaper when the room was remodeled in 1997.\nLater years\nIn the following years, Jeffries had an unspecified arrangement with Dale Cooper's doppelganger, who himself later claimed to have been working undercover with Jeffries for over twenty years. At one point, Jeffries requested information from Albert Rosenfield concerning a man in Colombia, claiming that it was pertinent to the safety of Cooper. A week later, the agent in Colombia was killed.\nJeffries somehow lost his human form, and by September 2016 he appeared to have become a white glowing orb emitted from the end of a large kettle-shaped device. His chamber was located behind room #8 at a motel only accessible from the upper floor of a certain convenience store.\nIn addition, another individual began assuming Jeffries' identity, hiring Ray Monroe and Darya to kill the doppelganger. While in South Dakota, \"Cooper\" attempted to contact Jeffries via radio, only to find this stranger on the other end. The person who answered mentioned that he knew the doppelganger had met with Major Garland Briggs, and was calling to tell him goodbye. \"Jeffries\" told him that the doppelganger would be \"going back in\" the next day and that he would be with BOB again, then disconnected.\nSee also: Phillip Jeffries (impostor)\nAfter shooting Cooper, Ray contacted \"Phillip\" on his phone and said that he believed Cooper was dead, or else Ray would finish the job when Cooper found him at \"the farm.\" At gunpoint, Monroe later confessed to Cooper that somebody named Phillip Jeffries had orchestrated the prison break and ordered him to place a ring on Cooper's body after he died. Jeffries was in hiding somewhere called \"the Dutchman's.\"\nIn one of his Monica Bellucci dreams, Gordon Cole relived the strange incident in 1989 where Jeffries had appeared in Philadelphia and cast doubt on Dale Cooper's identity, which Cole had since forgotten. Albert also admitted that he was starting to remember the day Cole referred to.\nCooper's doppelganger drove to the convenience store and received an audience with the real Jeffries at the Dutchman's, determining that he had no involvement with Ray. Cooper then asked him about Judy, whom Jeffries had previously mentioned at the FBI, and whether Judy wanted something from Cooper. Jeffries responded that he could ask Judy himself, and a series of numbers floated out of his orb, which Cooper wrote down.\nAfter the doppelganger was killed, the real Dale Cooper accompanied Mike to see Jeffries in person. Cooper said he was interested in a particular date: February 23, 1989, and Jeffries agreed to find it for him. Commenting that it was \"slippery in here\" Jeffries eventually manifested the symbol found in Owl Cave, which turned into an \"8\" symbol with a bead modulating around its lower half. Jeffries said that this was where he could find Judy. He also added: \"There may be... someone. Did you ask me this?\" Jeffries said to give Gordon Cole his regards, and that Cole would remember \"the unofficial version.\" In a loud crackle of electricity, Cooper appeared in the woods near Twin Peaks in 1989.\nBehind the scenes\nThe original editing of Fire Walk With Me put Jeffries reappearance in 1988 since it is before the \"one year later\" hard title. But the shooting script, The Missing Pieces, The Secret History of Twin Peaks, and Part 15 of The Return put it in 1989.\nJeffries was played by English musician and actor David Bowie and, for Twin Peaks (2017), voiced by Nathan Frizzell. Bowie was approached to reprise his role as Jeffries in the 2017 limited series, but declined due to his cancer diagnosis, which was not public knowledge until his death on January 10, 2016. Bowie gave Lynch permission to reuse footage of the character from the film on the condition that he be re-dubbed by a Louisianan actor.\nShowtime's closed-captioning for Twin Peaks: Fire Walk with Me erroneously states that the monkey that says Judy's name was speaking with Jeffries' voice.\nOn Jeffries' appearance in the revived series, Lynch lamented the fact that many viewers thought that Jeffries was in the form of a tea kettle, regretting that he had not made the \"spout\" straight instead. Nonetheless, he does not oppose viewers interpreting it as such."}