{"name": "Pierre", "url": "https://twinpeaks.fandom.com/wiki/Pierre", "text": "Pierre\n\"My grandson is studying magic!\"\n ―Mrs. Tremond\nPierre was a young boy who lived at the Fat Trout Trailer Park in Deer Meadow, and later in Twin Peaks, Washington.\nBiography\nPierre sat slumped on a couch in a dirty room above a convenience store, where a number of spirits were having a meeting, including an old woman, BOB, the arm, two woodsmen, the electrician, and a jumping man. He pointed at the table where BOB and the arm were sitting and said, \"Fell a victim.\" While they spoke, he played with a white plaster mask with a spiked nose. At one point, his face appeared to turn into that of a monkey.\nAt the Red Diamond City Motel, when Leland Palmer chickened out from Teresa Banks' date after seeing that his daughter Laura and Ronette Pulaski were to join them, the boy jumped around the parking lot, wearing the same mask.\nIn 1988, at the time of Teresa Banks' murder, the boy and the old woman were living at the Fat Trout Trailer Park using the name \"Chalfont,\" which was also the name of the two people living there before. Chet Desmond found Banks' missing ring on a mound of dirt below their trailer. By the time Dale Cooper arrived to investigate Desmond's disappearance, the trailer had disappeared.\nBy November 1988, the boy and old woman (now \"Mrs. Tremond\") were living in an apartment in Twin Peaks' Low Town neighborhood, next door to Harold Smith. During a Meals on Wheels delivery, Harold's friend Laura Palmer forced him to have sex with her. Laura took away his choice because he was too scared to leave his home. As she left, Pierre walked up to her and performed a magic trick, pulling a coin out of her ear.\nThe Twin Peaks Collectible CardArt set gives his full name as \"Pierre Tremond,\" born January 10, 1983, and suggests that he attended elementary school in Twin Peaks.\n \nThe week before Laura died, Pierre, wearing the white mask, and the old woman appeared outside the Double R Diner to give Laura a framed picture of a doorway. Pierre whispered a warning that BOB was searching her room for the secret diary she kept:\n\"The man behind the mask is looking for the book with the pages torn out. He is going toward the hiding place. He is under the fan now.\"\nIn a dream that night, Laura seemed to step into the picture, which led to a room above the convenience store. Laura walked through two doorways and found Pierre, who snapped his fingers and caused a red curtain to appear.\nAfter Laura's death, Donna Hayward took up her Meals on Wheels route and brought dinner to Mrs. Tremond. Donna was startled to see Pierre, whom she called her grandson, seated in an armchair behind them. He told Donna \"Miss? Sometimes things can happen just like this,\" and snapped his fingers. Mrs. Tremond was disturbed to see creamed corn on her plate, and it then disappeared, materializing in Pierre's outstretched hands. The woman explained that he had been studying magic, and suggested that Donna speak to Harold Smith, who had been Laura's friend. Pierre said \"J'ai une âme solitaire.\" When Donna left, the boy commented, \"She seemed like a very nice girl.\"\nDays later, Harold wrote \"J'ai une âme solitaire,\" French for \"I am a lonely soul,\" as his suicide note. Remembering the bizarre visit, Donna led Special Agent Dale Cooper to the Tremonds' apartment, but found another woman named Mrs. Tremond living there, who said she had no family members who could have been the old woman or boy. She did, however, give them a page from Laura's diary that had been left in her mail, addressed to Donna, the day after Harold's body was found.\nBehind the scenes\nPierre's first name is revealed in The Secret Diary of Laura Palmer. In the series, Mrs. Tremond's grandson was listed in the credits as \"Little Boy\" and was played by Austin Jack Lynch, the son of Twin Peaks co-creator, David Lynch. In the film, he was played by Jonathan J. Leppell.\nThe song \"The Black Dog Runs At Night\" accompanies the grandson when he meets with Leland in Red Diamond City and when he and his grandmother appeared to Laura. A black dog is seen barking when Mike is yelling at Leland and Laura.\nGallery\nGrandson with eyeless maskThe grandson in the painting's third roomIn the painting's third room"}