{"name": "Pilot", "url": "https://twinpeaks.fandom.com/wiki/Pilot", "text": "Pilot\nNot to be confused with Episode 1 or Part 1.\n\"Pilot\" (also known as \"Northwest Passage\") is the premiere episode of Twin Peaks, which aired on ABC on April 8, 1990. It was written by series creators Mark Frost and David Lynch, and directed by Lynch.\nThe International Pilot is a self-contained version of the episode that contains twenty minutes of extra footage that solves the murder. This version was filmed in case the show was not picked up as a series, and instead released as a television movie.\nA 4K transfer of both versions was released as part of Twin Peaks: From Z to A.\nPlot\n\"Welcome to Twin Peaks. My name is Margaret Lanterman. I live in Twin Peaks. I am known as the Log Lady. There is a story behind that. There are many stories in Twin Peaks. Some of them are sad, some funny. Some of them are stories of madness, of violence. Some are ordinary. Yet they all have about them a sense of mystery - the mystery of life.Sometimes, the mystery of death. The mystery of the woods. The woods surrounding Twin Peaks.To introduce this story, let me just say it encompasses the all-- it is beyond the \"fire\", though few would know that meaning. It is a story of many, but begins with one - and I knew her.The one leading to the many is Laura Palmer. Laura is the one.\"\n ―Margaret Lanterman\nOn the morning of February 24, 1989 in the Washington town of Twin Peaks, Pete Martell leaves his home—the Blue Pine Lodge, where he lives with his wife Catherine Martell and her sister-in-law, Josie Packard—to go fishing. However, he notices an object by the shore, and when he approaches it, he discovers that it is a dead body wrapped in plastic.\n \nHe calls the Twin Peaks Sheriff's Department, where he is transferred by receptionist Lucy Moran to Sheriff Harry S. Truman. He informs Truman of his discovery and the sheriff makes his way to Martell's home, telling Lucy to have Doctor Will Hayward and Deputy Andy Brennan—Lucy's on-and-off boyfriend—meet him there.\nAfter the deputy breaks down crying whilst taking pictures of the scene, Truman and Hayward turn over the body, discovering that it is Laura Palmer, a popular high school student.\n \nLaura's mother, Sarah calls for her to come down. After receiving no answer, she searches the house for her daughter but does not find her. She calls the home of Laura's boyfriend, Bobby Briggs. She asks Bobby's mother Betty if their children were together, but she does not know. Betty gives Sarah the phone number to the school's field office to possibly reach Bobby, as he was supposed to be at football practice. Sarah calls the field office, reaching the football coach, Max Hartman, who tells her that Bobby had not yet shown up for practice and had been late for several weeks straight.\nAudrey Horne leaves for school from her home at the Great Northern Hotel, and her father, Benjamin Horne discusses the Ghostwood Development Project with Leland Palmer, Laura's father. They plan to take over the Packard Sawmill land and to have a group of Norwegian businessmen led by Sven Jorgenson and accompanied by a translator to invest in the project. Palmer is then taken aside by hotel concierge Julie for a phone call from his wife, clearly worried about Laura and he tries to calm her. However, he sees Sheriff Truman enter the hotel to see him. He makes the connection and realizes that his daughter is dead. Sarah wails as she hears this through the phone and the parents both have a breakdown.\n \nHeidi shows up late to work at the Double R Diner as Shelly Johnson and Bobby leave together, their secret relationship being suspected by the diner's owner, Norma Jennings. Bobby plays music on the jukebox before leaving. Bobby takes Shelly home, but decides to drop her off from a distance, as he notices that her husband Leo's truck is parked in the driveway, despite Shelly telling him Leo was out of town. Bobby frantically leaves after letting Shelly out.\nTruman takes Leland to Calhoun Memorial Hospital to confirm the identity of the body, which he does and breaks down into tears.\nAt school, Laura's best friend, Donna Hayward goes to her locker, and looks at the nearby Audrey, amused by her smoking. James Hurley then approaches Donna, asking if she had seen Laura yet and commenting that it was a \"nice day for a picnic.\" Bobby then arrives and is informed that he is wanted in the office, and his best friend Mike Nelson confirms that something had happened.\n \nLaura's homeroom teacher Margaret Honeycutt takes roll and state trooper G. McMickle briefly speaks to her that an announcement of Laura's death would be made. Donna and James then realize what has happened, the former beginning to cry.\nBobby tells deputies Andy and Hawk of his activities the previous night and earlier in the morning, and Truman sits down with them, informing Bobby of Laura's death. Bobby is stunned by the news, insisting that he loved her, and is taken in for questioning. Principal George Wolchezk then announces Laura's death to the school and cancels classes for the day.\nThe sheriff's department asks Mrs. Palmer about Laura's activities the previous night, Sarah confirming that she last saw her daughter around 9:00 and that she later had a phone call. Hawk searches Laura's room, finding a diary and a camcorder. Andy then informs Sheriff Truman of a call that came in from mill worker Janek Pulaski, reporting his daughter Ronette missing.\n \nAt the mill, Josie and Catherine fight, as Josie wishes to shut the mill down for the day due to the murder and disappearance. Pete takes Josie's side, shutting down the mill.\nA dazed Ronette is then discovered on a bridge, dirty and bruised, with tattered clothes and rope around her wrists.\nJames goes to his uncle Ed Hurley's gas station and gives him a note to give Donna, requesting her to meet him at the Roadhouse later in the evening. Ed's wife, Nadine then tells him to pick up a set of drapes she ordered.\n \nFederal Bureau of Investigation Special Agent Dale Cooper arrives in the town at 11:30 AM and makes his way to the hospital to meet Sheriff Truman, informing him that the FBI would be taking over Ronette's case and requests his cooperation. They go to see Ronette who is attended by Doctor Louise Shelvy, and is unresponsive, but utters the words, \"don't go there.\"\nThe special agent and sheriff enter an elevator with a one-armed man, then encounter eccentric psychiatrist Doctor Lawrence Jacoby. Jacoby tells them that Laura was his patient and he wished to assist them in examining the body, but this was denied. In addition, he said that Laura's parents did not know that she was his patient.\nIn the morgue, after the attendant Jim left, Agent Cooper examines Laura's body, finding a small piece of paper with the letter 'R' underneath her left ring fingernail.\nDonna goes to the gas station, where Ed gives her the note left by James. However, Mike—her boyfriend—arrives and angrily tells her to go to the sheriff's station to support Bobby. Nadine then commands Ed to hang up her drapes.\nBack at the station, Cooper examines what was found in Laura's room. Inside the diary, he finds a safety deposit key in a small plastic envelope also containing a white powder, which he suspects to be cocaine. However, Sheriff Truman has his doubts, due to Laura's character. Also in the diary was a statement that she was nervous about meeting \"J.\"\nAndy and a group of other lawmen discover the murder scene, an old train car. Andy requests that Lucy not tell Harry that he cried.\nCooper then questions Bobby, asking of his activities with her the previous night, and a fight they had the previous week. They then watch a tape found in Laura's camcorder of Laura and Donna at a picnic. Cooper states that Laura had been seeing someone else, though Bobby insists that he does not know the identity of \"J.\"\n \nAudrey mischievously goes to the Norwegian businessmen and tells them of the murder.\nBobby is let go and he goes to Mike as Donna is being questioned. They then plan to find the biker whose name starts with the letter 'J.'\nDonna is questioned by Cooper, but she insists that a female hiker took the video found on the camcorder. The agent lets her go and Lucy comes with Harry to tell Cooper that she overheard Bobby and Mike discuss the biker. However, Dale shows them that he already figured this out, having found a bike reflected in Laura's eye in the video.\nJames sits next to his bike at the picnic spot. The Norwegians then leave Twin Peaks after being told of Laura's murder.\nCooper and Truman go to the train car where they find a bloodied hammer, rag, half of a heart-shaped necklace, and a note written in blood that reads, \"FIRE WALK WITH ME.\" James continues to sit and he observes the other half of the necklace.\nAudrey sits with her mother as her older brother Johnny hits his head against a dollhouse, wanting Laura to be there, as she was his tutor.\nCooper and Truman go to the bank with Laura's safety deposit box, following the employee Alice Brady. Inside, they find a copy of Flesh World and over $10,000. In the magazine, they find a photo of Ronette Pulaski, confirming a connection with Laura. Also inside is a photo of Leo Johnson's truck.\nLeo observes the ashtray at his home and questions Shelly why there is more than one brand of cigarettes inside. He tells her to start smoking only one brand, threatening that he will break her neck if she does not comply.\nNorma calls Ed, wishing to meet him at the Roadhouse, while Nadine opens and closes her drapes.\nCooper leads a town meeting, informing them of the FBI's investigation of Laura's murder, as it is believed to be linked to the murder of Teresa Banks the previous year, and the killer may be a citizen of Twin Peaks. A curfew is put into effect for citizens under 18 years of age.\nDoctor Hayward tells his wife, Eileen about the murder, including unreleased information about the necklace, and that the lawmen were searching for the other half, possibly in the killer's possession. Donna overhears this and sneaks out, requesting her sister, Harriet cover for her. Bobby and Mike then come looking for Donna. Doctor Hayward goes up to get her, discovering that she is gone. He requests they help search for her. They head up to the roadhouse. Lucy then patches a call from Hayward to Sheriff Truman and Agent Cooper, informing them of Donna's absence while they stakeout the roadhouse. Truman puts out an all-points-bulletin for her.\n \nAt the roadhouse, a singer sings \"Falling\" as Ed and Norma discuss their plans to leave their respective spouses so they can be together. Bobby and Mike then arrive as the singer performs \"The Nightingale.\" Joey Paulson and Scotty observe their arrival as Donna shows up as well. Cooper then has Truman call in backup and report that Donna had been found. When Donna goes inside, Mike aggressively goes to her, sparking a barfight. Bobby knocks out Ed, and other patrons get involved as Joey escorts Donna away from the fight. They ride off with Cooper and Truman in pursuit.\nThe lawmen eventually lose the trail until they hear motorcycle engines. Joey takes Donna to James, and James tells her about Laura the previous night, that she was as if she were a completely different person. As James breaks down crying, Donna tries to calm him and they end up kissing. They hear sirens, then decide to bury James' half of the necklace.\nJames starts to take Donna home until they are stopped by Agent Cooper and Sheriff Truman. James is taken into custody for questioning while Donna is released to her father, but her presence is requested for more questioning the next morning.\n \nCooper and Truman sit down for donuts and the sheriff recommends that the FBI man stay at the Great Northern Hotel.\nTruman goes to the Blue Pine Lodge to see Josie, his lover. Catherine informs Benjamin Horne of the sheriff's arrival and they plan to meet. Harry and Josie look out on where Laura's body was found, supposing that the murder must have happened 24 hours prior.\nAs Sarah Palmer rests, she is suddenly frightened by a vision of a gloved hand digging up James' half of the necklace.\nAlternate ending\nNote: This ending is only seen in the International Pilot, which contains all previous scenes, except with an alteration on the final one.\nSarah Palmer screams as she remembers seeing a gray-haired man crouched at the foot of Laura's bed. Deputy Hawk sketches the picture of the man. The One-Armed Man phones Cooper to tell him that Laura's killer is in the hospital.\nThe One-Armed Man meets Cooper, Harry, and Andy in the morgue where Laura's corpse was. He tells them that the light doesn't work because of the transformer is bad and then recites the Fire Walk With Me chant. He explains that he and the killer were living among the people, above a convenience store. He then tells that his name is Mike and that the killer is Bob. He then answers to Coop that he was in the hospital because he was searching for Bob who sometimes likes to walk among the injured of the species and that he has been searching for him for over a year. He says that he too was touched by the devilish one with a tattoo on his left shoulder but that after seeing the face of god he cut his entire arm off. Two sketches are then shown to him and he recognizes the second one sketched by Hawk as being Bob. He then tells the group that he is in the basement.\n \nCooper and Harry confront Killer Bob in the basement while he is doing a ritual with 12 candles in a circle. Bob is disappointed by not seeing Mike, wanting to sing with him again but nonetheless speak to his absent partner, asking if he hears him and recounting a pursuit with someone that he caught with \"his death bag\". Mike sneaks in the shadow of the door frame, unnoticed by anyone. Bob explains that the letters were going to spell his proper name \"Robert\", he gleefully admits to murdering Teresa Banks who had the \"T\" (and by extension Laura) and vows to kill again. Mike immediately bursts in after this promise and shoots Bob to death with his own gun, before suffering a heart attack and dying. The twelve candles put out themselves as Cooper says to \"make a wish\".\nTwenty-five years later, Cooper finds himself in a red room. Also there are a little man and Laura Palmer, who whispers something into Cooper's ear.\nDeleted/extended scenes\n\"Cooper and Donna Talk About Picnic\"\nMike and Donna argue in the sheriff's station until Cooper comes to retrieve the latter for her interview.\n\"Picnic\"\nExtended version of Laura and Donna's picnic that was filmed by James.\n\"Cooper and Truman at Gazebo\"\nBefore the town meeting, Cooper and Truman walk at the city square, the former being fascinated by the gazebo, as he has apparently only seen them in pictures. He further becomes fascinated by a Douglas fir bear carving and hedges.\n\"Mayor's Speech\"\nAt the town meeting, Mayor Milford tries to make a speech and wonders if the microphone is on. Sheriff Truman adjusts the microphone and Milford makes an address to the citizens about Laura's death.\n\"Lucy and Raccoons\"\nExtended scene, where after Truman recommends Cooper to the Great Northern, Lucy tells Harry that a prowler was reported by Josie at the Blue Pine Lodge. When he blames raccoons, Lucy begins telling a story she is reminded of.\nEpisode credits\n\nCast\n\nStarring\nKyle MacLachlan as Special Agent Dale Cooper\nMichael Ontkean as Sheriff Harry S. Truman\nMadchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nRichard Beymer as Benjamin Horne\nLara Flynn Boyle as Donna Hayward\nSherilyn Fenn as Audrey Horne\nWarren Frost as Dr. Will Hayward\nPeggy Lipton as Norma Jennings\nJames Marshall as James Hurley\nEverett McGill as Big Ed Hurley\nJack Nance as Pete Martell\nRay Wise as Leland Palmer\nJoan Chen as Jocelyn Packard\nPiper Laurie as Katherine Martell\nAlso Starring\nRuss Tamblyn as Dr. Lawrence Jacoby\nEric Da Re as Leo Johnson\nMary Jo Deschanel as Eileen Hayward\nHarry Goaz as Deputy Andy Brennan\nGary Hershberger as Mike Nelson\nMichael Horse as Deputy Tommy \"Hawk\" Hill\nGrace Zabriskie as Sarah Palmer\nFeaturing\nTroy Evans as George Wolchezk\nJohn Boylan as Mayor Dwayne Milford\nRodney Harvey as Biker Scotty\nSheryl Lee as Laura\nRobert Davenport as Johnny Horne\nJan D'Arcy as Sylvia Horne\nKimmy Robertson as Lucy Morgan\nJessica Wallenfels as Harriet Hayward\nWendy Robie as Nadine Hurley\nDon Davis as Maj. Garland Briggs\nCharlotte Stewart as Betty Briggs\nRoberta Maguire as Maria Pulaski (credit only)\nPhoebe Augustine as Ronnette Pulaski\nFrank Roberts as Father Hutchings (credit only)\nBrett Vadset as Joey\nDavid Wasman as Gilman White\nJane Jones as Margaret Honeycutt\nTawnya Pettiford-Waites as Dr. Shelvy\nShelly Henning as Alice Brady\nDorothy Roberts as Mrs. Jackson\nJulee Cruise as Girl Singer\nArnie Stenseth as Sven Jorgenson\nAndrea Hays as Heidi\nRick Tutor as Janek Pulaski\nMarjorie Nelson as Janice Hogan\nBen DiGregorio as Max Hartman\nDiane Caldwell as Hotel Employee\nCatherine Coulson as The Log Lady\nAl Strobel as One-Armed Man\nUncredited\nJim (Last Name Unknown) as Jim, the Morgue Attendant\nJoseph L. Altruda as Band at Roadhouse \nMichael J. Anderson as Man From Another Place (international version only)\nDan Bixler as Fred Truax\nDavid Boushey as State Trooper #2\nSteve Buckley as Stunt Double \nEd Egerdahl as Interpreter\nMark Frost as Cyril Pons (voice)\nSteven Hodges as Band at Roadhouse \nSmokey Hormel as Band at Roadhouse \nBob Riebe as Bob, Hotel Employee\nFrank Silva as BOB\nJoseph 'Simon' Szeibert as Band at Roadhouse \nWilliam Ungerman as Band at Roadhouse \nLaurel Anne White as Johnny Horne's nurse\nunknown performer as Dancing student\nunknown performer as Terry Franklin\nunknown performer as Martha Grimes\nunknown performer as State Trooper #1\nunknown performer as screaming girl\nunknown performer as switchman\nProduction staff\nProduction Designer: Patricia Norris\nDirector of Photography: Ron Garcia\nEdited by Duwayne R. Dunham\nMusic Composed & Conducted by Angelo Badalamenti\nProduced by David J. Latt\nWritten by Mark Frost & David Lynch\nDirected by David Lynch\nExecutive Producers:\nMark Frost\nDavid Lynch\nAssociate Producer: Monty Montgomery\nCasting by Johanna Ray\nUnit Production Manager: Eugene Mazzola\n1st Assistant Director: Margaux Mackay\n2nd Assistant Director: Carol L. Vitkay\nCamera Operator: Sean Doyle\nFirst Assistant Camera: Thomas Klines\nOrchestrations: Angelo Badalamenti\nSet Decorator: Leslie Morales\nOn Set Dresser: Frank Silva\nConstruction Coordinator: Charles Armstrong\nProperty Master/Special Effects: Greg McMickle\nScenic Artist: Gretchen Armstrong\nScenic Painter, WA (uncredited): Steven LaRose\nCostume Designer: Patricia Norris\nSound Mixer: James Pilcher\nBoom: Robert Marts\nSound Effects Recordist: John Wentworth\nGaffer: James Blair\nKey Grip: Mark Davis\nSeattle Casting: Susan Dixon\nExtra Casting: White Light Casting, Inc.\nScript Supervisor: Sharon West\nLocation Manager: Julie Duvic\nTransportation Coordinator: John \"J.D.\" Yarbrough\nProduction Supervisor: Deborah LeFaive\nProduction Accountant: Nowell B. Grossman\nStunt Coordinator: David Boushey\nBiker Coordinator: Jeff Ferrell\nProduction Coordinator: Denyse Hurley\nLos Angeles Coordinator: Joseph Montrone\nAssistant to David Lynch: Debby Trutnik\nAssistant to Mark Frost: Paula K. Shimatsu-U.\nTechnical Consultant: Richard B. Whitaker\nAssociate Editor: Jay Ignaszewski\nAssistant Editors:\nBrian Berdan\nMichael Altman\nApprentice Editor: Tim Bare\nPost Production Supervisor: Ute Leonhardt\nSound Design: Douglas Murray\nMusic Editor: David Slusser\nRe-Recording Mixers:\nMark Berger\nDavid Parker\n\"The Nightingale\"\nLyric by David Lynch\nMusic by Angelo Badalamenti\n\"Falling\"\nLyric by David Lynch\nMusic by Angelo Badalamenti\n\"The Nightingale\" and \"Falling\"\nPerformed by Julee Cruise\nCourtesy of Warner Bros. Records Inc.\nBy Arrangement with Warner Special Products\nTitles & Opticals by Pacific Title\nTitle Design by Awest\nColor by CFI\nSound Editing & Stereo Mix: Saul Zaentz Film Center\nNotes\nThe population of Twin Peaks is 51,201 due to a request from ABC Network. They felt that a town of 5,120 (the original population) was too small and unrelatable. This was one of the few changes that the network made regarding the original pilot - as revealed by Mark Frost in an appearance with the cast in New York City in September 1990.\nThis episode takes place on Friday, February 24, 1989\nAgent Cooper mentions an agent named \"Sam\" who doesn't seem to be on the ball. Twin Peaks: Fire Walk with Me features Special Agent Sam Stanley, a specialist who investigates the murder of Teresa Banks. However, it is unconfirmed whether the characters are one and the same.\nIn the final scene, where Sarah Palmer has an upsetting vision, one can briefly make out the reflection of Set Decorator Frank Silva in the mirror behind her. When this was called to Lynch's attention on the set, he was overjoyed and shouted \"PERFECT!\" This is how Frank Silva was chosen to play the character of Killer BOB.\nDue to a contractual obligation, Lynch was forced to shoot an alternate ending to the pilot, which wrapped up the story quickly. This version is referred to as the International Pilot. Released on video in Europe (and a few years later, the US). Much of the footage of the red room was re-edited and used to great effect in Episode 2 in a dream sequence along with some of the hospital scenes of Mike and Bob. The scenes with Cooper, Harry, Lucy, Hawk, and Andy were not reused as well as the one of Mike shooting Bob but they are still mentioned by Cooper when recounting his dream in Episode 3. This implies that all new footage of this version is retconned as part of Cooper's dream.\nThe Pilot episode, with the \"European\" ending, was exhibited in some countries in cinemas. It played in a number of film festivals including the Seminci.\nThis two-hour special originally aired as an ABC Sunday Night Movie.\nWhen Twin Peaks was rerun on the Bravo cable network in 1993, David Lynch wrote new introductions for each episode that were performed by Catherine Coulson as The Log Lady.\nThe pilot features an extended opening title sequence, with more shots of the Packard Mill than usual. All the \"Guest Starring,\" writing, producing, editing and directing credits also run during the main title sequence. The title font is also slightly different than what would be used in the series.\nThe pilot episode was nominated for eight Emmy Awards in 1990, including best drama, best writing, best directing, best production design, best actor (MacLachlan), best director, and best supporting actress (Laurie and Fenn). Duwayne Dunham won the Emmy for best editing and Patricia Norris won for best costume design for this episode.\nIn this episode, Julee Cruise sings \"Falling\" and \"The Nightingale\", like all the original songs in Twin Peaks they have the music composed by Angelo Badalamenti and the lyrics written by David Lynch. Both songs appeared on Cruise's 1989 album Floating into the Night, which also featured her song \"Mysteries of Love,\" which was recorded for Lynch's 1986 film Blue Velvet.\nConception and writing\nDavid Lynch and Mark Frost pitched the idea to ABC during the time of Writers Guild of America, East strike in 1988 in a ten-minute meeting with the network's drama head, Chad Hoffman, with nothing more than this image and a concept. According to the director, the mystery of who killed Laura Palmer was initially going to be in the foreground, but would recede gradually as viewers got to know the other townsfolk and the problems they were having. Lynch and Frost wanted to mix a police investigation with a soap opera.\nABC liked the idea, and asked Lynch and Frost to write a screenplay for the pilot episode. Frost wrote more verbal characters, like Benjamin Horne, while Lynch was responsible for Agent Dale Cooper. According to the director, \"He says a lot of the things I say\". Originally, the show was entitled Northwest Passage and set in North Dakota, but the fact that a town called Northwest Passage really exists prompted a revision in the script. They filmed the pilot for $1.8 million with an agreement with ABC that they would shoot an additional \"ending\" to it so that it could be sold directly to video in Europe as a feature if the TV show was not picked up. However, even though ABC's Bob Iger liked the pilot, he had a tough time persuading the rest of the network brass. Iger suggested showing it to a more diverse, younger group, who liked it, and the executive subsequently convinced ABC to buy seven episodes at $1.1 million apiece. Some executives figured that the show would never get on the air, believing it would meet negative reviews from viewers and critics alike. However, Iger planned to schedule it for the spring. The final showdown occurred during a bi-coastal conference call between Iger and a room full of New York executives; Iger won, and Twin Peaks was on the air.\nRatings\nRating: 21.7/33; Number 1 for the night, number 5 for the week.\nThe two-hour pilot was the highest-rated movie for the 1989–1990 season with a 22 rating and was viewed by 33% of the audience. In Los Angeles, Twin Peaks became the seventh most-watched show of the week earning 29% of viewers, while the most-watched show being Married... With Children which gathered 34% of viewers. The following episode, \"Traces to Nowhere\" would start with a significant drop in ratings. Various medias such as The New York Times and local radio stations announced that the show had managed to grow a cult following. According to a local radio station, many viewers were \"offended with some of the sexual overtones or the eating sequence\".\nIn the 1990 Emmy Awards, the pilot episode was nominated for six awards, including \"Outstanding Directing in a Drama Series\" for David Lynch, \"Outstanding Lead Actor in a Drama Series\" for Kyle MacLachlan as Dale Cooper, and \"Outstanding Writing in a Drama Series\" for Mark Frost and Lynch. The pilot won two awards, Patricia Norris won the \"Outstanding Costume Design for a Series\" and Duwayne Dunham won the \"Outstanding Editing for a Series - Single Camera Production\". According to the Internet Movie Database, the pilot received a Peabody Award in 1990.\nCritical reception\nBefore the two-hour pilot premiered on TV, a screening was held at the Museum of Broadcasting in Hollywood. Media analyst and advertising executive Paul Schulman said, \"I don't think it has a chance of succeeding. It is not commercial, it is radically different from what we as viewers are accustomed to seeing, there's no one in the show to root for.\" Initially, the show's Thursday night time slot was not a good one for soap operas as both Dynasty and its short-lived spin-off The Colbys did poorly. Twin Peaks was also up against the hugely successful sitcom, Cheers. Initially, the show received a positive response from TV critics. Tom Shales, in the Washington Post, wrote, \"Twin Peaks disorients you in ways that small-screen productions seldom attempt. It's a pleasurable sensation, the floor dropping out and leaving one dangling.\" In the New York Times, John J. O'Connor wrote, \"Twin Peaks is not a sendup of the form. Mr. Lynch clearly savors the standard ingredients...but then the director adds his own peculiar touches, small passing details that suddenly, and often hilariously, thrust the commonplace out of kilter.\"\nMany critics saw the pilot as \"the movie that will change TV\" history, according to Diana White from the Boston Globe. Ken Tucker from Entertainment Weekly was overall positive towards the episode, giving it a A+. While liking the story, and calling Lynch's directing beautiful, he said it \"not a chance in hell\" the show could become a rating hit. Because of its \"unsettling\" story. David Zurawik from Eugene Register-Guard compared the pilot to the work of Alfred Hitchcock. He further stated that the filming of the episode was as close \"as prime-time television\" could get \"to art\". Jen Chaney from The Washington Post called the pilot \"one of the most finely crafted series kick-offs in broadcast history\".\nHome video release\nDue to rights issues, the American pilot (94 minutes) was not released for the United States home video market until 2007. The European pilot (116 min) was released on VHS and laser disc years earlier. Both versions of the pilot are included in the Twin Peaks: Definitive Gold Box Edition DVD set, released in the US on 30 October 2007. An alternate version of the pilot was aired in Europe as a stand-alone television movie. This version is identical to the United States-aired version up until the last several scenes when the killer of Laura Palmer is revealed. Lynch was so pleased with the footage shot for the European ending that he later incorporated some of it into Cooper's dream sequences that aired in subsequent episodes.\nShooting script differences\nDuring the filming of the scene in which Dale Cooper first examines Laura's body, a malfunctioning fluorescent light above the table flickered constantly. Lynch decided not to replace it since he liked the disconcerting effect that it created and added a few lines to the morgue attendant who did not have scripted lines. \nThe morgue attendant actor misheard a line and, thinking he was being asked his name, told MacLachlan in character as Cooper his real name (Jim) instead of saying his line. Lynch was reportedly pleased with the lifelike, unscripted moment in dialogue, and kept the mistake in the final cut.\nSet decorator Frank Silva was accidentally filmed in a mirror during Sarah Palmer's vision at the end of the pilot. When Lynch saw Silva's face, he liked it so much he kept it in the show, and cast Silva as Killer BOB, the mysterious tormentor of Laura Palmer.\nThe original title for the pilot movie (and for the series as a whole) was Northwest Passage. It was later changed to Twin Peaks. This title was reused by Germany when assigning titles to the episodes.\nThe script places the events taking place on November 14, while the filmed pilot takes place on February 24.\nSheriff Harry S. Truman was instead named Daniel \"Dan\" Steadman.\nThe script has the Pulaski parents named Janek and Maria, but the scene was deleted.\nJosie Packard was named Giovanna Pasqualini Packard and was of Italian descent instead of Chinese. Indeed, the role was originally written for Italian-American actress Isabella Rossellini, who was David Lynch's partner at the time, and previously appeared in his film Blue Velvet as Dorothy Vallens.\nDeputy Hawk was not present. In his place was an African-American deputy named Bernie Hill.\nRonette Pulaski was instead named Sharon Pulaski.\nThe boogie dancing highschooler and the screaming girl are unscripted.\nFlesh World was instead titled Sex Toys: Swingers, Coast-to-Coast.\nMax Hartman was named Max Hartmen.\nJulie is the fusion of two unnamed characters from the script and is named after the location manager Julie Duvic (see her nametag).\nDr. Shelvy's nametag indicates that her first name is Louise.\nThe state trooper's nametag indicate that he is named G. McMickle, and so is named after property master Greg McMickle.\nThe hotel employee Bob did not exist.\nAudrey had no lines of dialogue.\nThe trees surrounding Twin Peaks that Cooper becomes fascinated with are Ponderosa Pines, rather than the Douglas Firs in the filmed pilot.\nProduction errors\nDavid Lynch's reflection appears in the first scene at the Sheriff's Station.\nThere is a change of tide at the lake between Pete discovering Laura and Harry, Doc, and Andy investigating up a little later.\nWhile Truman and Cooper are waiting in their cruising at the Roadhouse, a shot of the Bookhouse is shown instead.\nWhen Sheriff Truman and Agent Cooper see Donna and James drive by on the motorcycle, the Sheriff flips on the truck's emergency lights. The scene then cuts to the truck pulling out onto the road in pursuit of the motorcycle and the lights are no longer on. In the next scene, we see the truck on the road and the lights are now on again.\nCatherine is written \"Katherine\" in the credits.\nQuotes\nPete: She's dead. Wrapped in plastic.\nAgent Cooper: Who's the lady with the log?Sheriff Truman: We call her the Log Lady.Log Lady: Shhhhhhh!\nCooper: Diane, 7:30 am, February twenty-fourth. Entering the town of Twin Peaks. Five miles south of the Canadian border, twelve miles west of the state line. Never seen so many trees in my life. As W.C. Fields would say, I'd rather be here than Philadelphia. It's fifty-four degrees on a slightly overcast day. Weatherman said rain. If you could get paid that kind of money for being wrong sixty percent of the time it'd beat working. Mileage is 79,345, gauge is on reserve, I'm riding on fumes here, I've got to tank up when I get into town. Remind me to tell you how much that is. Lunch was $6.31 at the Lamplighter Inn. That's on Highway Two near Lewis Fork. That was a tuna fish sandwich on whole wheat, a slice of cherry pie and a cup of coffee. Damn good food. Diane, if you ever get up this way, that cherry pie is worth a stop.\nShelly: What kept you, Heidi? Seconds on knockwurst this morning?Heidi: I couldn't get my car started.Shelly: Too busy jump-starting the old man, huh?\nNorma: I thought the only time you cared about, Bobby, was making time.\nBobby: Norma, I'll see you in my dreams.Norma: Not if I see you first."}