{"name": "Rancho_Rosa_Estates", "url": "https://twinpeaks.fandom.com/wiki/Rancho_Rosa_Estates", "text": "Rancho Rosa Estates\nRancho Rosa Estates was a suburban residential development in Las Vegas, Nevada.\nHistory\nBy September 2016, Rancho Rosa had fallen into a state of disrepair, with many of the homes up for sale or foreclosed. A drug-addicted woman was apparently squatting in one of the homes, along with her son.\nDougie Jones gained access to one of the foreclosed houses for a tryst with Jade, a prostitute. After they finished, Jade went to use the shower, while Dougie became violently ill, crawling to a spare bedroom and vomiting. He was then pulled into the red room and disintegrated, turning into a golden orb. In his place, Dale Cooper emerged in a cloud of black smoke from a wall outlet, in a state of severe catatonia. Jade, startled by the commotion, arrived to find Cooper and mistook him for Dougie. She frustratedly got the unresponsive Cooper out the door and into her car, annoyed at having to drive him home.\nGene and Jake, who had been hired to kill Dougie, communicated by radio as they drove off. While Cooper was bent over trying to find a dropped hotel key, Jake sighted the car through his rifle scope and mistakenly assumed that Jade was alone. Gene, believing that Dougie was still at the house, planted a bomb on Dougie's car, while the boy across the street watched curiously.\nThat evening, Gene and Jake reported their failure to Lorraine over the phone, and she screamed that they were going to get her killed. The next morning, the two hitmen drove by the house, where Dougie's car still sat, undisturbed. A gang of car thieves drove by shortly afterward, casing the area.\nSome time later, the boy left his house and walked across the street to look at the device more closely. The thieves pulled up suddenly and shouted epithets, the leader throwing a rock at him. Another broke into the car and started it, triggering the bomb and killing all three. The boy ran back across the street, terrified, just before his mother awoke from her stupor.\nThe police soon arrived in response to the explosion. Jones' license plate was recovered from the roof of the house across the street.\nBehind the scenes\nIn a Q&A, Mark Frost revealed that the name \"Rancho Rosa\" is \"a private easter egg referencing one of favorite films from the 1970's.\""}