{"name": "Ray_Monroe", "url": "https://twinpeaks.fandom.com/wiki/Ray_Monroe", "text": "Ray Monroe\nRay Monroe was an associate of Dale Cooper's doppelganger.\nBiography\nCooper retrieved Ray and Darya from Buella.\nAt dinner with Cooper, Darya, and Jack, he and Cooper discussed the latter's alleged worry about the next day. They further discussed information that Ray was to receive from the secretary to William Hastings.\nRay did not show up for a planned meeting with Cooper, as he had been arrested and incarcerated in federal prison in South Dakota for carrying guns over the state line. He called Darya and they discussed their job to kill Cooper, having received a message from Phillip Jeffries.\nCooper soon managed to blackmail Warden Dwight Murphy, convincing him to release Cooper alongside Ray, as well as provide them transportation.\nAfter Cooper deactivated three tracking devices on the car, they went to a secluded area. Cooper demanded the information and tried to shoot Ray, but Ray had already unloaded his gun. He then shot Cooper and saw shadowy men gathering around him and tearing at him, revealing to him the face of BOB.\nCooper tracked Ray to The Farm, where he arm-wrestled and killed its leader, Renzo, before demanding to be alone with him. Ray was shot in the leg by Cooper and he told him that Phillip Jeffries had hired Ray and Darya to kill Cooper and was to place a ring on Cooper after killing him. Cooper had Ray put on the ring and hand over the coordinates. Ray was asked about Jeffries' whereabouts and Ray said he was at \"The Dutchman's\" before Cooper shot him in the head. The ring disappeared from Ray's body, which then followed suit, appearing in a red room.\nAccording to Gordon Cole, Ray was a paid FBI informant who sent a message informing them that the Cooper they met at prison was searching for coordinates from Major Garland Briggs.\nFBI investigators later discovered a relatively new matchbook in one of Monroe's pockets. The matchbook appeared to have originated from The Dutchman's Lodge, as it contained both the name and address of the location upon the item in question."}