{"name": "Red_room", "url": "https://twinpeaks.fandom.com/wiki/Red_room", "text": "Red room\n\"Where am I, and how can I leave?\"\"You are here... now there is... no place to go... BUT HOME!\"\n ―Dale Cooper and the arm\nThe red room, also known as \"the waiting room,\" was an anomalous extradimensional space connected to Glastonbury Grove in Twin Peaks' Ghostwood National Forest. First discovered as early as the 1800s, the red room was believed by many to be the Black Lodge of local Native American legend. Many spirits appeared to \"live\" in the red room, most notably one calling itself \"the arm.\"\nHistory\n\n1800s\nTo be added\n1980s\nTo be added\n2010s\nTo be added\nProperties\nThe red room was more accurately a set of seemingly infinite rooms and hallways, the only walls being the thick red velvet curtains that marked the division between different sections. The curtains' height and anchor was unclear. In one instance, the curtains lifted to reveal an endless black expanse beyond, the patterned floor stretching out into nothingness.\nThe floor was covered in a distinctive, alternating off-white and dark-brown chevron pattern. It was composed of a hard material, although in one of Dale Cooper's dreams it was instead a patterned carpet. On one occasion, the arm's doppelganger somehow caused the floor to shake and break apart, revealing a body of water underneath.\nGenerally speaking, earthly laws of physics did not necessarily apply within the red room, as its arrangement could change from moment to moment, making navigation or escape extremely difficult. The passage of time was equally nebulous; Cooper and Annie Blackburn appeared to be present in the room in a dream of Laura Palmer, over a month before they actually entered it.\nOne disturbing phenomenon encountered in the room was the doppelganger, a malevolent duplicate of a person or spirit distinguished by its fogged white eyes.\nFurther reading: Doppelganger\nFeatures\n\nEntrance\n \nSee also: Glastonbury Grove\nThe red room was primarily accessed by an entrance at the center of a circle of sycamore trees known as Glastonbury Grove, located within Ghostwood National Forest. According to an ornate pictogram drawn on the wall of Owl Cave, this was where one could enter the Black Lodge, at the moment of Jupiter and Saturn's conjunction. The curtains would appear stretched across the grove, with the opening above a pool containing a black, burnt-smelling oil. Those who stepped through would disappear and find themselves inside the red room.\nCertain individuals could make use of this entrance at any time, regardless of the planets' alignment, including BOB, Leland Palmer, and Dale Cooper.\nThe room was also connected, apparently, to a room above a convenience store, as BOB and the arm traveled there following a meeting with several other spirits.\n \nHallway\nImmediately beyond the Glastonbury Grove entrance lay a short hallway, intermittently adorned with a statue of the Venus de Milo. The statue, and the adjoining rooms, constantly shifted as one walked between them.\nA second statue was positioned at the opposite end of the hallway, apparently only at different times from the Venus de Milo. This statue transformed into the evolution of the arm, which screamed, \"Non-exist-ent!\" and promptly sent Cooper hurtling into a starry oblivion.\nThis statue is the Venus of Arles.\nWaiting room\n\"This is the waiting room. Would you like some coffee?\"\n ―The arm\nIn a large room, three armchairs sat arranged around an end table, on which sat a miniature Saturn lamp. Behind the chairs was another classical marble statue, along with two floor lamps.\nThe statue, unlike the one in the hallway, is a reproduction of the Venus de Medici.\nIn a dream and later during his first visit to the red room, Cooper repeatedly found himself seated in the lone chair to the left, across from the arm. At various times, the third chair was occupied by Laura Palmer (or a girl who strongly resembled her), the \"Giant,\" and an elderly room service waiter from the Great Northern Hotel. Twenty-five years later, Phillip Gerard instead occupied the arm's seat.\nFurniture\nIn one room, a gold and black marble table stood, with a gold and green ring sitting atop it. While the ring frequently changed hands, it would be placed back on the table by Phillip Gerard upon its return to the red room.\nSeveral armchairs were scattered about the rooms, most notably in the waiting room. These were used by Gerard to manufacture new tulpas, by placing a seed on the seat and combining it with the subject's hair. Tulpas would sit in the armchairs prior to their destruction.\nBehind the scenes\nThe red room was originally devised by David Lynch as a set piece to conclude the International Pilot, which concludes the story with the resolution of Laura Palmer's murder, followed by a bizarre sequence twenty-five years later, where Cooper sits in the room with Laura and a \"man from another place.\" Lynch recalled that he was leaning against a hot car when the image of the room came to him, fully formed."}