{"name": "References_to_popular_culture_in_Twin_Peaks", "url": "https://twinpeaks.fandom.com/wiki/References_to_popular_culture_in_Twin_Peaks", "text": "References to popular culture in Twin Peaks\nThe Twin Peaks franchise often makes references to various elements of popular culture:\nReal-world events and people\nDale Bartholomew Cooper is named after D. B. Cooper.\nSheriff Harry S. Truman is named after the United States president of the same name and also after the Harry Truman who refused to leave his lodge during the 1980 eruption of Mount St. Helens.\nThe name \"Bob\" is a reference to Bob's Big Boy, a restaurant where David Lynch ordered the same lunch every day for several years.\nLaura Palmer's story is inspired by Marilyn Monroe, probably due to Mark Frost and David Lynch's first collaboration when trying to adapt her biography Goddess: The Secret Lives of Marilyn Monroe. Most specifically, Laura mentions in her diary that she is going to \"tell the world about Ben Horne\" while Monroe stated she would tell the world about the \"famous and important man she is having an affair with.\" Days after both Laura and Monroe wrote these in their diaries, they were found dead. Agent Cooper also displays a curiosity of the nature of Monroe's relationship with John F. Kennedy.\nIn his drug-induced state, Garland Briggs confuses his name with Judy Garland.\nHarold Smith is inspired by the real-life person Arthur Crew Inman.\nDr. Lawrence Jacoby has many similarities with ethnobotanist Terrence McKenna.\nIn the pilot, Jacoby mishears Cooper's name as Gary Cooper.\nNorma Jennings mentions Tammy Wynette in the pilot.\nBen and Jerry are named after the ice cream Ben & Jerry's.\nIn Episode 6, Blackie tells Cooper that he looks like Cary Grant.\nAfter Cooper is shot, he tells Diane that he wishes he cracked the Lindbergh kidnapping.\nBen Horne does a re-enactment of the American Civil War. During this time, he believes himself to be General Robert E. Lee, confuses Jerry for Jeb Stuart and muses about Stonewall Jackson. This culminates in a re-enactment of the surrender at Appomattox, though the North surrenders instead of the South. During the surrender, Jacoby played General Ulysses S. Grant and Jerry played Wilmer McLean.\nIn Twin Peaks: Fire Walk with Me, Laura refers to her parents as \"Fred and Ginger.\"\nIn Part 1, Andy says that his and Lucy's son was born on the same day as Marlon Brando.\nThe Trinity nuclear test is portrayed in Part 8.\nLeland Palmer is named for famed actress/dancer Leland Palmer, star of All That Jazz.\nLiterature\nCooper is supposed to be a modern Sherlock Holmes.\nReverse speech comes from Moonchild by Aleister Crowley.\nBen recites Shakespeare's Sonnet 18 to Blackie.\nCyril Pons is named after Solar Pons, a Sherlock Holmes pastiche character.\nJohn Justice Wheeler says that he has a photo of \"Audrey Horne as Heidi.\"\nThe White and Black Lodge's mythos is lifted from Psychic Self-Defense.\nThe concept of the White and Black Lodge, especially Windom Earle's line about dugpas in Episode 27, is inspired by Devil's Guard.\nThe Twin Peaks Sheriff's Department has occult signs hanging on strings when investigating the Lodges: the sign of Belial is in episode 28 and the sign of Asmodeus in the scene when Cooper's hand is shaking in episode 27, both from Lesser Key of Solomon.\nIn the pilot episode, Joey Paulson refers to Bobby Briggs and Mike Nelson as \"Mutt and Jeff\".\nWhen Audrey Horne is hired at One Eyed Jacks, she gives her name as Hester Prynne, the protagonist of Nathaniel Hawthorne's The Scarlet Letter.\nDenver Bob Hobbes from The Secret History of Twin Peaks shares his name with a character from The List of Seven, also by Mark Frost.\nWindom Earle gives Shelley's poem, \"Love's Philosophy\" to Shelly, Donna, and Audrey.\nFilm\nThe name \"Rancho Rosa\" is a reference to one of Mark Frost's favourite 1970's film. Although, he was probably mistakenly referring to True Confessions (1981) featuring a housing development called \"Rancho Rosa.\"\nTwin Peaks' logo is very much like the neon billboard sign of the Twin Oaks motel in 1946 film The Postman Always Rings Twice.\nLaura Palmer's first name comes from the 1944 film Laura, which in turn was based on the 1943 novel of the same name. The veterinarian Dr. Bob Lydecker and the myna bird named Waldo are references to the character Waldo Lydecker.\nOne Eyed Jacks is named after the movie One-Eyed Jacks by Marlon Brando. Donna Hayward references the film when Audrey Horne tells her about the brothel.\nMaddy Ferguson is named after the characters John \"Scottie\" Ferguson and Madeleine in the 1958 Alfred Hitchcock film Vertigo. Furthermore, Sheryl Lee portrays both a blonde and a brunette characters in Twin Peaks. In Vertigo, Kim Novak plays two characters, a blonde and a brunette.\nJames Hurley and Donna Hayward are inspired by the characters Jim and Judy from Rebel Without a Cause.\nThe insurance agent Mr. Neff is named after the character Walter Neff from the 1944 film Double Indemnity who has the same profession.\nGordon Cole is named after a minor character from Sunset Boulevard, which David Lynch theorizes to be named after Gordon St. and Cole Av. which cross the real life Sunset Blvd. Cooper watches a part of the film in Part 15.\nJoe Fielding is from Fairvale but there is no actual Fairvale in the United States, and thus may be a reference to the town from Alfred Hitchcock's Psycho and the Robert Bloch novel it was based on.\nHarley Peyton named Windom Earle after actor William Windom and the character Roy Earle from the 1941 film High Sierra.\nThe Blue Monkey from Twin Peaks: Fire Walk with Me may be a reference to The Wizard of Oz movie.\nEvelyn Marsh's subplot is lifted from Angel Face.\nLynch, Frost and Tony Krantz rented a screening room in Beverly Hills and watched the 1957 film Peyton Place for inspiration. Russ Tamblyn also performed in this movie.\nLynch reused the floor pattern of Eraserhead for the Red Room.\nThe elderly waiter says \"Thank Ya Kindly\" and whoops like an Indian as his performer Hank Worden did in The Searchers.\nRichard Beymer portrayed Mike Pulaski in the 1962 film Bachelor Flat, which might be the origin of Ronette Pulaski's last name.\nThe lyrics of the song \"Sycamore Trees\" of Episode 29, are an exact copy of some lines from an old Lynch script of Ronny Rocket (which are missing from the later scripts called Ronnie Rocket).\nAs a youth, Dale Cooper had a poster of James Stewart in the film The FBI Story.\nIn Part 6, Red asks Richard Horne if he has ever seen The King and I.\nWhen Albert is caught in the rain in Part 6, he insults Gene Kelly in reference to the 1952 film, Singin' in the Rain, co-directed by and starring Kelly.\nIn Part 17, Albert likens Special Agent Randall Headley to the Marx Brothers.\nArt\nEdward Hopper's paintings are an inspiration for Twin Peaks' aesthetics.\nThe imagery of the Red Room seems to be inspired by Francis Bacon's Seated Figure, 1961.\nTelevision\nThe one-armed man named Philip Gerard is a reference to similarly-named Lt. Philip Gerard from The Fugitive, who was looking for Richard Kimble, who was himself looking for a one-armed man.\nThe Man from Another Place was inspired by the character of Dr. Loveless on the 1965-1969 TV series The Wild Wild West.\nThe room service waiter's first scene seems to be lifted from an episode of Hill Street Blues by Mark Frost.\nCooper being shot at the end of the first season may be a reference to the famous \"Who shot JR?\" cliffhanger from Dallas.\nTheatre\nThe relationship between Windom Earle and Leo Johnson is a reference to Beckett's Endgame.\nIn Episode 13, Leland Palmer sings \"Getting to Know You\" from The King and I, which Pete Martell identifies as such.\nIn the same episode, Pete mentions that Fiddler on the Roof made him \"weep like a little baby.\"\nIn addition to Sonnet 18, several of William Shakespeare's plays are referenced:\nWhen Ben goes to see the \"new girl\" (Audrey) at One Eyed Jacks in Episode 7, he partially quotes Prospero in Act IV, Scene I of The Tempest.\nBen says \"This is such stuff that dreams are made of,\" while the line from the play is \"We are such stuff as dreams are made on.\"\nMajor Briggs' line in Episode 16, \"there's more in heaven and earth than is dreamt up in our philosophy\" is taken from the line, \"There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy,\" in Act I, Scene V of Hamlet.\nWhen watching his childhood movie in Episode 18, Ben recites some of Richard III's monologue in Act I, Scene I of Shakespeare's Richard III.\nIn Episode 19, when Dick Tremayne is taken by the beauty of Lana Budding Milford, he begins quoting Romeo in Act I, Scene V of Romeo and Juliet. Doctor Hayward joins him in reciting the line.\nIn Episode 21, during his Civil War re-enactment, Ben quotes the title character in Act IV, Scene III of Henry V.\nMusic\nIn Part 1, Ben and Jerry both quote the Aretha Franklin version of the song \"Respect.\"\nGordon Cole is whistling a song in Part 7, but it is difficult to distinguish if it is Rammstein's \"Engel\" or the theme from Fellini's Amarcord composed by Nino Rota.\nIn Part 14, while explaining his glove to James, Freddie Sykes quotes the Beatles song, \"A Day in the Life.\"\nIncorrectly regarded as cultural references\nContrary to popular belief, Hank Jennings' prisoner number is not 24601, like Jean Valjean in Les Misérables, but 8464257."}