{"name": "Richard_Horne", "url": "https://twinpeaks.fandom.com/wiki/Richard_Horne", "text": "Richard Horne\nNot to be confused with Richard.\nRichard Horne was the disturbed son of Audrey Horne and Dale Cooper's doppelganger, involved in the illegal drug trade in Twin Peaks, Washington.\nBiography\n\nChildhood\nRichard was born to Audrey Horne, apparently fathered by the doppelganger of Dale Cooper in March 1989 while Audrey was comatose following an explosion at the Twin Peaks Savings and Loan. Audrey discovered her pregnancy two months after recovering, and moved out of her parents' home, preparing to raise the child on her own.\nAudrey allowed her mother Sylvia to help raise Richard, but until his tenth birthday she refused to allow him to meet his grandfather, Benjamin. She refused to confirm who Richard's father might be, but notably kept a framed portrait of Agent Cooper on the wall in her office at her hair and beauty salon. In 1999, Audrey's fortunes took a mysterious tumble, beginning with her sudden and unexpected marriage to her accountant, followed by reports of heavy drinking, public fights, and infidelity. By 2013, she had closed her successful hair salon and disappeared from public view.\nWith no father and now an absent mother, Richard's teenage years saw several run-ins with Sheriff Harry S. Truman. He began regularly coming to his grandmother and, now, his grandfather to borrow money.\nHit and run\nOn one evening at the Roadhouse, Richard smoked underneath a 'no smoking' sign. He was asked to stop by an employee, but off-duty Deputy Chad Broxford told him he would handle it. Horne covertly passed Broxford a wad of cash inside his empty cigarette pack. A girl from the next table, Charlotte, asked him for a light. Richard had her join him in his booth and he aggressively grabbed her, making threats to rape her.\nRichard later met with gangsters led by Red, who planned on using Twin Peaks as a spot for running \"sparkle\" down from Canada. He sampled the product and promised that it would be easy to traffic into town. Red pulled out a dime and flipped it, it hung in the air spinning far longer than it should have, then suddenly appeared in Richard's mouth, then back in Red's hand.\nRichard drove away from the encounter, fuming at having been called \"kid\" repeatedly by Red. In his anger he illegally sped into the oncoming lane and ran a stop sign, killing a young boy. He then went to a field belonging to a local farmer and wiped the boy's blood off of his truck's grill.\nRichard showed up at Miriam Sullivan's trailer after she witnessed him kill the boy. She told him that she had sent an incriminating letter to Sheriff Truman and he broke inside, savagely beating her. He then called Chad, telling him to intercept the letter.\nHe then went to his grandmother for money. After strangling her, he received the combination for her safe and took her purse, totaling thousands of dollars.\nMontana\nRichard left the state, hiding out with a criminal organization at the Farm in Montana. There, he joined a group of men watching a camera feed of Ray Monroe's death at the hands of Dale Cooper's doppelganger.\nHe followed Cooper to a convenience store in the nearby woods, aiming a gun at him and remarking that he recognized him as an FBI agent from a photograph his mother used to own. Cooper asked who his mother was, and then quickly disarmed and threw him to the ground. Cooper invited him to get in the truck, saying that they would have time to talk on the way.\n \nRichard drove with Cooper to a field, which matched two of the three coordinate sets Cooper had acquired from Ray Monroe, Phillip Jeffries, and Ruth Davenport. The spot was on a large rock a ways up a nearby hill. Cooper, claiming he was too old, told Richard to take a tracking device and locate the exact spot for him. Richard climbed onto the rock and followed the device's beeps. Just as it became a constant tone, Richard lit up like a torch as he was electrocuted, screaming, and then disintegrated.\nCooper did not react to the grisly death of his offspring as it happened in front of his eyes, but just stood and watched it happen in silence. As Richard's remains was scattered as dust in the wind, Cooper sighed, and muttered a laconic \"Goodbye, my son\" before returning to his car.\nBehind the scenes\nRichard is played by Australian actor Eamon Farren, who was selected by David Lynch to appear in the series without an audition. He previously appeared in Chained, a film directed by Lynch's daughter, Jennifer Lynch."}