{"name": "Roadhouse", "url": "https://twinpeaks.fandom.com/wiki/Roadhouse", "text": "Roadhouse\nThe Bang Bang Bar, referred to primarily by its local nickname the Roadhouse, was a popular tavern in the southern part of Twin Peaks, Washington, not far from the \"Welcome to Twin Peaks\" sign. It was liked by bikers, loving couples, and lovers of good music.\nHistory\nThe Roadhouse was acquired by the Renault family circa 1949.\n1989\n\n2016\n\nNotable staff\nJacques Renault – bartender ( – March 1989)\nBernard Renault – janitor ( – February 1989)\nJean-Michel Renault – owner/bartender (2016)\nFederico (2016)\nAn MC (2016)\nEntertainers\nOver the years, several musical acts performed on stage at the Roadhouse.\nJulee Cruise\nChromatics (2016)\nThe Cactus Blossoms (2016)\nAu Revoir Simone (2016)\nTrouble (2016)\nSharon Van Etten (2016)\nThe Nine Inch Nails (2016)\nHudson Mohawke (2016)\nRebekah Del Rio (2016)\nJames Hurley (2016)\nLissie (2016)\nThe Veils (2016)\nEdward Louis Severson III (2016)\nAudrey Horne (2016)\nBehind the scenes\nThe exteriors for the Roadhouse in the pilot episode were filmed at the former Colonial Inn, located at 4200 Preston Fall City Road SE in Fall City, Washington. The interiors were filmed at the Cornish College of the Arts' Raisbeck Performance Hall, located at 2015 Boren Avenue, Seattle, Washington. For subsequent episodes, the interiors were reproduced on a sound stage. The exterior appears in the pilot, Twin Peaks: Fire Walk with Me, and most episodes of Twin Peaks (2017).\nThe neon sign above the Roadhouse door, reading The Bang Bang Bar, was added by the production, and is possibly intended to display the Roadhouse's actual name. In this interpretation, the Bang Bang Bar is known locally as simply the Roadhouse, as it is the only establishment of its kind in Twin Peaks. This interpretation is supported by an outtake from the pilot included in Twin Peaks: The Entire Mystery where Sheriff Truman says, \"Jake Morrissey owns the Bookhouse and the Roadhouse. The Bang Bang Bar. Everybody calls it the Roadhouse.\" Aside from this outtake, the location is referred to in dialogue, scripts, and merchandise (such as Twin Peaks: Access Guide to the Town) solely as \"the Roadhouse,\" and never explicitly as \"the Bang Bang Bar.\" This inconsistency is referenced in The Final Dossier, where Agent Preston notes that it is known as \"the Bang Bang Bar\" only by its signage.\nSince the airing of the 2017 revival, an officially-approved Roadhouse pop-up bar and restaurant has been opened twice in LA, featuring Twin Peaks-themed musical performances and food. Several cast members, including Rebekah Del Rio, Robert Broski, Josh Fadem, Zoe McLane, and Adele René have visited the pop-up."}