{"name": "Rodney_Mitchum", "url": "https://twinpeaks.fandom.com/wiki/Rodney_Mitchum", "text": "Rodney Mitchum\nRodney Mitchum, along with his brother, Bradley, owned the Silver Mustang Casino.\nBiography\nRodney and Bradley were raised in an orphanage.\nAfter a man won a total of $425,000 at the Silver Mustang, Rodney and Bradley went to the casino to punish Burns, the casino supervisor. After Rodney beat up Burns, he fired him and replaced him with the pit boss, Warrick.\nLater, as Rodney did paperwork, Candie smacked him in the face with a television remote as she tried to swat a fly, causing her to become hysterical as Bradley came to see what had happened. They later watched the news, seeing that Ike \"The Spike\" Stadtler had been arrested after trying to kill \"Dougie Jones,\" the man who had won at the casino.\nAnthony Sinclair later came to see the brothers, telling them that Jones was trying to prevent them from their insurance claim on a hotel they owned, which burned down due to arson.\nThe following afternoon, Bradley told Rodney about a dream he had the previous night about their meeting with Jones. While waiting for the meeting, Bradley said the cut Rodney received from Candy had been healed, so he ripped it off of Rodney's face. Upon seeing Jones carrying a box, Bradley took him aside, telling him that if there was a cherry pie inside, they could not kill him. A pie was indeed found in the box and a $30 million check for the brothers was in Jones' pocket. The brothers then decided to take Dougie to dinner.\nThe brothers later delivered gifts for Dougie's boss, Bushnell Mullins: Montecristo Number Twos, diamond cuff links, and a BMW convertible. They also purchased a gym set for Dougie's son and a BMW convertible for the family.\nRodney and his brother later visited Jones in the hospital, where he was comatose due to inserting a fork into an electrical socket. The Mitchums brought food for the family and met Jones' wife Janey-E and Sonny Jim before offering to stock their home.\nLater, while making their delivery to the home, the baffled brothers witnessed a shootout in the neighborhood, the cause of which Rod blamed on stress. They decided to leave as the FBI arrested a Polish accountant, the only survivor of the gunfight.\nDougie later awoke and requested from the brothers and plane to Spokane. They noticed Jones behaving differently and were informed by him that he was actually FBI Special Agent Dale Cooper, who had been missing for twenty-five years, and that he needed to get to the Twin Peaks Sheriff's Department. The brothers expressed doubts about willingly visiting a law enforcement office, but Cooper assured them that he could vouch for the fact that they both had \"hearts of gold.\"\nAfter arriving at the sheriff's station in Twin Peaks, Rodney and his brother witnessed BOB being removed from the body of Cooper's doppelganger and shattered into pieces by Freddie Sykes, an event which he remarked as \"one for the grandkids.\"\nBehind the scenes\nThe scene in which Candie smacks Rod in the face with a television remote as she tries to swat a fly was unscripted and a byproduct of an actual on-set accident. A light on the set fell and hit Robert Knepper right below his eye on his cheekbone, and David Lynch devised the scene between Candie and Rod to explain the cut on his face."}