{"name": "Ronette_Pulaski", "url": "https://twinpeaks.fandom.com/wiki/Ronette_Pulaski", "text": "Ronette Pulaski\n\"This girl doesn't even know where she is. Or if she is.\"\n ―Dr. Louise Shelvy\nRonette Pulaski was a student at Twin Peaks High School and a partying companion of the late Laura Palmer, with whom she worked as a prostitute at the brothel One Eyed Jacks.\nIn February 1989, Ronette was abducted along with Laura and witnessed her friend's brutal murder at an abandoned train car in the nearby woods. She was found wandering, dazed and catatonic, along a rail bridge the following morning, and soon lapsed into a coma. By crossing the state border between Washington and Idaho, Ronette invadvertently caused Laura's murder to become a federal case, prompting the arrival of FBI Special Agent Dale Cooper.\nBiography\n\nProstitution\nIn February 1988, Ronette and Laura sat in a motel room when Teresa Banks came in with money from a man who chickened out of his planned foursome with them. Teresa was murdered soon after.\nA year later at The Power and the Glory at the American-Canadian border, Ronette found Laura. Jacques Renault came to them and they talked about Teresa. He also invited the girls up to his cabin later in the week.\nLaura and Ronette then sat in a booth, receiving oral sex from Buck until Ronette pointed out Donna Hayward, who was topless with Laura's shirt tied around her waist. This caused Laura to become upset and charge at Donna.\nAbduction and hospitalization\nOn the night of February 23, Ronette, Jacques, and Leo Johnson met near a cabin, where they engaged in sex and cocaine. Ronette tried to stop Jacques from tying Laura up, but Leo pulled her back.\n \nJacques and Leo then left, and Ronette and Laura were taken to a train car by a long-haired man and Laura was killed. Ronette barely escaped thanks to the help of the One-Armed Man, and she saw an Angel in the car train.\nRonette was reported missing the following day and she was found in a daze, bloody and dirty while crossing a bridge.\nShe was later visited in the hospital by FBI Special Agent Dale Cooper and Sheriff Harry S. Truman. The doctor told them she had been raped and was unresponsive. When Cooper checked her fingernails, she began saying \"don't go there.\"\n \nThe sheriff's department later found a picture of Ronette in an issue of Flesh World.\nJust over a week later, Ronette remained at the hospital, laying in her bed, moaning. She lifted her arms and thrashed around, having a flashback to the night Laura died, with the long-haired man killing her.\nThe next day, she laid in her bed, awake, as Agent Cooper and Sheriff Truman arrived. Cooper showed her a sketch of Leo Johnson, but she did not recognize him as the man who tried to kill her. The agent then showed her a sketch of the long-haired man, which caused her to thrash around again and say \"train\" repeatedly.\n \nThe following day, Ronette tried to resist as she was taken to her hospital bed and sedated so Cooper could extract a small piece of paper containing the letter 'B' from under her left ring fingernail.\nWeeks later, after her release from the hospital, Ronette was brought to the sheriff's station, where Agent Cooper had her smell a jar of oil, which frightened her, as she recognized the smell from the night Laura was killed.\nAnother 1989\nOn the night of February 23, Ronette waited for Laura Palmer with Leo Johnson and Jacques Renault off Sparkwood Road, but the other girl never showed up. The three went to Jacques' cabin in the woods. Later that night, Ronette was kidnapped; she was found the next morning in a dazed state, having wandered along a rail bridge into Idaho. Over twenty-five years later she was contacted by FBI Agent Tammy Preston regarding Laura's supposed murder, but after thinking about it with some confusion recalled the events as Laura simply disappearing.\nBehind the scenes\nRonette was played by Phoebe Augustine, who also appeared in Part 3 of the 2017 revival as \"American Girl.\" It is unclear if the American girl is intended to be Ronette or if she is a new, separate character. \nRonette's name in the pilot's original script was Sharon.\nHer name in The Secret Diary of Laura Palmer is spelled as \"Ronnette Pulaski.\" Though only briefly hinted at in the show and film, Laura writes in her diary about being attracted to Ronette, and later reportedly having a sexual experience.\nTrivia\nIn the rule book for Twin Peaks Murder Mystery Game, it is erroneously stated that Ronette is 21 years old and a therapist."}