{"name": "Ruth_Davenport", "url": "https://twinpeaks.fandom.com/wiki/Ruth_Davenport", "text": "Ruth Davenport\nRuth Davenport was a librarian who lived in Buckhorn, South Dakota. She was found murdered in her apartment, along with the headless corpse of the presumed-dead Major Garland Briggs. Davenport's lover and partner in amateur paranormal studies, William Hastings, was arrested for her murder.\nBiography\n\nBefore her death\nRuth lived at 1349 Arrowhead Road next door to Marjorie Green, who had a spare set of keys to the apartment to water Ruth's plants whenever she was away.\nRuth was having an affair with a married high school principal, William Hastings. With Hastings and Heinrich Viegel, she also contributed to a blog documenting alternate dimensions and paranormal phenomena. Ruth was skilled at accessing hidden or classified information.\nThe zone\nOn or around September 19, Hastings and Davenport visited the property at 2240 Sycamore and traveled to another reality, which Hastings called \"the zone.\" They encountered a man there, \"the Major\" (later identified as Garland Briggs), who said he had been \"hibernating\" and needed to travel somewhere else to remain safe. The Major asked them to access a secure military database and bring him a set of coordinates, which they did. Hastings' secretary Betty was also privy to these coordinates, which Ruth wrote on her hand.\nWhen they returned around September 22, they gave him the coordinates, whereupon the Major floated into the air, saying \"Cooper. Cooper.\" His head then disappeared. Several other people in that place then attacked Hastings, grabbing him by the neck and demanding to know the name of his wife, Phyllis. William then woke up at home. When questioned, he would later claim he had had an uneventful staff evaluation meeting at school that evening and had driven Betty home afterward, though he did remember having a terrible nightmare about being at Ruth's apartment that night.\nPost-mortem\nRuth's naked, decapitated body was left in a field near the portal, while her severed head was placed in her bed atop the decapitated body of Major Briggs. The grisly scene was discovered a few days later, when Ruth's neighbor Marjorie called the police to report the smell coming from next door.\nHer body was discovered by Gordon Cole and Albert Rosenfield the following week. Albert photographed the smudged coordinates that were indeed written on her arm, which pointed to a location near Twin Peaks, Washington.\nBehind the scenes\nMary Stofle portrayed Davenport's body on set, complete with prosthetics, but her appearances were altered by computer-generated effects for the final episodes."}