{"name": "Sam_Stanley", "url": "https://twinpeaks.fandom.com/wiki/Sam_Stanley", "text": "Sam Stanley\n\"You know, Agent Desmond, I estimate this whole office – furniture included – is worth about twenty-seven thousand dollars.\"\nSam Stanley was an FBI forensic pathologist assigned, along with Special Agent Chester Desmond, to investigate the murder of Teresa Banks in Deer Meadow, Washington.\nBiography\nStanley gained repute for helping to solve the Whiteman case using a special device he owned, which helped the investigators find crucial wood splinters.\nMurder of Teresa Banks\nIn February 1988, Stanley was assigned by Gordon Cole to assist in the investigation of Teresa Banks' murder, which Cole deemed relevant to the Blue Rose Task Force. Upon Desmond's arrival at the airport in Portland, Cole introduced him to Stanley, before the three watched an interpretive dance by Lil. Afterward, Cole bid them farewell, telling Stanley to stay close to Chet's side.\nOn the drive to Deer Meadow, Sam asked about Lil's dance, and Chet explained that it was a code for important facts about the case. Her sour face meant that the local authorities were not cooperative, her eyes blinking meant there was trouble higher up with the law enforcement, her hand in her pocket meant they were hiding something, her fist meant they were belligerent, her walking in place meant there would be a lot of legwork, her being Cole's \"mother's sister's girl\" meant the sheriff's uncle was in federal prison, her tailored dress meant drugs, and her blue rose meant something Chet could not tell Sam about.\nThey went to the Deer Meadow Sheriff's Department, where Deputy Cliff Howard refused entry to Sheriff Cable's office, he and the secretary taking pleasure in stalling the investigation. Desmond became restless and forced his way past the deputy and into the sheriff's office, retrieving all available information on Teresa Banks.\n \nOn their way out to the morgue, Stanley told Desmond that he had determined the Deer Meadow sheriff's station to be worth $27,000 with furniture included. They examined Teresa's body and found that the cause of death was likely repeated blows to the head from a blunt object. She was also missing a ring. Under a fingernail, Stanley found a small piece of paper with the letter 'T' on it.\nStanley and Desmond left the morgue at Deer Meadow at 3:30 AM. He asked where they would sleep, and Desmond said that they were going to get something to eat first. Stanley commented that Desmond has his own modus operandi. At Hap's Diner, where Teresa worked, they talked to a man named Jack and ask about Hap, who they discovered was dead. They asked about Teresa Banks and found out she did not have any friends or companions. He told them to ask the waitress Irene for further information. They went inside and asked Irene about Teresa and she told them that the girl was often late and Irene believed she had a cocaine problem and called her death \"a freak accident.\" When Desmond asked Irene if she does drugs, she said she did not do any drugs. Stanley responded that nicotine and caffeine are drugs. Chet asked Sam what time it was, causing him to accidentally pour coffee on himself. Irene then told them that Teresa's left arm went numb for three days before her death. Sam suggested they take the body back to Portland for more work.\nThey left the diner later in the morning. Chet told Sam that they should see the sun rise at Fat Trout Trailer Park, where Teresa had lived. Sam first believed this statement to be some code, but Desmond told him that was what he literally meant. As they got into Desmond's car, they saw Irene leave.\nAt the trailer park, they approached the trailer belonging to the owner, Carl Rodd, who was very grumpy as they had knocked on his door before 9:00, despite instructions on the door to not do so. Carl took them to Teresa's trailer, where they found a photo of Teresa wearing a ring. Carl brought them strong cups of coffee just before an old woman came to the trailer and left when Desmond asked if she knew Teresa.\nStanley and Desmond returned to the Deer Meadow Sheriff's Department to retrieve the body. After Sheriff Cable refused to comply, he challenged Desmond to a fight, which Stanley watched. Desmond managed to overpower the sheriff.\nSam transported the body to Portland while Chet went back to the trailer park for one more look - for the Blue Rose. However, this was the last time the men saw each other, as Desmond disappeared at the trailer park.\n \nSpecial Agent Dale Cooper later met with Stanley at his apartment to gain some insight on Desmond's disappearance. Stanley mentioned the blue rose, which Desmond would not explain to him, but Cooper replied that he would not be explaining it to him either. He then showed Cooper the letter \"T\" they had found under Banks' fingernail. Sam shook Cooper's hand and asked him to remember him if he ever needed assistance on a case.\nStanley may be the \"Sam\" to whom Cooper refers in the pilot episode, when he asks that Diane consult Albert Rosenfield instead of him.\nLater life\nFollowing the Banks investigation, Stanley suffered a personal breakdown, possibly related to alcoholism. He was placed on administrative leave and, as of late 2016, had not returned to active duty."}