{"name": "Sarah_Palmer", "url": "https://twinpeaks.fandom.com/wiki/Sarah_Palmer", "text": "Sarah Palmer\n\"...I can still make a happy face! When I go to get my hair done, or to the grocery store... I mean, no one really knows what I'm thinking. Uh, or cares, that's the thing. Inside, it's... one thing. Then there's... step aside... separate.\"\n ―Sarah Palmer, 2014\nSarah Judith Palmer (née Novack) was the wife of Leland Palmer and mother of Laura Palmer, the latter of whom was found murdered. Both Sarah and her husband suffered from psychological problems following Laura's death. She also seemingly had some paranormal powers and she was known to, on some occasions, predict the future or see people that no one else could see.\nBiography\n\nChildhood\nSarah Novack was born on March 3, 1943 in Bellevue, Washington. In summer of that year, her father, a Department of Defense employee, moved the family to Los Alamos, New Mexico to work in a subcontractor role on the Manhattan Project. They lived in a suburb outside the town proper built for workers involved in the program.\nOn the night of August 5, 1956, Sarah's parents found her unconscious and unresponsive in her bedroom and rushed her to the hospital. She awoke in the backseat en route, with no memory of what had happened to her. As reported in a local newspaper, Sarah was one of more than a dozen people in the region who experienced medical distress that evening, apparently connected to a hijacked radio broadcast from the KPJK station, where two people had been found murdered. However, attending physicians found nothing physically wrong with her.\nTwin Peaks: The Final Dossier strongly implies that Sarah is in fact the girl portrayed by Tikaeni Faircrest in \"Part 8,\" credited only as \"Girl (1956).\"\nSarah had at least one niece, Maddy Ferguson, who was Beth's daughter.\nIt is not stated if Beth is Sarah's sister or sister-in-law.\nAdulthood\nSarah attended the University of Washington, majoring in political science. While at school she met Leland Palmer, whom she married in 1968. They had one child, a daughter named Laura, born in 1971.\nShe and Leland organized the Twin Peaks Timber Players in 1974, which annually held three summer performances staged at Twin Peaks High School.\nLaura's final days\nSarah came home from the grocery store one day in mid-February 1989, a cigarette dangling out of her mouth, which she had Laura take from her. Laura asked for the car, as she had forgotten her books, and almost took the cigarette with her, but Sarah advised that she would never become a smoker if she did not start.\nLater, Laura returned home, Sarah discovering that she was lying since she found the books in her room while searching for a sweater Laura borrowed from her. Laura told her that she had been with her boyfriend Bobby. This frustrated Sarah, as she wished for her daughter to always tell her the truth.\nIn the dining room, Leland came in, loudly declaring that he was hungry. He then taught Sarah and Laura how to introduce themselves in Norwegian.\nAt dinner the following evening, Leland frightened Laura as he examined her allegedly dirty hands and a heart necklace she wore. Sarah begged Leland to stop. While getting ready for bed that night, Leland began to cry.\nDuring breakfast the next morning, Leland came through the dining room on his way out the door to remind Sarah and Laura that it was Johnny Horne's birthday.\nLater, she asked Laura if she had seen her blue sweater, which Laura pointed out that Sarah was wearing. Sarah began to sob, believing that she was having a mental breakdown.\nThat evening, she was drugged with a glass of milk by her husband. She awoke to see a white horse standing in her bedroom.\nAt breakfast the next morning, Laura did not eat much and did not wish to speak with her parents. She left the dining room and Leland followed while Sarah lit a cigarette.\nLaura then told her mother at dinner that she hated asparagus. Leland was at work late and Laura asked to go to Bobby's to do homework.\nIn the evening, Laura passed through the living room after coming home from Bobby's, telling her mother goodnight.\nLaura's murder\n \nSarah stood in her kitchen the next morning, February 24, 1989. She impatiently called for her daughter to wake up, but received no answer. After searching for Laura, she could not find her anywhere in the house. She called the Briggs household and the phone was picked up by Bobby's mother, Betty. Sarah asked if Laura was perhaps with Bobby, but Mrs. Briggs was unsure, as she said Bobby had left to go running before football practice. Sarah also wondered if, perhaps, Laura left with Leland earlier in the morning. Sarah hung up and called the school after Betty agreed that this could be the case. The football coach told her that Bobby had yet to show up for practice and that he had been late every day of the week. Sarah then hung up and called the Great Northern Hotel, where her husband was. She got a hold of him and he said Laura was not with him. She became more worried and said Laura would have left a note if she was with Bobby. Leland then said, \"Sheriff Truman,\" leading her to worry even more. Sarah's suspicion was confirmed when Leland dropped the phone. Their daughter was dead.\nMrs. Palmer became hysterical in the hours following the confirmation of her daughter's death. Doctor Will Hayward sedated her so she could calmly answer questions from Sheriff Truman regarding Laura. She said she had last seen her around 9:00 the night before after coming home from Bobby's house, then Laura went upstairs. Sarah then heard footsteps on the upper floor, which Truman confirmed to be Leland and Deputy Hawk. She then said that her last words to her daughter were \"goodnight, sweetheart\" and that she heard her phone ring once, but did not know who it was.\n \nLater in the evening, she was awoken by a vision of a gloved hand digging up half of Laura's heart-shaped necklace.\nThe next day, she sat on the couch when Laura's best friend, Donna Hayward came to the Palmer home. Donna came and sat next to her and tried to comfort her. Sarah then thought Donna was Laura and hugs her, but had a vision of a man with long, gray hair and began screaming.\nThe following day, upon hearing her husband crying and screaming with a picture of Laura, Sarah came in to try and stop him, but he said that they must Dance for Laura. They broke the picture frame and as Leland rubbed his blood on the photo, she asked with frustration what was going on in their house.\nSarah attends Laura's funeral the next day, where Leland broke down and jumped onto the casket. Also attending was Sarah's niece, Maddy Ferguson, who was nearly identical in appearance to Laura and had come from Missoula, Montana to attend the funeral.\nThe next day, she described to Deputy Andy Brennan the man she saw in her vision as the deputy made a sketch of him. Leland then came in and reminded her of the vision she had of the gloved hand digging up Laura's necklace.\nA few days later, she talked with Maddy in her living room and asked about Maddy's mother. Maddy began to tell her about a dream she had but was interrupted by Leland, who entered with his hair having turned completely white.\nIn the evening, Sarah joined Leland, Maddy, and the Haywards to hear Gersten Hayward play the piano and Harriet Hayward recite a poem she wrote about Laura.\nDays later, Sarah attended her husband's hearing for the murder of Jacques Renault. Prosecutor Daryl Lodwick proposed, on behalf of the state, that Leland be denied bail due to his mental state and the apparent premeditation of the crime. Sheriff Truman spoke for the defense, which ultimately caused Leland to be released on bail until his trial.\nA couple of mornings later, Maddy told Sarah and Leland that she would be returning home to Missoula.\nShe later crawled down the stairs at her home, calling for Leland, and she once again saw a white horse, this time in the living room.\nSarah called her husband upstairs the next day when Donna and James Hurley came to say goodbye to Maddy, who had already apparently left. She also reminded him to sign them up for the \"Glenn Miller Night\" at the club.\nAftermath\nThree days after Leland was arrested for Laura and Maddy's murder, then died in custody, Dr. Hayward tried to sedate Sarah before the funeral, but she calmly refused the shot, wishing to \"be there\" at the funeral. She was comforted by Agent Dale Cooper, who assured her that Leland was not guilty of his actions against Laura, but were the responsibility of an evil spirit called BOB, the gray-haired man Sarah had seen. He also informed her that he had kept her drugged whenever he would commit heinous acts, but came to terms with what he had done just prior to his death.\nAt the reception, Hank Jennings brought her a plate of food and she talked with Audrey Horne and Eileen Hayward about memories she had of her family.\nTwelve days later, Doctor Lawrence Jacoby brought her to the Double R Diner to speak to Major Garland Briggs, who she told, \"I'm in the Black Lodge with Dale Cooper.\"\nLater life\nAs of late 2016, Sarah lived alone in the same house, and spent her nights smoking and drinking Bloody Marys while watching television. Her viewing choices included violent nature programs, boxing, and football. She had consulted with people \"in the medical profession\" to little avail, but was still able to put on her \"happy face\" when she went out in public.\nThe set dressing for Sarah's house in Twin Peaks (2017) included a prop pill bottle for a hydrochlorothiazide prescription from the Twin Peaks Pharmacy. Hydrochlorothiazide (HCTZ) is used to treat high blood pressure and swelling due to fluid buildup.\nAt a local grocery store, Sarah had a breakdown after seeing an unfamiliar brand of turkey jerky being sold. She warned the workers about \"men coming,\" and said that something had happened to her. Eventually, she talked herself through finding her keys and stormed out, leaving behind her purchases. Later, Deputy Chief Hawk came to visit her, concerned for her well-being. Sarah easily guessed he was there about what had happened at the grocery store and assured him she was fine. Hawk heard a disturbance from inside the house, but Sarah assured him it was just \"something in the kitchen,\" and said it was a \"goddamn bad story.\" He told her to call him if she ever needed any help in the future.\n \nSarah went to the Elk's Point #9 bar one evening, where a trucker sitting nearby attempted to proposition her. Although Sarah rejected his advances and warned that she would eat him, he persisted and made vulgar threats toward her. Sarah stood and peeled off her face, revealing a left hand with a black ring finger and a giant mouth in a black void within, before closing it and ripping the man's jugular out with her teeth, killing him. She screamed in feigned terror, summoning the bartender, who asked in horror what had happened. Sarah insisted she had no idea, and said it was a mystery.\nAfter Dale Cooper traveled back to 1989, Sarah stalked around her house, wailing hideously. She ran into the living room and seized the framed portrait of her daughter Laura, and began smashing it repeatedly with an empty bottle.\nWhile standing outside the house where Dale Cooper said she had once lived, Carrie Page heard the sounds of Sarah calling Laura downstairs the morning her body was discovered, and began screaming.\nAnother 1989\nOne year to the day after Laura Palmer disappeared, Sarah's husband Leland Palmer shot himself in his parked car by White Tail Falls, leaving her a widow. Over the next few decades, Sarah was treated for clinical depression and spiraled into alcohol and prescription drug abuse. In 2016, she was witness to a bizarre sudden death at the Elk's Point #9 bar in Twin Peaks, when a trucker fell down dead with half his throat torn out.\nNon-canon appearances\n\nInternational Pilot\nThis section covers only the alternate ending presented in the International Pilot.\nIn the evening, Sarah is awoken by recalling seeing a man with long, gray hair hiding behind Laura's bed and she screams for Leland.\nBehind the scenes\nSarah is portrayed by American actress Grace Zabriskie. Later, in 2006, Zabriskie appeared in another mystery film by David Lynch, Inland Empire, where she played a mysterious neighbor of the main character. Zabriskie reprised the role of Sarah Palmer in the 2017 revival.\nGallery\n\nTwin Peaks (1990-1991)\n\nTwin Peaks (2017)\n"}