{"name": "Saturday_Night_Live", "url": "https://twinpeaks.fandom.com/wiki/Saturday_Night_Live", "text": "Saturday Night Live\nSaturday Night Live is an American late-night comedy show which has been running for over 40 years.\nKyle MacLachlan hosted the show for the first episode of its sixteenth season, which aired on September 29, 1990, one day before the second season of Twin Peaks premiered. He reprised his role as Special Agent Dale Cooper in a sketch parodying the show.\nMacLachlan's opening monologue and the Twin Peaks sketch were included with Twin Peaks: Definitive Gold Box Edition.\nKyle MacLachlan as host\n\nOpening monologue\nDuring MacLachlan's opening monologue, an audience member asks him if they will find out who killed Laura Palmer in the upcoming season. He reveals that the killer was Shelly Johnson, which prompts Kyle to be called to the control room, where he receives a call from David Lynch, who is enraged at him for spoiling the show. He returns to the stage to assure the audience that he was joking about Shelly killing Laura.\nTwin Peaks sketch\nIn his room at the Great Northern Hotel at 11:31 PM, Cooper addresses a tape to Diane, telling her how long he showered and the details, including how many hairs he found and what kind of shampoo he used. He then tells her that he ate fifteen jelly doughnuts and that he will soon take an insulin shot, then details his plans to slide around his sheets in the nude to figure out what they are made of.\n \nSheriff Harry S. Truman then enters, announcing that Leo Johnson has confessed to Laura's murder. However, Cooper does not listen, instead suggesting that they go to One Eyed Jacks disguised as Indians, using Hawk's buckskins. The sheriff tells him of Leo's confession again and Cooper says it to be another piece of the puzzle of figuring out Laura's killer. Harry tells him that they have evidence, including a videotape of Leo murdering Laura, but Cooper again dismisses this as it is too obvious. He then tells of a dream he had of a hairless mouse with a pitchfork singing a song about caves, and surmises the caves to be the same ones at the Packard Sawmill.\nDeputy Andy Brennan brings a handcuffed Leo into the room, who says he is ready to do his time. Cooper determines Leo's actions to make him a prime suspect. Leland Palmer then enters, thanking him for finding the man who killed Laura. However, Cooper tells him that Laura's killer is still at large, which causes Leland to have a breakdown and he leaves. \nAudrey Horne then enters. Cooper asks her if she has found any leads at the perfume counter, but she say she quit the job after Leo confessed. Leo interrupts and shows pictures of him about to kill Laura, killing Laura, and wrapping Laura in plastic. However, Cooper is still unconvinced. Audrey gives him a present, tying the bow with her tongue, and she leaves.\nCooper turns to Harry, telling him of his plan to stake out the graveyard, disguised as altar boys. The sheriff shoots this plan down and continues trying to convince him that Leo is guilty of the crime. Cooper suggests that he throw a rock at a window, suggesting that if it breaks, Leo is innocent. He throws the rock, breaking the window, and tells Leo he is free to go. This irritates Leo, who says he sent several notes to Cooper, confessing to the crime.\nNadine Hurley enters and asks Cooper to take her silent drape runner to the patent office in Washington, D.C. then leaves. Harry says he is about to head out as well, but Cooper stops him, as they have not yet heard from the Log Lady. However, Harry says they will not hear from her, as they have already used both female Saturday Night Live cast members. Nevertheless, she comes in to tell him that her log points to Leo being the murderer and she leaves.\nSheriff Truman prepares to leave with Andy and Leo, but Cooper then says that they still have to figure out who shot him, which Leo also confesses to. They leave Cooper alone and he addresses another tape to Diane, telling her of his impending return. He says that he feels alone in Twin Peaks for the first time. The Man from Another Place then enters. Cooper says he is off to get a pie from the diner, but then decides to go to bed as the man dances.\nCast\nKyle MacLachlan as Special Agent Dale Cooper\nKevin Nealon as Sheriff Harry S. Truman\nChris Farley as Leo Johnson\nConan O'Brien as Deputy Andy Brennan\nPhil Hartman as Leland Palmer\nVictoria Jackson as Audrey Horne\nJan Hooks as Nadine Hurley and the Log Lady\nMike Myers as the Man from Another Place\nExternal links\nOpening monologue on NBC.com\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}