{"name": "SaveTwinPeaks", "url": "https://twinpeaks.fandom.com/wiki/SaveTwinPeaks", "text": "SaveTwinPeaks\n \n#SaveTwinPeaks was a viral campaign to ensure David Lynch's participation in the Twin Peaks revival following his sudden departure due to contract negotiations.\nHistory\nThe return of Twin Peaks had been greatly anticipated before it was officially announced on October 6, 2014. The initial press release stated the production would consist of nine episodes written by Mark Frost and David Lynch, and directed by David Lynch. The plan was to film all the episodes in the coming year for release in 2016, with a companion book by Mark Frost, titled The Secret History of Twin Peaks, to be released in the fall of 2015.\nOn March 15, 2015, Lynch reported that there were contract negotiation \"complications\" impeding the progress of the production. A few weeks later, on April 5, Lynch abruptly announced on social media that he was pulling out of the production, claiming Showtime was not offering enough money for him to produce the scripts.\nFan and cast response to the announcement was swift. On April 7, an official \"Save Twin Peaks\" social media campaign was launched with a video featuring Sheryl Lee, Dana Ashbrook, Sherilyn Fenn, Mädchen Amick, Peggy Lipton, James Marshall, Kimmy Robertson, Gary Hershberger, Catherine Coulson, Wendy Robie, Al Strobel, and Jennifer Lynch completing the phrase \"Twin Peaks without David Lynch is like...\" along with text-only statements from Grace Zabriskie and Charlotte Stewart. This was accompanied by an official change.org petition to Showtime.\nBehind the scenes, Showtime CEO David Nevins only found out about the contract negotiations turning sour after Lynch's sudden announcement. In response, Nevins and president of programming Gary S. Levine went to Lynch's house and sorted the situation out over coffee and cookies.\nOn May 15, 2015, Lynch announced he was returning to the project. Showtime further confirmed that the series would go further than the initially announced nine episodes. As a result of the delay, Twin Peaks: The Return was delayed for filming until fall of 2015 with release in May 2017, while The Secret History of Twin Peaks was delayed to the fall of 2016. Lynch was later heard remarking in behind the scenes footage that production was extremely pressed for time because of the delay.\nAt Twin Peaks Festival 2015, the cast confirmed Lynch was aware of the campaign and that it had partially influenced his desire to return to the project.\nTwin Peaks premiered on May 21, 2017."}