{"name": "Shelly_Briggs", "url": "https://twinpeaks.fandom.com/wiki/Shelly_Briggs", "text": "Shelly Briggs\n\"That's the kind of girl to make you wish you spoke a little French!\"\n ―Gordon Cole\nShelly McCauley Briggs (known as Shelly Johnson during her first marriage) was a waitress at the Double R Diner, which was owned by Norma Jennings, a friend and motherly figure to Shelly, who dropped out of high school to marry trucker Leo Johnson, who had swept her off her feet by lavishing her with attention. As soon as they got married, it turned out that Leo just \"wanted a maid he didn't have to pay for,\" in her words. Leo was a monstrous home dictator, wife-beater, and dangerous criminal, and he was tangibly connected to Laura Palmer's murder.\nAs of 1989, Shelly was having an affair with Laura's boyfriend, Bobby Briggs, who, like Laura, was still in high school, and besides being a jock, he was something of a known hooligan. Although Bobby did not quite tread on the right side of the law, he was at least kind to Shelly, unlike Leo. The risk of the affair was great and Bobby dealt drugs for Leo and knew just how dangerous Leo was.\nOver the next twenty-five years, Shelly had a daughter named Rebecca, or \"Becky,\" and continued to work at the diner.\nBiography\n\nEarly life\nShelly was the only child born from a dysfunctional marriage. Her parents divorced early in her life, after which, her father left the state.\nShe met Bobby Briggs in elementary school and the two eventually began dating. However, in her junior year of high school, after discovering that he was cheating on her with Laura Palmer, Shelly confronted Bobby at their prom in a disruptive public scene. After this episode, she went to the Roadhouse, where she met trucker Leo Johnson.\nThree weeks later, the couple were married by a local justice of the peace and Shelly dropped out of school. However, during the next two years, Bobby and Shelly secretly renewed their relationship.\nOn a slow day at the diner in February 1989, Shelly watched as Ed and Nadine Hurley came to the diner, the latter storming out upon seeing Norma. Norma asked her to help Laura with her Meals on Wheels delivery, as Heidi had a bloody nose. However, a distressed Laura told Shelly that she was unable to do the Meals on Wheels. After Laura suddenly left, Shelly went back in to tell Norma, who had her make the deliveries since the diner was having a slow day.\nLater, Leo lectured and abused her, whilst trying to wash the kitchen floor. Bobby called Leo and Shelly overheard that he owed him $5,000.\nLaura Palmer's murder\nShelly was at work on the morning of February 24, 1989 and she asked fellow waitress Heidi why she was late to work. Heidi claimed she could not get her car started and Shelly finished this thought with \"too busy jump-starting the old man, huh?\" Which caused Heidi to giggle as she heads to the kitchen. Bobby Briggs offered to take her home on his way to football practice, which she accepted. She left the diner with Bobby and out to his car, where he said that he thought Norma suspected their secret relationship, but she said she probably did not.\nThey drove to her house, drinking as they went until Bobby spotted her husband's, truck after she said he was out of town. Bobby backed up and dropped her off away from her house.\n \nLater, while watching news coverage over the murder of Laura Palmer, she sat with Leo, who was examining cigarettes in their ashtray and noted that there were different brands. When he questioned her on the matter, she said she just smoked whatever she could find, so he insisted she smoke one brand from then on and threatened her if she did not listen.\nThe next morning, Shelly left her house, ready for work, and went over to Leo, who was cleaning his truck. She said she had finished doing laundry, but he gave her a pile of dirty clothes to wash and told her to do it immediately. She took the clothes to their washing machine but found a bloody shirt among them. When Norma arrived to take her to work, she hid the shirt. Before she left, Leo told her that he may come to the diner and to save him a piece of pie.\nShe later served coffee to Sheriff Harry S. Truman and FBI Special Agent Dale Cooper, the former suggesting the latter to try the diner's cherry pie, which Shelly said to be the \"best in the tri-counties.\" Truman then asked her if he could speak to Norma.\nShe later went home where Leo was waiting for her and questioned her about his shirt that she hid. He then beat her with a sock stuffed with a bar of soap.\nIn the morning, she turned off the television showing Invitation to Love when Bobby showed up. She reluctantly let him in, but he saw where Leo had beaten her. He declared that if Leo did it again, he would kill him.\nShelly attended Laura's funeral, where Laura's father, Leland broke down and threw himself onto Laura's casket. Shelly later made fun of this to customers at the diner.\nShe came home to Leo, who angrily left the house, not telling her where he was going. She took a pistol from her purse and hid it in a drawer.\nThe next day, Shelly sat on Bobby's lap at her home, kissing him and said that Leo was with Jacques Renault. He told her about the drug operation run by Leo and Jacques, and that Laura had bought cocaine from them. Shelly then showed him Leo's bloody shirt and he happily said that the shirt could be the \"answer to prayers.\" She then showed him her gun.\nShe later went to work, venting to Norma about her problems with Leo. Norma then suggested they have a beauty day together. After Norma received a call, she tells Shelly that her husband, Hank had made parole.\nThe following morning, Shelly made breakfast for Bobby, who then played out a scenario in which he threatened Leo's life if he harmed Shelly again. Bobby hid when Deputy Andy Brennan came to the door, asking about Leo and the sheriff's department's interest in speaking to him. Shelly said that she overheard an argument about Laura between Leo and Jacques. Andy left and Bobby came back out from hiding, having listened in on the conversation. They shared a romantic moment but were interrupted by a call from Leo, who asked if there was anyone looking for him, but Shelly did not say there was. He said he was coming home soon and Bobby placed the gun in her hand.\nAfter devoting much of the day to beauty with Norma, she came to work with her and they were stopped by Hank, freshly released on parole. Shelly left them alone.\nLater that night, Shelly lit a cigarette with her stove, nervously awaiting Leo's inevitable return. Leo came in, all bloody, commanding her to get him a beer. She tried to ask him what happened, but he pushed her down and she drew her pistol. When he came closer to her, she shot him.\nIn the morning, Shelly welcomed Bobby to her home, upset after shooting Leo. She expressed that she thought Leo was outside, waiting to kill her and told Bobby what happened leading up to her shooting him. Bobby then promised he would take care of Leo.\nLater at work, Hank told Shelly about prison life. She then overheard a conversation regarding Hank's parole when Sheriff Truman arrived. She then offered Cooper a cup of coffee.\nThe following day, she washed her hair in the kitchen sink at her home, placing her pistol next to her. Her eyes were stung by her shampoo and she reached for her towel, which was not where she placed it. Realizing she was not alone, she reached for her gun, but was grabbed by Leo and taken to the Packard Sawmill, where she was tied up. Leo showed her a bomb and told her that Bobby would be dead by the time it went off in an hour. She was found by Catherine Martell just before the bomb went off, sparking a fire. Catherine cut her free and took her by the hand as part of the roof fell in.\nLeo's recovery\nHaving been hospitalized with smoke inhalation, she sobbed about Bobby the next morning, believing him to be dead. However, she was overjoyed when she was later visited by him. They talked about Leo, who is also in the hospital, having been shot. She told him about what Leo did to her the previous night and Bobby then left and expressed his love for her. She was later visited by Norma, who promised to bring her food instead of making her eat from the hospital's appalling menu.\nThe next day, with Doctor Will Hayward, she observed Leo, who had a bullet lodged in his spine and was possibly paralyzed. Hayward said that Leo's comatose state could be contained, but he did not know when he would improve.\nAfter her release from the hospital, she sat with Bobby in his car, discussing a plan to live off of disability checks for Leo, but she was resistant, not wanting Leo to be home in any condition.\nShelly went to the sheriff's station the next day to give her statement on Leo but did not wish to say anything against him, so Cooper let her go.\nA couple of days later, she watched as Tim Pinkle demonstrated a Port-O-Patient for her and Bobby for use with Leo. However, the machine proved to be unsafe. She took Bobby aside to ask how their situation was before she went to meet Leo's lawyer. He reassured her and they went outside, leaving Pinkle in the Port-O-Patient.\nShe attended the hearing held on behalf of Leo, who was determined to be not competent to stand trial.\nShelly stood in her home with Bobby the next day with insurance representative Tom Brockman, who admired their choice to take care of Leo in the home. However, they were dismayed to find out that they would only receive $700 in insurance every month rather than the $5000 they expected.\nThey later threw a party for Leo's return and for the first time expressed their relationship in front of him. However, she was frightened when Leo moved while they kissed.\nBobby determined that Shelly only had $42 to live on for the month. Leo began to scream, then spat and said, \"New shoes.\" Bobby asked what this could mean and Shelly mentioned a pair of boots Leo had repaired the previous week.\nShe later tearfully told Norma that she had to quit her job at the diner to take care of Leo. Norma reassured her that there would always be an opening for her. Ed and Nadine then entered, the latter having reverted to an 18-year-old state of mind. She brought out a coffee for Ed and a milkshake for Nadine, which Nadine broke.\nAfter attempting to feed Leo the next day, Shelly went to Bobby, who said he had decided to pursue a business career and will earn enough money for them to get by. Several days later, she watched Bobby put on one of Leo's suits to go meet with Benjamin Horne for this career. She requested Bobby to take her out later that night, but they did not know what to do with Leo. Bobby assured her that his business with Horne would make them financially secure.\nShe brushes Leo's teeth later as the phone rang. She reluctantly answered the call from Bobby and noticed that Leo was moving.\nA few days later, Shelly fed Leo and was angered at Bobby, as it was his turn to take care of him. Bobby got up and left for the Great Northern Hotel, much to Shelly's anger. At night, the power at her home fluctuated, and she found Leo's wheelchair to be empty, then saw that he was standing and grinning at her.\nShe moved through the house, calling for Leo as the lights pulsed. He threw a bottle at her, which shattered against the fridge and she ran for the door, which she could not manage to open. She cried for help and darted for the backdoor but was hit by Leo's wheelchair. She took a knife from the kitchen drawer and swore she would kill him. She tried to cut through the plastic over the house's unfinished wall, but he picked her up and threw her across the room. She heard Bobby asking for her as Leo picked up an ax. Bobby came and tried to disarm him, but was pinned against the wall with the ax's handle. Shelly managed to find the knife she was using and stabbed Leo in the leg. He escaped from the hole she had cut in the plastic.\nShelly and Bobby went to the station, where they spoke with Agent Cooper and Sheriff Truman about the attack. When questioned about his reason for being at the Johnson home, Bobby openly admitted his and Shelly's relationship. Truman told Shelly that he would assign deputies to keep watch on her home, and she went to the diner to get her job back.\nReturn to work\nDuring her first day back at work, Shelly asked Norma about her sister, who had left a convent and was to arrive in Twin Peaks the next day. Norma found an envelope with Shelly's name on it and gave it to her. She opened it, finding a torn part of a poem and an invitation to the Roadhouse later that night. Ed then came in and embraced Norma, asking her to marry him. Shelly headed to the kitchen to let the two lovers have a private moment.\nShe went to the Roadhouse, where she saw Donna Hayward and Audrey Horne, who also had pieces of the torn-up poem she received.\nThe next morning, Shelly met Norma's sister, Annie, and then went to give Major Garland Briggs his bill.\nLater, Norma showed her an advertisement for the Miss Twin Peaks Contest, but Shelly did not wish to participate. She brought out a man's order, who encouraged her to participate.\nThe next day, she heard her name yelled by Cooper, who was having breakfast with his superior, FBI Regional Bureau Gordon Cole, who came over to admire her beauty with a loud voice. Shelly asked him not to shout and he responded that he could hear her, despite being nearly deaf. Flattered, she served him a pie.\nShelly later asked Annie about the difference between her life then compared to her time in the convent and teased her about her clear chance with Agent Cooper.\nMiss Twin Peaks pageant\nThe following day, Bobby attempted to convince Shelly that she enter the Miss Twin Peaks Contest, as he believed beautiful people always got what they wanted. After Bobby left, she recited the poem sent to her, which Agent Cooper overheard and asked to see it. She handed over her part of the poem and he kept it.\nShe later went to the Roadhouse with Bobby and Donna to try out for the contest but worried that she would not be capable of making a speech. Bobby reassured her, saying he would write it for her.\n \nBack at the diner, Gordon told her impressive stories of his career when Cooper and Annie arrive, hand-in-hand, joining them. Cole turned to her and told her that he would be leaving soon and would regret it for the rest of his days if he did not kiss her. They prepared to kiss and were interrupted by Bobby. Gordon told Bobby that he was \"witnessing a front three-quarter view of two adults sharing a tender moment,\" and then he kissed her.\nThe following day, Shelly went over her speech with Bobby, who then expressed that he had not been good to her lately and seeing her kiss Cole made him realize this and that he loved her. She then received an urgent phone call from Agent Cooper. She was called to the sheriff's station, where Cooper went over the poem received by Shelly, Audrey, and Donna. She told him about a $10 tip she received for a cup of coffee. Upon closer examination, she realized that the poem was in Leo's handwriting. Cooper told the girls to then check in with the Sheriff's Department twice a day.\nNorma made pies for the Contest the next day and told Shelly and Annie that she expected to see one of them win. The two of them teased her about which one of them she would vote for. After Annie won the title of Miss Twin Peaks that night, chaos ensued.\nThe next morning, Shelly and Bobby watched Bobby's parents eating breakfast as happy husband and wife. He declared that he thought he and Shelly should get married. A few days later, Leo was found dead in a cabin in the nearby woods, shot five times by an unknown assailant. After an \"appropriate\" mourning period, Shelly and Bobby resumed their relationship, now a publicly known couple.\nLater life\nAlmost one year to the day after Leo's body was found, Shelly married Bobby during a weekend trip to Reno, Nevada. Seven months later, Shelly gave birth to their daughter, Rebecca McCauley Briggs. Bobby's mother and Norma Jennings co-signed a loan to allow the couple to buy their first home, and continued to provide moral and financial support.\nOver the next twenty-five years, however, the marriage crumbled and ended in divorce some years later. Their daughter \"Becky\" eventually married Steven Burnett. \nIn a Q&A, Mark Frost stated that Shelly and Bobby \"raised Rebecca together but slowly grew apart, as young couples often do. Amicable divorce, shared custody. Shelly's weakness for \"bad boys\" never went away, but infidelity was not the root cause for their breakup.\"\nOver the course of these twenty-five years, Shelly remained working as a waitress at the Double R Diner under Norma's employ. In 2016, Shelly started dating Red, who unbeknownst to her, was an international drug trafficker.\n \nOne evening, Shelly discussed her worries about Becky with her friends Hannah and Renee at the Roadhouse, where she also spotted Red across the room. When Hannah noticed James Hurley watching Renee in the crowd, Shelly assured them that James was \"still cool.\"\nBecky later came to the diner, asking Shelly for money for the third time in two weeks, as noted by Norma, who urged Shelly to help her daughter rather than continue to enable her.\nOn another day, customer Miriam Sullivan left a tip that Shelly and Heidi both agreed she could not afford, so the two waitresses planned to repay her as a token of their appreciation.\nBecky later called Shelly, asking for her car in a panicked state. Upon reaching Steven and Becky's trailer, Becky came out with a gun and got into the car, beginning to drive with Shelly on the windshield until she was flung off. Shelly got a ride from Carl Rodd back into town and got in touch with Bobby on the way. That night, she met with Bobby and Becky at the diner, discussing Becky's situation with Steven and insisting that she wasn't safe around him. Soon, Red showed up and Shelly embraced him and made plans to meet him later. Upon returning to the table she noticed Bobby and Becky staring at her with concern, but before she could say anything a shot was fired at the diner, forcing everyone inside to dive for cover while Bobby ran outside to investigate.\nBecky later called Shelly, worried about Steven, who had been absent for two days. Shelly then invited her to come to the diner for pie.\nShe later served coffee to a depressed Ed, but she looked on in glee as he and Norma embraced and agreed to marry after the latter broke off her business partnership with her boyfriend, Walter Lawford.\nBy September 2017, a warrant had been issued for Steven as a suspected accomplice in an international drug-ring that prominently involved Richard Horne and Deputy Chad Broxford and Steven had gone missing. The timely intervention of Shelly and Bobby appears to have spared their daughter, Becky, any lasting legal trouble.\nIn a Q&A, Mark Frost stated that warrants were eventually issued for Red's arrest, but \"as of this writing\" he remained at large. This development would assuredly put an end to Shelly and Red's dalliance.\nNon-canon appearance\n\nGeorgia Coffee Commercials\nShelly offers coffee to Ken and Agent Cooper, but the latter rejects this for a can of Georgia Coffee. She then gives Ken an origami swan that was left for him by \"a beautiful woman.\"\nBehind the scenes\nShelly is played by American actress Mädchen Amick, who returned in the 2017 revival. Amick originally auditioned for the role of Donna Hayward, but she was so liked that the character of Shelly was created specifically for her.\nIn the original script for the pilot episode, the character was known as Shelly Simpson. In The Secret Diary of Laura Palmer, her first name is spelled \"Shelley.\"\nWhen Amick discovered Shelly and Bobby were no longer together in the 2017 revival, she was heartbroken and tried to change David Lynch's mind about the story, to no avail. She then snuck in Shelly and Bobby's wedding ring on a necklace as her own backstory: \"I wanted to wear our ring around my neck to show that there's something in Shelly's heart that hopes that they can get back together one day. That Bobby was something very special to her, and she wasn't willing to completely let it go yet.\""}