{"name": "Steven_Burnett", "url": "https://twinpeaks.fandom.com/wiki/Steven_Burnett", "text": "Steven Burnett\n\"Look at me. I'm a high school graduate.\"\nSteven Burnett was the drug-addled and unstable career miscreant husband of Becky Burnett, with whom he lived at the New Fat Trout Trailer Park in Twin Peaks, Washington.\nBiography\nSteven was involved in an off-again, on-again affair with Gersten Hayward and had become her primary source for narcotics. Their relationship both preceded and overlapped his marriage to Becky.\nSteven was unsuccessfully looking for work for several weeks. He submitted his resume to Mike Nelson's office, but Nelson informed him that his resume was the worst he had ever seen and his forms were filled out incorrectly, and told him to leave. Later in the day, Steven drove Becky to the Double R Diner for a bread delivery, and so that Becky could borrow more money from her mother. Steven, lying that the interview had gone well, gave her the last of their drug and promised to take her to dinner.\nAt their trailer, Steven exploded at Becky over a comment about his failure to find a job, throwing her onto a couch and nearly striking her. He shouted that he knew about something she had done.\nSteven had resumed his affair with Gersten, and escaped her apartment just before Becky showed up, and fired shots at the door. Later, Becky told her mother that Steven hadn't come home in two days.\nHe and Gersten, seemingly under the influence, went to the woods behind the trailer park, where they sat against a tree and he held a gun, distraught over something he had done. She tried to console him, insisting that it was \"her\" fault and that he had been stoned. Steven ranted about what might happen if he killed himself, wondering if he would be like \"the rhinoceros\" or \"the lighting in a bottle,\" or just \"turquoise.\" They were interrupted when Cyril Pons approached them, walking his dog. Gersten jumped up and ran around the tree, while Pons turned and fled. Gersten listened, horrified, as Steven fired his gun.\nAs of September 2017, Steven's whereabouts were still unknown, and a warrant had been issued for his arrest as a suspected accomplice in a regional drug ring that prominently involved Richard Horne and Deputy Chad Broxford.\nBehind the scenes\nAlthough \"Part 15\" possibly implies that Steven shot Becky, this is not the opinion of co-creator Mark Frost, stating, \"Steven did not kill Becky.\" Frost briefly writes of Becky's post-series fate in The Final Dossier."}