{"name": "Sylvia_Horne", "url": "https://twinpeaks.fandom.com/wiki/Sylvia_Horne", "text": "Sylvia Horne\nSylvia Horne was the wife of business magnate Benjamin Horne and the mother of Audrey and Johnny Horne.\nBiography\n\n1980s\nOn February 24, 1989, Sylvia sat at the dinner table with her daughter as her son banged his head against a dollhouse. Frustrated, she told Johnny's nurse to explain that Laura Palmer would not be coming to tutor him that day, as she had been murdered.\nTwo days later, she silently had dinner with her family until her brother-in-law Jerry arrived, who tried to kiss her, which frustrated her.\nThe next day, she argued with her husband about their son.\nA month later, Sylvia went to the Hayward home and became upset that Ben had re-opened the wounds of his affair with Eileen Hayward from years ago. Will Hayward punched Ben, causing him to slam his head into the fireplace.\nIn the following years, Sylvia helped raise Audrey's son, Richard. She eventually divorced her husband Benjamin, moving to a \"McMansion\" in an upscale neighborhood of Twin Peaks.\n2010s\nIn late 2016, Johnny ran through their home head-first, while Sylvia shouted after him and Mary. Sylvia rushed downstairs after him to find, to her horror, that he had smashed into a wall.\nSylvia's grandson, Richard, later came to her home, demanding money. When she refused, he began to strangle her until she gave him the combination to her safe, which he emptied in addition to stealing her purse. She later reported the incident to Ben, who refused to reimburse her for the robbery or give her \"any more money.\" Sylvia then threatened to call her lawyer and hung up.\nBehind the scenes\nSylvia was played by Jan D'Arcy, who reprised the role in the 2017 revival.\nThe character does not appear in Twin Peaks: Fire Walk with Me, but she does appear in a scene in the original script. The scene is of Johnny's birthday party, during which she has a minor argument with Ben about Johnny wanting to have the party in Ben's office. In the same scene, she becomes upset over Ben having a picture of Laura in his office, but not either of his own children."}