{"name": "Tammy_Preston", "url": "https://twinpeaks.fandom.com/wiki/Tammy_Preston", "text": "Tammy Preston\nTamara \"Tammy\" Preston (also known by her initials TP) was an accomplished FBI agent who accompanied Gordon Cole and Albert Rosenfield to South Dakota to investigate the strange reappearance of their long-lost colleague, Dale Cooper. During the course of this investigation, Preston became the first new member of the Blue Rose Task Force since its founding.\nBiography\n\nEducation\nPreston attended George Washington High School and made the school's honor roll. In college, she majored in English. Subsequently, she attended the Massachusetts Institute of Technology and made the dean's list. Preston graduated from the FBI Academy as the valedictorian of her class. Her early accomplishments gained the attention of the secretive Blue Rose Task Force, who deemed her a promising potential recruit.\nWith the Blue Rose Task Force\nIn September 2016, Preston presented crime scene photos of the deaths of Sam Colby and Tracey Barberato to Deputy Director Gordon Cole and Agent Albert Rosenfield. One of the photos included a figure recorded within a glass box in the room just prior to the deaths of Colby and Barberato. Before Preston could finish her presentation, Cole received a call concerning missing Special Agent Dale Cooper, prompting him and Albert to go to his office with Preston in tow. Upon learning Cooper's location, Cole asked Preston to accompany him and Rosenfield to meet with Agent Cooper.\nPreston accompanied Cole and Rosenfield to a federal prison in South Dakota, where Cooper was being held. During an interview, Cooper claimed to have been working undercover with missing agent Phillip Jeffries and had been on his way to debrief with Cole when he had his car accident that led to his incarceration. Outside the prison, Preston questioned the identities of Jeffries and Cooper, apparently recognizing their names from the Dossier. However, she was dismissed by Cole and Rosenfield as she was wearing a wire, despite her protests that Cole had told her to wear it.\nShe later examined Cooper's file and compared his fingerprints from before his 1989 disappearance and from his booking at the federal prison. Troubled, she quickly left her desk. On a flight to South Dakota with Albert, Gordon, and Cooper's former secretary Diane, Tammy presented her findings, revealing that though the fingerprints were identical, someone at the prison had to reverse the images to get a match, meaning the man at the prison's fingerprints were the exact opposite of Agent Cooper's. Gordon praised her work and gave her a hint as to what direction he speculated the investigation was going in.\nLater, while escorting Diane to meet with Cooper, she expressed the FBI's gratitude at her cooperation, only to get cursed out by Diane.\nOn the flight back to Philadelphia, Preston received a call from Air Force Colonel Davis and put Cole on the line. Cole was informed that the body of Major Garland Briggs was found in Buckhorn, South Dakota, thus re-routing the plane. Preston then transferred another call to Cole, this time from Warden Dwight Murphy, who stated that Cooper had escaped from prison.\nThey reached Buckhorn, where they were shown to Briggs' body, which Albert noted to be too young. Detective Dave Macklay told them that the body was found in bed with the severed head of Ruth Davenport, who – along with William Hastings, the prime suspect in her murder – had an interest in alternate dimensions.\nPreston questioned Hastings, who identified a photo of Briggs as the Major he met in an alternate dimension and gave him coordinates before he floated up, speaking Cooper's name.\nShe later watched with Gordon as Albert had dinner with coroner Constance Talbot. Following this, she brought a photo to Albert and Gordon of the glass box present at the scene of Sam Colby and Tracey Barberato's deaths. The photo showed Cooper and another man with the box.\nHastings led them to where he had claimed to have entered \"the zone.\" Preston stood guard as Albert and Gordon investigated, confirming Hastings' account just before he suddenly died in the back of Macklay's car.\nTammy was later quietly informed by Cole and Albert about Project Blue Book and the Blue Rose cases that were subsequently established with a task force headed by Agent Phillip Jeffries and included personnel such as Cooper, Albert, and Agent Chester Desmond. She agreed to join the task force.\nAlbert explained to Tammy the first Blue Rose case, which was assigned to Cole and Jeffries in 1975. The case concerned a woman named Lois Duffy, who had appeared to have killed a person identical to herself. The victim stated, \"I'm like the blue rose,\" which Preston figured to mean that the identical woman was not natural, a reference to actual blue roses, as they do not occur in nature.\nCole entered followed by Diane, who, after being told the significance of Major Briggs in the investigation, stated she recognized the names on a ring found in the Major's stomach – her half-sister and brother-in-law, Janey-E and Dougie Jones, who lived in Las Vegas. Tammy then connected Cole to the FBI in Las Vegas so he could tell them that the Joneses were wanted in connection to a double murder.\nAfter Diane left, Cole informed Tammy and Albert that he had been in contact with the Twin Peaks Sheriff's Department, who came across Laura Palmer's diary, which indicated the existence of two Coopers. He then recalled a dream he had the previous night about Monica Bellucci, in which he saw himself on February 16, 1989, amid a brief re-appearance of Phillip Jeffries. He noted that Jeffries had pointed to Cooper and asked who he thought he was.\nDiane later met with Tammy, Gordon, and Albert to recount the evening she last saw Cooper. After describing the events that took place, Diane became upset and drew a gun from her purse. Tammy and Albert reacted in time, drawing their guns and shooting Diane, who then disappeared, prompting Tammy to note that Diane was actually a tulpa. While the agents were recovering from what they had just witnessed, Cole received word from Las Vegas that Dougie Jones was, in fact, Agent Cooper. Upon researching him, Tammy reported the destruction of Dougie's car and attempted assassination by Ike \"The Spike,\" as well as how he electrocuted himself by sticking a fork in a wall socket. Tammy then joined Gordon and Albert to the town of Twin Peaks, in time to witness the real Agent Cooper's final speech to his friends from Twin Peaks and his reunion with the real Diane. As he finished his speech, the lights began to go dark. Gordon, Diane, and Cooper suddenly disappeared before their very eyes, only for Gordon to return a short while later reporting they had been in the boiler room of the Great Northern Hotel. Cooper and Diane were gone, apparently never to be seen again.\nThe dossier\nCole assigned Preston to review a dossier concerning the town of Twin Peaks that was recovered from the basement of Ruth Davenport's building, with the assignment to discover the identity of the person who compiled it. In addition, she was given access to all of Special Agent Dale Cooper's files from his 1989 investigation of the murder of Laura Palmer, as Cole found that they may help her identify the Archivist.\nAfter reviewing and annotating the dossier, Preston determined that the Archivist was Major Garland Briggs of the United States Air Force, who was continuing the work of his predecessor, Lieutenant Colonel Douglas Milford.\nThe Secret History of Twin Peaks is implied to take place before the events of Twin Peaks (2017), as Preston has limited knowledge of the individuals covered in the dossier. The opening statement by Gordon Cole to Tammy Preston specifically notes how the Archivist's dossier was found on July 17, 2016, several months before most of the show's present-day events. Inexplicably, however, The Final Dossier reveals that it must have occurred after the series, as the dossier itself was found \"weeks\" after Davenport's body was discovered. This revelation could however be explained as a new version of events unfolding within the present day as a result of Cooper's actions in saving Laura Palmer, thus making it appear that the dossier was found before Davenport's death at a different crime scene before Cooper's alteration of past events.\nThe new \"Archivist\"\nAfter the bizarre confrontation at the Twin Peaks Sheriff's Department, Cole assigned Preston to remain in Twin Peaks for a follow-up investigation. She spent several weeks in town interviewing the various residents and learning what had transpired in the years since Agent Cooper's first visit. Among other things, Preston visited Annie Blackburn at a private psychiatric hospital in Spokane and interviewed Benjamin Horne. By letter, she corresponded with Donna Hayward, who had relocated to Vermont to assist her father's practice. Preston was unable, however, to find any current information on Audrey Horne since her reclusion, though she noted a disturbing rumor that Audrey was in a private care facility.\nAs her investigation continued, Preston noticed an odd anomaly in a Twin Peaks Post back issue from March 1989: a claim that Cooper came to Twin Peaks to investigate the \"disappearance, still unsolved, of local teenage beauty queen, Laura Palmer.\" Startled, Preston began looking through all the corresponding police records and discovered they all referred to the disappearance, not the murder, of Laura Palmer. She questioned the various relevant parties, including the Twin Peaks police and Ronette Pulaski, and although some seemed confused by this, all agreed this was how the events happened. Disturbed by the apparent change in events since she began her research, Preston herself began to feel her memory of the circumstances grow fuzzy, and abruptly ended her investigation to return to Philadelphia.\nPreston penned her final remarks on the plane ride home, observing that the effects on her own memory seemed to be fading with every passing mile. She submitted her final report and collected files to Director Cole on September 9, 2017.\nPersonality\nPreston shared many of the same investigative skills and quirks characteristic of other agents who previously worked directly under Cole, such as Chester Desmond and Dale Cooper, including a penchant for identifying the smallest details and a love of coffee. Her notes while annotating the dossier characterize her as highly skeptical, often using her notes to refute some of the more fantastical elements of the dossier and suggesting alternative explanations. As she read through the dossier, she became increasingly intrigued by all of the connections the Archivist made, and grasped at reasonable explanations. She appeared to hold Gordon Cole in high regard, and was left conflicted by his apparent connection to several of the mysterious events described in the dossier.\nPreston would get carsick, and on the ride to the prison in South Dakota, she was seen with her head leaning out the open window, puzzling her boss.\nBehind the scenes\nTamara Preston was portrayed by musician Chrysta Bell in Twin Peaks (2017), her first major acting role. In the audiobook release of The Secret History of Twin Peaks and Twin Peaks: The Final Dossier, Preston's notes were read by actress Annie Wersching.\nPreston's appearance was designed by costume designer Nancy Steiner based on David Lynch's vision of the character, employing a retro look for her undershirts and tops."}