{"name": "Ted_Morello", "url": "https://twinpeaks.fandom.com/wiki/Ted_Morello", "text": "Ted Morello\nTed Morello was a reporter for the United Press and a part-tme employee of KMO radio.\nBiography\nOn June 22, 1947, Morello picked up the story of Harold Dahl allegedly spotting a UFO, later dubbed the \"Maury Island Incident.\" Morello's reporting of the case brought national attention to it.\nEarly in the morning of August 1, Morello received a call from an anonymous informant, who told him that a B-25 that had crashed overnight had been shot down and to tell Kenneth Arnold and Emil J. Smith \"that the same thing could happen to them.\"\nHe called Arnold, Smith, and Fred Crisman to confirm details about their meeting with Captain Davidson and Lieutenant Brown, who had been aboard the B-25 and to relay the warning given to him by the informant.\nHe later received another call from the informant, who claimed that military personnel had taken custody of Crisman and had boarded him onto an Air Force transport en route to Alaska. Morello called Arnold and Smith about this incident, but they wished to instead discuss the matter in person. They met in a back room of the KMO radio station, where Morello divulged the information of the anonymous call. Morello then warned the men to leave Tacoma until the situation blew over.\nFollowing the crash, some fragments found during the Maury Island Incident were given to Morello for safekeeping and he wrote a story about them. He then sent them to a chemistry professor at the College of Puget Sound for analysis.\nYears later, the widow of Morello's friend Paul Lantz wrote him a letter, detailing an incident that occurred in their home in the fall of 1947. She claimed that she and her husband were visited by men claiming to be FBI agents, who demanded that he cease from publishing stories related to the Maury Island Incident.\nBehind the scenes\nTed Morello (December 15, 1918 – July 15, 2007) was a reporter for the United Press and later the Associated Press of Pakistan and a United Nations correspondent for The Pakistan Times."}