{"name": "Tell_It_Martin", "url": "https://twinpeaks.fandom.com/wiki/Tell_It_Martin", "text": "Tell It Martin\nTell It Martin is the second short film of Impressions: A Journey Behind the Scenes of Twin Peaks.\nSynopsis\nWhat happens in the desert before everything turns back to sand? Why do the machines never stop, constantly pumping their black wetness from the ground? I find metal structures blocking the wind. Dirty children's feet scratch at the clothes. A child's play toy in the middle of the brush. Inside, the man with the gray elevated hair tells the people what to do. The brown-haired woman is next to him again. What does she do? Never knowing where I should get off, I see fire in front of houses where no one lives. Do you ask me anything? Are we there yet?\nIn a production meeting, David Lynch plans out the sequence of Jake driving through Rancho Rosa Estates and planting a bomb on Dougie Jones' car. After a minor disagreement over when to shoot the actual bomb placement, he and Scott Cameron agree to film it the same day as the drive-by.\nOn the day of filming, Lynch decides to wait for the sun to rise more before filming with Sawyer Shipman due to the low temperature. Later, Lynch talks Shipman through walking across the street to look at the bomb, before the punks arrive to scare him away.\nCrew members wheel in a half-demolished duplicate of Dougie's car and set up pyrotechnics for the explosion. Gary D'Amico breaks off the driver's side door and breaks the window, while Lynch explains to the surviving punk how he will flee after the explosion goes off.\nTwo men disappear in a room. One of them has no hair, is nearly half-size of the other. The man with the gray elevated hair comes. It looks like he's looking what's going on, drawing some things on a paper, running behind the small one.\nLAS VEGAS\nChristophe Zajac-Denek arrives on set and greets Lynch, who draws him a schematic of the hallway of Lorraine's office and how the stabbing scene will go. Stunt coordinator Brian Duffy and Zajac-Denek choreograph the stabbing itself. Lynch says the killing should be random and messy, like a \"kindergarten killing.\" While filming, he directs him to really \"slam that fucking thing in there!\"\nWhile on location in Palmdale (Rancho Rosa Estates), Lynch speaks to Jim Belushi on the phone regarding several of Belushi's scenes, including his visit to Bushnell Mullins and the dream Bradley Mitchum mentions in \"Part 11.\"\nIn a meeting, Lynch asks Sabrina Sutherland if they can have three Las Vegas detectives instead of two, and explains that he wants to hire \"the big guy\" to play one. Brainstorming, he decides the new detective, \"Smiley\", will be an idiot savant. On a whim, Lynch decides the detectives should all be named \"Fusco,\" instead of \"Haig\" and \"Fusco\" as in the script. As Sutherland laughs, he decides their first initials will be \"Smiley and the DTs.\"\nThe cars move like ants along an asphalt trail, transporting their owners without disturbing their hair. Only the man with the gray elevated hair can save them.\nThe producers plan the Santino's sequence. Lynch reflects on Martin Luther King, Jr.'s most famous speech, praising the musical quality of the address, and recalls being taken by the woman visible behind King who could be heard encouraging him after a shaky start. Scott Cameron recalls that the woman in question said \"Tell it, Martin!\" Lynch is upset that the Santino's scene will be the first one with Robert Knepper and Jim Belushi.\nOn the day, Lynch first meets Knepper and Belushi and takes them to a booth to apologize for the circumstances of their shooting out of sequence. He explains that the scene is late in their relationship with Dougie Jones, and that at this moment they regard him as \"solid gold.\" Ironically, the next day they will film their scenes with Supervisor Burns, their very first appearance. Knepper asks about their backstory at the orphanage, wondering if they might have had only one parent in common, but Lynch assures them they are brothers, together against the world. \nPeople featured\nTammie Baird\nPhil Bartko\nJim Belushi\nScott Cameron\nLarry Clarke\nGary D'Amico\nGiselle DaMier\nPeter Deming\nBrian Duffy\nEric Edelstein\nIme N. Etuk\nPierce Gagnon\nBrett Gelman\nCori Glazer\nRobert Knepper\nAndrea Leal\nDavid Lynch\nKyle MacLachlan\nDon Murray\nAmy Shiels\nSawyer Shipman\nSabrina S. Sutherland\nBill Tangradi\nGreg Vrotsos\nNaomi Watts\nChristophe Zajac-Denek\nBlake Zingale\nDebbie Zoller\nCredits\nSee: Impressions: A Journey Behind the Scenes of Twin Peaks § Credits\nMusic\n\"DJ Hick\"\n\"Dumpf\"\n\"Woodsmen Scalp\"\n\"Longgrillsam\"\n\"MUDU GRUM\"\n\"Pinched Salt\"\n\"Ping Dorothy Hoch\"\n\"Belushi Call\"\n\"Metal Detector\"\n\"Mudu_slow\"\n\"Tile Downer\"\n\"Santinos\"\nAttribution\n↑ 1.0 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers and Ann-Kristin Mayr and Jason Denner\nProduced by Josef Maria Schäfers\n↑ 2.0 2.1 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers\nProduced by Josef Maria Schäfers\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}