{"name": "Teresa_Banks", "url": "https://twinpeaks.fandom.com/wiki/Teresa_Banks", "text": "Teresa Banks\n\"Diane, as Gordon thought, everything about this has the feel of a serial killing. The question is, is this the beginning of something, or the end?\"\n ―Dale Cooper\nTeresa Mary Banks was an underage prostitute and cocaine addict from Tacoma, Washington who was identified as the first possible victim of a serial killer active in the state. Her body was found in Wind River, wrapped in plastic with a letter \"T\" under her ring fingernail. Similarities between this case and the murder of Laura Palmer a year later led Special Agent Dale Cooper to the town of Twin Peaks, where he believed Teresa's killer had struck for the second time.\nBiography\n\nEarly life\nBanks was born on July 11, 1970 to Tony and Ellen Banks, who died in a car accident when Teresa was twelve, resulting in her becoming a ward of the state. She ran away from a state facility at the age of fifteen.\nDeer Meadow\nBy the age of seventeen, Teresa was a drifter and prostitute, regularly submitting ads to Flesh World, a swingers magazine. In January 1988, a month before her death, she moved to the Fat Trout Trailer Park in Deer Meadow and found work at Hap's Diner. At this time, Teresa took to wearing a gold ring on her left hand. Her supervisor Irene recalled that her left arm went numb for a period of three days.\nIn The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes, Teresa worked at the Cross River Cafe (ten miles outside Deer Meadow) for only three weeks before her murder, and lived in a nearby tourist rental cabin.\nAfter seeing one of Teresa's ads, Leland Palmer met her at the Red Diamond City Motel for sex. Afterward, he placed his hand over her eyes and asked her who he was, and she said she didn't know. They made plans to \"party\" with two girlfriends she had mentioned. On their next meeting, however, Leland was stunned to see that the other two were Ronette Pulaski and his own daughter, Laura. He paid Teresa and quickly left, saying he had chickened out. She went to Ronette and Laura following this, showing her ring to Laura.\nSuspicious of his sudden change of heart, Teresa went to a payphone and called Jacques Renault and asked him what Ronette and Laura's fathers looked like, confirming that the man was Laura's father, Leland Palmer. She lied to Jacques saying it was someone else and thanked him. She hung up, then called Palmer.\n \nBefore Teresa could successfully blackmail Palmer, he murdered her at her trailer on the night of February 9, 1988, bashing her head in with a pipe. By this time, Teresa was no longer wearing the ring.\nIn My Life, My Tapes, Teresa's body was found in a drainage ditch after not showing up to work for five days.\nPost-mortem\nTeresa's body was found, wrapped in plastic, floating in the nearby Wind River. Having no next-of-kin, her body was not claimed by anyone. The case was determined by Gordon Cole to have some possible significance to the Blue Rose Task Force, prompting an investigation by FBI Agents Chester Desmond and Sam Stanley.\n \nAfter arriving in Deer Meadow, Desmond and Stanley conducted an autopsy and determined that Banks died from \"repeated blows to the back of the head by a blunt obtuse-angled object.\" Stanley also discovered the indentation on her finger where she had worn the ring, and a small piece of white paper imprinted with the letter 'T' beneath the nail of her left ring finger.\nHer former co-worker at Hap's Diner, Irene, called her death a \"freak accident\" and mentioned the incident where Teresa's arm lost feeling for several days. In light of this information, Stanley agreed to drive her body to a lab in Portland for further study.\nOn his first night in Twin Peaks a year later, Special Agent Dale Cooper referenced Banks' murder in a town meeting and warned that her killer might also be responsible for the murder of Laura Palmer. However, Cooper's original prime suspect, Leo Johnson, was exonerated of killing Banks, as he had been incarcerated in a Hungry Horse, Montana jail cell on the night she died.\nUltimately, Leland Palmer confessed to killing Teresa, claiming he had been compelled to do so by a possessing demonic spirit called BOB.\nBehind the scenes\nIn the script of Episode 2, her name is \"Theresa\" instead of \"Teresa\".\nTo achieve her mouth shape while in the morgue, Pamela Gidley was given two cotton balls which she held in the back of her mouth. Banks's final make-up appearance on the slab was done by director David Lynch himself, as he was not satisfied with the initial product. Among the details he added was a tattoo on her back, which is not seen in the finished film."}