{"name": "The_Dutchman%27s_Lodge", "url": "https://twinpeaks.fandom.com/wiki/The_Dutchman%27s_Lodge", "text": "The Dutchman's Lodge\nThe Dutchman's Lodge, also known as \"The Dutchman's\" for short, was a former roadside motel in rural western Montana.\nHistory\nThe Dutchman's Lodge was built in the early 1930s by Horace \"The Dutchman\" Vandersant.\" It gained a reputation as a mob- and gangster-friendly establishment, and it was reputed that John Dillinger had spent a week there while on the lam. The lodge closed in 1962 after Vandersant's death and was demolished in 1967. Despite no longer existing, the Dutchman's was accessible via the rooms above a convenience store at the same location, roughly equidistant between Missoula, Montana and Twin Peaks, Washington.\nIn late 2016, Phillip Jeffries was apparently in hiding at the Dutchman's. At gunpoint, Ray Monroe gave up Jeffries' location to Dale Cooper's doppelganger, although he said it wasn't a \"real place.\" A matchbook from the Dutchman's, appearing to be relatively new, was later found on Monroe's body.\n \nCooper traveled to the Dutchman's by walking up the exterior stairs of the convenience store, and then following a woodsman down a long, pitch-black hallway and up a staircase. More of them were waiting in the motel's courtyard, along with a gaunt woman in a housedress, who agreed to unlock the door to room 8 for him.\nInside, one of the walls dissolved to reveal another room containing Jeffries' apparatus. Cooper asked why Jeffries had hired Ray to kill him, but it seemed that the person responsible – the one whom Cooper had spoken to over the radio – might have been somebody else. Cooper then demanded to know who Judy was and if she wanted something from him; Jeffries replied that he had already met her and could contact her himself, showing him a set of numbers that swirled out of his glowing orb. When the phone began ringing, Cooper went to answer it, and suddenly found himself outside the convenience store once again.\nThe gaunt woman stood at the edge of the motel courtyard, staring at Jeffries' door.\nDale Cooper and Mike later passed by the Dutchman's, but took a different route to meet with Jeffries.\nBehind the scenes\nThe Dutchman's exteriors were filmed on October 13, 2015 at the Mt. Si Motel at 43200 SE North Bend Way, North Bend, Washington. The location was previously used for the Red Diamond City Motel in Twin Peaks: Fire Walk with Me."}