{"name": "The_ring", "url": "https://twinpeaks.fandom.com/wiki/The_ring", "text": "The ring\n\"This is the ring.\"\n ―The arm\nAn inscribed gold ring sat on an ornate table in the red room. It had an inset circle, composed of jade or a similar substance, which was inscribed with an insignia from the petroglyph on the wall of Owl Cave. The symbol somewhat resembled two peaks surrounding a central diamond, or an owl in flight.\nThe ring was associated with the arm, who offered it to Laura Palmer in a dream. From the early 1800s, several individuals were observed wearing this ring or ones resembling it.\nHistory\n\n19th century\nIn September 1805, the Corps of Discovery made contact with the Nez Perce tribe in northwestern Washington and treated with their chief Twisted Hair. The chief told Meriwether Lewis about a sacred grove above the nearby falls where several white men lived, and gave him three bizarre artifacts they had given to the tribe. One of these was an inscribed gold ring, which Lewis sketched for President Thomas Jefferson in a dispatch. After visiting the sacred place, Lewis destroyed the map but wrote that he intended to keep the ring. Lewis further reported that Twisted Hair had allowed him to take the ring with him, but at the same time also emphatically warned him to keep the ring in a small leather pouch at all times and to never try to wear it on his fingers.\nAfter Lewis' mysterious death at Grinder's Stand in October 1809, the leather pouch which Priscilla Grinder had seen him worrying the night before his death was found in his possessions, empty. Garland Briggs posited that the traitor Major James Neely had a hand in Lewis' death and speculated that he might have taken the ring for himself, referring to the fact that Neely had been seen by witnesses wearing some of the deceased Lewis' clothes in the days after the governor's death. Briggs also noted that Neely had disappeared under mysterious circumstances shortly after these sightings were reported, and with this any trace of the ring disappeared from known history for over a century.\n20th century\nIn August 1945, L. Ron Hubbard attended a Thelema gathering at the so-called \"Parsonage,\" the Pasadena home of rocket scientist and Thelemite Jack Parsons. During a conversation between the two that Hubbard later recounted for Congressman Richard Nixon, Hubbard noticed that Parsons was fiddling with an inscribed gold ring on his left ring finger, as he expounded on the tenets of Thelema and the nature of alchemy.\nFollowing this, Colonel Douglas Milford met with Jack Parsons on two occasions, to gather intel on him for Project Grudge, the first time on December 3, 1949, and the second time on June 15, 1952, just two days prior to Parsons' mysterious death. Milford, posing as a journalist from a left-wing magazine, was able to get an extensive interview with Parsons both times. During both meetings, Milford noticed that Parsons was wearing a \"jade green ring\" on his right hand. Notably, when Parsons died on June 17, 1952 in what appeared to be an unplanned explosion during a private experiment he was conducting in his apartment, his right arm was by all appearances obliterated in the explosion and no trace it of it was ever found.\nDuring a private meeting with Richard Nixon, now President of the United States, on February 19, 1973, at Nixon's personal compound on Key Biscayne, Florida, Douglas Milford noticed that Nixon was \"wearing a green ring on the ring finger of his right hand.\"\n1980s\nIn early 1988, the ring was in the possession of Teresa Banks, an underage waitress and prostitute living in Deer Meadow. She was photographed wearing it on her left hand. By the night of Banks' murder, however, it had gone missing.\nWhile conducting Banks' autopsy, FBI agents Chet Desmond and Sam Stanley noticed the indentation on Banks' finger where the ring had been, and asked Sheriff Cable if he had found it in her belongings, to no avail. When Desmond returned to the Fat Trout Trailer Park the next evening, he saw Teresa's ring on a pile of dirt beneath the trailer where Mrs. Chalfont and her grandson lived, and reached out to take it. Desmond was soon afterward reported missing.\nIn February 1989, agent Phillip Jeffries mentioned \"the ring\" in relation to Judy and a convenience store meeting, while trying to explain his two-year disappearance.\n \n\"Don't take the ring, Laura. Don't take the ring.\"\n ―Dale Cooper\nThe week before Laura Palmer's death, she and her father Leland were accosted on the road by Mike's host Philip Gerard, who was wearing the ring on his right pinky. He waved it for Laura to see while trying to shout to her that Leland was BOB's host, but she couldn't hear over Leland gunning the engine. She later remembered seeing the ring on Teresa's hand the year before. In a dream, the arm waved his hand over the ring and then extended it to Laura, as Dale Cooper warned her not to take it. When she woke, she was terrified to find it in her hand, but it then disappeared.\nAfter Laura and Ronette were abducted by BOB and brought to the train graveyard in the woods, Mike threw the ring into the train after Ronette escaped. Laura placed it on her hand, causing Leland to scream in despair and exclaim, \"Don't make me do this!\" He then stabbed Laura to death.\nIn March 1989, a \"jade green ring\" was documented among Douglas Milford's belongings following his death the night after his wedding, and apparently returned to his widow, Lana Milford. Some years later, Lana dated a \"notorious resident of a certain eponymous tower on Fifth Avenue\" in New York City. In a photograph of the two taken at a charity event obtained by Tamara Preston, this man appeared to be wearing a green ring on his left ring finger, although the resolution was too poor to verify its identity.\nLater in March 1989, Annie Blackburn emerged from the Black Lodge wearing the ring. While she was being treated, an attending nurse at Calhoun Memorial Hospital removed the ring and, in a reverie, put it on her own finger.\n21st century\nDougie Jones, a tulpa of Dale Cooper, wore the ring on his left hand at the time of his death. Just before he was returned to the waiting room, Jones experienced his left arm going numb and became violently ill. Once there, he began to shrink and the ring fell off his hand. Jones then turned into a black cloud of smoke and shrunk into a gold orb. Mike collected the orb and the ring, returning the latter to its table.\nRay Monroe was given the ring by a man dressed as a prison guard at Yankton Federal Prison. He was ordered by someone claiming to be Phillip Jeffries to place it on the body of Cooper's doppelganger after killing him, as Cooper had something \"inside him\" that \"Jeffries\" wanted.\nAfter tracking down Ray at the farm, the doppelganger ordered him to put on the ring, and then shot him after obtaining Jeffries' location. The ring disappeared, then landed on the floor of the waiting room. Ray's corpse later appeared there as well, and Mike once again placed the ring back on its table.\nFollowing Dale Cooper's return to full consciousness, Mike appeared before him. Mike revealed that the doppelganger was still at large in the world, and then gave the ring to Cooper. Cooper hid the ring beneath his pillow just as Janey-E and Sonny Jim Jones arrived.\nAt the Twin Peaks Sheriff's Department, Lucy Brennan shot and apparently killed Cooper's doppelganger. The real Cooper placed the ring on his doppelganger's finger, transporting both doppelganger and ring to the waiting room.\nOwners\nChief Twisted Hair, 1800s\nMeriwether Lewis, 1805–1809\nTeresa Banks, 1988\nPhillip Gerard, February 1989\nLaura Palmer, February 1989\nAnnie Blackburn, March 1989\nB. Roundtree, March 1989\nDougie Jones, September 2016\nRay Monroe, September 2016\nDale Cooper, October 2016\nUnverified\nJames Neely, 1809\nJack Parsons, August 1945\nRichard Nixon, August 1974\nDouglas Milford, March 1989\nLana Budding Milford, March 1989–1990s\nUnidentified Fifth Avenue resident, 1990s\nBehind the scenes\nIn Twin Peaks (2017), the ring seemingly serves to transport individuals, both living and recently deceased, to the red room upon death. This happens to both Ray Monroe and Cooper's doppelganger."}