{"name": "The_Man_with_the_Gray_Elevated_Hair", "url": "https://twinpeaks.fandom.com/wiki/The_Man_with_the_Gray_Elevated_Hair", "text": "The Man with the Gray Elevated Hair\nThe Man with the Gray Elevated Hair is the first short film of Impressions: A Journey Behind the Scenes of Twin Peaks.\nSynopsis\nI was sent to locate the man with the gray elevated hair. I traveled very far and for many months. Plants grew like hairstyles on the dried skin. I saw many landscapes on my journey. I saw black cables on long poles over the ground, always further to the point where nothing ends. Someone goes by slowly.\nI wondered what he's doing with all the people who are with him. They are speaking strange sentences and using strange equipment. Floating over white boxes, following my gray shadow against the measured lines, I wonder to myself: \"Are there still places where no footprints can be found?\"\nBASE CAMP\nKyle MacLachlan and Sheryl Lee, in full costume, join David Lynch in his trailer. Lynch shows them a reference shot of Laura Palmer from Fire Walk with Me and explains the scene they will film between them in the woods. (\"Part 17\")\nI see the spine of a sleeping dragon. Can you see it? Something is moving in the forest. Underneath, people stand rigid like trees. The nervous man with the silver face is running and falling, out of the dark, into the green.\nLynch greets David Patrick Kelly on his first day on location, joking that they both look exactly the same. Kelly recalls Lynch telling Harry Dean Stanton about yogis leaving their bodies before filming Stanton's death scene in Wild at Heart, then asks if he has similar advice for today's scene. Lynch explains that Jerry is lost and looking for \"the answer,\" and he is single-mindedly rushing to find it. They film several of Horne's scenes in the woods. (\"Part 12\")\nNearby, Lynch oversees construction on the golden pool of oil near Jack Rabbit's Palace, preparing to film the scene of the sheriffs finding Naido. He explains to Nae Yuuki how Andy will find and comfort her, as she moves her neck like a \"little animal\" and starts \"talking mechanical.\" Lynch then walks through the sequence of the sheriffs finding her and seeing a vortex in the sky, including Bobby Briggs doing a \"yellow-mouthed scream.\" (\"Part 14\")\nLynch steps away to film Jerry Horne's attempts to find cell reception. (\"Part 7\") He is dismayed to find that their buyer was unable to find the Fix-All he requested, instead coming back with \"Plaster of Paris, bullshit!\" The crew mixes the gold substance to pour into the pit.\nDuring a break, Kelly performs \"The Lass of Aughrim\" to much applause.\nFurther against the direction of the water, bright light shines on the face of a young woman. A mother twists herself inside the bottle, smashing her face into the carpet. Talking quietly in the corner, he tells her of the plan. Does the man with the gray elevated hair belong to her?\nAt the Palmer house location, Lynch, in a very low voice, talks Grace Zabriskie through the scene of Sarah Palmer watching a nature show. He explains an idea for another \"pretty strange\" scene he just came up with:\n\"You sense it's in God's hands. And you might, you know, you might make a noise, like 'Fuck!' you know, like you're out of stuff. And then you'll get up and go in the other room, we'll stay there. And you'll go in, you're rustling through some empty bottles. And you drink that but it's not enough. And then you'll leave the room, and, next thing you know you're on your way to the bar.\"\n\"Okay, the third thing is: you're on your hands and knees. You've got the picture of Laura Palmer. And it's on the rug... and you're sort of screaming at it. And you hit it with the bottle and break it.\"\n\"Those three things. Okay. I love you so much.\"\nThey set up to film the nature show scene, Lynch describing the particular way Sarah sits and drinks. (\"Part 2\")\nDuring a smoke break, Lynch explains Audrey Horne's emotional state and relationship with Charlie to Sherilyn Fenn as they prepare to film their extended argument. (\"Part 12\") Fenn jokes that Audrey is giving Charlie \"the business\" like she gave Lynch the business, and comments that Audrey seems like a child-woman, switching back and forth between personalities. Lynch says the dream Audrey had about Billy is predominant in her thoughts. She asks what \"papers\" she threatens Charlie with; he demurs, but says it could refer to a divorce contract, and suggests that \"Paul\" would \"kick his ass\" if she went to him.\nNothing stands in the way of the curious view now. I see, in the end, everything looks the same. Why is the headless body sleeping on the table? Are these the last thoughts of a free-standing mind?\nAt the \"Part 18\" motel location, Lynch walks MacLachlan and Laura Dern through their first scene inside the motel room. They laugh at his direction to \"kiss hot.\" Lynch comments on how strange it is to be working with both of them twenty-five years after their collaboration on Blue Velvet. Lynch tells the crew particular shots to get for the sex scene that follows.\nPeople featured\nDana Ashbrook\nScott Cameron\nPeter Deming\nLaura Dern\nSherilyn Fenn\nRobert Forster\nCori Glazer\nHarry Goaz\nMichael Horse\nDavid Patrick Kelly\nSheryl Lee\nDavid Lynch\nKyle MacLachlan\nJohn Sclimenti\nSabrina S. Sutherland\nNae Yuuki\nGrace Zabriskie\nCredits\nSee: Impressions: A Journey Behind the Scenes of Twin Peaks § Credits\nMusic\n\"Atmo27\"\n\"Sunday Morning\"\n\"Nosin is to late #1\"\n\"Nosin is to late #2\"\n\"MUDU lo #1\"\n\"Banchi Man\"\n\"YoumeMudu\"\n\"The Lass of Aughrim\"\n\"Evel Knievel's Knees #1\"\n\"Mudu_slow\"\n\"Flying Mudu\"\n\"Malantata\"\n\"Juhiju\"\nAttribution\n↑ 1.0 1.1 1.2 1.3 1.4 1.5 1.6 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers and Ann-Kristin Mayr and Jason Denner\nProduced by Josef Maria Schäfers\n↑ 2.0 2.1 2.2 2.3 2.4 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers\nProduced by Josef Maria Schäfers\n↑ Performed by David Patrick Kelly\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}