{"name": "The_Secret_History_of_Twin_Peaks", "url": "https://twinpeaks.fandom.com/wiki/The_Secret_History_of_Twin_Peaks", "text": "The Secret History of Twin Peaks\nThe Secret History of Twin Peaks is the third Twin Peaks novel, written by Mark Frost. It was released on October 18, 2016. The book is presented as a dossier, compiled by an unknown archivist, with annotations from FBI Special Agent \"TP,\" who has been assigned to discover the archivist's identity.\nOverview\nThe book is organized as a dossier with annotations by Special Agent \"TP\", who has been assigned by Deputy Director Gordon Cole to discover the identity of the person who compiled the dossier, referred to as the Archivist.\nThe dossier contains documents pertaining to the town of Twin Peaks and its inhabitants, particularly Douglas Milford. Milford was the town drunk until he drifted away from Twin Peaks and eventually joined the Air Force. During his time in the Air Force, he ended up in Roswell, New Mexico, where he was present for the alleged UFO crash. Following this incident, he was assigned to investigations pertaining to UFO sightings and was eventually put on Project Blue Book.\nThe Archivist revealed his identity as Major Garland Briggs, who Milford hand-picked as his successor. The dossier ended with a 'MAYDAY' message from Briggs on March 28, 1989, and Agent \"TP\" sent her findings to her superiors, signing her name as Tamara Preston.\nFeatures\n\n3D Glasses\nUsing 3D glasses on certain illustrations reveal interesting details with, as Dr. Jacoby says in the book, Red suppressing the logical and Blue suppressing the intuitive.\nOn another picture of an Owl, Red shows the Freemasonry's all-seeing eye (the Great Sign) within the representation of the fifth triangular number figure (instead of a common triangle). Blue shows only an owl, the representation of the Illuminati.\nOn a picture of an Owl, Red shows the face of a stereotypical alien while Blue only shows an Owl.\nOn the cover of Jacoby's book, The Eye of God, Red removes the subtitle \"Sacred Psychology in the Aboriginal Mind\" and the brand logo, leaving only the title followed by Dr. Lawrence Jacoby's name and also simplifies the cover picture to a dot inside a square inside another square. Blue changes nothing.\nThe preface of Jacoby's book: Red removes the name of those giving a favorable review of the book and half of Jacoby's picture. Blue removes the other half of Jacoby's picture.\nOn the picture of Leland and BOB, Red removes BOB. Blue changes nothing.\nOn Norma's postcard to her parents, Red obscures (but does not completely eliminate) all her text, including the name and address of her parents (\"Lindstrom rather than \"Blackburn\"), and parts of the anachronistic \"First Man On The Moon\" stamp. Blue eliminates the \"Post Card\" label and lines (though not completely the stamp or postmark).\nRed removes all the marginal notes from \"TP\", including her verification of the facts and the further conclusions she draws—as well as her identification as \"Tamara Preston\".\nSecret messages or oddities\nOn the picture of the Bookhouse Boys favorite books numbered from 1 to 11 by the Archivist using \"I\" instead of \"1\" like everywhere else he typed this number in his sections of the dossier. The Archivist also notes on this page that “Good literature is a mirror through which we see ourselves more clearly…”.\nIf one holds this picture in front of a mirror, the only numbers which are not changed are I, 8 and II, and by taking the first word of each book title we have \"fear the double\". If we were using the number one written with a \"1\", then only 8 would be the same as its reflection, the book number 8 is associated with Cooper.\n \nThis means that the Archivist might be aware of what happened to Cooper.\nMilford's Buick's receipt was probably typed with the Archivist's typewriter as indicated lack of the numeral \"1\" which is replaced with an \"I\". It might be to indicate that Milford is not the Man in Black driving a black Buick sedan in the 1940s. To support that, Milford states in his diary after his visit of a military facility by Nixon, that his car was parked next to a black sedan. Furthermore, this receipt is not validated by one of TP's verifications.\nThe Ghostwood Bill of Sale was similarly likely forged by the Archivist. It might be to indicate that Ghostwood was not actually sold. Furthermore, this document is not validated by one of TP's verifications.\nAgent Preston doesn't end at least one of her anotation with \"TP\": annotation number 2 of section 7 of NOTABLE FAMILIES. This note is the one detailing what happened to Catherine and the Mill after the bank explosion.\nDifferences between versions\nThe audiobook companion has at least two images different from other versions of the novel:\nThe picture of the Bookhouse books puts then name of the appropriate member under each of the 11 volumes, instead of a numbering going from \"I\" to \"II\" above them.\nThe cover of The Eye of God by Dr. Jacoby has a different illustration which is not affected by the use of 3D Glasses.\nDiscrepancies\nThe book contains various alleged continuity errors with the series. Indeed, author Mark Frost purposely decided for the book to be a dossier composed of a set of documents authored by various people, in which the facts presented could be in-universe errors made by these characters, even purposely including typos or statements that seem untrue, his reasoning being that actual historical documents are filled with inaccuracies. In The Final Dossier, it is stated that Harry Truman was a source for parts of the dossier, passing some data to Briggs while remaining uncredited: this may solve some of the discrepancies.\nWithin the book alone\nMilford's enlistment form is to the US Air Force in 1941 while the book itself also states that he enlisted to the US Army Air Corps and that it did not become the USAF until 1947.\nThe Archivist talks about Milford with contempt when recounting the events of the 1940s. But starting on the page where he begins to talk about himself with the first person, as noted by TP, he talks about Milford fondly.\nThis shift in tone and behavior regarding Milford might indicate a change of Archivist.\nThe report of Kenneth Arnold's UFO sighting places the event on June 25, while the previous news article states that it happened the previous day, June 24.\nThe archivist's \"faithful Corona\" does not have a * key even though he typed this symbol several times, including under this very picture. Other symbols such as the # and “ ” marks are also not on the depicted corona, which appears to be a 1939 Corona Standard with a German QWERTZ keyboard. While Corona has produced QWERTZ typewriters, those in the Standard series are uncommon if they ever even existed.\nThe Archivist constantly uses upper case i \"I\" every time he should use \"1\", indicating that his typewriter does not have this key although the common real world usage is to use lower case l \"l\" since it is the exact same symbol. The archivist reveals himself to be Briggs and then put the picture of his typewriter which has the \"1\" key and starting on the next page with the transcript of his discussion with Milford, he uses \"1\" instead of any substitution.\nIt may be to indicate a change of Archivist. This follows the shift in style noted before.\nStates that Robert Jacoby died in 1969 before Milford bought the Twin Peaks Gazette and changed its name into the Twin Peaks Post. But many articles from Robert were written in the Post later and he was stated to have died again on November 19, 1986.\nJacoby has moved to Hawaii on March 19 but wrote a report on Ben's Civil War on March 22 at Calhoun Memorial Hospital.\nRobert Jacoby notes on page 316 that he \"first met in third grade ... And was seated behind her.\" On page 320, his funeral cards indicate he was born in May 1931. This would make him a 16 year old 3rd grader since the Log Lady was in third grade in 1947 according to the \"Three Students Vanish\" entry beginning on page 142.\nDouglas Milford's middle name is given as \"James\" in his Roswell interview, while his obituary says \"Raymond.\"\nMilford's enlistment form from 1941 states that he has no distinctive marks. In 1985, he reveals a three triangle marking on his forearm to Major Briggs, dating back from his scoutmaster youth in Ghostwood Forest before his enlistment as noted by TP.\nThe Archivist's last entry is from March 28, 1989, yet the dossier contains the dying letter of Hank written three years later and Harry's letter which was apparently written after Cooper left town. He also wrote that Catherine became a recluse after the bank explosion which occurred on the very same day and that Lana got out of Twin Peaks six months later to get remarried.\nThis might indicate that the Archivist worked on earlier sections after writing this last entry. To support it, on her last entry, TP mentions \"the other data\" that she did not yet see.\nBenjamin Horne is stated to have been the student manager for the Twin Peaks High School football team in 1968. However, his birth date is later given as August 4, 1940, which would have made him 27 or 28 years old, a decade older than most high school seniors.\nIn her notes, Preston mistakenly refers to Charles Erskine Wood as \"Ernest Wood.\"\nWith the real world\nIt can also be noted that one of the books from the picture of the Bookhouse Boys favorite tomes, The Boys of Summer, is an edition from 2006 meaning that the picture can not be from when the dossier was made. Indeed, the Harper Perennial 'olive' logo did not exist before 2005.\nIt might be done on purpose to indicate that the Archivist retroactively took the picture to include the secret message: \"Fear the Double\"/\"Cooper\"\nThe Hollywood postcard from Norma to her parents is dated April 17, 1969, while its FIRST MAN ON THE MOON stamp was later issued on September 9, 1969.\nNorma also wrote that the Tonight Show's guests that day were Sammy Davis Jr. and Victor Buono. In real life, the guests actually were Victor Buono and Peggy Lee (aka Norma Egstrom).\nDouglas Milford's enlistment form in the United States Air Force is from December 1941, although the archivist states that it was the Army Air Corps. But in the real world, it was actually the Army Air Forces from June 1941 to 1947.\nThe book implies that Aleister Crowley died in 1944, though he actually died in 1947.\nAdditionally, it states that Crowley's book, Moonchild, was published in 1923, whereas it was actually published in 1917.\nThe book implies that Betty Northrup and Jack Parsons began their affair in 1945, when she was 17. While she was indeed 17 at the beginning of their relationship, it actually began four years earlier, in 1941, and ended in 1945.\nWith the rest of the franchise\n\nWith the TV series and movies\nThe Archivist states Pete Martell played checkers, not chess. In the series, Pete assists Agent Cooper in his chess match with Windom Earle.\nThough, the Archivist was speaking figuratively, stating just after it that Catherine was \"only playing hardball.\"\nNadine's maiden name is stated in the book to be \"Gertz\", while Episode 17 states that it is \"Butler\".\nIn the book, Nadine's birthdate is given as January 25, 1950, which would make her 39 years old in the February–March 1989 setting of the original show. But the show states her age to be 35.\nDr. Jacoby states that Laura turned 18 on the day she began consulting him when the show explicitly states her to have died at 17.\nIt might be because Laura lied to him so that he was not legally obliged to inform her parents.\nDetails of Ed and Nadine's relationship are different between the show and book. In the show, Ed and Nadine were married the spring after high school after Norma cheated on Ed with Hank. During their honeymoon, he accidentally shot out Nadine's eye with a buckshot that ricocheted off of a rock. The book states that Ed and Norma's relationship crumbled while Ed was in Vietnam and Hank intercepted letters he had sent to her, then Ed and Nadine fell in love after meeting at his gas station and that Nadine's eye was shot out during a hunting trip they took with Harry S. Truman.\nThe book states that Douglas Milford changed the name of the Twin Peaks Gazette to the Twin Peaks Post prior to when the series takes place although characters still call it the Gazette.\nHowever, the newspaper props seen episodes 18, 23 and 26 bear \"The Twin Peaks Post,\" indicating that it was officially renamed the Post but still commonly referred to as the Gazette.\nBen is stated to have surrendered at Appomattox during his Civil War reenactment following Jacoby's advice to get to the truth. In the show, Jacoby is the one who surrendered at Appomattox wanting for Ben reverse his emotional center.\nThe reconciliation between Ben and Audrey is not apparent in the book, due to a bitter note allegedly left by Audrey before she went to the bank. The note also indicates that Ben planned on proceeding with the Ghostwood plans, despite his campaign against it by the end of the show and the fact that it was in Catherine Martell's hands at this point.\nThis might be a consequence of changing the course of Ben's Civil War.\nIn the pilot set in February 1989, Harry S. Truman states Andrew Packard's \"death\" to have taken place \"last year,\" which would presumably mean 1988. However, the book and the Access Guide state that it occurred on September 27, 1987.\nThe Twin Peaks Post article mentions Margaret's log being Douglas Fir, even though it has always been stated as Ponderosa Pine, including in the Access Guide.\nThe book states that Josie Packard's autopsy was performed on March 11, 1989. However, when going by how many days pass in the show by the time of her death, Josie would have died around March 20, 1989.\nAs a result, this places Josie's death before that of Leland Palmer and Douglas Milford, the latter of which appears to be unchanged (the former is not mentioned in the book). This is sequentially incorrect in terms of the series.\nDouglas bought the Twin Peaks Gazette in 1969 and published a favorable article on his brother's fifth mayor candidacy. But Episode 17 states that Douglas wrote an unfavorable article for the first candidacy of his brother in 1962 although he was unopposed.\nIn the book, Lawrence Jacoby had moved to Hawaii by March 19, 1989, writing his final notes about Laura and had his license revoked on March 26. However, Jacoby appears to still be practicing psychiatry in Twin Peaks in the final episodes, which take place after this date.\nIn Hawk's journal \"The Ballad of Big Ed and Norma and Nadine,\" there is a photo of Ed and Norma captioned \"Big Ed and Norma at the RR.\" However, the photo is actually the two at the Roadhouse; a production still from the Pilot episode.\nThe book states Briggs to be the only officer in the military facility of Twin Peaks. But Episode 19 shows USAF Colonel Calvin Reilly to be a superior officer who is into the loop with Listening Post Alpha activities.\nReilly may have been a contact of Milford not stationed in Twin Peaks.\nThe book states that the Great Northern opened in 1928 and Ben Horne was born in 1940. But Episode 18 shows a footage of Ben at the Great Northern groundbreaking. Similarly, the Access Guide states the Hotel groundbreaking to be in 1927 and using the same 1940 birthdate for Ben.\nThe series and film state Deer Meadow to be in the southwest corner of Washington, but the book states it is one county west of Twin Peaks.\nThe book states the Briggs received the \"Cooper, Cooper, Cooper\" message after Cooper solved Laura's murder, while in the series, it was during the investigation.\nThe message might have been detected on two different occasions.\nThe book states that Douglas' wedding occurred on the same night Briggs disappeared but this was not the case in the series.\nBriggs indicates that when he returned after his disappearance, he appeared in the same spot in the woods where he left; he then ran home. In the series he appears in a flash of light in his living room.\nWith the Secret Diary of Laura Palmer\nAccording to The Secret Diary of Laura Palmer, the Log Lady's husband died by having fallen face-first into hot coals and burning to death. The Secret History of Twin Peaks states that Sam Lanterman fell into a burning ravine during a fire.\nSince the article in The Secret History of Twin Peaks does not actually declare Sam's cause of death, it is possible that when Sam fell into the burning ravine, he fell into hot coals that burned him to death.\nIn The Secret History of Twin Peaks, Jacoby states that Laura began seeing him six months before her death, when The Secret Diary of Laura Palmer states that she began seeing him over a year prior.\nWith Access Guide to the Town\nIn the Access Guide, the football team photo seems to show enough players for a regular eleven-player team. But in the Secret History, the plaque and description shows a seven-player squad.\nThe Guide states that coach Bobo Hobson was never caught on camera, fearing that it would take his soul but the dossier has a picture of him in a Twin Peaks Gazette article.\nIn the Access Guide, Harry team number is #10, Ed is #60, Hank is #81 and Stan Lillas is #80 but in the dossier, Harry is #45, Ed is #65 and Hank is #80.\nThe Access Guide states the Martells arrived in Twin Peaks after the Packards, but the Secret History states the opposite.\nThe Guide is produced by Richard Saul Wurman who is a good friend of Andrew Packard, thus he may have written it this way to favor his friend's family.\nIn the Secret History, Pete's father is named Ersel, whose father is named Zebulon. But in the Access Guide, Pete's father is named Nealith, whose father is named Rudolph.\nIn the Access Guide, Pete's father is the one to sell the Martell Mill to the Packards one week before dying of indigestion. In the Secret History, it is Pete's grandfather selling to Andrew's father on his deathbed.\nIn the Access Guide, Andrew and Catherine's father is named Ezekial. In the Secret History, his name is Thomas.\nIn the Access Guide, Harry is stated to be the son of a mill worker named Boyd Truman. In the Secret History, it is said that he is the son of sheriff Frederick Truman.\nIn the Access Guide, Hawk is said to be the son of a Zuni shaman. In the Secret History, he is stated to be the full-blooded Nez Perce son of a mill worker.\nIn the Access Guide, Frank and Jerry are not seen in the roster of the Twin Peaks High Steeplejacks football team of 1968 and the student manager is Herb Fredrick instead of Ben.\nIn the Access Guide, the 1968 Steeplejacks never lost a game, including the last one against the Kettle Falls Cougars. In the Secret History, the 1968 Lumberjacks lost in their final game which was against the Kettle Falls Cougars.\nAudiobook\nThe audiobook edition features voices actors from the TV show reprising their or other roles as well as actors original to the franchise. No official credits of who plays what parts is known to be released. The following list includes all the actors and some of the audio characters portrayed:\nArthur Bishop as a Wisconsin journalist / Wayne Chance / Pendleton East Oregonian / Edward R. Murrow / Fred Crisman / Ezekiel / Jack Parsons\nLen Cariou as Thomas Jefferson / Lt. Dan Luhrman / Dr. Will Hayward / Richard Nixon\nAri Fliakos as Robert Jacoby\nMark Frost as Dr. Dan Hayward / Dr. Will Hayward / Cyril Pons\nMichael Horse as Chief Joseph / Deputy Tommy 'Hawk' Hill\nMat Hostetler as Andrew Packard\nDavid Patrick Kelly as Deputy Director Gordon Cole / Captain Meriwether Lewis / Major James Neely / Colonel Nelson Miles / Kenneth Arnold / Paul Lantz\nRobert Knepper as Captain Charles Erskine Wood / Douglas Milford / Jackie Gleason\nKyle MacLachlan as Special Agent Dale Cooper / Sheriff Harry S. Truman\nJames Morrison as Major Garland Briggs\nChris Mulkey as Captain William Clark / General Oliver Howard / Hank Jennings / L. Ron Hubbard\nAmy Shiels as Mrs. Paul Lantz / Norma Jennings / Audrey Horne / Margaret Lanterman\nRuss Tamblyn as Dr. Lawrence Jacoby\nAnnie Wersching as Special Agent Tamara Preston\nTeasers\n\nYouTube\nA teaser video for the book was released on July 27, 2016.\nIt shows the hands of an FBI Special Agent opening the contents of a package from Gordon Cole, who is now the Deputy Director of the FBI. It is postmarked August 3, 2016. The following elements are then shown:\nA 1903 Edward S. Curtis photo of Chief Joseph\nHandwritten notes from someone searching for a mine with a man called Denver Bob\nA cup of coffee\nA receipt for a 1947 Buick Roadmaster, sold to Douglas Milford by a salesman named Bob J. Hart. In the trailer, the paper looks old and withered but in the book this 70 years old document seems in pristine condition.\n2 sheets of paper pertaining to Kenneth Arnold's UFO sighting in July 1947\nA slice of cherry pie\nA 3rd sheet of paper pertaining to Kenneth Arnold's UFO sighting in July 1947\nA September 1947 physician's report concerning Margaret \"Maggie\" Coulson. It is interesting to note that the mark shown is the 3 triangles pointing at the centre marking that appears on Major Briggs' neck, not the one of two mountains that Margaret shows Cooper on the back of her knee. In the finished book the marking is changed to the way Cooper redraws the Major's markings on the chalkboard with the three triangles pointing upwards.\nDouglas Milford's United States Air Force enlistment form from December 8, 1941.\nA Hollywood postcard from Norma to her parents, dated April 17, 1969. The teaser's stamp is the - US10¢ PRESERVE THE ENVIRONMENT stamp issued on April 18, 1974 while the one in the finished book is the FIRST MAN ON THE MOON stamp issued on September 9, 1969.\nA log, possibly from the Log Lady.\nA memorandum from Cole to the special agent, whose name is redacted. It says that the contents are from Cooper's investigation in Twin Peaks and may be related to a current case the agent has been assigned to, and that the identity of the person who compiled it must be discovered.\nGallery\nThe Secret History of Twin Peaks by Mark FrostTeaserA package from Gordon Cole to \"Curtis took this photograph of Joseph in Seattle in 1903\"Denver Bob NotesDouglas Milford's Buick receiptKenneth Arnold UFO reportKenneth Arnold UFO report (cont.)Physician's report for Margaret CoulsonDouglas Milford's USAF enlistmentPostcard from Norma to her parentsMemorandum from Cole to Agent \nTwitter\nOn September 13, 2016, the Flatiron Books Twitter account tweeted a short video containing the quote, \"We saw things that maybe men aren't supposed to see,\" by Jack Parsons.\nAnother teaser was posted to the account on September 20, containing the Chief Joseph quote, \"I will go now to the place of smoke by the great falls and twin mountains to seek the aid of the Great Spirit Chief in this time of need.\"\nA third teaser was posted on September 27, with another Jack Parsons quote: \"I've often felt there were spirits in this wood...\" with images of Nadine Hurley, the Log Lady, and Lawrence Jacoby flashing in the background.\nSeptember 13, 2016 teaser screenshotSeptember 20, 2016 teaser screenshotSeptember 27, 2016 teaser screenshot\nSequel\nOn October 26, 2016, Mark Frost suggested that another book will follow the airing of Season 3.\nOn April 3, 2017, Twin Peaks: The Final Dossier was announced.\nBehind the scenes\nMark Frost re-read Twin Peaks: Access Guide to the Town to reacquaint himself with the geography and general history of Twin Peaks.\nFrost wrote the novel following his and David Lynch's submission of the initial nine-episode script for the limited series, during production on the series itself. Lynch reportedly has not read the novel."}