{"name": "The_arm", "url": "https://twinpeaks.fandom.com/wiki/The_arm", "text": "The arm\n\"Let's rock!\"\n\"The arm\" was the self-professed name of a being from the red room who appeared in dreams to both Laura Palmer and Special Agent Dale Cooper, primarily in the form of a dancing, red-suited little man. The arm had an unclear relationship with the spirit known as Mike, whose human host, Phillip Gerard, claimed in one of Cooper's dreams that he had cut off his own arm to rid himself of evil.\nEpisode end credits identify the character as \"Man from Another Place.\"\nBiography\n\nAbove a convenience store\nThe arm sat across from BOB at a formica table in a dirty room above a convenience store. Seated around the room were an electrician, Mrs. Chalfont, Pierre, and two woodsmen, while a jumping man screamed and darted about.\nThe arm said: \n\"The chrome reflects our image. From pure air, we have descended, from pure air. Going up and down. Intercourse between the two worlds.\"\nHe then smiled at the bowls of creamed corn on the table, identifying them as \"garmonbozia,\" and commented on the green color of the table itself. BOB replied: \"I have the fury of my own momentum.\" The arm said \"With this ring, I thee wed,\" and laughed with BOB, before adding: \"Fire walk with me.\" BOB clapped, and the curtains of the red room appeared. The two exited through the curtains, laughing.\nDeer Meadow\nIn 1988, a particular telephone pole in the Fat Trout Trailer Park occasionally emitted the sound of the arm whooping. This occurred during both of Agent Chet Desmond's visits to the trailer park while he was investigating the murder of resident Teresa Banks. After Desmond's disappearance, the phrase \"Let's rock\" was written in pink cursive on the windshield of his abandoned car.\nWhile investigating a series of bank robberies, Dale Cooper found himself dwelling on the strange case of Banks' murder. One night, he had a dream in which he danced with a little man and a beautiful young woman.\nLaura Palmer's final days\nShortly before her death in February 1989, Laura Palmer had a dream in which she observed a meeting between the arm and Dale Cooper. The little man questioned whether it was future or past, and then told Cooper: \"Do you know who I am? I am the arm. And I sound like this...\" before making an eerie whooping sound. He then picked up a gold ring from a nearby table and held it up for Laura, which Cooper implored her not to take.\nThe next Sunday, the same whooping sound could be heard when Phillip Gerard confronted Leland and Laura on the road. After the confrontation, Laura asked if she had somehow met Gerard before, although she had only seen the arm and Cooper in her dream.\nOn the night of February 21, Laura dreamed she was in a strange room with the little man and a very old Cooper. She struggled to speak, but the words came out sounding strange. Eventually, Laura stood and kissed the old man, then whispered the identity of her killer into his ear. She described the dream in her diary the following day.\nAfter murdering Laura at the train graveyard near Twin Peaks, Leland and BOB entered the red room through the curtains at Glastonbury Grove and found the arm seated next to Mike. The arm placed his hand where Gerard's left arm used to be, and the two spoke in unison: \"Bob, I want all my garmonbozia.\" In response, BOB held his hand to Leland's stomach and then threw a great quantity of blood onto the floor. The little man then ate a spoonful of creamed corn.\nDale Cooper's dreams\n \nOn the night of February 26, Dale Cooper had a dream which corresponded exactly to the one Laura had, two days before her murder. The little man stood with his back turned, shaking, before spinning around with a clap and exclaiming, \"Let's rock!\" The arm sat down and said that the gum Cooper liked was going to come back in style. He remarked that the girl sitting next to him was his cousin, although she happened to look exactly like Laura Palmer. The arm said that she was \"full of secrets,\" and that where the two of them were from, \"the birds sing a pretty song and there's always music in the air.\" He then stood up and began dancing as music began to play.\nCooper described the dream to Sheriff Harry Truman and Lucy Moran the following morning. Several of the little man's strange remarks later bore curious connections to his investigation of Laura's murder. The singing birds and music referenced the cabin belonging to Jacques Renault where Laura had been taken before her death, while the \"favorite gum\" apparently referenced Leland Palmer's \"favorite gum in the world.\" His incessant dancing mirrored Leland's spontaneous bouts of singing and dancing over the next several days.\nFollowing the death of Josie Packard, the little man appeared to Agent Cooper, dancing on the bed where Josie's body had been moments before.\nWith Cooper in the red room\nIn March 1989, the man appeared to Cooper when the latter entered the red room via the curtains in Glastonbury Grove. He emerged from a curtain, dancing over to a set of armchairs as a singer performed \"Sycamore Trees.\"\nLater, seated with Cooper, the arm told him: \"When you see me again, it won't be me,\" then stomped his foot. He explained that they were in the \"waiting room\" and offered him coffee, mentioning that some of Cooper's friends were here. Laura Palmer then briefly sat down next to the man to speak to Cooper, followed by an elderly waiter from the Great Northern, who brought Cooper a cup of coffee. Suddenly, the Giant appeared in the waiter's place, rejoining the little man and saying, \"One and the same,\" then disappearing. The arm grinned and rubbed his hands together as Agent Cooper's coffee began shifting, solidifying one moment and then gaining the consistency of a thick sludge. He then said \"Wow, Bob, wow. Fire walk with me,\", and then disappeared in a burst of flame.\nAs Cooper wandered the halls, the arm, still seated in the same chair, indicated that Cooper had gone the \"wrong way.\" Later, he danced and laughed hideously, announcing that \"another friend\" was near, which turned out to be Maddy Ferguson. Finally, in a completely empty room, the little man, now with pale white eyes, danced in place and said the word \"Doppelganger.\"\nLater, just as in Laura's dream, the man spoke to Cooper, questioning whether it was future or past and identifying himself as the arm. This time, however, there was no ring on the table, as the arm explained that \"someone else\" has it now. Cooper realized with horror that Annie Blackburn was in danger, and asked how he could leave. The arm answered that Cooper was \"here,\" and there was no place to go but \"home,\" before laughing and beginning to dance.\nPost-evolution\nOver the next twenty-five years, the arm evolved. In his new form, he resembled a slowly moving tree sending random electrical current with a pink fleshy-looking mass, the same shape as his former cranium, atop its trunk swelling in and out like a balloon.\nIn September 2016, Phillip Gerard led Cooper into the arm's chamber and pointed to him, explaining that it was \"The evolution of the arm.\" The tree repeated its customary greeting, then asked Agent Cooper if he remembered his doppelganger. The other Cooper, he said, needed to come \"back in\" before the real Cooper could \"go out.\" The arm then said, \"253. Time and time again,\" before repeatedly saying BOB's name and bidding Cooper to go.\nAs Cooper was attempting to find the exit, a nearby statue transformed into the arm's doppelganger, also now resembling a tree sending random electricity but more violent and with a diseased black-and-yellow head. It roared and lashed Cooper with its branches, screaming \"Non-exist-ent!\" Suddenly, the floor gave way and Cooper fell into empty space.\nIn Las Vegas, the arm appeared in miniature form to a catatonic Cooper as he disarmed Ike \"The Spike\" Stadtler, repeatedly telling Cooper to \"Squeeze his hand off!\"\nAfter attempting to prevent Laura Palmer's murder, Cooper met the arm in the red room once more. This time, echoing Audrey Horne, the tree asked him, \"Is it the story of the little girl who lived down the lane? Is it?\"\nNon-canon appearances\n\nInternational Pilot\nTwenty-five years after Laura Palmer's death, Dale Cooper finds himself in a strange red-curtained room with the little man and a woman who looks exactly like Laura.\nThe scene is essentially identical to the final scene of \"Episode 2,\" which repurposes it as part of Cooper's dream.\nSaturday Night Live sketch\nThe man (played by Mike Myers) goes to Agent Cooper's room after Leo confesses to Laura's murder. When Cooper says he plans to get a pie from the Double R Diner, the man asks if they have little pies and starts to follow him out, but then the agent decides to go to bed. The man starts dancing.\nBehind the scenes\nThe Man from Another Place was played by American actor Michael J. Anderson, who was first approached by David Lynch as the eponymous character of the unproduced movie Ronnie Rocket and they later worked together on Industrial Symphony No. 1 and Mulholland Drive.\nThe little man's identity and relationship with Mike is only vaguely alluded to in the series and film. However, the shooting script for Twin Peaks: Fire Walk with Me explicitly identifies the man as \"Mike\" in the convenience store sequence.\nDue to payment disputes with Showtime, Anderson did not reprise the role in the 2017 series of Twin Peaks.\nAn uncredited voice actor provided the arm's voice in Anderson's stead. When asked about the identity of the actor, executive producer Sabrina S. Sutherland responded, \"Unfortunately, I think this question should remain a mystery and not be answered.\" The evolution of the arm's lip movements were based upon footage of Lynch's mouth.\nReverse speak\nThe strange cadence of the Man's dialogue was achieved by having Anderson speak into a recorder. This was then played in reverse, and Anderson was directed to repeat the reversed original. This “reverse-speak” was then reversed again in editing to bring it back to the normal direction. This created the strange rhythm and accentuation that set Cooper's dream world apart from the real world.\nAnderson recalls that his reverse-speak was not difficult to master as, coincidentally, he had used it as a secret language with his junior high school friends. Series creator David Lynch was unaware of this when he cast Anderson in the part and had hired a trainer to help Anderson with enunciation. When he found out Anderson could already talk backward, he canceled the trainer and wrote more difficult lines of dialogue for Anderson to read.\nThe evolution of the arm\nThe tree was made entirely using CGI, the practical set only having an X mark on the curtains. The arm and its doppelganger, referred to as the Good and Bad Tree, were created by the visual company based on Lynch's sculptures of trees and the lip sync being done using footage of Lynch's mouth. It is very similar to the cover made by Lynch for \"The Voice of Love\" album by Julee Cruise. The cover is a picture of an experiment made by Lynch, who stuffed turkey and cheese into a head-shaped hollowed clay figure and photographed ants eating it.\nLynch unambiguously states that the head on top is just a head, not a talking brain, a gland or a neuron.\nIt is also reminiscent of The Grandmother, a short film he directed where a boy made a tree from which he pulled an old woman. A tree also seemed to be an important part of Eraserhead."}