{"name": "The_Search_for_the_Zone", "url": "https://twinpeaks.fandom.com/wiki/The_Search_for_the_Zone", "text": "The Search for the Zone\nThe Search for the Zone, located at thesearchforthezone.com, was an Internet blog maintained by Buckhorn high school principal William Hastings, dedicated to the topic of parallel universes and alternate dimensions. Hastings ran the site with town librarian Ruth Davenport. Heinrich Viegel was an occasional contributor.\nHistory\n \nThe blog was started on June 1, 1997. As early as 2010, visitors could leave comments in a guestbook, to which Hastings would occasionally respond. The last site update took place in November 2015.\nThe week before Ruth Davenport was found dead, Hastings left a post stating that the two of them had managed for the first time to enter \"the zone,\" where they made contact with \"the Major.\" Buckhorn police detective Dave Macklay provided a copy of the post to FBI investigator Albert Rosenfield.\nContents\n\nIntroduction\nWelcome to The Search for the Zone. Here you will find writings, links, and other bits and pieces as we find the time and inclination to post them up. This site is a journal of my (and my partner’s) fascination with multidimensional/time travel, dark matter, the afterlife, etc. We are interested in a lot of things, but these are the main topics of discussion...\nWe will have to reconcile with the question that if someone from outside our familiar world gains access to our plane of existence, what ramifications will that entail? There might be forces at work from deep dimensional space, or from the future…or are these one in the same? Think of the events that could have splintered time? The things that could have laid the seed for a starting point for this development? Perhaps technological innovations or the assassination of President Kennedy?\nA link below led to Hastings' older journal entries.\nReading links\nParallel Universes and Density Shifting\nhttp://www.grantchronicles.com/astro15.htm\nThe Science of Parallel Universes\nhttp://phys.org/news/2015-09-theory-parallel-universes-maths-science.html\nOn Electricity by Nikola Tesla\nhttp://www.tfcbooks.com/tesla/1897-01-27.htm\nThe Horizon Project\nhttp://www.thehorizonproject.com/\nWhy Frequencies are the Key to Understanding Parallel Universes and Time Travel (link takes you to another site)\nFred’s Blog\nhttp://mishscifimusings.wordpress.com/\nEpoch Times article on Parallel Universes\nhttp://web.archive.org/web/20130906031010/http://www.theepochtimes.com:80/n2/science/is-deja-vu-caused-by-parallel-universes-video-229364.html\nGreat article on Hugh Everett III\nhttps://www.scientificamerican.com/article/hugh-everett-biography/\nThis is a little goofy, but always nice to see some local Buckhorn/Rapid City area lore…after all this is the sacred lands of the Lakota\nhttp://rapidcityjournal.com/now/today/rcj/black-hills-ghost-stories/collection_9a079eda-799d-11e5-b74c-9b73ebaf901e.html#1\nHeinlein Links\nScience Fiction has been a source of enjoyment for me since I was ten years old, when I read Orphans of The Sky.\nRobert A. Heinlein Novel and Collections list\nhttp://www.luna-city.com/sf/rah.htm\nRobert A. Heinlein Homepage\nhttp://www.nitrosyncretic.com/rah/srah-links.html\nThe Heinlein Society\nhttp://www.heinleinsociety.org/links.html\nWavs\nThree WAV audio files were linked in this section:\nelectrical_interference_1.wav\nelectrical_interference_2.wav\nvortex.wav\nFooter\nAt the bottom of the home page were banner links to subscribe to the site's newsletter or donate, and several awards, including the Yahoo! Pick of the Week and the WebTrips Rockin' Site of the Week.\nGuestbook\nAs of 2016, the site guestbook contained the following posts:\nDate\nName\n03 Nov 10 05:12am\nDoris\nThere have been a few articles of well-known scientists who admitted they were trying to break thru to a parallel universe, so it’s obvious even hard science is beginning to acknowledge there are indeed parallel universes. In general though science is a very dogmatic field and not open to enquiry. What’s funny is when it’s reported that science has ‘found something that shouldn’t exist’ as if the whole universe is governed by man made laws of physics. Thanks for all your work, Bill...those of us in the community commend and support you!\n12 Oct 11 03:01am\nJ. Garvey\nRecently I had an experience that can only be explained by the existence of multiple dimensions. It was not a dream of any kind or anything I had experienced in the past. Without going into too much detail, I found myself present…physically present with a close friend who passed in some other ‘space’ or ‘dimension.’ He has been gone for several years but in this elsewhere where I found myself he existed in flesh form. I know this sounds impossible, but it happened, I swear. This has completely changed my concepts of ‘life’ and ‘consciousness'\n12 Oct 11 08:06pm\nBill Hastings \nvery powerful stuff, John...\n07 Mar 14 04:53pm\nAdam Z.\nIts chemicals that change \nthe brain - we can do\nthis. I know it.\nBetty is so cool!\n20 Sep 14 06:06pm\nStewart Fuller\nOh Lord … It was grand to meet you H.V.!\n08 Oct 14 07:15am\nGet A Life\nare you people crazy? there is no fucking 'zone.' fuck you and the spaceship you rode in on.\n16 Jan 15 02:42pm\nMary Susan\nmy grandmother remembers this - she \nsaid you are real but you should …\n(not to say sorry.)\nand remember this is not my name! - so\nno one gets in trouble!\n08 Sep 15 05:37pm\nTom Pence\nH.V. … and B.H. …\ngreat video… but not the good quality. I couldn’t tell\n- was that light really fire? Was the boy burned?\nHis face looked burned. When will you do the “thing”?\n20 Nov 15 09:00pm\nfriend\nwhere are you people?\nBeginning in late July 2017, visiting the guestbook URL returned an internal server error (500).\nBehind the scenes\nTheSearchfortheZone.com was a real website owned by Rhino, intended to promote the release of the Twin Peaks (Music From The Limited Event Series) soundtrack. Mark Frost suggested the concept but was not involved in writing the site itself."}