{"name": "The_Secret_Diary_of_Laura_Palmer", "url": "https://twinpeaks.fandom.com/wiki/The_Secret_Diary_of_Laura_Palmer", "text": "The Secret Diary of Laura Palmer\nThe Secret Diary of Laura Palmer is a 1990 spin-off novel from the television series Twin Peaks by Jennifer Lynch, then aged 22, the daughter of series co-creator David Lynch. It was published after the airing of the first season but before the second.\nAn audiobook read by Sheryl Lee was released on May 2, 2017.\nPublisher's audio summary\n\"Lifeless and wrapped in plastic. This is how Sheryl Lee was first introduced as \"Laura Palmer\" in the cult television classic, Twin Peaks. Now, Sheryl returns to voice Laura's darkest secrets in the audiobook event that fans of the show have long awaited. Commissioned by series creators Mark Frost and David Lynch and written by Lynch's daughter, Jennifer - who was told she was one of \"three air breathing mammals to know the identity of Laura's killer\" - The Secret Diary of Laura Palmer became an integral part of the Twin Peaks canon.\nThe diary chronicles Laura's life from age 12 to her death at 17 and provides a harrowing backstory to the event that set the entire series in motion. In intimate diary entries, Laura goes from a happy and naïve tween to a tormented soul posing behind the phony smile of homecoming queen. Plagued by visions of a creepy man with long hair - a demonic presence she comes to know as \"BOB\" - Laura falls into a world of drug addiction, sexual promiscuity, and prostitution to escape. But as she's swallowed deeper and deeper into the abyss, Laura is forced to question the reality of who and what BOB really is.\nWith hidden Easter eggs, glimpses at the origins of principal characters, and clues to the identity of her eventual killer, The Secret Diary of Laura Palmer is required listening for diehard fans of the original show, and essential background for the 2017 revival.\"\nPlot\nThe novel is said to be \"As seen by Jennifer Lynch,\" and is written in a matter-of-fact tone from the point of view of Laura Palmer, a small-town teenager —a \"good girl gone bad\"— who is abused, terrorized and murdered by the demonic entity BOB. Lynch says she was told by her father and Mark Frost, co-creator of the series, to \"be Laura Palmer,\" and that she \"knew Laura so well it was like automatic writing.\" The book begins on Laura's 12th birthday in 1984, and steadily matures in writing style and vocabulary. It recounts standard teenage concerns of her first period, her first kiss, and her relationship with her parents, alongside experiences of sexual abuse, promiscuity, cocaine addiction, and her obsession with death. Laura's poetry foreshadows her murder. Her slow realization of BOB's identity is described, although pages are 'missing' from the end of the diary, which ends with an undated entry in late 1989, leaving the reader unable to reach a firm conclusion. Lynch said that \"the careful reader will know the clues and who the killer is,\" and BOB's identity as Laura's father is confirmed in the second season of the series and the 1992 film Twin Peaks: Fire Walk with Me.\nThe book reached number four on the New York Times paperback fiction best seller list in October 1990, though some US book stores refused to stock it due to the graphic content. It was published in the UK by Penguin Books in November 1990. Entertainment Weekly said it was \"gratifyingly faithful to the spirit of Peaks.\" The Associated Press commented that it was \"vaguely reminiscent of her father's chilling depiction of sexual blackmail in Blue Velvet.\"\nInconsistencies with the rest of the franchise\nThe book assumes the series to take place in 1990, while the original show takes place in 1989.\nAs a result, it can be assumed for continuity's sake that each entry actually happened a year prior to the written dates, with the exception of Hank Jennings' incarceration, which is stated to have happened in 1987, a date corroborated in other releases.\nSome names are spelled differently than in the show.\nMadeleine Ferguson's name is spelled \"Madeline Ferguson.\"\nRonette Pulaski's name is spelled \"Ronnette Pulaski.\"\nShelly Johnson's name is spelled \"Shelley Johnson.\"\nEmory Battis' name is spelled \"Amory Battis.\"\nFlesh World is spelled \"Fleshworld\".\nIt can be said that Laura made these mistakes herself while writing the diary.\nAccording to the diary, Donna Hayward had known Maddy Ferguson for several years before the series takes place. However, when they meet in the series, it seems as if they are meeting for the first time.\nIn Twin Peaks: Fire Walk with Me, Laura says that BOB had been abusing her since she was twelve years old. The book's entry for her twelfth birthday indicates that she already has been.\nIt can be understood that BOB was seeing her without yet abusing her.\nThe person Bobby Briggs kills in Twin Peaks: Fire Walk with Me is Deputy Cliff Howard, who pulled a gun on Bobby and Laura during a drug deal. In the book, Bobby shoots a drug dealer who snuck into Leo Johnson's truck when escaping from a bad deal in Low Town.\nIn the book, Laura is familiar with Harold's neighbors, Mrs. Tremond and her grandson Pierre, but she did not seem to know them in Fire Walk with Me when they gave her the doorway picture. The book's Mrs. Tremond can not be the young Mrs. Tremond from Episode 16 since she stated that she did not have any children.\nTrivia\nThe book officially introduces events from unshot or deleted scripted scenes:\nHer pony Troy given to her by Ben with Leland pretending to have done so is mentioned in the shooting script of Episode 1, though the de facto non-canon script stated that it was for her ninth birthday.\nThe Pilot script states Jake Morissey to be the owner of the Roadhouse Nightclub and the \"Hemingway's\" coffee Book House. The book states Big Jake Morrissey to be the owner of the Book House."}