{"name": "Thomas_Jefferson", "url": "https://twinpeaks.fandom.com/wiki/Thomas_Jefferson", "text": "Thomas Jefferson\nThomas Jefferson was the United States President who commissioned the Corps of Discovery.\nBiography\nJefferson was raised in Virginia and knew Meriwether Lewis since his childhood.\nLewis later became Jefferson's secretary and was chosen by him to lead the Corps of Discovery, a secret expedition across the Louisiana Purchase.\nIn 1805, General James Wilkinson revealed to Jefferson a plot by former vice president Aaron Burr to seize land in Texas, Mexico, and Louisiana in order to establish a republic to be led by Burr.\nOn September 25, Lewis wrote to Jefferson a letter in which he described a meeting with the Nez Perce Chief Twisted Hair, who provided him with a strange ring and a map to an area later known as Glastonbury Grove. Lewis informed the President of his intention to explore the area charted in the map.\nAfter weeks of silence from Lewis, Jefferson received communication from him that Jefferson surmised to have been written in the midst of delirium, as it contained strange and often incoherent ramblings alongside Lewis' usual writing. Jefferson reflected on these writings in his journals.\nBy October 1809, Jefferson was succeeded in office by James Madison.\nFollowing Lewis' death, Jefferson was informed by Major James Neely, who stated his death to have been suicide. However, in the following weeks, he received a letter from Major Gilbert Russell, who described the death as \"murder.\" Despite this, another letter from Russell – dated two years after and possibly forged – described Lewis as having been \"deranged\" and that he had attempted suicide multiple times prior to his death. This letter cemented Jefferson's opinion that Lewis committed suicide.\nFollowing the return of the Corps of Discovery in 1807, Jefferson appointed Lewis governor of the Upper Louisiana Territory and at some point initiated him into Freemasonry.\nJefferson's writings on Lewis' letters were stored alongside various writings on Freemasonry and supernatural beliefs of Native Americans. These writings resided in a maximum-security section of the Library of Congress as of the 1940s.\nBehind the scenes\nThomas Jefferson (April 13, 1743 – July 4, 1826) was the third President of the United States and one of the nation's Founding Fathers, having been the primary author of the Declaration of Independence.\nJefferson's journals were narrated by Len Cariou in the audiobook version of The Secret History of Twin Peaks."}