{"name": "Timeline", "url": "https://twinpeaks.fandom.com/wiki/Timeline", "text": "Timeline\n\"What year is this?\"\n ―Dale Cooper\nThe following is a timeline of events in the Twin Peaks fictional chronology, covering all officially released material.\nTimeline\nBefore 1 AD\n1 – 1800\n1801 – 1900\n1901 – 2000\n2001 –\nDating conventions\nWork\nTime period\nTwin Peaks (2017)\nJuly 1945 – August 1956\nThe Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes\nDecember 1967 – February 1989\nThe Secret Diary of Laura Palmer\nJuly 1983 – February 1989\nTwin Peaks: Fire Walk with Me\nFebruary 1988 – March 1989\nTwin Peaks: The Missing Pieces\nTwin Peaks (season 1)\nFebruary 1989 – March 1989\n\"Diane...\" - The Twin Peaks Tapes of Agent Cooper\nTwin Peaks (season 2)\nMarch 1989\nTwin Peaks: Access Guide to the Town\nTwin Peaks (2017)\nSeptember 2016 – October 2016\nThe Secret History of Twin Peaks\nLate 2016\nTwin Peaks: The Final Dossier\nSeptember 2017\nTwin Peaks (1990-91)\nAlthough the show contains many inconsistencies, it is commonly agreed that the events take place in February and March 1989.\nIn the Pilot, Dale states into his tape recorder that the date is February 24, and Ronette's medical chart in episode 8 confirms that her hospital admission on that date is February 24, 1989. This year is given in subsequent releases, including Twin Peaks: Fire Walk with Me and The Secret History of Twin Peaks. Occasionally, incidental dates visible onscreen differ – for instance, Emory Battis' book in episode 6 describes events up to February 25, 1990 when the date at the time should be March 2, 1989.\nBefore the original TV broadcast of Episode 24, a short vignette featuring Dale Cooper summarizing recent episodes uses the episode's airdate (Thursday, March 28, 1990) rather than the in-story date.\nTwin Peaks: Fire Walk with Me\nThe film establishes Laura's murder to be on a Thursday to Friday night.\nThe Secret Diary of Laura Palmer\nThe novel was written to place Laura's death after October 31, 1989 with her birthday being July 22, 1972, contrary to the TV show which places her death on February 24, 1989 at age 17. To compensate, the dates for most events that do not otherwise conflict with the series or Fire Walk with Me are placed one year prior. The exceptions are two chapters concerning Lawrence Jacoby, which remain set in November 1988 and January 1989 for consistency with dialogue in the series establishing that Laura started therapy \"six months ago,\" around August 1988.\nMy Life, My Tapes\nThe account of Caroline Earle's murder by her husband is set in 1979, contradicting dialogue in Episode 17 that places it four years prior (c. 1985). To account for this, all events in Part 5, Chapter 2 (April 1978) through Part 6, Chapter 1 (July 1980) are advanced forward six years (1984 – 1986).\nAccess Guide to the Town\nThe introductory letter by Mayor Dwayne Milford is dated 1991, the actual publication year for the book itself. However, the fictional guide was apparently written in mid-March 1989; Leland Palmer's death is referenced, but not that of Josie Packard.\nThe Secret History of Twin Peaks\nThe framing story of the novel, involving the recovery of the Archivist's dossier, is set in July and August 2016. However, the sequel The Final Dossier indicates the dossier was discovered after the events of the limited series, placing it in October 2016 or later.\nTwin Peaks (2017)\nThe current dating scheme originates from dialogue in Part 9, which indicates that the date in Twin Peaks, South Dakota, and Las Vegas is September 29. As the events surrounding Dale Cooper in Las Vegas cover only a few consecutive days, this allows for a reasonable extrapolation of most scenes to a particular date. In Part 3, the date of Cooper's car crash is \"9/22,\" although this may be an oversight. In another possible error, Lucky 7 Insurance appears to be open for business on seven consecutive days, September 26 – October 2.\nThe year is not stated in the series, other than indications of \"twenty-five years\" after the events of the original series. Twin Peaks: The Final Dossier establishes the year as 2016, actually twenty-seven years and seven months later, although this contradicts the date of Hastings' arrest (September 23) being stated as a Saturday. The Search for the Zone tie-in website indicates that Hastings last updated his blog in November 2015 and implies that he had gone missing by this time.\nIt is unclear to what degree the events taking place in and around Twin Peaks are concurrent with those involving Dale Cooper and the doppelganger, or even other Twin Peaks-set scenes. For example, the Great Northern Hotel key mailed by Jade in Part 5 arrives in town at some point during Part 7, which (if set contemporaneously) would require a transit time of less than a day. Andy Brennan's watch in Part 7 shows that the date is the 10th, possibly September 10.\nTime periods\nBC era\n1st to 18th century\n19th century\n1800s\n1810s\n1820s\n1830s\n1840s\n1850s\n1860s\n1870s\n1880s\n1890s\n20th century\n1900s\n1910s\n1920s\n1930s\n1940s\n1940\n1941\n1942\n1943\n1944\n1945\n1946\n1947\n1948\n1949\n1950s\n1950\n1951\n1952\n1953\n1954\n1955\n1956\n1957\n1958\n1959\n1960s\n1960\n1961\n1962\n1963\n1964\n1965\n1966\n1967\n1968\n1969\n1970s\n1970\n1971\n1972\n1973\n1974\n1975\n1976\n1977\n1978\n1979\n1980s\n1980\n1981\n1982\n1983\n1984\n1985\n1986\n1987\n1988\n1989\nFebruary 1989\nMarch 1989\n1990s\n1990\n1991\n1992\n1993\n1994\n1995\n1996\n1997\n1998\n1999\n21st century\n2000s\n2000\n2001\n2002\n2003\n2004\n2005\n2006\n2007\n2008\n2009\n2010s\n2010\n2011\n2012\n2013\n2014\n2015\n2016\n2017\nUnknown year\nTo be added"}