{"name": "Twin_Peaks:_Access_Guide_to_the_Town", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks:_Access_Guide_to_the_Town", "text": "Twin Peaks: Access Guide to the Town\nTwin Peaks: Access Guide to the Town is a 1991 book by Gregg Almquist, Tricia Brock, Robert Engels, Lise Friedman and Harley Peyton. It is written as a visitor's guide to the town of Twin Peaks, Washington, telling some of the history and attractions of the town.\nContents\nThe travel guide was made by request in Andrew Packard's will, in which he had Richard Saul Wurman assigned to be the book's editor-in-chief. The categories in which the guide covers are as follows:\nHistory\nThe Old Opera House\nFirst Inhabitants\nFirst White Men\nPackard Sawmill\nThe Sawmill Then\nThe Sawmill Now\nThe Joys of Whittling\nWood Mistress\nFlora\nFerns and Flowers\nPines and Firs\nFauna\nAnimal Life\nTaxidermy\nThe White Moose\nFishing\nGeology and Weather\nIn the Beginning\nWeather Watch\nPoints of Interest\nWhite Tail Falls\nOwl Cave\nThe Grange\nThe Train Graveyard\nEvents\nPassion Play\nPackard Timber Games\nCalendar of Events\nLumberjack Feast\nDining\nCherry Pie\nDoughnuts\nDining Out\nLodging\nGreat Northern Hotel\nBed & Breakfasts\nSports\nFootball\nFashion\nReligious Worship\nTransportation\nTown Life\nTwin Peaks Gazette\nPhone Book\nTimber Players\nBlack Lake Cemetery\nChamber of Commerce\nGovernment\nProposed Prison\nBehind the scenes\nLynch was the jacket photograph and brought Tim & Tom's Taxi-dermy picture.\nThis was the only time Richard Saul Wurman was asked to make a book and he plans, as any of his books, to never release the Access Guide again. The book took about six months to be made and the maps were made from scratch, most of the locations and roads being made after Richard Saul Wurman's family and friends. Indeed, his wife is Gloria Nagy, his four children are Joshua, Reven T.C., Vanessa and Tony, his frequent Access Guide typographer is Linda Lenhoff. On the maps can be found: Richard Saul Woods, Gloria's Grove, Josh Alley, Reven Rd., Vanessa's Landing, Tony Ave., Lenhoff Avenue.\nWurman's team was the one to come up with the cut fingers and whittling joke and Wurman considers that Frost was more open to suggestions than Lynch.\nMark Frost re-read the Access Guide as inspiration for The Secret History of Twin Peaks."}