{"name": "Twin_Peaks_in_popular_culture", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks_in_popular_culture", "text": "Twin Peaks in popular culture\nSince its debut, Twin Peaks has been referenced in popular culture numerous times.\nTelevision\nExposición norte\nEpisode \"Russian Flu\" (#1.5) (1990) - There are shown references like sceneries with the Snoqualmie waterfall, music like in Twin Peaks. Also, donuts and cherry pie are offered to Fleischman. A Log Lady is seen through a telescope\nThe Fresh Prince of Bel-Air\nEpisode \"Knowledge is Power\" (#1.13) (1990) - Hilary mentions it.\nEpisode \"Someday Your Prince Will Be in Effect (Part 2)\" (#1.09) (1990) - Hilary mentions at her Halloween costume party that \"the entire Brat Pack is here, plus two Twin Peakers\".\nMystery Science Theater 3000\nEpisode \"King Dinosaur\" (#3.10) (1990) - 'The owl footage is not what it seems.'\nEpisode \"Pod People\" (#4.3) (1991) - \"It's Laura Palmer\"\nEpisode \"Santa Claus Conquers the Martians\" (#4.21) (1991) - \"...those ridiculous Earth programs. It confuses them.\" \"Especially Twin Peaks.\"\nEpisode \"The Final Sacrifice\" (#9.10) (1998) - Tom Servo hums the opening of \"Falling\" over static nature scenes.\nSesame Street\nThe Monsterpiece Theater segment from Episode 2822 (1991), named \"Twin Beaks\", has many references such as the Twin Beaks town, the Cookie Monster becoming Agent Cookie, recording a report for Diane, enjoying some \"darn fine pie\". He interviews the waitress, fellow patron David Finch, and the Log Bird, while receiving valuable direction from Laura, who whispers in his ear. Some extracts this episodes are featured in the Secrets from Another Place extra when recounted by Catherine Coulson.\nIn the segment \"Cookie of Oz\" (2014) when the Cookie Monster opens the red door instead of the emerald green one, he enters in the Red Room.\nBeverly Hills, 90210\nEpisode \"Fame Is Where You Find It\" (#1.15) (1991) - Brandon says the on-set teacher is writing a 'spec script' for Twin Peaks.\nSoul Eater\nEpisode 12: Soul has a dream of the Black Lodge and talks to a small demon which is dancing to jazz music. Later in the series Maka shows up as Laura Palmer.\nDarkwing Duck\nEpisode 44 \"Twin Beaks\" (1992): \"Falling (Instrumental)\", is used when the heroes enter Twin Beaks. Launchpad's psychic investigation skills and communication with a log, combines Dale Cooper and the Log Lady. Trudi's Diner is a reference to the Double R Diner and Trudi herself is designed after Nadine Hurley. The discovery of a wrapped in plastic corpse is akin to the discovery of Laura Palmer's body even mimick Pete's lines with \"It's Bushroot, he's dead!\" followed with \"wrapped up in plastic\". The sentence \"The cows are not what they seem\" is also used.\nThe Simpsons\nEpisode Who Shot Mr. Burns? (Part Two) (#7.1)(1995): Chief Wiggum has a dream in which Lisa speaks backwards which was a reference to Special Agent Dale Cooper's dream where he interacts with The Man from Another Place.\nEpisode \"Lisa's Sax\" (#9.3) (1997): Homer watches an episode of Twin Peaks with the Giant and the pale horse dancing under a traffic light.\nDR-Derude\n\"DR-Derude på Svalbard - Part 1\" (#21.1) (1998)Søren Ryge mentions the Twin Peaks theme from the series.\nNYPD Blue\nEpisode \"Twin Petes\" (#5.13) (1998) - Title reference.\n \nSaturday Night Live\nMain article: Saturday Night Live\nEpisode Kyle MacLachlan/Sinéad O'Connor (#16.1) (1990) - Spoofed in Twin Peaks skit\nThe Chronicle: The Stepford Cheerleaders\n(#1.18) - mentioned by name.\nGeneral Hospital\nRuss Tamblyn portrays a doctor Rose in two episodes, which is widely seen as a Dr Jacoby reference.\nThe Sopranos\nCreator David Chase states Twin Peaks to have been a big influence.\n24\nRay Wise (Leland Palmer) shows up as a potential suspect in the murder of David Palmer. He had nothing to do with it. (Season 5).\nThemes of duality similar to Twin Peaks and Mulholland Dr. are central to 24, with the first season making some overt homages to Mulholland Dr. with a Teri Bauer plot.\nWhite Out\nAndy specifically references the show, which then sparks a brief conversation about the Log Lady.\n100 höjdare: Världens skönaste land\nDel 6 (#6.6) (2008) - Mentioned by name.\nAnte Meridiem\nThe pilot opens with the lead actress wrapped in plastic next to a river is a direct reference to Twin Peaks.\nFringe\nFringe's second season featured an episode called \"Northwest Passage\", which had been the original title for Twin Peaks and its pilot. In this episode, Peter finds himself in Washington, eating pie at the local diner, traveling through Snoqualmie, and working with a local sheriff when a girl goes missing \nIn an episode, Joan Chen appeared as a mistress of alternate-universe Walter Bishop and a doctor Silva (like actor Frank Silva) who ordered cherry pie and coffee. \nFringe's third season also featured the character Walter who is wearing eyeglasses identical to those of Lawrence Jacoby. He also mentions that they were \"sent to by a Dr. Jacoby from Washington State\", with whom he had worked in the past. \nPsych\nEpisode #5.12 \"Dual Spires\" aired on December 1, 2010, and served as a tribute to Twin Peaks and its 20th anniversary. The episode focuses on the murder of teenaged citizen of a small town in Washington - Dual Spires. Notably, the \"enhanced\" video states that there are 724 references to Twin Peaks in the episode's closing scene.\nThe episode featured seven Twin Peaks stars in various roles.\nSheryl Lee as doctor Donna Goodwin, whose first name is a reference to Donna Hayward and Donna's father, Dr. Hayward, was the town doctor and medical examiner.\nSherilyn Fenn as Maudette Hornsby. The \"Aud\" and \"Horn\" parts of her name likely reference her character Audrey Horne.\nRay Wise as Father Peter Westley (reprising his season 4 Psych character but now with white-turned hair).\nDana Ashbrook as Robert \"Bob\" Barker, the name \"Bob\" referencing his character Bobby Briggs, \"Barker\" because Bobby barks in the Pilot.\nRobyn Lively as Michelle Barker.\nLenny von Dohlen as Sheriff Andrew Jackson (named after a US president like Harry S. Truman).\nCatherine Coulson as the Wood Wooman, appearing to talk to the log she is carrying until her grandson steps out of a store.\nThe victim Paula Merral's name is an anagram of \"Laura Palmer.\"\nShawn tells Gus about silent window shades invented by some woman in Washington in the early 90s.\nA newspaper called The Great Northern.\nThe chocolate bunny sitting on Shawn's desk references Agent Cooper's famous statement, \"Diane, I have in my hand a box of chocolate bunnies.\"\nme@underthenail.com references how BOB left his initials under the fingernails of his victims.\nThe Welcome To Dual Spires sign is a very close replication of the Welcome to Twin Peaks Sign seen in the intro of every episode of Twin Peaks.\nThe Sawmill Dinner references both the Double R Diner and the Packard Sawmill which was burned down.\nLeo the Cinnamon Owl trophy references the owls theme of Twin Peaks, as well as the name of Leo Johnson.\nThe mayor of Dual Spires is named \"Douglas Fir\", referencing the type of trees Agent Cooper takes a liking to in the pilot.\nThe old mayor is a reference to mayor Dwayne Milford and his brother Douglas.\nGus is introduced as \"Lodge Blackman\" this is a reference to The Black Lodge.\nJack Smith has completely lost sight in his left eye and only has 30 percent left in the right. This is a reference to the One Eyed Jacks. Later, at the end of the episode he sports an eye patch (itself a reference to Nadine Hurley) further cementing him as One Eyed Jack.\nHe is also seen dancing in the same outfit as the Man from Another Place and snapping his fingers.\nPaula Merral was found along the shore wrapped in plastic. Laura Palmer was famously found along a lake wrapped in plastic.\nA question sent to the Psych phone \"Who Killed Paula Merral?\" is a direct reference to the catchphrase surrounding the Twin Peaks show \"Who Killed Laura Palmer?\"\nRandy Jackson is the equivalent of Bobby Briggs. He hasn't been communicating with his father just as Bobby hasn't been talking to his own father.\nDeputy Frost is a reference to the also very in tune with nature Native American Deputy Hawk and series co-creator Mark Frost.\nDoughnuts at the Santa Barbara Police Station are stacked exactly how they were in the Twin Peaks police department, by type and on pieces of paper towel.\nDoctor Goodwin compliments a man named Patrick on saving his receipts. Bobby and Shelly find receipts of Leo's that lead them to a pair of boots containing the cassette tape of Ben Horne blackmailing him into burning down the sawmill.\nCoconuts can be seen on the counter of Doctor Goodwin's office: Twin Peaks’ psychiatrist Doctor Jacoby also had an affinity for coconuts.\nDoctor Goodwin's \"next patient\" is a sick manya bird.\nThe bike chase sequence takes place on a bridge similar to the Ronette's one that is seen in the Pilot.\nSheriff Jackson's house is similar to that of the Palmers: a ceiling fan can even be seen over the staircase leading to the upper level, this shot a direct copy of one seen repeatedly in Twin Peaks.\nRandy is playing a game of darts. He keeps missing when he lies until he tells the truth. This is a reference to an exercise performed by Agent Cooper in Episode 2 in which he throws rocks at a milk bottle mentioning names that start with J until the glass breaks.\nMaudette is seen in the episode drinking cherry Coke and making the comment that cherry is just the best and has a cherry tattoo. Audrey joins One Eyed Jacks after tying a cherry stem with her tongue.\nGus say they want to \"poke around\" they then correct themselves and say \"peak\" twice each.\nA book found in the library is written by Earl Wyndam, referencing Windom Earle.\nA prom queen photo can be seen of Paula that is a very close copy of the one seen of Laura Palmer.\nLucy is the name of Paula's Mother.\nPaula kept a secret diary and begins to use Latin as a code because she believes someone has started to read it. The translation mentions the letter J just as Laura was set to meet someone with the initial J on the night that she died.\nLassiter takes on the role of FBI agent who criticizes everything about Twin Peaks and its rustic nature, much like Albert.\nShawn mentions a Betty Boob night at the Roadhouse.\nMaudette is hanged in the same manner as Harold, with the audience only getting a shot of her legs.\nThe portrait hung in the cabin closely resembles Major Briggs.\nRandy Jackson using the circular saw on the block of wood is a reference to the opening credits of Twin Peaks with the Packard Sawmill.\nJukebox in the local café.\nDual Spires has no modern communication such as Internet to make it look like small town of the '80s, like Twin Peaks.\nRandy and Paula Merral secretly dated each other and shared one pair of earrings similar to the broken heart necklace Laura Palmer and James Hurley shared.\nPsych's title theme song \"I Know You Know\" was remixed with an enigmatic Twin Peaks style and was sung by Julee Cruise and is almost a shot-for shot recreation of the Twin Peaks' intro.\n\"Damn hot cider.\"\nThe D.S. high school jackets reuse the Twin Peaks High School design.\nThe Barkers are a fairly obvious reference to the Palmers.\nBob and Michelle reference Bobby and Shelly's reference.\nGus is crying like Andy in the Pilot.\nThe Pale horse in the opening sequence.\nGus behind the curtain, looking like Killer Bob.\nChris Isaak’s \"Baby Did A Bad Bad Thing\" is heard.\nRandy doing a Lelandish grin.\nA book about golf (Leland played golf).\nA book about \"Reincarnation and Rebirth\" probably referring to Sheryl Lee's return as Laura's cousin, Maddy.\nSpying through the library rack like Windom Earle.\nSeñor Droolcup making hand signs in the diner.\nThe FBI visits the town.\nA moose head on the table like at the Twin Peaks' bank in the Pilot.\nPaula's very girly bedroom referencing Laura's.\nShawn having a vision (which is \"common\" the context of the show since he is a fraud, but gains extra credence as a reference to Agent Cooper's frequent visions).\nMaudette Hornsby's Audrey-like \"new\" shoes sequence.\n\"I like to dance all night long\" refers to \"There’s always music in the air.\"\nMaudette Hornsby doesn't really like Paula, like Audrey and Laura.\nJack Smith is a reference to Harold Smith.\nJack takes \"from-the-hip\" photos like the ones of Laura with Waldo.\nMany soap opera comparisons à la Invitation To Love.\n\"You remind me of Paula…\"\nArson in the library (not the mill).\nA wood cabin with red curtains, like Jacques’.\nAn owl cave ring.\nPaula's chair at the Cinnamon Festival is empty, just like Laura's chair at her high school, and this is how the characters realize she is missing.\nThe soundtrack of the whole episode is a pastiche of Angelo Badalementi's soundtrack.\nBob Barker lights up a match and holds it in the air like Leland Palmer in Episode 10.\nBob Barker wears a gold ring on his pinky finger, like Coop.\n\"Paula was a troubled young girl\", says her psychiatrist.\nGiant plastic ice cream cone at the diner.\nJack was with Paula at the beginning of the night before she disappeared, and they had a fight in the forest, referencing Laura and James's last interaction, mentioned in the Pilot and depicted in Twin Peaks: Fire Walk with Me.\nSheriff Jackson's speech to Shawn bears some similarities with the one Jean Renault gives Coop in episode 20 (\"You shouldn’t have come here...this town used to be a simple place...our business was none of your concern…\").\nMaudette's body bag looks like it is \"smiling\".\nDual Spires is famous for its cinnamon pie and apple cider, and Twin Peaks is famous for cherry pie and \"damn fine\" coffee.\nThe Barkers' niece's body is found wrapped in plastic by the lake, and in Twin Peaks, Laura Palmer's body was found \"dead, wrapped in plastic\" on a rocky beach.\nThe Barkers have a framed prom photo of the victim wearing a tiara prominently displayed: a similar photo of Laura Palmer remains the iconic Twin Peaks image.\nA local teenage boy wears a jeweled crown and in \"Peaks,\" Audrey Horne's little brother wore a Native American headdress.\nAn old woman and her grandson, like the Tremonds.\nThe only famous event of Dual Spires is the Sawmill burning in 1958, for Twin Peals it is the Elks Club burning in 1959.\nThe victim had a meeting with \"J\" who actually was her secret boyfriend.\nJulee Cruise's song \"Kool Kat Walk\" plays on the jukebox in the end of the episode.\nSomeone at the dinner is wearing a helmet and banging their head against the dinner table in the same way that Johnny banged his head against the wall after Laura didn't come to see him.\nBob is wearing exactly the same clothes as Bobby Briggs in the Pilot.\nBob walking backwards, which is how Lynch recorded the Black Lodge scenes.\nCarton Lassiter mimics one of the most famous lines of twin peaks \"That’s a damn fine cup of cider\" with his arm raised in a similar fashion to agent Cooper.\nA seven foot tall man similarly dressed as the Giant orders \"three\" cinnamon pies.\nCarlton's cider has solidified just as Agent Cooper's coffee did in the Black Lodge.\nRandy is barking at a dog which is a reference to Bobby barking at James in the Pilot.\nA woman is seen in the background dancing in a similar \"lateral moonwalk\" fashion to one of the high school students in the Pilot.\nMichelle Barker is dancing similarly to the way Audrey danced to the \"dreamy\" music playing on the jukebox.\nBob Barker is dancing holding a picture in reference to the way that Leland danced with a picture of Laura.\n\"Heavenly pie.\"\nThe end credits are accompanied by a shot of Paula's prom picture exactly like Twin Peaks and Laura.\nMichael Ontkean and Mädchen Amick were also approached to appear in the episode.\nTwin Peaks co-creator David Lynch was originally going to guest star in a speaking role as Mayor Douglas Fir, but Lynch was not asked due to James Roday's concern over what Lynch would think of the episode\nGravity Falls\nThe fourth episode, \"The Hand That Rocks the Mabel,\" protagonist Dipper Pines meets up with Gideon Gleeful in a club looking like the red room.\nThe bus driver of the last episode is played by Kyle MacLachlan for his previous role as Agent Cooper.\nThe role of the main antagonist, Bill, was originally offered to David Lynch but he declined.\nTeenage Mutant Ninja Turtles\nThe sixth episode of the fourth season \"Journey to the Center of Mikey's Mind\", the room with the checkerboard tile and the backwards-speaking Mikey may be a nod to the red room and the Man from Another Place .\nScooby-Doo! Mystery Incorporated\nEpisode 46, \"Stand and Deliver\", Scooby-Doo has a dream in the Red Room about following his girlfriend Nova (who's in a comma) (possibly a reference to Laura Palmer), through red curtains and finally meets with a small dancing man (voiced by Michael J. Anderson), who is heavily based on the Man from Another Place.\nEpisode 48, \"Nightmare in Red\", the whole Mystery Inc. gang visits the small dancing man from Scooby's dreams who is an author. He sends them in the \"sitting room, a world between worlds\" through hypnosis to face a monster and uncover its identity and to get his other half (the best part of him) back. These references play an important role in the progress of the show.\nJimmy Neutron: Boy Genius\nSeason 5 Episode 053B, a scene takes place in the Black Lodge.\nManiac Mansion\nEpisode \"Luck Be a Lady This Season\" (#2.1)\" (1991) - A scene features Casey and Tina dressed like Shelly Johnson and Audrey Horne eating a donut and drinking coffee. The music playing is similar to \"Laura Palmer's theme\".\nGreg the Bunny\nEpisode \"Blue Velveteen\" (#2.3) (2006) - The Wumpus is shown in a surreal fantasy sequence reminiscent of the series. His mumbled speech is subtitled, although the subtitles still make no sense to Greg. This is a reference to the man from another place.\nMuchachada nui\nEpisode #3.3 (2009) - The segment \"Miguel Indurain Presenta Muchachada Nuí\" spoofs characters, scenes and settings.\nDarkwing Duck\nEpisode \"Twin Beaks\" - On a visit to the titular town, Launchpad McQuack begins talking to a log and warning Darkwing that \"The cows are not what they seem.\"\nTorchwood\nSeason 3, Episode 1\"Children of the Earth: Day One\" (2009) - A home's 'for sale' sign lists \"Frost\" and \"Lynch\" as the estate agents.\nBates Motel\nCreator Carlton Cuse said that he was heavily inspired by Twin Peaks.\nSmackDown\nSegment \"Fashion Peaks\" from August 1, 2007\nStarts with an intro like the one of the revival\nTyler Breeze in a black suit investigates \"Deputy\" Fandango's disparition (possibly by aliens) linking them to Dale and Laura, he records a message to \"Diane\" and has fondness for \"damn fine \" coffee and donuts. Fandango has a missing poster \"Have you seen this person\" and \"disappeared 25 years ago\"\nTony Chimmel has the subtitle \"Killer Blob\" with the sticker \"Parasite\"\nBecky Lynch has the clue \"Lynch?!\" linking her to David Lynch\nKane as the clue \"Fire Walk With Me\"\nVelvet McIntyre has the subtitle \"Blue Velvet McIntyre\"\nThe Bella Twins have the subtitle Bella Twin Peaks\nSting has the subtitle \"Eraserhead?\" and the sticker \"Over my head\"\nTyler's coffee turns viscous before the scene turns red\nDuring the red colored dream, Fandango has a red shirt and dance like the Man from Another Place\nAt the beginning of the vision the light flickers and Tyler uses a line similar to Cole in the movie \"Fandango, is that you?\" to which Fandango answers \"em htiw klaw erif\"\nAt some point Tyler says \"no wonder this show got cancelled the first time\"\nKonnor has a log like the Log Lady\nAscension gives a rose to Fandango\nAscension and Fandango laughing is similar to BOB and the doppelganger from episode 29\nWhen waking up Tyler says \"I know who kidnapped Fandango\" similar to Cooper knowing the killer when waking up in episode 2\nRiverdale\nThe forty-ninth episode of the series is entitled \"Fire Walk With Me.\" Twin Peaks star Mädchen Amick is part of the main cast of the series.\nFilm\nClueless\nCher says \"I'm having a Twin Peaks experience.\"\nHype!\nMentioned by Art Chantry.\nA Body in the Woods\nOwls and the white horse\nSetting is in the woods\nScream 2\nFamous traffic light shot foreboding danger.\nMulholland Dr.\nMany thematic similarities. Michael J. Anderson plays a character that is thematically similar to the Man from Another Place, though played very differently. Originally conceived as a Twin Peaks spinoff with Audrey Horne as the central character.\nJane White Is Sick & Twisted\nMentioned in dialogue.\nNight Calls: The Movie\nA character asks another if she's been watching Twin Peaks reruns.\nJiminy Glick in Lalawood\nTheme music plays a couple of times.\nRakkaudesta rituaaleihin\nA Lynchlike mystery with clear references to Twin Peaks in storytelling. The \"White Room\" scene owes a great deal to Twin Peaks' \"White Lodge\".\nTwink Peaks\nTitle reference.\nGamers\nTrivia question on the radio.\nInland Empire\nLogger sawing wood at party in end credits is a joke reference to logging town Twin Peaks.\nGood Luck Chuck\nIn one scene Chuck's little friend and his blonde girlfriend (resembling Laura Palmer) speak and move in backward motion.\nModelo Burela\nA shot near the beginning is designed to mirror the \"Welcome to Twin Peaks\" shot in the series intro.\nNever Have I Ever\nFour characters in the film have last names that were chosen by the writer to obscurely reference characters in the series and David Lynch himself.\nThe Telling\nThe \"dead, wrapped in plastic\" line and a 911 operator that sounds like Lucy.\nThe Fourth Kind\nThe owls are not what they seem, and may be connected to Project Blue Book.\nqui a tué Pamela Rose?\nThe plot is spoofed\nComics\nThe Thing that Waits in the Fog\n\"Martin Mystère presents: Elsewhere Tales\", vol.2, November 1999, 140 pages\nIf there are several entrances to the Black Lodge across the United States, then they may exist all over the world. In 1896, an Englishman is mysteriously found near Ghostwood Forest (Washington State). Special agent Kyle Anderson (\"ancestor\" of Dale Cooper/Kyle MacLachlan) is sent to the man's home town in England to further investigate. There, he meets Sherlock Holmes. In the end, the creature from the Black Lodge closes down the British access to the Lodge for good, after challenging Sherlock Holmes to find another entrance in North America, if he wants to save several abducted souls.\nThe Shadow that Challenged Sherlock Holmes\n\"Martin Mystère presents: Elsewhere Tales\", vol.3, November 2000, 170 pages\n1896. Sherlock Holmes and Kyle Anderson move to the United States and keep fighting the Black Lodge creature, the same creature that lead Meriwether Lewis to suicide 90 years earlier. Their investigation leads them to \"a small town at the foot of two identical mountains\" (Twin Peaks name was omitted for copyright reasons).\nThis volume features: an older version of the Great Northern Hotel, the Ring, the petroglyph, a character inspired to both Ben Horne and Windom Earle, and more.\nThe Woman that Lived in Two Worlds\n\"Martin Mystère presents: Elsewhere Tales\", vol.5, November 2002, 140 pages\n1910. Fourteen years after the previous episode, an Englishwoman formerly attacked by the Black Lodge creature awakens from her coma, and asks for Sherlock Holmes and Kyle Anderson: half of her soul is still trapped in the Black Lodge. During the investigation, Sherlock Holmes himself is driven to madness, and only the secret psychic powers of the Elephant Man could save him.\nThe Thing that Waits in the FogThe Shadow that Challenged Sherlock HolmesThe Woman that Lived in Two WorldsDavid Lynch's masked Elephant Man is depicted on the back cover\nVideo games\nDay of the Tentacle\nThe famous line \"Damn good coffee!\" from Twin Peaks is said.\nMizzurna Falls\nStrongly influenced by David Lynch's Twin Peaks and Blue Velvet.\nLink's Awakening\nDirector Takashi Tezuka stated that Twin Peaks was an influence.\nPersona\nArt director Kazuma Kaneko stated that the Velvet Room from the series, at least in the first game, is inspired by the Black Lodge.\nSilent Hill\nThe series, especially Silent Hill 2, is influenced by Twin Peaks according to producer Akihiro Imamura.\nAlan Wake\nReferencing characters and the general feel of the game.\n \nDeadly Premonition / Red Seeds Profile (2010)\nA photo of the Great Northern Hotel can be seen in the hotel room where FBI Special Agent York Morgan stays.\nSigourney carries around a pot, as a reference to the Log Lady, but is used much more for comedic effect.\nSpecial Agent York Morgan is a lover of coffee like Cooper, but puts creamer in it as opposed to Cooper's preference for black coffee. He also uses unconventional methods of investigation and monologues to a person called \"Zach,\" much like Cooper's practice of addressing tapes to Diane.\nAnna Graham, whose death sparks the events of Deadly Premonition, is the most popular girl in town and dies from loss of blood. Laura's prom picture can also be found in Anna's room. Her name may also be a reference to both Annie Blackburn and her actress, Heather Graham.\nGreenvale, the game's setting, is located in Washington, just like Twin Peaks.\nA bag of red powder is found in Quint Dunn's motorcycle gas tank, similar to Bobby planting cocaine in James' gas tank.\nThomas MacLaine can be seen as a reference to Andy and Denise due to his sensitivity and cross-dressing practice, respectively.\nIn the game's extras, research photos from the development team can be found, taken at various landmarks where Twin Peaks was filmed in Snoqualmie and North Bend, Washington.\nLife is Strange\nOn Chloe's truck's license plates, the letters TWNPKS are written, shortened from Twin Peaks.\nIn Episode 2 of the game, \"Fire Walk With Me\" can be seen written in the bathroom mirror of the Two Whales Diner.\nIn Episode 4 a letter from Dr. Jacoby can be found in the Dark Room.\nRachel Amber shares her birthday with Laura Palmer.\nKentucky Route Zero\nThe general feeling of the game seems very Lynchian and especially Twin Peaks-like.\nPuzzle Agent\nThe plot is very reminiscent of the series.\nVirginia\nThe game seems influenced by Twin Peaks.\nThimbleweed Park\nThe game will be \"poking fun at Twin Peaks, True Detective and The X-Files, with a little Stephen King thrown in\".\nKathy Rain\nThe game's theme is inspired by Twin Peaks.\nThere is a direct reference to Twin Peaks said by its titular character, \"Contrary to popular belief, I don't believe the owls are more than they seem.\"\nBlair Witch Volume 1: Rustin Parr\nThere are several references in the game, most notably a Dale Cooper facsimile making a cameo appearance in the Burkittsville Diner, directly using quotes from the television show (\"Damn fine cup of coffee... and Hot!\"; \"This must be where pies go when they die.\"). His name is given as \"Hale\" only when chatting to him while the town sheriff is present\nFortnite\nA location in the game is called \"Twine Peaks\".\nCarmageddon 2: Carpocalypse Now\nThere is a hidden room reminiscent of the Red Room located in Beaver Woods. One of the courses in Beaver Woods is called Twin Shrieks which is an obvious reference to the show's title.\nGleaner Heights\nThe premise of the game is Harvest Moon x Twin Peaks.\nWatch Dogs 2\nThere is a location in the game called \"Twin Peaks,\" based on a real-life location. However, the game also describes it as \"the location of a famous TV show.\"\n428: Shibuya Scramble\nThere is a character in the game named Leland Palmer.\nA hostess club called Log Lady is visited.\nThe Council\nIn Episode 2, the player encounters a myna bird named Waldo, and like the Waldo in Twin Peaks, it recalls a violent attack.\nCube Escape\nThe main character is a detective called Dale Vandermeer, referencing Dale Cooper. The young woman who was killed is called Laura. A lot of references to Twin Peaks are made throughout the games.\nIon Fury\nA sign that can be found in a coffee shop and on coffee vending machines says, \"Damn good Coffee! ... and hot!\" a line spoken by Cooper in Episode 2.\nMusic\n\"Twelve Days of Christmas\"\na 1990 parody by some cast members for the Los Angeles rock radio station KROQ. This song was included in a Christmas album in the Los Angeles area by the station. The castmembers were Jack Nance, Dana Ashbrook, Frank Silva, Kyle MacLachlan, Kimmy Robertson and Robert Bauer.\n\"Weird Al\" Yankovic's song \"I Can't Watch This\" (a parody of \"U Can't Touch This by MC Hammer) from his 1992 album, Off the Deep End name-checks several television shows including Twin Peaks.\n\"Go\"\nTechno artist Moby sampled \"Laura Palmer's Theme\" for his 1992 song.\n\"The Giant\" & \"Ghost of Laura Palmer\"\nSongs by the Finnish Doom metal band Swallow the Sun from their Ghosts of Loss album refer respectively to the Giant and Laura Palmer.\n\"Transmission 3\"\nOutro track after the song \"What Does Your Soul Look Like (Part 1 - Blue Sky Revisit)\", DJ Shadow samples the voice of the Giant on the album Endtroducing.....\n\"The Things I Tell You\" & \"Hyperborea\"\nThe phrase \"Sorry to wake you... I forgot to tell you something... The things I tell you will not be wrong...\" by the Giant and Major Briggs' vision of light are respectively sampled on the classic ambient album Substrata by Biosphere.\nBritish Indie Rock band The Wedding Present covered \"Falling\" in the Hit Parade 1 album (1992)\n\"Black Lodge\"\nSong by thrash metal band Anthrax from the Sound of White Noise album (1993) with some help from Angelo Badalamenti.\nWind's Poem\nAlbum by Mount Eerie sonically and thematically references themes from Twin Peaks.\n\"Line of Sight\"\nThe song off Lonely Soup Day's Chocolate Bar EP has a music video that is an homage to Twin Peaks and was shot in a number of the series' iconic locations.\n\"Eroika\"\nThe hip-hop artist KOOL AD (formerly a part of the rap group known as Das Racist) refers to Twin Peaks in his song by saying \"Girls love me 'cause I act like Garfield; watchin' Twin Peaks, bitch, look I'm Laura Palmer.\n\"Twin Peaks: Fire Walk with Me\"\nAvant-metallers band Fantômas remixed the song \"Questions in a World of Blue\" for the album The Director's Cut (2001).\nGerman band Autumnblaze released the album Words Are Not What They Seem (2004), with a Twin Peaks-inspired title, artwork, and a cover of \"Falling\".\nBritish experimental artist V/Vm's 2008 release \"There Was A Fish... In... The Percolator\" uses samples from the series.\nAmerican artist Amanda Palmer's first solo album release in 2008 was entitled \"Who Killed Amanda Palmer\". A companion book with Neil Gaiman was released in conjunction with the album, focusing on the details surrounding the death of the fictional version of Amanda Palmer.\n\"Twin Peaks\"\nFor April Fools 2010, MC Chris released the parody song on his website.\n\"Laura Palmer\"\nThe lead singer of the band Bastille is a big fan of Twin Peaks. Their first album \"Bad Blood\" (2013) features two songs based on the show, the other one being \"Overjoyed\".\n\"Night Time, My Time\"\nSky Ferreira is a fan of Twin Peaks, and the titular song of her debut album Night Time, My Time is inspired by a conversation in Twin Peaks: Fire Walk with Me. She will also make an appearance in the upcoming 2017 revival of Twin Peaks.\n\"Real\"\nThe band Years & Years released a music video for their song (2014) that they say is inspired by Twin Peaks.\nXiu Xiu released the album Plays The Music Of Twin Peaks (2016).\n\"Talon of the Hawk\"\nThe fourth album by The Front Bottoms is partially titled from the character Hawk as the lead singer and his girlfriend were watching the show and thought the nickname sounded \"badass\".\n\"Wrapped in Plastic\"\nThe title of this Marilyn Manson song is a quote from Pete Martell in the pilot. It also contains looped samples of Laura Palmer's scream.\n“A Jack With One Eye”, recorded by American band Texas is the Reason, references One Eyed Jack's in the title. A reference to the Bookhouse Boys can also be heard before a 1996 live performance of the song at Brownies in NYC, New York.\nBooks\nWayward Pines\nThe author, Blake Crouch has acknowledged that he was inspired by the TV series.\nIn the Wayward Pines Sheriff's Departament, the receptionist is called Belinda Moran. His last name is a reference to Lucy Moran.\nWeb series\nHomestarrunner.com\nEverything Else, Volume 2 - In \"3 Times Halloween Funjob\", Marzipan's Halloween costume is the Log Lady.\nStrongbad_email.exe: Disc Five - In an Easter egg involving Coach Z in \"Alternate Universe\", this scene is paid homage to with red curtains and coffee pouring down Coach Z's head, which is what Dale Cooper spilled on himself. Also, Homestar's speech refers to this show by having it sound backwards, which is how the show's actors actually spoke before recording it forwards.\nEverything Else, Volume 3 (2007) (V) - In \"DNA Evidence\", two references to the show are made: first, the opening sequence's music sounds like the theme music of the show; second, the ending in which Strong Sad laughs maniacally and appears in various locations refers to the show's antagonist, Killer Bob.\nStrongbad_email.exe: Disc Six (2008) (V) - In an Easter egg for \"Underlings\", the promo for a TV show called Stink's Reach parodies the opening of this show."}