{"name": "Twin_Peaks:_Fire_Walk_with_Me", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks:_Fire_Walk_with_Me", "text": "Twin Peaks: Fire Walk with Me\nTwin Peaks: Fire Walk with Me (released internationally as Twin Peaks: The Movie) is a 1992 American psychological thriller film directed by David Lynch and written by Lynch and Robert Engels. The film can be viewed as both prologue and epilogue to the television series Twin Peaks, created by Lynch and Mark Frost. The film revolves around the investigation into the murder of Teresa Banks (Pamela Gidley) and the last seven days in the life of Laura Palmer (Sheryl Lee), a popular high school student in the fictional Washington town of Twin Peaks, of which these two connected murders were the central mysteries of the television series. Additionally, the film's convoluted narrative references - and clarifies - Agent Dale Cooper (Kyle MacLachlan)'s fate in the series finale. Thus, the film is often considered a prequel - however, it also has features more typical of a sequel.\nMost of the television cast returned for the film, with the notable exceptions of Lara Flynn Boyle who declined to return as Laura's best friend Donna Hayward (she was replaced by Moira Kelly), and Sherilyn Fenn due to scheduling conflicts. Also, Kyle MacLachlan, who starred as Special Agent Dale Cooper in the TV series, was reluctant to return out of fear of getting typecast, so his presence in the film is smaller than originally planned.\nFire Walk with Me was greeted at the 1992 Cannes Film Festival with booing from the audience and met with negative reviews in the United States. The film fared poorly in the United States at the box office, partially because it was released almost a year after the television series was canceled (due to a sharp ratings decline in the second season), partially due to its incomprehensibility to the uninitiated and the fact that the film only appeals to a subset of the viewers of the Twin Peaks series. However, it was a commercial hit in Japan.\nA compilation of deleted scenes from the film, entitled Twin Peaks: The Missing Pieces, was released in 2014.\nPlot\n\"There's a lot of things that people don't know. It's the same way with me. Sometimes even much less than half is known. Sometimes more.Many things happened. Many things all at once, like a circus with dark creatures at night with flickering lights, and I knew... I knew a man named BOB. And when he came to visit me I knew that my life was over.And then, there was a time... when I cried. Because I saw what it was. And it was so beautiful. I was awake.\"\n ―Laura Palmer\nGordon Cole calls Agent Chester Desmond who is arresting two prostitutes and a school bus driver in Fargo. Cole assigns Chet to the mysterious murder of Teresa Banks in the town of Deer Meadow. Cole introduces Chester to his new partner, Sam Stanley, and they receive clues from Lil the Dancer, who communicates the case to be a \"Blue Rose\" case.\nAfter some difficulty with the local police force, Desmond and Stanley eventually view Teresa's body at a morgue, realizing that her ring is missing and that a letter \"T\" has been placed under her left ring fingernail. Desmond and Stanley learn about the victim's recent past from the town residents at Hap's Diner, where Teresa worked for a month, including a French-speaking girl saying \"La nuit est le bon moment\", the old guy with her, Jack, and Irene.\nThey investigate Fat Trout Trailer Park owned by Carl Rodd where Teresa lived, sighting a curious woman. Stanley leaves Deer Meadow after he finishes his part of the investigation, while Desmond remains behind for the \"Blue Rose.\" Desmond finds Teresa's ring on a dirt pile under a trailer, never to be seen again.\nMeanwhile, on February 6, at the same moment at the FBI headquarters in Philadelphia, long-lost Agent Phillip Jeffries re-appears after a nearly two-year long disappearance. He tells Gordon of the events he has seen, adding that Judy is not to be talked about. He recalls the reunion in the room above the convenience store of a little man, BOB, Mrs. Chalfont, her grandson, the Jumping Man, two woodsmen and the Electrician. Jeffries disappears into thin air.\nSpecial Agent Dale Cooper is sent to Deer Meadow to investigate Desmond's disappearance in the park. A resident asks Carl about her hot water while Cooper sees the words \"Let's rock\" on the windshield of Desmond's car. The clues to Teresa Banks' murder have led to a dead end. Cooper, however, is certain that her killer will strike again.\nOne year later in Twin Peaks, seven days before her murder, Laura Palmer goes to school with Donna Hayward. There, Laura takes cocaine and makes out with James Hurley. After school, Laura talks with Donna about the difference between Hurley and Laura's actual boyfriend, Bobby Briggs. Laura realizes that there are pages missing from her secret diary, and goes to tell her friend Harold Smith about the pages, saying that BOB did it, and getting mad at Harold for not believing in BOB. Laura gives Harold her diary.\nMeanwhile, Agent Cooper tells fellow FBI agent Albert Rosenfield that he believes the killer will strike again and describes the appearance of who he believes the victim will be.\nWhile preparing for her Meals on Wheels route, Laura sees Mrs. Chalfont and her grandson. Mrs. Chalfont gives Laura a painting, and her grandson informs Laura that the \"man behind the mask\" is in Laura's room. Laura lets Shelly Johnson deliver the remaining Meals on Wheels and returns home, where she sees BOB. As Laura rushes outside in terror, she sees her father Leland emerge from the house. Laura then realizes her father could be BOB.\n \nWhen the Palmer family is about to eat, Leland menaces Laura about her dirty hands, and questions her about her \"lovers.\" Later, about to go to bed, Laura hangs the painting she got from Mrs. Chalfont. She dreams about Cooper entering the Black Lodge, and little man telling Cooper that he is \"the arm\" and he sounds like a whooping sound. The arm shows Cooper the ring that Teresa Banks had, and Cooper tells Laura not to take the ring. Laura wakes up to find Annie Blackburn next to her in bed, covered in blood, and Annie tells Laura that \"the good Dale\" is trapped in the Black Lodge, that he can't leave, and that she should write it in her diary. Laura sees the ring in her hand. Laura awakens in the morning, and the ring is gone from her hand. Meanwhile, Bobby, Leo, and Jacques Renault discuss drug scores.\nLaura gets ready to go to the Roadhouse when Donna tells her of her wish to accompany her, but Laura says she's not invited. As Laura is about to enter the bar, she encounters the Log Lady. Inside the bar, Jacques Renault introduces Laura to two men, Buck and Tommy. As the group is about to leave for the Power and the Glory at the Canadian border to party, Donna shows up and wants to come too; impressed by her \"audition\" kiss, they let her. Within the Power and the Glory, Laura allows Donna's drink to be spiked. Laura discusses Teresa Banks' murder with Ronette Pulaski, then receives oral sex with Buck. Laura sees Donna barely conscious and topless making out with one of the men and in a moment of lucid rage takes her home.\nThe next morning, Laura tells Donna that she doesn't want Donna to become like her. Leland arrives and takes Laura home. On the way home, Mike shouts madly at Leland and Laura, shouting at Leland that \"the thread will be torn\" and showing Laura Teresa's ring.\nLeland pulls into a gas station parking lot to gather his wits, then recalls his affair with Teresa, and her murder at his hands. Later that same night Laura realizes that the ring she saw was the same one from her dream. The next night, Laura and Bobby take cocaine in the woods, and Jacques sends a drug messenger, Deer Meadow Sheriff's Deputy Cliff Howard, carrying an enormous amount of cocaine. The messenger takes out a gun, but Bobby shoots him and futilely tries to bury him as Laura laughs maniacally in drunken hysteria.\n \n \nThe next morning, James worries about Laura taking too many drugs. That night, BOB comes through Laura's window and begins raping her. She realizes that BOB is Leland, and warns Leland away from her the next morning. Upset over the realization that her father is actually BOB, and strung out on cocaine, Laura is unable to concentrate at school. Later, Laura refuses sex with Bobby, and he finally realizes that Laura was using him to get the cocaine. The angel in Laura's painting disappears.\nJames and Laura go to the woods and start to make out, but she tells James \"his Laura\" is gone. Screaming that she loves him, Laura runs away from James into the woods. Laura meets Ronette, Jacques, and Leo, and they hold an orgy in Jacques's cabin as Leland watches from outside. Jacques wants to have hard sex and ties Laura up. Leland attacks Jacques outside, and Leo flees in panic; Leland takes Laura and Ronette, both bound, to the train car.\n \nMeanwhile, Mike realizes that BOB/Leland is about to kill again, and chases after him. BOB/Leland takes a mirror and says he'll kill Laura if she won't let him inside her. Mike tries to get into the train car, and when Leland sees Ronette trying to let him in, he knocks her unconscious and kicks her out of the train car. Mike drops Teresa's ring as he flees the scene. Laura wears the ring, preventing BOB from going inside her. Angered that he can't enter her anymore, he brutally stabs her to death.\nBOB/Leland dumps Laura's body in the lake. As her corpse drifts away, BOB/Leland enters the Black Lodge, where he encounters Mike and the arm (who is seated at Mike's left side as the aforementioned \"arm\"). They tell BOB that they want their Garmonbozia (\"pain and sorrow\"). BOB returns it in the form of blood. Will Hayward unwraps Laura's corpse the next morning.\nLaura's spirit later sits in the red room, and notices Agent Cooper at her side, who has a comforting hand on her shoulder. Suddenly, an angel appears, and she begins to cry, and then laugh.\nCast\n\nStarring\nSheryl Lee as Laura Palmer\nRay Wise as Leland Palmer\nMädchen Amick as Shelly Johnson\nDana Ashbrook as Bobby Briggs\nPhoebe Augustine as Ronette Pulaski\nDavid Bowie as Phillip Jeffries\nEric DaRe as Leo Johnson\nMiguel Ferrer as Albert Rosenfeld\nPamela Gidley as Teresa Banks\nHeather Graham as Annie Blackburn\nChris Isaak as Special Agent Chester Desmond\nMoira Kelly as Donna Hayward\nPeggy Lipton as Norma Jennings\nDavid Lynch as Gordon Cole\nJames Marshall as James Hurley\nJürgen Prochnow as Woodsman\nHarry Dean Stanton as Carl Rodd\nKiefer Sutherland as Sam Stanley\nLenny Von Dohlen as Harold Smith\nGrace Zabriskie as Sarah Palmer\nKyle MacLachlan as Special Agent Dale Cooper\nFrances Bay as Mrs. Chalfont\nCatherine E. Coulson as The Log Lady\nMichael J. Anderson as The Man from Another Place\nFrank Silva as Bob\nWalter Olkewicz as Jacques Renault\nAl Strobel as Philip Gerard (The One Armed Man)\nGary Hershberger as Mike Nelson\nSandra Kinder as Irene at Hap's\nChris Pedersen as Tommy\nVictor Rivers as Buck\nRick Aiello as Cliff Howard\nGary Bullock as Sheriff Cable\nFeaturing by Order of Appearance\nJon Huck as FBI Agent\nMike Malone as FBI Agent\nJoe Berman as Bus Driver\nYvonne Roberts as First Prostitute\nAudra L. Cooper as Second Prostitute\nJohn Hoobler as Pilot\nKimberly Ann Cole as Lil the Dancer\nElizabeth Ann McCarthy as Giggling Secretary\nC.H. Evans as Jack at Hap's\nPaige Bennett as French Girl at Hap's\nG. Kenneth Davidson as Old Guy at Hap's\nIngrid Brucato as Curious Woman\nMargaret Adams as Fat Trout Neighbor\nCarlton L. Russell as Jumping Man\nCalvin Lockhart as The Electrician\nJonathan J. Leppell as Mrs. Chalfont's Grandson\nDavid Brisbin as Second Woodsman\nAndrea Hays as Heidi\nJulee Cruise as Roadhouse Singer\nSteven Hodges as Band at Roadhouse\nWilliam Ungerman as Band at Roadhouse\nJoseph \"Simon\" Szeibert as Band at Roadhouse\nGregory 'Smokey' Hormel as Band at Roadhouse\nJoseph L. Altruda as Band at Roadhouse\nJames Parks as Service Station Mechanic\nJane Jones as School Teacher\nKarin Robison as Angel in Train Car\nLorna MacMillan as Angel in Red Room\nStand - Ins\nDana Eskelson\nBarry Gregg Littman\nTraci Lynn Clauson\nStunt Players\nDiana Wagner-Boyd\nDave Boushey\nHannah Kozak as Ronette Pulaski\nKathleen Reilly\nUncredited\nPhilip Anagnos as Student \nWarren Frost as Doc Will Hayward (Pilot stock footage)\nAnne Gaybis as Dancer on Stage - The Pink Room \nJohn Nelson as Double R Diner Customer \nUnknown performer as Cole's brown-haired secretary\nUnknown performer as Cole's blonde-haired secretary\nBrian as FBI agent (the one with a mustache)\nUnknown performer as FBI Surveillance room guard\nThe Missing Pieces\nMain article: Twin Peaks: The Missing Pieces\nThe 2014 Blu-ray, Twin Peaks: The Entire Mystery and its stripped-down 2016 release, Twin Peaks: The Original Series, Fire Walk With Me & The Missing Pieces contain a feature-length compilation of deleted scenes from the film, titled Twin Peaks: The Missing Pieces. \nThe Missing Pieces were also included on the Criterion Collection's 2017 Blu-Ray and DVD releases of the film.\nShooting script differences\nThe Power and the Glory, the pink-colored room, was called Partyland\nFat Trout Trailer Park was originally called the Canyon Trailer Park\nAdded the first scene of the TV being axed\nAdded agent Gene to the school arrest\nThe script explains that the arrests at the school bus were of the driver and prostitutes.\nThe FBI agent portrayed by Mike Malone has a cast on his left arm since the set dresser broke it\nThe script had a scene with Gordon, Sam and Chet inside the airport instead of the exterior\nThe dialogue between Sam and Chet about Cole's code is shortened (including why the code exists)\nThe script states that Chet sees Cable's pile of steel bar at Deer Meadow's station\nRemoved dialogue of Sam using his machine in the morgue\nAdded Chet and Sam discussing after the autopsy to The Missing Pieces\nAt Hap's Diner, flickering blue light is due to someone trying to open a safe with a torch but the script instead mentions someone trying to fix a light at random. Jack still asks him about the light.\nFull dialogue with Jack at Hap's only with the Missing Pieces\nShortened the beginning of the discussion with Irene at Hap's asking why Jack let her work and removed the part about Teresa's friend\nAdded the French Girl at Hap's saying \"La nuit est le bon moment.\"\nIncluded the scene between Chet and Sam when getting out of Hap's Diner to The Missing Pieces\nRemoved Carl's lines about Teresa's proprietor, Mrs. Simmons, and Teresa's friend\nDeleted Sam and Chet inspecting Teresa's trailer\nAdded Carl's line and a shot of a pole when seeing the curious woman\nRemoved the scenes of Cliff at the trailer park and the golf ball that Chet finds under Teresa's trailer\nThe fight between Chet and Cable is included only with the Missing Pieces\nRemoved the dialogue between Sam and Chet after the fight which mentioned the light at Hap's\nAdded a pole and the woman wanting hot water from Carl\nRemoved the hand at the window of the Chalfont's trailer over the jade ring\nRemoved the scene between Cole and Albert\nThe scene of Cooper with Diane is included only to the Missing Pieces\nRemoved the scene of Gordon asking Cooper to investigate\nIncluded the scene between Cooper and Sam only with the Missing Pieces\nRemoved the beginning of the dialogue between Carl and Cooper\nIncluded the scenes of Jeffries in the Palm Deluxe hotel only to the Missing Pieces and added a line about Judy. Removed that Jeffries room is number 612.\nIn the script, Jeffries reappeared on 15 February 1989, one year after Cooper investigated Chet's disappearance. The release cut states it to be on 16 February 1988, the day Chet disappeared (before Cooper's investigation and the \"one year later\" caption). In the Missing Pieces, it was after Cooper's investigation. The Secret History of Twin Peaks eventually uses 1989 without the precise day of the year.\nIntercut Jeffries testimony with the convenience store scene for the original cut, cutting pieces from both. The script and the Missing Pieces have the complete Jeffries' scenes being before the conventional ones.\nAdded the Jumping Man, the Electrician, the monkey and the grandson's mask\nRemoved Mrs Tremond's line about not being made of atoms and the Woodsmens' lines\nThe script clearly states the Man from Another Place to be Mike\nRemoved BOB making a circle of fire leading to the Red Room\nAdded the Man from Another Place line about marrying someone with \"this ring\"\nAdded the lines \"Electricity\" and \"Garmonbozia\"\nRemoved Cole's line that he will be prepared for \"them\" after Jeffries disappeared again and the word association between Cole, Cooper and Albert. Cooper mentions Teresa and Albert mentions Tylenol.\nRemoved Laura and Donna's lines in the first scene and added them encountering Bobby and Mike.\nRemoved all of February 21, 1989, which was Johnny's birthday. The event is still mentioned in a Missing Pieces scene between Laura and Jacoby.\nBobby's reaction to killing Cliff Howard is changed from laughing uncontrollably like Laura to actually being horrified by the act.\nProduction\nTwin Peaks had only been canceled for a month when it was announced that David Lynch would be making a movie with French company CIBY-2000 financing what would be the first film of a three-picture deal. However, on July 11, 1991, Ken Scherer, CEO of Lynch/Frost productions, announced that the film was not going to be made because series star Kyle MacLachlan did not want to reprise his role of Special Agent Dale Cooper. A month later, MacLachlan had changed his mind and the film was back on.\nThe film was made without the Twin Peaks series regulars Lara Flynn Boyle and Sherilyn Fenn. At the time, the absence of these actresses was attributed to scheduling conflicts, but in a 1995 interview, Fenn revealed that the real reason was that she \"was extremely disappointed in the way the second season got off track. As far as Fire Walk with Me, it was something that I chose not to be a part of.\" Fenn's character was cut from the script and Boyle was recast with Moira Kelly. MacLachlan's reluctance was also caused by the decline of quality in the second season of the show; he said \"David and Mark were only around for the first season... I think we all felt a little abandoned. So I was fairly resentful when the film, Fire Walk with Me, came around.\" Although he agreed to be in the film, MacLachlan wanted a smaller role, forcing Lynch and co-writer Robert Engels to re-write the screenplay so that the Teresa Banks murder was investigated by Agent Chester Desmond and not by Cooper as originally planned. MacLachlan ended up working only five days on the movie.\nAnother missing figure from Twin Peaks was co-creator Mark Frost. The relationship between Lynch and Frost had become strained during the second season and after the series ended. Frost went on to direct his own movie, Storyville, and was unable to collaborate with Lynch on Fire Walk with Me.\nAccording to co-writer Robert Engels, an early draft of the film was set in 1954 (specifically the night of President Dwight D. Eisenhower's inauguration) and would have \"explained BOB and the Black Lodge inhabitants reasons for 'wanting to go home' on the series.\"\nFilming began on September 5, 1991, in Snoqualmie, Washington and lasted until October of the same year, with four weeks dedicated to locations in Washington, and another four weeks of interiors and additional locations in Los Angeles, California. When shooting went over schedule in Seattle, Washington, Laura's death in the train car had to be shot in Los Angeles on a soundstage during the last day of shooting, October 31, 1991.\nThemes\nLynch wanted to make a Twin Peaks movie because, as he claimed in an interview, \"I couldn’t get myself to leave the world of Twin Peaks. I was in love with the character of Laura Palmer and her contradictions: radiant on the surface but dying inside. I wanted to see her live, move and talk.\" And that he had \"not yet finished with the material\". Actress Sheryl Lee, who played Laura Palmer, also echoed these sentiments. \"I never got to be Laura alive, just in flashbacks, it allowed me to come full circle with the character.\" According to Lynch, the movie is about \"the loneliness, shame, guilt, confusion and devastation of the victim of incest. It also dealt with the torment of the father – the war in him.\"\nRelease\nTwin Peaks: Fire Walk with Me received a reaction quite the contrary to the television series. The film was entered into the 1992 Cannes Film Festival, where it was greeted with booing from the audience and met with almost unanimously negative reviews. According to Roger Ebert from The Chicago Sun-Times, the film was met with two extremes, one side being overall positive, while the other side being the exact opposite. Even the CIBY-2000 party at Cannes did not go well. According to Lynch, Francis Bouygues (then head of CIBY) was not well liked in France and this only added to the film's demise at the festival. After the Cannes showing, David Lynch said: \"It was a little bit of a sadness, You'd like to have everybody there, but (their characters) didn't have a bearing on the life of \".\nU.S. distributor New Line Cinema released the film in America on August 28, 1992. It grossed a total of US$1.8 million in 691 theaters in its opening weekend and went on to gross a total of $4.1 million in North America. The film flopped in the United States, partially because it was released almost a year after the television series was canceled (due to a sharp ratings decline in the second season) and partially due to its incomprehensibility to the uninitiated.\nAccording to the Internet Movie Database, despite its poor critical and commercial response Twin Peaks: Fire Walk with Me gained attention come awards time. The film was nominated for five Saturn Awards and two Independent Spirit Awards, including Sheryl Lee being nominated for Best Actress. The only awards won by the film were for Angelo Badalamenti's musical score, which won an Indie Spirit Award, a Saturn Award and a Brit Award.\nCritical reception\nMetacritic, which assigns a normalized rating out of 100 to reviews from mainstream film critics, reported that there were \"generally unfavorable reviews\", with an average score of 28% based on 16 reviews. The film holds a 53% rating on Rotten Tomatoes, with 19 of 36 critics giving the film a positive review. The website wrote of the critics' consensus: \"For better or worse, Twin Peaks: Fire Walk With Me is every bit as strange and twisted as you'd expect from David Lynch\".\nAmong the negative reviews, was Janet Maslin from the The New York Times wrote, \"Mr. Lynch's taste for brain-dead grotesque has lost its novelty.\" Fellow Times film critic Vincent Canby concurred, \"It's not the worst movie ever made; it just seems to be.\" In his review for Variety magazine, Todd McCarthy said, \"that Laura Palmer, after all the talk, is not a very interesting or compelling character and long before the climax has become a tiresome teenager.\" USA Today gave the film one-and-a-half stars out of four, calling it, \"a morbidly joyless affair.\" Rolling Stone magazine's Peter Travers wrote, \"And though the movie ups the TV ante on nudity, language, and violence, Lynch's control falters. But if inspiration is lacking, talent is not. Count Lynch down but never out.\" In her review for the Washington Post, Rita Kempley described the film as a \"perversely moving, profoundly self-indulgent prequel.\"\nAmong the positive reviews, Kim Newman from the British magazine, Sight & Sound stated: \"The film’s many moments of horror ... demonstrate just how tidy, conventional and domesticated the generic horror movie of the 1980s and 1990s has become.\" Mark Kermode has hailed the film as Lynch's \"masterpiece.\" Slant Magazine gave the film a four out of four stars, listing it in their '100 Essential Films' list.\nHome media releases\n\n2001 release\n\nFeatures\nFire Walk with Me\n2 Theatrical trailers\nReflections on the Phenomenon of Twin Peaks\nDirector David Lynch originally shot about five hours of footage that was subsequently cut down to two hours and fourteen minutes. The footage nearly appeared on New Line's Special Edition DVD in 2002 but was nixed over budgetary and running time concerns. In 2002, a French distribution company called MK2 began negotiations with Lynch to include the missing scenes, properly edited and scored, for a Special Edition DVD, which never surfaced. Most of the deleted scenes feature additional characters from the television series who ultimately did not appear in the finished film.\nIn 2007, dvdrama.com reported that MK2 was in final negotiations with Lynch about a new two-disc Special Edition that would have included 17 deleted scenes hand-picked by the director himself. It had been tentatively scheduled for release on October 17, 2007, but MK2 subsequently opted instead to re-release a bare-bones edition of Fire Walk with Me, citing that a new version including the deleted scenes has been put on hold indefinitely. In November 2008, Lynch had the following to say regarding the deleted scenes to Twin Peaks: Fire Walk With Me:\n...Twin Peaks: Fire Walk With Me is owned by a company called MK2 in France. And I spoke to them a couple of months ago...I've spoke to them several times about this...I think it will happen, but maybe the financial crisis is...affecting that in some way. I'm not sure what's going on. I'm pretty sure there's 17 scenes in that at least but its been a while since we've looked into that.\nA Blu-ray release of the film that had been slated for 2009 in the UK had been delayed indefinitely. Paramount Pictures (which has DVD distribution rights to the TV series) acquired the rights in Germany and most of the world excluding the US, UK, France, and Canada. Paramount released their DVD in 2007. The DVD was a port straight from the MK2 French edition.\nTwin Peaks: The Entire Mystery\nMain article: Twin Peaks: The Entire Mystery\nTwin Peaks: The Entire Mystery, a July 29, 2014 Blu-Ray release of the complete TV series and Fire Walk with Me, includes nearly 90 minutes of deleted and extended scenes from the film, entitled Twin Peaks: The Missing Pieces.\nCriterion Collection\nThe film was released on DVD and Blu-ray as part of the Criterion Collection on October 17, 2017. This edition contains the following:\nRestored 4K digital transfer\n7.1 surround DTS-HD Master Audio soundtrack (Blu-ray only)\nAlternate original 2.0 surround soundtrack (presented in DTS-HD Master Audio on the Blu-ray)\nNew interview with Sheryl Lee\nNew interview with Angelo Badalamenti\nTwin Peaks: The Missing Pieces\n2014 Actors' Discussion with Lee, Grace Zabriskie, and Ray Wise\nAn excerpt from Chris Rodley's Lynch on Lynch\nTwin Peaks: From Z to A\nMain article: Twin Peaks: From Z to A\nThe upcoming release Twin Peaks: From Z to A includes the film and The Missing Pieces along with both seasons of the original series as well as the 2017 series.\nLegacy and sequel\nAccording to the film's cinematographer, Ron Garcia, the film was very popular in Japan — in particular, with women, as Martha Nochimson wrote in her book on Lynch's movies, \"He surmises that the enthusiasm of the Japanese women comes from a gratification of seeing in Laura some acknowledgment of their suffering in a repressive society\". Released under the title, Twin Peaks: The Last Seven Days of Laura Palmer, it was greeted with long lines of moviegoers at theaters. In retrospect, Lynch felt bad that the film \"did no business and that a lot of people hate the film. I really like the film. But it had a lot of baggage with it\". The film's editor Mary Sweeney said, \"They so badly wanted it to be like the T.V. show, and it wasn’t. It was a David Lynch feature. And people were very angry about it. They felt betrayed\". Lee is very proud of the film, saying, \"I have had many people, victims of incest, approach me since the film was released, so glad that it had been made because it helped them to release a lot\".\nAfter Fire Walk with Me was released, Lynch reportedly planned two more films that would have continued and then concluded the series' narrative. However, in a 2001 interview, he said that the Twin Peaks franchise is \"dead as a doornail.\"\nIn October 2014, it was announced that the show would be returning as a limited series on Showtime, set to air in 2016. However, it was later delayed to a 2017 release and premiered on May 21, 2017.\nSoundtrack\n\nTwin Peaks: Fire Walk with Me\nMain article: Twin Peaks: Fire Walk with Me (soundtrack)\nThe film's soundtrack was released in August 1992.\nTwin Peaks: Season Two Music and More\nMain article: Twin Peaks: Season Two Music and More\nIn addition, a second soundtrack of music, entitled, Twin Peaks: Season Two Music and More, from both the series and the film was released on October 30, 2007. The following tracks were recorded specifically for the film:\n\"Blue Frank\"\n\"Half Heart\"\n\"Laura's Dark Boogie\"\nTwin Peaks Archive\nIn 2011, through DavidLynch.com, The Twin Peaks Archive began releasing all the unreleased music from the world of Twin Peaks. As of November 2011 this has included the following pieces from the film.\nTrack listing\n\"Deer Meadow Shuffle\" 5:21\n\"Deer Meadow Shuffle (film version)\" 4:40\n\"Mysterioso 1\" 5:08\n\"Mysterioso 1 (film version)\" 3:07\n\"Mysterioso 2\" 4:44\n\"Mysterioso 2 (film version)\" 3:28\n\"Girl Talk\" 2:07\n\"Birds In Hell\" 4:23\n\"RR Swing\" 2:00\n\"James Visits Laura\" 1:32\n\"Nightsea Wind\" 5:25"}