{"name": "Twin_Peaks,_Washington", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks,_Washington", "text": "Twin Peaks, Washington\n\"Twin Peaks is different, a long way from the world. You've noticed that. That's exactly the way we like it. But there's a... back end to that that's kind of different, too. Maybe that's the price we pay for all the good things. There's a sort of evil out there. Something very, very strange in these old woods. Call it what you want – a darkness, a presence. It takes many forms... but it's been out there for as long as anyone can remember.\"\n ―Sheriff Harry S. Truman\nTwin Peaks was a small logging town in northeastern Washington State, five miles south of the Canadian border and twelve miles west of the state line with Idaho. Its population was stated to be 51,201 (erroneously) on the welcome sign, before the 1990 census established that the real population was 5,120.1. Twin Peaks drew its name from the two mountains between which it lay, White Tail and Blue Pine Mountain.\nHistory\nSometime around August 1803, Dominick Renault arrived on the shore of Black Lake and opened a trading post a half mile above White Tail Falls.\nIt has been alleged that Lewis and Clark took a route that passed what would eventually become the town of Twin Peaks. The source of this claim is a June 1805 journal entry by Meriwether Lewis, who described \"two mountains of a singular appearance and more like ramparts of high fortification than works of nature.\"\nBetween 1875 and 1880, Owl Cave was discovered by men named Denver Bob Hobbes and Wayne Chance. This was just east of what later became Twin Peaks, within the present-day location of Ghostwood National Forest.\nBy 1888, the town of Twin Peaks existed along the shores of Black Lake and was settled by refugees, trappers, and thieves. The chief exports were dealt through Wakahannawawak Trading Post (eventually renamed Thor's Trading Post) and consisted of furs and potables. It is also rumored that opium was traded at the post.\nLumber would become the town's chief export with the opening of the Martell Mill, which would eventually be overtaken by the Packard Sawmill, which opened three years later and would continue to have the highest employment in Twin Peaks until 1989.\nA blizzard hit the town on December 19, 1889, and claimed the lives of over 43 citizens in the blizzard's first ten minutes alone.\nThe town's first mayor was John Hanford, who had been elected by July 4, 1891, when he created a cocktail called the \"Little Scottie.\"\nOn the night of February 24, 1902, a logjam on the river caught fire and spread onto the land of the town, claiming the lives of eight citizens. This event would later be referred to as \"The Night of the Burning River.\"\nIn 1905, Orville Horne arrived in Twin Peaks and opened Horne's General Store, which flourished after Thor's Trading Post suspiciously burned down. It would eventually evolve into Horne's Department Store by the 1920s.\nOrville Horne's son J.J. eventually opened the Great Northern Hotel, which went on to be operated (along with Horne's Department Store) by J.J.'s son, Benjamin.\nA local screening of the film 49th Parallel inspired a surge in local enlistment and necessitated the formation of the volunteer group Citizens Brigade. The group was led by Sheriff Frederick Truman and recruited men with the purpose of defending the town. This group would later go on to be known as the Bookhouse Boys.\nDwayne Milford was elected mayor of Twin Peaks in 1962, and served fourteen consecutive two-year terms.\nThe town held its first-annual Miss Twin Peaks Contest in 1969, crowning Norma Jennings as its winner. The 1973 winner died of an electric shock during the ceremony, and a moment of silence is held for her at the town's annual Candlelighting and Christmas Tree Ceremony.\nOn February 24, 1989, the town was shaken by the murder of its homecoming queen, Laura Palmer. Due to her murder being similar to the previous murder of Teresa Banks in Deer Meadow, Washington, the Federal Bureau of Investigation took helm of the case with Special Agent Dale Cooper. During Cooper's investigation, it was found that Laura's father, Leland, was responsible for her death.\nWhen the Packard Sawmill burned in 1989, the land was purchased by Benjamin Horne, who planned on developing it into a country club, Ghostwood Estates, but this project along with the land was repurchased by Catherine Martell.\nLater that month, the 20th-annual Miss Twin Peaks was held, crowning Annie Blackburn—sister of Miss Twin Peaks 1969, Norma Jennings—the winner. Seconds after her win, chaos ensued, perpetrated by former FBI Special Agent Windom Earle, who kidnapped Annie. Annie was recovered and hospitalized, but remained in a trance.\nThe day after the chaos of Miss Twin Peaks 1989, a bombing at the Twin Peaks Savings and Loan claimed the lives of Dell Mibbler, Pete Martell and Andrew Packard, who appeared to have actually survived the boat explosion that allegedly claimed his life in 1987.\nLocations\nMain article: List of Twin Peaks locations\nBehind the scenes\nLynch and Frost wanted the town's population to be 5,120 but the channel ABC found the figure to be too small and believed contemporary audiences would not be interested in the small town. As a result, the population on the 'Welcome to Twin Peaks' sign was changed to 51,201, despite the fact that the town never seems to be that big in the show.\nThe sign painter, Steven LaRose, was unaware of any population change. He came back to paint a new one for the 2017 revival.\nTrivia\nThe town has been given four different ZIP codes:\n59219, seen on the postcard sent from James Hurley to Donna Hayward in Episode 24. The real-life city with this ZIP code is Dagmar, Montana.\n99153, according to Twin Peaks: Access Guide to the Town. The real-life city with this ZIP code is Metaline Falls, Washington.\n98065, according to Norma's postcard from The Secret History of Twin Peaks. The real-life city under this ZIP code is Snoqualmie, Washington, where much of the show's exteriors were filmed.\n98045, according to the check issued to Robert Jacoby by Twin Peaks Town Council for his book Oh, What a Tangled Web... in The Secret History of Twin Peaks. The zip code used here is actually for the area around North Bend, Washington, where many of the exterior shots of the TV series were filmed."}