{"name": "Twin_Peaks_Murder_Mystery_Game", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks_Murder_Mystery_Game", "text": "Twin Peaks Murder Mystery Game\n \nTwin Peaks Murder Mystery Game is a board game published in 1991 by Paul Lamond Games Ltd. and designed by Cicero Greathouse and Michael G. Kennedy.\nPublisher's summary\nTwin Peaks must surely be the strangest town in America. Scarcely a day goes past without some weird occurrence. You really need your wits about you to fathom these mysterious events, but can you ever match up to the almost supernatural detection skills of FBI super-sleuth Agent Cooper?\nEnter the enigmatic world of Twin Peaks and test your powers of deduction. Weave your way through the web of premonitions and dreams; donuts and cherry pie, deciphering the cryptic clues as you go.\nAnd remember, in Twin Peaks, the owls are not what they seem.\nContents:\n1 playing board\n1 Agent Cooper's Handbook\n6 miniatures Pentagon puzzle\n1 pack of Suspect Cards\n75 donut counters\n1 die & 1 poker die\n6 playing pieces\nFour to six players\nFBI Agent's Handbook\n\"Winners don't use drugs\" - William S. Sessions, Director, FBI\nThe game's 20 pages rule book as written by Special Agent: Dale Cooper.\nIntroduction\n\"A Word About – The Inside TrackAs a Special Agent, you are obliged to pursue every clue and walk every pathway to investigate, apprehend, and prosecute any suspect or suspects, you deem to have a direct connection with your case bringing them to justice in a timely manner.Within this manual, you will find certain personality profiles, clues, and admissible evidence that will aid you in your task. It has consequently been pre-established that five clues linked directly to any of the following personalities are the required amount with which to secure your suspect.While treating yourself to copious amounts of sliced huckleberry pies, and fistfuls of glazed and sugared donuts, be forewarned that you are about to embark on a perilous journey; one of mystery, intrigue, danger at every corner, and the unexpected. Take heed and remain prepared at all costs: for many things are not what they seem!\"\nRules of Play\nThe board game is designed for two to six players (teen to adult) and the object of the game is to reveal the chief suspect in mysterious killings that have occurred in Twin Peaks and ensnare the killer before the other player(s). This is accomplished by collecting four Suspect Clue cards that match in poker suit and name (there are 50 in total), collecting twelve donut counters (there are 70 in total), and assembling the five points the Pentagram Deathtrap puzzle (there are 30 pieces divided into 6 sets on a perforated cardboard), thus \"trapping\" the suspect.\nThe playing pieces are:\ncolour\ntoken\nRed\nThe Heart\nBlue\nThe Pie\nGreen\nThe Poker Chip\nYellow\nThe Log\n(plays first)\nBlack\nThe Gun\nWhite\nThe Coffee Cup\nOnly five suspects have enough Suspect Cards to be trapped: Jacques Renault and Phillip M. Gerard have four, Leo Johnson and Leland Palmer have a few more cards and BOB has the most.\nMap of Twin Peaks\nAn original map of the town.\nA History of the Local Area\nIn 1887, the introduction of the locomotive opened the Cascade wilderness to the logging industry. Prior to this time the Chinook Indian tribes were among those Native Americans to precede the first white explorers Robert Gray and Lewis and Clark recognizing the beauty and opportunity of the Columbia River region. Places like the Twin Peaks locale were common to possess forests of fir pine, hemlock, and cedar so dense that they remained almost completely unexplored by man. Indeed, a man can still to this day, find himself quite easily lost after entering the Pacific Northwest woods after only a few dozen feet.\nThe Town of Twin Peaks\nPop. 51,201. Twin Peaks is located 5 miles south of the Canadian Border and 12 miles west of the state line in the Northeast portion of Washington State, near the Huckleberry Mountain Range. The economy is based on the conversion of wood and forestry products with many small cottage industries providing finished goods to support the area's many wood craftsmen, the minority of whom are of local Indian origins. From Seattle, travelling along 1-90; continue to State Road 21, then North into the Colville Indian Reservation and National Park areas. The twin tributaries of Deer Creek and the Kettle River converge upon the outskirts of the community to form Timber Falls jus below the Great Northern Hotel.\nTwin Peaks derives its name from the summits along the Huckleberry ridge, with Troublesome Peak standing at elevation 4,439 as the tallest of the two. High- way 21 connects at mid-town Twin Peaks with Sparkwood, but continues on some distance to Grand Forks, British Columbia across the Canadian border. Aside from the regional tribes of American Indians making up the population, the balance is a diversified grouping of Danes, Welsh and Dutch, along with small cluster of Irish mill workers who emigraled in the late 1800s, now residing along the river in low town.\nThe Darkness\nThere are many legends in American Indian lore about the deep woods. Things such as spirits and souls fill their religion and bear some consideration before casting such detailed accounts aside. Thankfully, there are protective attitudes in this otherwise sleepy town of Twin Peaks. Over the years stories of children found murdered in the woods have prompted the formation of a secret society chartered to keop the DARKNESS at bay, and has been in effect over the Course of many generations. The DARKNESS is an expression of the very presence of evil, the black nature of the forces of life. On one hand it is a natural force, yet on the other, it endeavours to confound and divert every attempt to civilize society. The DARKNESS is a disorganiaing element which bears watching for it may rear its head at any given moment however sacred, claiming back that which it jealously reveres as its own. Attempts to push back the deep shroud of the DARKNESS over the years have only caused it to harbour a greater determination to take humanity down with it, for it has shown a cunning, palience, and perversion to be compared to the instincts of certain beasts af prey stealing away the frail and the young. The DARKNESS is sometimes explained in local lore by the phrase: \"The Owls are not what they seem!\"\nPersonality Profiles\nDr. JacobyJosie PackardBlackieJerry HornePhillip M. GerardJean RenaultHank JenningsBenjamin HorneMargaret (Log Lady)Leland PalmerJames HurleyRonette PulaskiJacques RenaultLeo Johnson\n\"Occupation: Psychiatrist\nAge: 47\nObservations:\nKooky over anything Hawaiian\nConceal an as yet undisclosed body of knowledge concerning Laura\nIs a virtual encyclopedia of psychosis\"\n\"Occupation: Mill owner\nAge: 32\nObservations:\nWithdrawn and sullen, streetwise, hardened to life\nFormer prostitute in Hong Kong - maintains connections\nHusband, Andrew disappeared mysteriously in boat accident\nSexual liaison with Sheriff Truman\"\n\"Occupation: Madame of prostitution\nAge: 39\nObservations:\nVoluptuous Shady-Lady, hard-edged business woman, gambler\nAddiction to sex, power, and drugs\nOne of Laura's lovers\nConsider as dangerous criminal\"\n\"Occupation: Brother and assistant to Benjamin Horne\nAge: 38\nObservations:\nUnpredictably hostile, with tendency toward the extravagant\nWeasel-like in method and form, smarter than he lets on to be\nWomanizer and the dupe doing his brother's biddings\"\n\"Occupation: Travelling shoe salesman\nAge: 56\nObservations:\nSchizoid, with multiple personality disorder\nClaims to be \"Bob's\" ex-partner and knows him only in spiritual form as his demonic familiar\"\n\"Occupation: Drug czar\nAge: 49\nObservations:\nUnderworld dealings in all areas of crime, powerful and dangerous\nKnown murderer, amoral, holds no compassion for human life\nJacques and Bernard Renault's brother\"\n\"Occupation: Labourer / R&R café\nAge: 36\nObservations:\nParolee, ex-con indicated for vehicular manslaughter\nOld friend of Sheriff Truman, and conspiring with Josie Packard\nTactics involve underworld dealings with criminal connections\"\n\"Occupation: Owner of Great Northern Hotel, Horne's Department Store and One-Eyed Jack's\nAge: 52\nObservations:\nSingularly most powerful man in Twin Peaks\nHis brainchild is the developpement, \"Ghostwood Estates\"\nInvolved in any enterprise turning a profit, (including murder)\"\n\"Occupation: Homemaker\nAge: 58\nObservations:\nA troubled soul who shows her remorse over losing her husband in a forest fire by channeling her obvious psychic abilitis to inanimate objects\nShe was the last witness prior to Laura's murder when she heard footsteps and laughter at the foot of the trail near her cabin\nExhibits a special aptitude concerning woodlore, and wildlife (owls)\"\n\"Occupation: Attorney\nAge: 49\nObservations:\nSharp and conniving, seductive wit, and extrovertive persona\nUnpredictable mood swings exhibit obsessive behaviour patterns\nOvert preoccupation with Laura that indicates a guilt-driven remorse possibly due to unsettled father-daughter relationship\"\n\"Occupation: Student\nAge: 17\nObservations:\nTeenage rebel, introvertive, secretive and a loner\nLaura's secret boyfriend (he was last to see Laura alive)\nHas masked his grief by involving himself with Donna Hayward\"\n\"Occupation: Therapist\nAge: 21\nObservations:\nA frail and insecure individual with trauma and delusions\nObviously doted an attention from the opposite sex and poised herself as a \"plaything\" to certain members of the community\nLaura's lover on regular basis and was at the cabin with her\"\n\"Occupation: Bartender at Roadhouse\nAge: 43\nObservations:\nA slow witted individual with no mind for complicated matters\nA Canadian citizen taking odd jobs while dabbling in drugs\nWas at the cabin with Laura and Ronette before the killing\"\n\"Occupation: Truck driver\nAge: 26\nObservations:\nA cunning and dangerous man with a penchant for cruelty\nDrives a truck (Pink Pussycat) across the border and back\nWas the lead culprit in getting the girls up to the cabin and was a regular lover of Laura's providing her with variations of perversion and corruption\"\nThe Dream-Speaking Sequence\nA red room hommage sequence of the game with six different sentences differing for each player. Upon success, brings the player to a square of the board.\nThe Pentagram Deathtrap\nEach piece is a point of the pentagram and depicts a character from the series, putting the five pieces together forms a white horse in the central pentagon labelled \"BOB\". They can be collected rolling the poker die by going to the Inner Track through One-Eyed Jack's, Horne's Department Store, Easter Park or Laura Palmer.\nRoll\nTalisman\nJack\nOwl\nKing\nLittle Man\nQueen\nCousin\n10\nGiant\n9\nLittle Boy\nAce\nBOB\nInconsistencies\n\nWithin itself\nIn the introduction, Cooper states to collect 5 clues but the Rules of the game states that only 4 Suspect Clue cards are necessary.\nThe back of the box states that there are 75 donuts pieces but only 70 are included.\nAccording to the rules, rolling the Ace with the die gives the BOB pentagram piece, but there isn't a BOB piece, as Bob is made up of all five pieces. Furthermore, the box states to be 6 different Pentagram pieces.\nThe back of one of Leland Palmer's Suspect Clue card, \"A man in a smiling bag\", has been printed in reverse.\nThe handbook states to store the Suspect Clue cards on the \"space provided on the board\", but the board does not have any dedicated space.\nA square that tells to \"Advance to Saw Mill\" which is the very next square.\nWith other releases\nThe game's rule book contains age inconsistencies with other released materials for the following characters:\nLawrence Jacoby\nJerry Horne\nBenjamin Horne\nMargaret Lanterman\nLeland Palmer\nRonette Pulaski\nLeo Johnson\nIn addition to her age being incorrect, the handbook also erroneously states that Ronette Pulaski is a therapist, while her only occupations given in the rest of the franchise are student, the perfume department at Horne's Department Store, and prostitute.\nThe handbook states that Margaret Lanterman was a witness to the murder of Laura Palmer, while the witness was actually her log.\nOne Suspect Clue card has the suspect \"Wyndham Earle\" instead of Windom, and contains the clue, \"A Walther P.B.K. (James Bond's gun)\" instead of the PPK which was used by Josie and not Earle to shoot Cooper.\nOne square used the name \"Albert Rosenfeld\" instead of Rosenfield."}