{"name": "Twin_Peaks_Sheriff%27s_Hotline", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks_Sheriff%27s_Hotline", "text": "Twin Peaks Sheriff's Hotline\nThe Twin Peaks Sheriff's Hotline was a hotline provided for viewers to be filled in on details they may have missed during the second season of Twin Peaks, narrated by Kimmy Robertson, Harry Goaz, and Warren Frost as Lucy Moran, Andy Brennan, and Will Hayward, respectively, alongside an uncredited voice actor. Each weekly message provides a recap to accompany episodes 9 to 15 of the series, with the final message summarising events across the season due to no new episode being broadcast. The now-defunct hotline's number was 1-900-860-0911, and cost callers $2 for the first minute and $1 for each minute thereafter. Supposedly, parts of the proceeds were donated to environmental causes.\nThe television promo and recordings of the hotline were released on Twin Peaks: Definitive Gold Box Edition, Twin Peaks: The Entire Mystery, and Twin Peaks: From Z to A.\n\"Twin Peaks Theme\" (\"Falling\") ended most of the spots. \"Dance of the Dream Man\" provided the background music to all of the mysterious voice segments except the final one, which used \"Laura Palmer's Theme.\"\nIn Twin Peaks, every episode (with minor exceptions) comprised a single day in the life of the characters. However, in the hotline's recordings, these one-day accounts are presented as weekly accounts probably so the characters can finish their calls by seeing that they will be here \"next Sunday.\"\nThere is no explanation on how Lucy's phone in Tacoma is able to answer a call placed to the station or how the narrator voice also cuts in, violating the basic expectations of a telephone call. It may have been White Tail and Blue Pine mountains and their strange electromagnetic influence on everything that happens in town.\n1-900 promo spot\nLucy is answering to someone who is not using the phone for official sheriff's business. Then the narrator tells real world information about the hotline.\nMessage 1\nLucy tells the caller that she used to work for Meals on Wheels and that Donna met a woman who dislikes creamed corn. Then Andy picks up his own phone and talks about a horse race before him and Lucy recounts that Ronette and Leland recognized Bob's drawing, Albert saying that Windom Earle had vanished. Then, the line is hijacked by an unknown character, who mentions Audrey seeing Battis at One Eyed Jacks before being caught by Blackie, Briggs showing space signals to Cooper, Ben and Jerry having both Mill ledgers and that Donna will soon visit Harold, but also that she shouldn't, according to him. When the line returns to Lucy, Andy says that Hank used to be a Bookhouse Boy and invites Lucy to eat smelt fries at the VFW next Friday, but she declines.\nMessage 2\nA depressed Lucy starts talking about Dick but when Andy picks up his phone, she says that she was talking about Austria before Andy recounts his own trip there. Lucy then hangs up on Andy and picks up Doc Hayward's call stating how Ronette's killer put the letter \"B\" under her fingernail and a blue liquid in her IV, how Nadine suffered memory trauma after waking from her coma and expects Jacoby to deal with it when he is fit. The line is hijacked once again by the narrator, recounting Donna's meeting with Harold who has Laura's secret diary, while Jean Renault plans to kill Cooper. The line returns to Lucy, Doc and Andy but Will must go to a patient. Lucy and Andy mention the missing One-Armed Man, who was seen injecting himself with chemicals and Leland being arrested for Jacques' homicide.\nMessage 3\nLucy starts complaining about Dick to the caller before Andy tells her that her mom is calling. Then Andy tells the caller that his sperm is better and that Judge Sternwood has arrived for Leland's trial. The line is hijacked and the narrator says that Jean made a deal with Ben trading Audrey with Cooper and killed Battis while Josie returned, awaited by her cousin Jonathan, who cut her relation with Hank, and Donna still sees Harold. Lucy returns and complains that Andy talked about the baby to her mother, who fiercely told him to marry her.\nMessage 4\nLucy tells that she is with her sister Gwen in Tacoma while her baby is crying in the back. Lucy, who was talking to Miss Zipman, asks Andy about Twin Peaks' news, prompting him to talk about Leland and Leo's trial and his drawing of Leland. The narrator then interrupts Andy, who was about to say something to Lucy to tell the caller about Donna failing to steal Laura's diary from Harold, Cooper rescuing Audrey and Jean killing Blackie. Lucy comes back wondering if she is talking to Mrs. Zipman before Andy corrects her, prompting her to recount Andy hyperventilating in French class before hanging up on him before he could say what he wanted.\nMessage 5\nAndy picks up since Lucy is still away and he had to buy groceries in her stead. He then reads his memo where he says that James, Donna and Maddy stole the secret diary from Harold but is interrupted by a call from Lucy. The narrator then hijacks the line to tell the caller that Cooper learned about Jean's homicidal intentions, that Leo had a party from Bobby and Shelly and that the money they expected was a disappointment, that Cole arrived to talk about Earle and the tissue found about the person who shot Cooper, that Maddy and Josie want to leave and that the One-Armed Man has a dual personality hunting for BOB, who has been in Twin Peaks at the Great Northern Hotel for 40 years. The call between Lucy and Andy comes back at the moment they finish talking.\nMessage 6\nAndy picks up since Lucy is still away, he managed to play some of his trumpet's sounds on the phone with Lucy's indications, but shot the department's lights out and burned his finger the day before. Lucy then makes a non-personal call to know what happened last week, he then says that has been playing trumpet before saying that Harold hanged himself. The narrator then takes over and says he did not like Harold, that Laura's diary mentions Killer BOB to be a friend of her father and that she has something to say about Ben, that Audrey revealed all she discovered about One Eyed Jacks to her father, prompting him to admit he slept with Laura, which after being repeated put Ben in jail. He continues, saying that Nadine went to the Double R, but still has trouble with time and that Tojamura actually was Catherine. The narrator is interrupted by Lucy's voice, Andy says that the line was dead and he did not hear anything which upsets her and makes her hang up. Andy plays trumpet again and the narrator comes back telling the caller that BOB killed again.\nMessage 7\nLucy picks the phone and talks about her Tacoma family but Andy arrives, saying that last week, he mistook Gwen's child with Lucy's before saying the news from Cooper and Harry: the One-Armed Man escaped but was caught again and that Harry charged Ben with the murder. Screams are heard while he says the news. The narrator takes over and says that Catherine was with Ben during the murder, exhorting him to sell back the Mill for her to provide the alibi, that Shelly found a tape of Leo and Ben about burning the Mill, and that Hank comes back one day late to the Double R and meets his prison friend Ernie Niles. When Lucy and Andy are back, Andy is crying after learning about Maddy's murder.\nMessage 8\nOnly the narrator is heard, making a summary of the show so far: Laura's corpse was found by the Packard Mill and Ben is the most likely suspect, having been arrested by Harry and Cooper after finding the secret diary and Audrey's testimony. He says that Bobby found a cassette in Leo's boot, proving Ben to have burned the Mill, Norma is displeased from seeing her mother and Ernie while expecting a food critic, Shelly quit her job for Leo, Donna is depressed about Harold and Maddy, the One-Armed Man is strained from the tracking of BOB, that Leland has BOB lurking inside and killed his niece, and Nadine is still amnesiac but has superhuman strength. He says Lucy and Andy will be back next week."}