{"name": "Twin_Peaks:_The_Missing_Pieces", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks:_The_Missing_Pieces", "text": "Twin Peaks: The Missing Pieces\nTwin Peaks: The Missing Pieces is a feature-length compilation of deleted scenes from the 1992 film Twin Peaks: Fire Walk with Me. It premiered as film feature at the Vista Theater in Los Angeles, with crew and cast members attending, on July 16, 2014.\nIt was originally released as part of Twin Peaks: The Entire Mystery and is also included in the Criterion Collection release of Fire Walk with Me. It was also included in the Blu-ray release Twin Peaks: From Z to A.\nContents\n\nDesmond's MO\nAgent Sam Stanley and Agent Chester Desmond exit the morgue after performing the autopsy, and comment on how it is already nighttime.\nSay Hello to Jack\nAgent Stanley and Agent Desmond talk to Jack, the owner of Hap's Diner, about Teresa Banks. Jack directs them to Irene, who was Teresa's supervisor.\nOnly the tail end of this scene appears in the finished film.\nGood Morning Irene\nWalking out of the diner as the sun rises, the FBI agents say good morning to Irene (referencing Jack's discouragement of saying \"Goodnight Irene\") as she gets in her car and heads home.\nThis One's Coming from J. Edgar\nSheriff Cable of Deer Meadow \"takes it outside\" with Chester Desmond for Teresa Banks's body. Cable shows off his strength bending a strand of rebar, only to get completely pummeled by Desmond, who finishes off the fight by bending his own strand of rebar. The deputy and the secretary abandon the scene in fright.\nCooper and Diane\nCooper stands in the doorway of his office and talks to Diane (unseen and unheard) offscreen. Diane has challenged him to figure out what she changed about the room. After thinking about it, Cooper figures out she moved the clock a few inches from its original position.\nStanley's Apartment\nCooper talks to Agent Stanley after Chester Desmond vanishes. Sam is a little awkward around Cooper, who eyes some of Agent Stanley's possessions (namely a vat of liquid) with puzzlement. Sam asks him about Lil's blue rose, but Cooper avoids answering.\nBuenos Aires / Above the Convenience Store\nPhillip Jeffries is in the lobby of a hotel in Buenos Aires, the Palm Deluxe. The concierge gives him a key. Jeffries asks if there is a \"Miss Judy\" at the hotel. The concierge responds by giving him a letter \"the young lady\" left (though it is not clear if he is talking about Judy or someone else).\nMore of Jeffries' rant in the FBI office is shown, without the \"Above the Convenience Store\" sequence over his appearance. Gordon makes Albert leave to check with the front desk, then tries to call for security, but gets no response. Cooper notices the lights flickering and leaves to check the hallway. As Cole shouts \"MAYDAY!\" Jeffries looks at a calendar and realizes to his shock that it is February 1989. Cole looks up and discovers Jeffries has disappeared, leading into the part seen in the film.\nJeffries abruptly appears on a staircase in Buenos Aires in severe pain. A maid is stumbling away, while a porter proclaims he has soiled himself while asking where Jeffries went. He screams \"Ayúdame\" (Spanish for \"Help me\") over and over as Jeffries himself starts screaming.\nMore of \"Above the Convenience Store\" sequence, with some more dialogue from The Man from Another Place after a shot of the pole numbered 6 with the arm's whooping sound.\nBesides the audio, which is cut up and rearranged, only some very quick shots of Jeffries' rant and subsequent return to Buenos Aires appear in the final cut.\nMike Is the Man / Sharing a Cigarette\nLonger introduction of Bobby Briggs and Mike Nelson, which is only briefly seen in a montage in the finished film. They discuss the fact that they owe Leo Johnson $5,000 and that their cocaine supply is running low.\nSchool Books\nLaura runs down the stairs after discovering someone ripped pages from her diary. She runs into her mother coming back from getting the groceries. She asks to use the car, claiming she forgot her books. Sarah gives her the keys and takes away her cigarette.\nThe Palmers\nLaura comes back at dinnertime, and is confronted by Sarah, who accuses her of lying about losing her school books. She notes Laura stole her blue sweater, and asks why she lied. Laura claims she had to see Bobby.\nThe Palmer family dining room shakes and Leland stomps in pretending to be a hungry lumberjack, which Laura and Sarah watch with rolled eyes. He then sits down and starts speaking Norwegian, explaining that the Norwegian investors are coming next week and he wants his family to know how to say \"Hello, my name is—\" in Norwegian. Sarah reluctantly learns, and Laura joins, and they join hands and start repeating the phrase until they are laughing and having a good time.\nLaura's Party\nLaura sneaks out of her house and meets a trucker. She exchanges sex for drugs.\n2x4\nDell Mibbler comes to the Packard Saw Mill and complains to Josie Packard and Pete Martell that their two-by-fours are not exactly two inches by four inches. His complaints distress Josie and frustrate Pete, who finally wins Dell over by pointing out that at Dell's bank the dollar is not worth the same as it used to be. Dell quickly (or as quick as he is capable of being) apologizes.\nKind of Quiet\nLonger scene in the Double R Diner with Laura helping out with Meals on Wheels. Ed and Nadine Hurley come in for coffee. Nadine sees Norma working at the counter and angrily drags Ed out.\nShelly sees Laura staring at the place where Mrs. Tremond and her grandson were standing. Laura runs away, and Shelly goes back into the diner. Norma sends Shelly to do Laura's route. The cook peeks in and comments that the diner is kind of quiet. Norma starts crying in a booth. Ed comes back in and apologizes to her and they make plans to meet later.\nBest Friends\nAfter Laura runs to Donna's house crying, Donna lets her in, and Will and Eileen Hayward look after her. Leland calls Laura back home, and Will and Eileen show obvious suspicion that something is off.\nOnly the start of this scene appears in the final cut, with no appearance by Donna's parents.\nI'm the Muffin / The Ring\nDonna shows Laura out of the house, with the two calling each other \"the muffin.\" As she leaves, Laura shouts out to Donna that \"I'm the muffin!\" This interaction is referred to with Laura's line in the Power and the Glory bar in the final cut.\nLonger scene of Cooper with The Man from Another Place, with the two interacting more than they did in the final cut. The Man introduces the ring to Cooper and poses the question \"is it future or is it past?\" This question is later repeated by Mike in Part 2.\nBob Speaks Through Laura / Blue Sweater\nA longer version of Laura's possession under the ceiling fan, and speaking to BOB.\nSarah accuses Laura of stealing her blue sweater again, only to realize she was wearing it. She bemoans having another nervous breakdown as Laura tries to comfort her.\nSunday at the Johnson's\nWhile people are at church on Sunday, Leo is showing Shelly the \"correct\" way of cleaning the floor.\nThis is a longer version of the scene that appears in the final cut.\nSmash Up\nNorma and Ed sit in a truck in the forest, listening to music and discussing their relationship.\nThis scene is unscripted.\nThe Power and the Glory\nLaura and Donna arrive with their hook-ups at the Power and the Glory room in the CAN-A-DO AND US OF FUCKING \"A\" bar with the barman Dennis, at the Canadian border.\nThis scene clarifies that the Pink Room scene was not actually in the Roadhouse, which is not so obvious in the finished film.\nFire Walk with Me\nMike sits shirtless in his motel room, lighting a circle of candles, and saying in backwards-talk, \"Fire walk with me.\"\nParty Girl\nAfter reading about her in Flesh World, Leland calls Teresa Banks, who invites him to the Red Diamond City Motel.\nAfter Leland runs off, Teresa tells Laura and Ronette that her client flaked on them, leaving the three alone in the motel room. She brushes her hair with her hand, prominently displaying her ring. Pieces of this scene appear in Laura's flashback of the ring in the final cut.\nShortly after witnessing Leland's outburst, Teresa's suspicions are raised, and she calls Jacques Renault, asking what Ronette Pulaski and Laura Palmer's fathers look like. After giving her descriptions, Jacques asks why. She gives a bogus explanation regarding a supposed assault. She quickly hangs up, snickers to herself, and then calls Leland at his office in a bid to blackmail him. This event is referred to by Renault during the Pink Room scene in the final cut.\nDon't Forget / Laura's Secret Stash\nLeland cheerfully reminds Laura while heading out that it is Johnny Horne's birthday. Laura and Sarah sit at the table silently.\nLaura snorts the last of her stash. This is essentially the same scene that appears in the film, with a few seconds added at the beginning and end of her reflecting.\nBernie the Mule\nHarry, Andy, and Hawk discuss setting up a trap for Bernard Renault. Andy comments that Bernie is coming in on foot, and Harry confirms this. After an awkward silence, Harry asks if he means they will have a lot of paths to cover, but Andy explains he merely thinks he'll have a lot of walking to do. Hawk quickly exits, followed by Andy after being dismissed by a puzzled Truman.\nI Killed Someone\nThe day after the drug deal turned lethal, Bobby confronts Laura at her locker and tells her to hide the $10,000 in her safety deposit box. Laura is unfazed by Bobby's stress and mocks his remorse, which angers him.\nBaby Laxative\nBobby inspects the cocaine bag in the woods, only to realize that it is baby laxative. He curses as he angrily dumps the contents out of the bag.\nSend Me a Kiss\nDr. Jacoby calls Laura the day before her death, right after she does some coke. He chastises her for not calling him. Laura can tell he has become infatuated. She says that she was at Johnny's birthday and mentions making some audio tapes for him, which were heard in the actual series. She gives up on snorting the last line of cocaine.\nAsparagus\nOn the night of her death, Laura is eating dinner with her mother, though she refuses to eat the asparagus as mentioned in her diary in the series. Sarah tells her Leland is staying late with Ben to work on the plan for the Norwegians. Laura tells her she's going to Bobby's to do homework. Sarah tells her it's a school night, but reminds her to be back at nine. After Laura leaves the room to put away her dishes, Sarah anxiously lights a cigarette. Laura leaves the house.\nBobby and Laura in the Basement\nMajor Briggs reads to Betty from the Book of Revelation. Betty lets Laura in.\nBobby reveals to Laura that the supposed cocaine they picked up and killed the mule for was actually baby laxative. Bobby is dealing with the consequences of what he has done, while Laura's thoughts are on getting more cocaine. Bobby gives her the cocaine and lets her snort it.\nThe two kissing and Bobby handing her the cocaine appears in the final cut.\nAfter he and Laura officially break up, Bobby shows her out of the house. After closing the door he pulls out a cigarette and starts to light it. Major Briggs looks up and tells Bobby to put out the cigarette. Major Briggs continues reading.\nGoodnight Lucy\nLucy calls Harry and Andy in the interrogation room. She tells Harry that Josie Packard saw a prowler. Harry tells her he's on his way and tells Andy to monitor the radio. Lucy speculates over the intercom what the prowler was, and screams in surprise when Harry appears at the front desk. Andy hears this and runs to see what's going on. Meanwhile, Lucy realizes Andy is no longer in the meeting room and runs to check on him. They collide in the hallway and scream. A similar situation occurs in the 2017 revival with Lucy's reaction to cellphones.\nWaiting for James\nWhile sneaking out on the night of her death, Laura waits outside her home for James. She watches Leland/BOB come home, and prays that he go into the house. Leland turns and stares in her direction before going inside. James pulls up in his motorcycle shortly afterwards.\nThis scene was edited in the final cut to show Laura climbing down just as he pulls up.\nDistant Screams\nAt her cabin, The Log Lady listens to Laura and Ronette's screams with sadness, as she mentions in Episode 5.\nLonesome Foghorn Blows\nLaura's body floats below the rock on the shore in front of the Packard estate, a few hours before Pete will find her. A similar shot appears in the final cut, although this version takes place while the sun is rising as opposed to the dark of night.\nEpilogue\nA shot of Glastonbury Grove, with the word card \"Some months later,\" picking up after the end of Episode 29. Annie after rescue from the Black Lodge was brought from Glastonbury Grove to hospital by Sheriff Truman. She is unresponsive with her face bloodied. She is wearing Caroline's dress on the stretcher, whereas in Episode 29 she wore black upon exiting the Black Lodge.\nStill in the Black Lodge, Cooper encounters the Man From Another Place. They repeat their earlier interaction, but this time the ring is nowhere to be seen. Cooper asks the Man where the ring is. The Man replies that \"someone else has it now.\" Cooper realizes to his horror that it is with Annie. He then asks how he can leave the Black Lodge. The Man replies that there is no place to go but home and begins to cackle and dance as tears well in Cooper's eyes.\nAnnie is being tended to by registered nurse B. Roundtree, and suddenly delivers her message to Laura, although she does not appear to be aware of her surroundings. The nurse selfishly steals the ring.\nMeanwhile, at the hotel, Dr. Hayward and Sheriff Truman hear Cooper/Bob hit his head against the mirror and rush to check on him. The doppelgänger, still cackling \"How's Annie?\" hears them and quickly lies on the floor. They come in and help him up. The doppelgänger claims he struck his head against the mirror and it \"struck as funny.\" When Truman tries to tell him they should go to a hospital, the doppelganger replies, \"But I haven't finished brushing my teeth yet.\"\nCredits\n\nCast in Order of Appearance\nChris Isaak as Special Agent Chester Desmond\nKiefer Sutherland as Sam Stanley\nC.H. Evans as Jack at Hap's\nSandra Kinder as Irene at Hap's\nRick Aiello as Cliff Howard\nElizabeth Ann McCarthy as Giggling Secretary\nSteven Beard as Crime Van Driver (Missing Pieces only)\nGary Bullock as Sheriff Cable\nKyle MacLachlan as FBI Special Agent Dale Cooper\nDavid Bowie as Phillip Jeffries\nHirsh Diamant as Head Clerk (Missing Pieces only)\nStefano Loverso as Bellhop (Missing Pieces only)\nJeanne Bonser as Dancer (Missing Pieces only)\nAlex Samorano as Dancer (Missing Pieces only)\nMichael J. Anderson as The Man from Another Place\nCarlton L. Russel as Jumping Man\nCalvin Lockhart as The Electrician\nJürgen Prochnow as Woodsman\nDavid Brisbin as Second Woodsman\nJonathan J. Leppell as Mrs. Tremond's Grandson\nFrances Bay as Mrs. Tremond (Chalfont)\nFrank Silva as Bob\nSheryl Lee as Laura Palmer\nDavid Lynch as FBI Regional Bureau Chief Gordon Cole\nMiguel Ferrer as FBI Agent Albert Rosenfield\nDori Guterson as Maid (Missing Pieces only)\nGary Hershberger as Mike Nelson\nDana Ashbrook as Bobby Briggs\nMoira Kelly as Donna Hayward\nGrace Zabriskie as Sarah Palmer\nRay Wise as Leland Palmer\nBrian T. Finney as Trucker (Missing Pieces only)\nJack Nance as Pete Martell (Missing Pieces only)\nJoan Chen as Jocelyn Packard (Missing Pieces only)\nEd Wright as Dell Mibbler (Missing Pieces only)\nMädchen Amick as Shelly Johnson\nPeggy Lipton as Norma Jennings\nAndrea Hays as Heidi\nWendy Robie as Nadine Hurley (Missing Pieces only)\nEverett McGill as Big Ed Hurley (Missing Pieces only)\nMarvin Rosand as Cook (Missing Pieces only)\nWarren Frost as Dr. Will Hayward (Missing Pieces only)\nMary Jo Deschanel as Eileen Hayward (Missing Pieces only)\nEric DaRe as Leo Johnson\nVictor Rivers as Buck\nChris Pedersen as Tommy\nDennis E. Roberts as Dennis the Bartender (Missing Pieces only)\nAl Strobel as Philip Gerard (The One Armed Man)\nPamela Gidley as Teresa Banks\nPhoebe Augustine as Ronette Pulaski\nWalter Olkewicz as Jacques Renault\nMichael Horse as Deputy Tommy \"Hawk\" Hill (Missing Pieces only)\nHarry Goaz as Deputy Andy Brennan (Missing Pieces only)\nMichael Ontkean as Sheriff Harry S. Truman (Missing Pieces only)\nRuss Tamblyn as Dr. Lawrence Jacoby (Missing Pieces only)\nDon S. Davis as Maj. Garland Briggs (Missing Pieces only)\nCharlotte Stewart as Betty Briggs (Missing Pieces only)\nKimmy Robertson as Lucy Moran (Missing Pieces only)\nJames Marshall as James Hurley\nCatherine E. Coulson as The Log Lady\nHeather Graham as Annie Blackburn\nTherese Xavier Tinling as Nurse (Missing Pieces only)\nChuck McQuarry as Medic (Missing Pieces only)\nUncredited\nUnknown performer as Harpist (Missing Pieces only)\nUnknown performer as Second Emergency Medical Technician (Missing Pieces only)\nThe Pink Room\nDrums: Steven Hodges\nGuitar: David Jaurequi\nKeyboard: Andy Armer\nBass: Don Falzone\nCrew\nDirected and Edited by David Lynch\nProduced by Sabrina S. Sutherland\nAdvisor to David Lynch: Marina Girard-Muttelet\nAssistant Editor: Noriko Miyakawa\nSpecial Visual Effects\nDavid Lynch\nNoriko Miyakawa\nSound Re-Recording Mixer: Dean Hurley\nMixed by\nDavid Lynch\nDean Hurley\nSupervising Sound Editor: Dean Hurley\n\"Don't Do Anything (I Wouldn't Do)\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"Mysterioso #2\"\nMusic by David Lynch and David Slusser\nPublishing\nBobkind Music/ASCAP\nAnlon Music/ASCAP\n\"Hotel Tango\"\nMusic by Dean Hurley\nPublishing Team Hurley/ASCAP\n\"Twin Peaks Theme\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"Love Theme Farewell\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"She Would Die For Love\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"One Dog Bark\"\nMusic by Thought Gang\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"The Pink Room\"\nMusic by David Lynch\nPublishing\nBobkkind Music/ASCAP\nAnlon Music/ASCAP\n\"Love Theme (Solo Rhodes)\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"Laura's Dark Boogie\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"South Sea Dreams\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"Dance of the Dream Man\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\n\"Dark Mood Woods (Studio Version)\"\nMusic by Angelo Badalamenti\nPublishing\nAnlon Music/ASCAP\nBobkind Music/ASCAP\nMusicians\nPiano\nAngelo Badalamenti\nDavid Slusser\nGuitars\nVinnie Bell\nDave Alvin\nBob Rose\nMyles Boisen\nSynthesizer Performance by\nKinny Landrum\nAngelo Badalamenti\nSaxophone: Al Regni\nBass\nBuster Williams\nRon Carter\nRufus Reed\nWilliam Fairbanks\nTrumpet: Jim Hynes\nVibraphone\nJay Hoggard\nDavid Cooper\nDrums\nGrady Tate\nDonald Bailey\nScore Mixer: Art Pohlemus\nAccordion: Dean Hurley\nGuitar on 'ONE DOG BARK' by David Lynch\nAssistants to David Lynch\nMindy Ramaker\nAnna Skarbek\nMichael T. Barile\nLegal Counsel\nTHE LONG LAW GROUP, PC\nToni Y. Long, ESQ.\nInsurance\nBACHRACH & ASSOCIATES\nRon Hess\nPost Services by FOTOKEM\nSr. VP Sales: Ray Morfino\nProject Manager: Mario Allen\nProducers\nJason Pelham\nAngelique Perez\nDigital Colorist: George Koran\nSupervising Post Producer: Andy Gizzarelli\nDI Editor: Erik Peterson\nVP & GM, FotoKem: Tom Vice\nChief Strategy Officer: Mike Broderson\nMK2\nCEO: Natanel Karmitz\nSales Department\nJuliette Schrameck\nVictoire Thevenin\nTechnical Department: Madeleine Lourenco\nLegal Department\nAnnabel Rigard-Abramowitz\nStephanie Bonmarchand\nDelphine Bonnafour\nSpecial Thanks to\nMark Frost\nKen Ross\nTom Hansen\nFred Altman\nShadi Zand\nJohanna Ray\nHeidi L. Walker\nEmily Lynch\nmk2\nFotoKem\nKEEP ME POSTED A FotoKem Company\nAbsurda\nCoproducer and Distributor: MK2\nNotes\n\nProduction errors\nThe editing of The Missing Pieces implies with the scene in Sam Stanley's apartment that the Teresa Banks murder, Chester Desmond disappearance and subsequent investigation by Agent Cooper take place in 1988, the year before Laura's death, whereas Phillip Jeffries's sudden reappearance takes place in 1989, shortly before Laura Palmer's death. This timeline is confirmed by Fire Walk With Me's shooting script, The Secret History of Twin Peaks and the 2017 series. However, Fire Walk With Me's troubled editing history meant that not only was Jeffries confirming the date cut from the film, the entire sequence was reset to 1988: the change in timing of the scene is obvious in the final cut, with Miguel Ferrer and David Lynch's lines about Chester Desmond dubbed over existing footage, with only reaction shots that do not show either actors' lips moving. As both Secret History and The Return place the timing of his appearance in 1989, this interpretation is considered the canon sequence of events.\nThe Bellhop's line in the \"Buenos Aires / Above the Convenience Store\" scene after Jeffries reappears is subbed \"Are you the man?\" although he is clearly saying \"Ayúdame!\" which is Spanish for \"help me!\""}