{"name": "Twin_Peaks:_The_Final_Dossier", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks:_The_Final_Dossier", "text": "Twin Peaks: The Final Dossier\nTwin Peaks: The Final Dossier is the fourth Twin Peaks novel, written by Mark Frost, and a sequel to The Secret History of Twin Peaks. It was released on October 31, 2017.\nThe book, which includes some material that was originally intended for The Secret History, primarily documents events that took place between the original series and its continuation, and provides \"context and commentary to the strange and cosmic happenings\" present in the latter.\nSummary\nThe novel is presented as a set of files and occasional original documents compiled by FBI agent Tamara Preston on several persons of interest, following avenues of investigation opened by her earlier work studying Garland Briggs' dossier. This investigation took place after Preston was inducted into the Blue Rose task force.\nInteroffice Memorandum\nIn 2017, Tamara Preston concludes her follow-up investigation of the dossier recovered the previous year and presents the finished report, the product of interviews and personal research on the Twin Peaks residents referenced in Major Briggs' original document. In a memo, she thanks Gordon Cole for granting her the opportunity and anticipates the work still ahead of them.\nAutopsy Report\nOn April 1, 1989, Albert Rosenfield conducted an impromptu autopsy on Leo Johnson, who was found dead in a cabin in the woods of Twin Peaks. After he was left in a tarantula trap by Windom Earle, Johnson was shot five times in the chest by an unknown assailant. Rosenfield notes that scuff marks on the scene indicate the shooter may have used an FBI shooting stance, and assumes it was Earle's doing. Johnson's house and truck cab were soon impounded.\nShelly Johnson\nShelly McCauley came from a broken home plagued by alcoholism and spousal abuse; her father eventually left the state, and she herself moved out by the age of seventeen. Shelly dated Bobby Briggs, whom she had known from elementary school, though high school, but broke up after learning he was cheating with Laura Palmer, causing a scene that disrupted the school's junior prom. At the Roadhouse the same night, she met Leo Johnson, who had just stopped off from a trucking run. Three weeks later, the two were married by a justice of the peace on their \"third anniversary.\"\nAfter Johnson was found dead, Shelly and Bobby placed a pause on their relationship for an appropriate mourning period. Almost one year to the day after Johnson's death, they were married during a weekend trip to Reno, Nevada. Seven months later, Shelly gave birth to their daughter, Rebecca McCauley Briggs. Bobby's mother Betty and Shelly's boss Norma Jennings pooled their resources to take out a loan, allowing the couple to buy a house in Twin Peaks.\nHornes and Haywards\nPreston attempts to make sense of the confusing events surrounding Benjamin Horne and Dr. Will Hayward in the days after the 1989 Miss Twin Peaks Contest. On the day of the Twin Peaks Savings and Loan explosion, Horne apparently visited Hayward's home after spending the day at Calhoun Memorial Hospital with his comatose daughter Audrey. The same night, Horne was admitted to the hospital himself with a head injury, sustained, according to Dr. Hayward, when he had slipped and hit their fireplace while they talked about Audrey's prospects. The next day, while Hayward tended to Dale Cooper after his own fall, Horne was cleared by another attending physician and driven home by his brother Jerry.\nWithin three months of this incident, Will filed for divorce from his wife of twenty-six years, Eileen, and moved across the country to Middlebury, Vermont. Donna Hayward also left town after graduating from high school, relocating to New York City, leaving Eileen to raise their younger daughters, Harriet and Gersten. Preston discovered bank records showing a monthly deposit of $7,500 to Eileen's account from a Cayman Islands shell corporation, traced back to the Horne Foundation. Harriet attended the University of Washington and became a pediatrician, settling in Bellevue. Eileen passed away in 2009, due to complications from pneumonia. Horne declined all interview requests from Agent Preston on the matter. \nBased on a later account provided by Dr. Hayward to Sheriff Frank Truman, Cooper did in fact visit Audrey Horne's room while at Calhoun Memorial. Nine months later, Audrey gave birth to a son, Richard. The father on Richard's birth certificate was listed as \"Unknown.\"\nDonna Hayward\n\nBen and Audrey Horne\n\nJerry Horne\n\nThe Double R\n\nAnnie Blackburn\n\nWindom Earle\n\nBack in Twin Peaks\n\nMiss Twin Peaks\n\nDr. Lawrence Jacoby\n\nMargaret Coulson\n\nSheriff Harry Truman\n\nMajor Briggs\n\nPhillip Jeffries\n\nJudy\n\nRay Monroe\n\nToday\nA few weeks into her investigation in Twin Peaks, Agent Tamara Preston writes about a bizarre situation that happened that very day. An issue of the Twin Peaks Post, reporting on Dale Cooper's disappearance in 1989, makes reference to \"the disappearance, still unsolved, of local teenage beauty queen Laura Palmer.\" All other issues now reflect that Laura disappeared without a trace on February 23, 1989, the case apparently remaining unsolved. When she asked about Laura at the sheriff's station, the employees got a dazed expression and apparently struggled to remember the exact events, but soon agreed that it was indeed as the papers reported. Ronette Pulaski was abducted and taken to the woods and found wandering across a railroad bridge, but testified that Laura had never appeared on the night in question. A few stories appeared in the Post reporting that Agent Cooper briefly visited town to investigate the disappearance, but were short on details. One year to the day after Laura went missing, her father Leland Palmer committed suicide by shooting himself in his car near White Tail Falls.\nWith no other leads, Preston investigates Sarah Palmer (née Novack), Laura's only living relative, and finds records of a bizarre incident that took place while she was living in Los Alamos as a child. Two employees at a nearby radio station were brutally murdered by assailants who left no traces, while over a dozen people listening to the broadcast that night experienced severe medical distress, many losing consciousness. Sarah was apparently among this number, but after a visit to an emergency room there appeared to be nothing wrong with her.\nAfter Laura's disappearance and her husband's suicide, Sarah slipped into depression and drug abuse. In the past year, however, she apparently witnessed the bizarre sudden death by evisceration of a trucker at a local bar.\nPreston reports that her own thoughts and memories are growing fuzzy and indistinct with every passing second, and immediately books a flight back to Philadelphia.\nFinal Thoughts\n\nAudiobook\nThe audiobook version of The Final Dossier was narrated by Annie Wersching, with a runtime of three hours. An exclusive clip was posted by the fansite Welcome to Twin Peaks.\nRelease\nA signing and presentation of the book by Mark Frost will be held at Vroman's Bookstore in Pasadena, CA.\nOn October 24, 2017, preview pages of the novel were released on iTunes.\nContinuity\nThe Final Dossier establishes that the third season takes place in September and October 2016.\nErrors and inconsistencies\nAgent Preston states that she will return to the matter of Bobby and Shelly Briggs in a later file, but neither are mentioned after the \"Shelly Johnson\" case file. Mark Frost attributes this to Preston abandoning her research after discovering the changed timeline.\nBoth are mentioned in regards to Becky's legal issues as a result of Steven's arrest warrant at the end of the \"Donna Hayward\" case file but no details are given to the dissolution of their marriage. Red is not mentioned in the book once, despite the details provided of his drug-dealing network being dismantled.\nThe fight between Ben Horne and Will Hayward in \"Episode 29\" is stated to have taken place on the same day as the Twin Peaks Savings and Loan explosion, whereas in the episode it appears to have been the night before.\nDonna Hayward is said to have moved to New York in 1992 after turning eighteen, but her split from her parents in the series occurred in 1989, at which time she was already a senior in high school.\nPreston indicates that Audrey Horne has successfully managed her beauty salon \"ever since\" its founding, and describes the photograph of Agent Cooper hanging on her office wall. Later in the chapter, it is stated that Audrey suddenly closed the salon four years prior to her writing.\nAnnie Blackburn is stated to have been born in 1973, but subsequently she is stated to have been in her early 20s when she moved to Twin Peaks in March 1989; a 1973 birth would have made her fifteen or sixteen years old at that time. In addition, more than five years are stated to pass between Marty Lindstrom's death in 1985 and her return to town. Frost confirmed, possibly in jest, that this inconsistency can be attributed to an error on Preston's part.\nThe sequence of events places Vivian Smythe and Ernie Niles' wedding at least \"a few years\" before the events of Twin Peaks, when in the series they were newlyweds on honeymoon.\nHank Jennings is stated to have been arrested after the Dead Dog Farm operation, when it was actually after he assaulted Ed Hurley in his home.\nCaroline Earle's maiden name is given as Wickam, contradicting dialogue in \"Episode 22\" that establishes it as Powell.\nConsistent with The Autobiography of F.B.I. Special Agent Dale Cooper: My Life, My Tapes, Caroline Earle's death is placed ten years prior to the original series, contradicting dialogue in \"Episode 17\" that places it four years prior.\nThere is no mention of Diane Evans' altered appearance at the Twin Peaks Sheriff's Department. In addition, she is missing from Gordon Cole's account of visiting the Great Northern Hotel basement with Dale Cooper, and instead Preston writes that she disappeared shortly after the lights went out in Frank Truman's office.\nGarland Briggs' dossier (the subject of The Secret History of Twin Peaks) is said to have been recovered from a storage locker in the basement of Ruth Davenport's building \"weeks\" after her body was discovered, contradicting both the stated time frame of that novel and Agent Preston's claim that she has no knowledge of Cooper or Briggs' ultimate fate when researching the first dossier. If this were the case, Preston would necessarily have only researched Briggs' document after the events of the new series.\nIt is erroneously stated that Ronette Pulaski went to the abandoned train car with Jacques Renault and Leo Johnson, when it was actually Jacques' cabin. When asked about it, Mark Frost retorted that Leo and Jacques were both extremely stupid and impulsive."}