{"name": "Twin_Peaks_Festival_Greeting", "url": "https://twinpeaks.fandom.com/wiki/Twin_Peaks_Festival_Greeting", "text": "Twin Peaks Festival Greeting\nThe Twin Peaks Festival Greeting is a short film done by David Lynch in 2008 for that year's Twin Peaks Festival. It was released in the Lime Green Set.\nThe film is four minutes and twenty seconds long and features Lynch and a small doll in a room that appears to be the red room. It opens with the doll on the floor in front of the right chair. Lynch enters the room and moves to the left chair, hits the chair three times, and sits down. The doll leaps up into the right chair into a sitting position.\nAfter a few moments, Lynch speaks the following words in reverse-speak:\n\"There are three things I want you to remember. Three things.\"\nHe then spasms and collapses onto the floor. After a moment, he lifts himself back up and sits back down and speaks again.\n\"Give it over strong. Make a purchase of a raincoat. Enjoy Twin Peaks Festival.\"\nHe then stands up, moves over to the doll, kisses it on the forehead, steps back to the curtain as a light shines up him from feet to face before the light fades.\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}