{"name": "Two_Blue_Balls", "url": "https://twinpeaks.fandom.com/wiki/Two_Blue_Balls", "text": "Two Blue Balls\nTwo Blue Balls is the third short film of Impressions: A Journey Behind the Scenes of Twin Peaks.\nSynopsis\nElectricity, always shooting electricity. Poles on wires, or is it the opposite? Deeper I go now, trying to avoid the dangers ahead. Rusted memories of another time, discarded behind the doorless shed. The man in the dark-colored glasses is a Frenchman. Do you see him? Why does the man with the gray elevated hair constantly talk about things? Does he have nowhere else to be?\nSOUTH DAKOTA\nDavid Lynch arrives at the Buckhorn Police Department prison location, joking that the cells are roomy and he wouldn't mind moving into one. Later, he sits down with Johanna Ray and Krista Husar to discuss casting for a \"tough lookout\" at the farm, but Lynch surprises them by revealing the character won't be in the series after all. Next, he sits with Matthew Lillard and Cornelia Guest to rehearse the scene between the two in Hastings' cell. Impressed, Lynch says he wishes they had another half hour of dialogue, and laughs that they are both playing \"bad, bad people.\"\nBig Sky Country. Moving further north and away from the desert, the black-faced Cooper finds his way on the metal chair. The bloody face of the bad giant splashes against the wooden floor. No one seems to notice. Hiding behind my magic box, I steal things.\nMONTANA\nLynch arrives at the farm filming location and greets Frank Collison, Derek Mears, and George Griffith. Effects artist Carey Jones shows him the dummy Renzo, which will be used for the moment when Mr. C punches him to death. Lynch directs the arm-wrestling scene, followed by the immediate aftermath of Renzo's death. Next, he walks Christopher Durbin through his brief appearance as the accountant.\nNEW YORK\nLynch rehearses Sam and Tracey's death scene with Ben Rosenfield and Madeline Zima, informing them that he will personally be hitting them with \"two blue balls\" on sticks to achieve the proper effect. Phil Bartko demonstrates the several different blood spray patterns they will use during filming. With a megaphone, Lynch directs Rosenfield and Zima through the scene itself.\nAgain we float above a straight line, drifting along a road that leads to nowhere. Inside the small man lives another man. Something is funny, but not to the woman with the brown hair.\nNEW MEXICO\nLynch sketches Phillip Jeffries' machine for Ruth De Jong, indicating that Jeffries is in the smoke emitted from the end of the machine's spout. He carves a chunk of foam to create the spout itself, as well as another short piece to go on the end. Lynch jokes that he accidentally made a \"dildo,\" but gets upset when she throws it back to him, saying it will still be part of the \"thing.\"\nDe Jong shows him the set for KPJK radio, still under construction, and Lynch marvels that it's far bigger than he had anticipated. They plan out where the various office furniture will go. Lynch says he was envisioning a simple set for one shot, but instead they built an authentic radio station, which he jokes could be on the air by next week.\nPeople featured\nPhil Bartko\nRobert Broski\nScott Cameron\nFrank Collison\nChristopher Durbin\nRuth De Jong\nPeter Deming\nCori Glazer\nGeorge Griffith\nCornelia Guest\nKrista Husar\nCarey Jones\nMatthew Lillard\nDavid Lynch\nKyle MacLachlan\nDerek Mears\nTracy Phillips\nJohanna Ray\nBenjamin Rosenfield\nSabrina S. Sutherland\nMadeline Zima\nDebbie Zoller\nCredits\nSee: Impressions: A Journey Behind the Scenes of Twin Peaks § Credits\nMusic\n\"Haho\"\n\"Maple\"\n\"Melts Bells\"\n\"The Yawn\"\n\"Ant The Ant\"\n\"Collonistial\"\n\"Black Jack\"\n\"Döse\"\n\"Dorothy\"\n\"kalakalak\"\n\"November Nation\"\nAttribution\n↑ 1.0 1.1 1.2 1.3 1.4 1.5 1.6 1.7 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers and Ann-Kristin Mayr and Jason Denner\nProduced by Josef Maria Schäfers\n↑ 2.0 2.1 2.2 \nWritten by Josef Maria Schäfers\nPerformed by Josef Maria Schäfers\nProduced by Josef Maria Schäfers\nvteTwin Peaks home video releasesThe First Season\n\"17 Pieces of Pie\"\n\"An Introduction to David Lynch\"\n\"Learning to Speak in the Red Room\"\n\"Mark Frost Telephone Interview\"\n\"Postcards From The Cast\"\nLog Lady introductions\nThe Second Season\n\"Cast Interview\"\n\"Crew Interview\"\nFire Walk with Me (Criterion)\n\"Reflections on the Phenomenon of Twin Peaks\"\nDefinitive Gold Box Edition\n\"A Slice of Lynch\"\n\"Location Guide\"\n\"Return to Twin Peaks\"\n\"Secrets from Another Place: Creating Twin Peaks\"\n\"Saturday Night Live\"\nGeorgia Coffee commercials\nTwin Peaks Sheriff's Hotline\nThe Entire Mystery\nTwin Peaks: The Missing Pieces\n\"Atmospherics\"\n\"Between Two Worlds\"\n\"Moving Through Time: Fire Walk with Me Memories\"\nA Limited Event Series\nImpressions: A Journey Behind the Scenes of Twin Peaks (The Man with the Gray Elevated Hair\nTell It Martin\nTwo Blue Balls\nThe Number of Completion\nBad Binoculars\nSee You on the Other Side Dear Friend\nDo Not Pick Up Hitchhikers\nA Bloody Finger In Your Mouth\nThe Polish Accountant\nA Pot of Boiling Oil)\nTwin Peaks: The Phenomenon\n\"Behind the Red Curtain\"\n\"I Had Bad Milk in Dehradun\"\n\"A Very Lovely Dream: One Week in Twin Peaks\"\nThe Television CollectionTBAFrom Z to A\nBehind the Curtain\nOn the Couch\nA Talk with Kyle MacLachlan and Sheryl Lee\nOthers\"Twin Peaks Festival Greeting\""}