{"name": "United_States", "url": "https://twinpeaks.fandom.com/wiki/United_States", "text": "United States\nThe United States of America (USA), commonly known as the United States (U.S.) or America, was a federal republic in North America, bordered by Canada to the north and Mexico to the south. In addition, the U.S. state of Hawaii was located in the mid-Pacific Ocean and the state of Alaska was located in the northwest corner of North America. Its capital was Washington, D.C.\nHistory\nFor thousands of years, North America was inhabited by disparate tribes of Native Americans. Beginning in the fifteenth century, European settlers from various nations, including England, France, and Spain, arrived in pursuit of land and resources. Their expansion over the next several centuries led to the displacement of many of the native peoples.\nThe eighteenth and nineteenth centuries saw the mapping and exploration of much of the continent, notably by the Corps of Discovery, which made its way from St. Louis, Missouri through the uncharted Pacific Northwest, eventually arriving at the Pacific Coast in Washington. By the 20th century, the United States had expanded to occupy the breadth of the North American continent from east to west.\nDuring the nineteenth century, the American Civil War between the U.S. and the breakaway Confederate States of America took place, culminating in a victory for the United States.\nIn the mid-twentieth century, the United States was a participant in World War II, a devastating global conflict. This era saw the development of the first atomic bomb by the Manhattan Project, which culminated in the first successful nuclear test in July 1945.\nGovernment\nThe United States Congress was the country's legislative body, while the President of the United States was the head of state.\nThe Federal Bureau of Investigation was the country's domestic intelligence service and its principal federal law enforcement agency.\nStates\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWest Virginia\nWisconsin\nWyoming"}