{"name": "Vivian_Smythe", "url": "https://twinpeaks.fandom.com/wiki/Vivian_Smythe", "text": "Vivian Smythe\nVivian Smythe Lindstrom Blackburn Niles Halliwell, born Vivian Smith, was a failed actress and singer-turned-food critic from Seattle, Washington, who wrote under the pseudonym M.T. Wentz. Via four disastrous marriages, she was the mother of Annie Blackburn and briefly the step-mother of Norma Jennings.\nBiography\nVivian was the only child born to two high school teachers.\nIn the 1960s, Vivian worked as the manager at the Weary Traveler motel in Yakima and began an affair with its owner Marty Lindstrom, which resulted in the birth of their daughter, Annie. For over a decade, Annie was led to believe that Lindstrom was her uncle rather than her father. The couple moved in together as a common-law union in 1978 until they were officially wed after the death of Lindstrom's wife Ilsa. By the time of this marriage, Vivian had changed her last name to Smythe.\nFollowing Marty's death, Vivian inherited his motel, the Weary Traveler, and within six weeks, married Roland Blackburn. Blackburn officially adopted Vivian's daughter and sent her to a Catholic boarding school in Kennewick, Washington.\nWhile Annie visited home for Christmas, Vivian witnessed Roland attempting to sexually assault Annie, after which he drove his car into the Yakima River. The night after Roland's death, Vivian discovered Annie after she had consumed a bottle of tranquilizers and slit her wrists. Vivian took her to the hospital, saving her life, and had her treated at a psychiatric hospital.\nWhle Annie was treated, Vivian met Ernie Niles at the Weary Traveler and soon allowed him to move in with her, before soon marrying. The couple moved to Seattle, where Vivian invested in an ultimately unsuccessful restaurant.\nBy March 1989, Vivian became a food critic, publishing under the name \"M.T. Wentz.\" That month, she went to the Double R Diner in Twin Peaks, where she tested potatoes from Toad's plate and introduced Ernie to Norma Jennings, her late husband Marty's daughter. Norma – referring to Vivian as her mother – informed her that a food critic was the reason the diner looked as nice as it did, unaware that Vivian was the critic. Vivian and her husband then left for the Great Northern Hotel.\nShe later helped Norma at the diner and overheard an argument between Norma and her husband Hank. When it calmed down, she went to Hank, offering to have dinner with them.\nAt dinner, she commented on the salmon. She excused herself with Norma and when they returned, Hank made a toast to her and Ernie.\nThe next day, Vivian was disgusted by the omelet she had been served at the diner and suggested a different recipe.\nAfter writing a scathing review of the restaurant, Vivian saw Norma taking down the decorations. She revealed to Norma that she was the critic, M.T. Wentz. Overwhelmed with Vivian's behavior toward her, Norma asked her to leave. The two never spoke again.\nOver the next few days, Ernie was arrested and compelled to take part in an FBI-DEA sting operation against Jean Renault at Dead Dog Farm. Vivian returned to Seattle and filed for divorce, leaving his packed belongings outside their home.\nWithin a year, Vivian married Simon Halliwell, a retired insurance executive. She remained married to him until 2009, when he choked to death on a cruise in the Mediterranean. Living alone off Halliwell's wealth for the rest of her life, Vivian passed away after a brief illness in 2013.\nBehind the scenes\n\"M.T. Wentz\" may be Mark Frost's thinly veiled homage to W.Y. Evans-Wentz, who published the first attempted translation of the texts marketed as The Tibetan Book of The Dead. T"}