{"name": "Waiter", "url": "https://twinpeaks.fandom.com/wiki/Waiter", "text": "Waiter\nAn old, decrepit waiter, derisively dubbed Señor Droolcup by Agent Albert Rosenfield, worked at the Great Northern Hotel in 1989.\nBiography\nAt the Great Northern Hotel in early March 1989, the waiter delivered a glass of milk to FBI Special Agent Dale Cooper, who laid on the floor of his room, bleeding. Cooper asked him to call the the doctor, but the senile waiter hung up the phone instead and did not understand the agent's situation. Cooper signed for the milk and as he left, he told Cooper that he had heard about him, then gave him a thumbs-up and a wink. He left the room, but came back to tell this to the special agent again, and got a thumbs-up in return. He came back once more to give another wink and a thumbs-up. A short time later, a Giant appeared in Cooper's room to share important clues about the Laura Palmer case.\nSeveral days later at the Roadhouse, after another appearance by the Giant, he approached Agent Cooper and sadly said, \"I am so sorry.\" Two days later, the waiter came around a corner at the hotel and saw Agent Cooper, reciting his speech from the night Cooper was lying on the floor.\n \nEscorted by Major Garland Briggs, he went to the Roadhouse, where he approached Agent Cooper with gum, which Leland Palmer commented on having been a gum he enjoyed as a boy. The waiter commented, \"That gum you like is going to come back in style.\"\nThe waiter appeared to Cooper in the red room several weeks later, seated next to the arm. He greeted the little man with \"Hallelujah!\" before making a whooping noise. He then stood and shuffled to give Cooper a cup of coffee, repeating the word \"coffee\" over and over. After giving it to him, the Giant appeared in his place, returning to the armchair and saying, \"One and the same.\"\nBehind the scenes\nThe waiter was played by Hank Worden, a cowboy and actor best known for his roles in John Wayne films. His catchphrase was \"Thank ya kindly,\" which was included in Twin Peaks, after Cooper signs for the room service delivery."}