{"name": "White_Lodge", "url": "https://twinpeaks.fandom.com/wiki/White_Lodge", "text": "White Lodge\n\"Once upon a time, there was a place of great goodness called the White Lodge. Gentle fawns gamboled there amidst happy, laughing spirits. The sounds of innocence and joy filled the air. And when it rained, it rained sweet nectar that infused one's heart with a desire to live life in truth and beauty.\"\n ―Windom Earle\nThe White Lodge was a mythological place referenced in the stories of the Nez Perce tribe of northeastern Washington. It was the subject of research by the United States Air Force's top-secret Listening Post Alpha in the region, whose personnel believed it to be a real phenomenon.\nLegends\nThe White Lodge and its opposing counterpart, the Black Lodge, originated in ancient legends passed down by the Nez Perce tribes who once inhabited the Twin Peaks region. In the stories, the White Lodge was the home of the spirits who ruled over man and nature there. It was a place of great goodness, which could be accessed through strong feelings of love.\nRogue FBI agent Windom Earle, who was obsessed with finding the Black Lodge, dismissively referred to the White Lodge as \"a ghastly place, reeking of virtue's sour smell.\"\nHistory\nListening Post Alpha, a secret U.S. Air Force facility located on Blue Pine Mountain, was actively engaged in a mission to locate the White Lodge well into the 1980s under the direction of Major Garland Briggs and his superior, Colonel Calvin Reilly. This endeavor was considered a matter of national security.\nDuring an overnight fishing trip in March 1989, Major Briggs and FBI Special Agent Dale Cooper discussed the bizarre recent events surrounding Leland Palmer and BOB, the spirit that had \"possessed\" him. Briggs remarked that there were powerful forces of evil in the world, and asked Cooper if he had ever heard of a place called the White Lodge. Intrigued, Cooper asked to hear more, but while he was away from their campfire the woods lit up, a hooded figure watching them from a nearby ridge. Briggs then disappeared without a trace.\nTwo nights later, Briggs reappeared in his own living room, wearing a World War I-era fighter pilot uniform, to the shock and joy of his wife and son. At the Twin Peaks Sheriff's Department, Briggs struggled to explain what had happened during his abduction, while simultaneously sitting on an ornate throne in the middle of a jungle:\n \n\"I remember stepping from the flames. A vague shape in the dark. Then nothing. 'Til I found myself standing by the cold remains of our campfire. Two days later.\"\n \nBriggs was in a severely disoriented state, at one stage indicating the wooden conference table and asking if it was meant to hold his soul. He also had a strange raised pattern of three triangles behind his left ear. As he recovered, Briggs explained that his station was working to locate the White Lodge, and that he believed he had been taken there during his disappearance. Before he could elaborate, a military police officer arrived to escort him out on the orders of Colonel Reilly. Subsequently, Briggs was deeply disturbed by his colleagues' suspicion and paranoia in his debriefing, and feared that their motives in searching for the lodge were less than pure.\nBehind the scenes\nThe White Lodge is a concept in the school of theosophy, using the connotation of a fraternal organization rather than a place. Psychic Self Defense, a 1930 \"handbook\" by British occultist Dion Fortune, is largely concerned with standards and practices for those belonging to the White Lodges, which are practitioners who follow the right-handed path and shirk using their abilities for ill ends.\nIn an interview with Salon promoting The Final Dossier, the interviewer asks Mark Frost if the Fireman's home and the White Lodge are one and the same. Frost cryptically indicates this is a possibility: \nSalon: The coordinates are one of the running plot threads throughout the new season. In \"Part 17,\" Evil Coop is transported from Jack Rabbit's Palace to a room inhabited by The Fireman – a space some fans have speculated could be the fabled \"White Lodge.\" Is that an accurate label?MF: I don't want to over-interpret it for people, but if theorizing leads them there, that's certainly a valid point of view."}