{"name": "William_Clark", "url": "https://twinpeaks.fandom.com/wiki/William_Clark", "text": "William Clark\nCaptain William Clark was the co-commander of the Corps of Discovery, alongside Meriwether Lewis.\nBiography\nClark was at one point the commanding officer of Meriwether Lewis, who recruited him to co-command the Corps of Discovery, a secret expedition across the Louisiana Purchase commissioned by President Thomas Jefferson.\nOn September 20, 1805, shortly after crossing the present-day border of Washington, Clark encountered a group of Nez Perce boys, who then hid from him. He handed over his gun and horse to one of his men and gave pieces of ribbon to the boys, who he then sent to a nearby village. A man from the village cautiously met him, then informed him that the village's chief would return in fifteen to eighteen days.\nThe following day, the men of the village took Clark downriver to meet Chief Twisted Hair. Twisted Hair drew for Clark a map of the river, which passed between two mountains and to a great waterfall, the location of present-day Twin Peaks. Clark could not determine what this place signified to them, but the expedition's Shoshone guide Sacagawea suggested it was related to the tribe's fascination with spirits. Clark then sent Reubin Fields and a man from the tribe to bring Lewis to the camp.\nLewis set off to explore the area charted in the map while Clark stayed with the rest of their party and returned on October 3.\nClark returned to Washington, D.C. with the expedition in 1807. A year later, Lewis initiated Clark into the St. Louis Masonic Lodge. Clark later founded Missouri Lodge 12 and remained an active Freemason for the rest of his life.\nJournals by Clark were among several documents compiled in a dossier that was discovered in 2016.\nBehind the scenes\nWilliam Clark (August 1, 1770 – September 1, 1838) was an American soldier, explorer, Indian agent, and territorial governor, best known for co-leading the Corps of Discovery Expedition from 1804 to 1806.\nChris Mulkey narrated Clark's letters in the audiobook release of The Secret History of Twin Peaks."}