{"name": "Will_Hayward", "url": "https://twinpeaks.fandom.com/wiki/Will_Hayward", "text": "Will Hayward\nWilliam \"Doc\" Hayward, M.D. was a physician and coroner. He was also the loving husband of Eileen Hayward and father of Donna, Harriet, and Gersten.\nBiography\n\nEarly life\nFollowing in his father's footsteps, Will attended medical school at Washington University in 1947 and completed his post-graduate work at the University of Washington in 1952. He then took over his father's medical practice.\nIn the 1960s, he married Eileen and they had three daughters: Donna, Harriet, and Gersten. In the early 1970s, Eileen had an affair with Benjamin Horne, which may have resulted in Donna's birth.\nLaura Palmer's final days\nOn a day in February 1989, Will went into his living room and tries to perform a magic trick for Donna and her best friend, Laura Palmer. The latter lit a cigarette and the doctor questioned why he allowed her to do this in his home. His wife brought in muffins and he found a piece of paper, a \"secret message for Laura,\" which he read to her: \"The angels will return, and when you see the one that's meant to help you, you will weep with joy.\" He then got up to answer the phone, Laura's father, Leland on the other end, asking her to come home.\nMurder of Laura Palmer\nHayward was called to the Blue Pine Lodge when Pete Martell found a body wrapped in plastic. When Deputy Andy Brennan became too emotional while taking pictures of the scene, Hayward finished for him. He and Sheriff Harry S. Truman then rolled over the face-down body and pulled plastic away from her face, revealing it to be Laura.\nHe waited at the hospital for Sheriff Truman and Leland Palmer so the latter could identify his daughter's body.\nHe later sedated Sarah Palmer at her home so she could calmly answer questions Truman had for her concerning Laura.\nIn the evening, he sat with his wife, talking about the events that took place throughout the day. He told her that part of a necklace was found at the crime scene, a detail that had not been released to the public. Hayward said that they believed the killer may have had the other half of the necklace. Shortly after, Bobby Briggs and Mike Nelson came to pick up Donna, but Will found that she was not home, having left through a window. He requested Mike to help find her and also reported her absence to Sheriff Truman.\nWhen Donna was reported as safe, he went to the sheriff's station, where Truman brought her to him and he took her home after a short talk.\n \nThe next day, Hayward presented the autopsy results of Laura to FBI Special Agent Dale Cooper and Sheriff Truman, but said that he could not bring himself to do it, only having assisted Joe Fielding who came from Fairvale for it. The autopsy revealed the time of death to have been between midnight and 4:00 AM, the cause of death to have been a loss of blood, she had bite marks on her shoulders and tongue, and lesions on her wrists, ankles, and upper arms. He also said that she had sexual relations with at least three men within twelve hours of her death and that the man who killed her is the same person who attacked Ronette Pulaski. Hayward was also asked how long it would be until the then-unresponsive Ronette could be asked about her experience, but he said it was too early to tell.\nAt dinnertime, James Hurley came and met them.\nAfter dinner, he went to bed with his wife, leaving James and Donna alone.\nThe next day, after church, he had lunch with Eileen and Donna at the Double R Diner.\nHayward got into a fight the next day with FBI Agent Albert Rosenfield, who wished to continue tests on Laura's body while Hayward insisted on it being released for the funeral. When the disagreement became physical, he was restrained by Deputy Andy Brennan and the present Benjamin Horne, who took the doctor's side. The altercation became physical once more before Sheriff Truman arrived with Agent Cooper. After the sheriff punched Albert, Cooper ordered the body to be released.\nHayward calls Donna for assistance the next day as he tried to cook dinner.\nAt Jacques Renault's apartment the following day, Doctor Hayward told Cooper the blood type found on a shirt belonging to Leo Johnson as AB negative. Cooper said that this was Jacques's blood, and Hayward then received a call confirming this.\nHe went with Cooper, Truman, and Deputy Hawk to find a cabin in the woods belonging to Jacques. They encountered the Log Lady and went inside for tea and cookies. She said her log saw something the night Laura died and spoke for it before the men headed back out. They approached the cabin, where inside, music was playing and they found Waldo, a myna bird belonging to Jacques.\nBack at the station, Doctor Hayward read aloud about myna birds to Harry and Dale, trying to get Waldo to speak. He went to get apples for the food-deprived bird.\nThe next day, he showed Sheriff Truman and Agent Cooper to Lawrence Jacoby, who had suffered a heart attack and was \"rambling incoherently\" and said he had a phone call from Laura Palmer and was attacked.\nHe went to the sheriff's station with Cooper and Truman. When Leland came asking about a suspect in Laura's murder being arrested, Will suggested Leland go home to Sarah. Hayward then left.\nThe next morning, he stood over Agent Cooper, who had been brought to the hospital with a gunshot wound to the abdomen. The FBI agent explained what happened, that his bulletproof vest was pulled up because he was chasing a wood tick. Hayward showed him the bullet, which had the dead tick stuck to it. After Lucy filled in Cooper on what happened overnight, Hayward commented that the hospital had not been this busy since the Elk's Club fire of 1959. Against Hayward's wishes, Cooper left his hospital bed.\nThey observed as Jacques' bagged body was wheeled through a hallway in the hospital after being murdered overnight.\nHayward was later confused about Jacoby's condition, thinking he may have been on something, but supposed it was the hospital's food. Cooper and Truman then arrived.\nThe Palmers joined his family for dinner in the evening and entertainment by his younger daughters, Harriet and Gersten. He talked with Leland, who then got up to sing and fainted after frantically speeding up the rhythm of the song.\nThe following day, Doc explained to Shelly her husband's condition: a bullet was lodged in his spine and he may have been paralyzed. Leo was comatose and Hayward was not sure when he would improve.\nHe later answered a phone call from Harold Smith to Donna.\nHe oversaw Nadine Hurley as her husband, Ed came to her bedside. He explaining why she was restrained and suggested singing her favorite song to her.\nThe next day, Hayward watched the interrogation of Leland Palmer, who had been arrested for the murder of Jacques Renault and confessed.\nCooper told Doc that Leland would plead temporary insanity and he said they would need to perform a psychiatric evaluation. As Cooper left, Andy confided in Doc that he needed to have a sperm count done. He gave Andy a vial and went out to his car.\nDoctor Hayward went to the Great Northern Hotel a few days later, where the sheriff's department was with Mike, a spirit housed in the body of Phillip Gerard. They were there to determine the host of an evil spirit known as \"BOB\". Mike had a seizure when Ben Horne entered the room.\nAfter Ben was arrested for Laura's murder, Hayward drew blood from him.\nWill warned Cooper the next day that Mike was dehydrated and in need of his medicine.\nAftermath of Laura's murder\nThree days after Leland was arrested for Laura's murder and died in custody, Hayward got ready to sedate Sarah before the funeral, but she calmly refused.\nLater at the reception, a fight broke out between Mayor Dwayne Milford and his brother, Dougie. Hayward and Pete explained to Agent Cooper the ongoing feud between the siblings.\nAfter Dougie Milford died the night after his wedding, Hayward stated that he believed his death to have been from a heart attack. He later confirmed this with an autopsy, which he delivers to the mayor in Sheriff Truman's office. After the mayor left the office, Will spotted Dougie's widow, Lana, and was taken with the rest of the men present by her charms.\nHayward was present at the sheriff's station the next day where Major Garland Briggs recounted his experiences following his sudden disappearance a few days prior. He described a vision of a giant owl and his involvement with the Air Force's Project Blue Book, which had officially been disbanded in 1969, though they still searched for a place called the \"White Lodge\".\nThe doctor examined a body found in Sheriff Truman's office later at night, with a chess pawn in his mouth. Cooper stated that he believed the victim had a stab wound, which the doctor soon confirmed. Cooper believed this to be the handiwork of former FBI agent Windom Earle due to a similar case.\nAt the diner, Will met with Ed, whose wife had reverted to a teenage state-of-mind following her suicide attempt. Ed said that she wished to start dating boys, to which Hayward said to give her a 9:00 curfew on school nights. He changed the subject to Donna, who had gone looking for James and asked Ed if he knew anything about this, to which he said Donna was taking him some money to where he was staying out west. Will then left.\nLater in the evening, he ordered Lucy Moran, Andy, and Dick Tremayne together to talk about Nicky Needleman, whom Andy and Dick suspected to have killed his own parents at the age of 6. Hayward shot down this ridiculous notion and informed them that Nicky was conceived by a sexual assault, his mother died in childbirth, and his adoptive parents were killed in a car crash.\nWill is defeated in a game of chess by Pete the next day.\nWill and Eileen came home from the grocery store a couple days later and Donna told them that Hayward's old colleague, Gerald Craig, had visited. However, Will noted this to be impossible, as Craig had drowned many years before. Eileen called the number left by \"Craig,\" discovering that it actually belonged to a cemetery. Will opened a gift also left by \"Craig,\" containing a knight chess piece along with a chess move. He left to take it to Agent Cooper, believing the man to have actually been Windom Earle.\nDoctor Hayward observed a bonsai tree the following day in Sheriff Truman's office, the sheriff then came in, suffering from a hangover. He then informed Cooper and Truman about the visit from Earle just before Cooper's superior, FBI Regional Bureau Chief Gordon Cole, arrived.\nLater, he observed Donna, who had received a postcard from James, who was in San Francisco. She then asked how Eileen knew Benjamin Horne, to which he replied that she probably did not, but Donna says he had visited the previous day and she went to the Great Northern, which Will dismissed as charity meetings. The doorbell then rang and Donna answered, bringing in a delivery of flowers for Eileen.\nThe next day, Will met with the rest of the Miss Twin Peaks Judging and Rules Committee, which included Dwayne Milford and Pete Martell. Benjamin Horne addressed the committee, suggesting the theme of the contest's speeches should concern how to save the forests. After Horne leaves, Lana is called up as the first candidate for the contest.\nAt dinner, Donna tried to ask Eileen how she knew Ben Horne, but Will stated again the charity, which Eileen quickly agreed to. However, Donna was not sold on the idea, because of the flowers sent to their house.\nWill went to Ben Horne the next day and warned him to stay away from Eileen, wishing the past affair between the two to stay buried. He met John Justice Wheeler, then excused himself.\nDonna came down to the living room the next day, dressed up for Miss Twin Peaks. Will complimented her and Eileen wished to hear her speech, but she instead said she wanted to know the truth about Eileen's involvement with Benjamin Horne. They did not reveal any information to her, so she left.\nHe hosted the Miss Twin Peaks Contest that evening. He announced the winner as Annie Blackburn, and subsequently, chaos ensued, resulting in Annie's kidnapping by Earle.\nFollowing the chaos at the pageant, Hayward patched up Mike Nelson and Nadine, the latter having been hit in the head by sandbags and had apparently returned to her adult mental state.\nHe came home to find Donna in tears, ready to leave, with Ben standing in the living room. Angered, he told Ben to leave. After Ben's wife, Sylvia, arrived, Will punched Ben, causing him to smack his head into the fireplace.\nHayward drove Ben to the hospital, claiming that, as the two spoke privately, Ben had become light-headed and slipped, hitting his head on the mantel. Hayward saw to Ben's condition, diagnosing him with a grade 2 concussion.\nAfter Cooper and Annie appeared at Glastonbury Grove, Will and Sheriff Truman took Cooper back to the Great Northern. He got up to brush his teeth. Hayward and Truman heard the mirror break in the bathroom while Cooper laughed and asked, \"How's Annie?\"\nHayward and Sheriff Truman broke down the door and found Cooper, who explained that he slipped and hit his head on the mirror, which struck him as funny. Hayward advised that he go back to bed, but Cooper said he had not yet brushed his teeth.\nHayward and Truman took him to the hospital, where Cooper was diagnosed with a grade 2 concussion. About an hour later, Hayward saw Cooper exit the intensive care unit where Audrey Horne was being kept while in a coma from a bombing at the Twin Peaks Savings and Loan.\nWithin the following three months, Hayward closed his practice in Twin Peaks and moved to Middlebury, Vermont, where he opened a new practice in family medicine. He and Eileen subsequently divorced.\nOver twenty years later, Will reconciled with Donna, who he hired as his assistant.\nIn 2016, Sheriff Frank Truman contacted Hayward through Skype for assistance in a case involving Agent Cooper. Hayward recounted to Frank his last encounter with Cooper at the hospital.\nBehind the scenes\nHayward was played by Warren Frost, who was the father of Twin Peaks co-creator Mark Frost and writer Scott Frost. Frost appeared posthumously in the 2017 series following his death on February 17, 2017.\nIn \"Part 7,\" Hayward's Skype username is \"MiddleburyDoc,\" apparently a reference to Frost's retirement in Middlebury, Vermont. "}