{"name": "William_Hastings", "url": "https://twinpeaks.fandom.com/wiki/William_Hastings", "text": "William Hastings\nWilliam \"Bill\" Hastings was a high school principal in Buckhorn, South Dakota. Through his hobbyist interest in alternate dimensions, Hastings and his mistress Ruth Davenport became embroiled in a conflict between Dale Cooper's double and the missing Major Garland Briggs.\nBiography\n\nEarly life\nAt the age of ten, Hastings first read Robert Heinlein's Orphans of the Sky, inspiring a lifelong interest in science fiction.\nAs of 2016, Hastings had been having an affair with a local librarian, Ruth Davenport. With Ruth and Heinrich Viegel, he also ran a blog documenting alternate dimensions and paranormal phenomena, titled The Search for the Zone. The site was opened in June 1997 and was updated through November 2015. Hastings occasionally replied to comments left on the site's guestbook, notably one by John Garvey, which involved Garvey's experience meeting a deceased friend in \"another place.\"\nThe zone\nOn or around September 19, 2016, Hastings and Davenport visited the property at 2240 Sycamore and traveled to another reality, which Hastings called \"the zone.\" They encountered a man there, \"the Major\" (later identified as Garland Briggs), who said he had been \"hibernating\" and needed to travel somewhere else to remain safe. The Major asked them to access a secure military database and bring him a set of coordinates, which they did. Ruth wrote down the set of numbers on her arm, and a copy was also given to Hastings' secretary, Betty. Hastings updated his blog to note their meeting with the Major.\nWhen they returned around September 22, they gave him the coordinates, whereupon the Major floated into the air, saying \"Cooper. Cooper.\" His head then disappeared. Several other people in that place then attacked Hastings, grabbing him by the neck and demanding to know the name of his wife, Phyllis. William then woke up at home. When questioned, he would later claim he had had an uneventful staff evaluation meeting at school that evening and had driven Betty home afterward, though he did remember having a terrible nightmare.\nArrest\nA few days later, Ruth's severed head and Briggs' decapitated body were found in Ruth's apartment. Hastings' fingerprints were all over the crime scene. He was arrested at his home by Detective Dave Macklay and was questioned about Ruth Davenport as well as his activities. His story lined up until there was a 45 to 50-minute gap that he could not account for, but eventually said he was taking his assistant, Betty, home after a meeting that had concluded. Hastings was then told that Ruth Davenport was found murdered, and Bill's fingerprints were found in the apartment. He was then escorted to a jail cell.\nWhile Bill waited nervously in his cell for his lawyer, George Bautzer, his wife came to see him, who said that he could not be released on bail, according to George. Bill insisted that while he was never in Ruth's apartment, he dreamt that he was there. Phyllis then stated that she knew he was having an affair with Ruth, and Bill countered with the knowledge that she was having an affair with George and possibly someone else. After she taunted him with \"life in prison,\" Detective Macklay came to dismiss her. A woodsman, sitting in a nearby cell, disappeared.\nOn September 29, a sobbing Bill was interviewed by FBI Agent Tammy Preston, concerning his website, The Search for the Zone, and his experience visiting the zone with Davenport. He signed and dated a photograph of Garland Briggs, verifying that this was \"the Major\" they had encountered.\nThe next day, Hastings led the FBI and Macklay to the property where he and Ruth and visited the zone. He sat in Macklay's car, terrified to see several woodsmen lurking around the buildings. One of them, flickering in and out of sight, crept up to the backseat window. Moments later, Hastings' head imploded, killing him instantly.\nBehind the scenes\nThe following, some of which was apparently recycled for Mr. C's arrest report in \"Part 4\", appears on Hastings' driver's license in \"Part 1\":\nLicense number: H62499810\nClass of vehicle: 1\nIssue date: 08/15/2012\nExpire date: 08/15/2017\nHeight: 6 feet 3 inches\nWeight: 215 pounds\nEyes color: Blue\nSex: Male\nBirthdate: August 15, 1973\nRestrictions: O\nEndorsements: none\nName: Hastings, William\nResidence address: 439 Elm Street Buckhorn, SD"}