{"name": "Windom_Earle", "url": "https://twinpeaks.fandom.com/wiki/Windom_Earle", "text": "Windom Earle\nWindom Earle was a former FBI agent, paired up with Agent Dale Cooper, later declared insane following the murder of his wife, Caroline.\nBiography\n\nEarly Life\nBorn circa 1941, Earle claimed that when he was ten years old in 1951, he had watched the film I Was a Communist for the F.B.I., and had as a result been greatly inspired to seek out a job in law enforcement.\nAcademically, Earle would prove to be quite a prodigy in his youth. By the age of fourteen he became a chess grandmaster, by age sixteen, he had enrolled in the University of Pennsylvania, where he earned a degree in criminal justice at age eighteen.\nAfter graduating, he applied for a job at the FBI, and was accepted on as a trainee. He attended his training as an agent at the FBI Academy in Quantico, Virginia, and passed with historically high marks.\nProject Blue Book\n \nA Special Agent of the FBI by 1965, Earle was loaned out by the Bureau to the United States Air Force as part of Project Blue Book and formed an interest in what the dugpas called the \"Black Lodge.\" During this time he also crossed paths with Douglas Milford. He was removed from the project when be became obsessive and violent, and his activities were classified.\nIn the aftermath, Earle partnered up with Gordon Cole and some other agents in creating the Blue Rose group. In 1973, Earle was assigned by the Bureau as an investigator in the Watergate hearing. During this time he met the young law student, Caroline Powell, and the two started dating, and eventually married on August 10, 1974, the day after Richard Nixon resigned from office.\nCooper's partner\nAt a job fair in December 1975, Earle met a young man named Dale Cooper, who had an interest in joining the bureau. When Cooper joined the FBI in the early 1980s, Earle kept a close eye on his progress and the two were partnered by the bureau and they began to play chess every day. It was during this time that Earle began acting strangely, and he disappeared around the time a body was found with its hands missing and face destroyed. Earle claimed to not remember what occurred during his disappearance and no arrests were made, despite four months of investigation. During his absence, Cooper began to bond with Earle's wife, Caroline.\nLater FBI investigations would reveal that Earle had around this time deliberately set up several \"coincidental\" meetings between Cooper and Caroline, unbeknownst to both of them, with the hopes of getting them into a relationship with each other. Earle would during these meetings claim to be out of town or occupied elsewhere, but would in fact shadow and monitor the couple from a distance. When speculating for a motive for this behavior, Tammy Preston noticed in her examination that Earle's sanity had at this point already started to slip, so when he noticed that Cooper and Caroline had shown mild interest in each other at an FBI Christmas party, he became obsessed with the two of them having an affair, and so had started to \"play cupid\" for them if only to make sure his paranoid fantasy would match reality.\nSometime around 1985, when Cooper was vacationing in the Caribbean, Earle claimed that his wife had been kidnapped by three men as they ate dinner. Caroline was found when she was arrested for prostitution in lower Manhattan, suffering from a heroin addiction. Following an attempt on her life, she was moved to a safe house, where Earle decided not to stay, thus sparking an affair between Dale and Caroline. Days later, Windom stabbed the lovers, killing Caroline and seriously injuring Cooper. Following this, Earle was institutionalized.\nEscape\nFollowing a taunting phone call he made to Cooper in early 1988, Earle escaped from the institution in March 1989 and made his way to Twin Peaks, Washington, where Cooper had been investigating the murder of a teenage girl. He began taunting Cooper by sending him chess deals and articles of Caroline's clothes from their wedding to various locations.\nSearch for the Black Lodge\nWhile intentionally taunting Cooper, Earle's true reason for going to Twin Peaks was to find the Black Lodge.\nInside a small cabin in the woods, Windom welcomed a man named Leo Johnson, who he found to be a criminal and began to use him as a pawn, to the point of placing a shock collar around Johnson's neck.\nHe later donned a disguise as Leo transcribed a poem Dale had once given to Caroline. He showed him photos of Donna Hayward, Shelly Johnson, and Audrey Horne, asking which one would be his \"queen.\"\nEarle tore the poem into three parts and went to the Great Northern Hotel, where he passed Cooper and went to the front desk, delivering the portion of the poem for Audrey.\nThe next day, Earle went to the Double R Diner, where he left the poem for Shelly Johnson before leaving. He went back to his cabin to check on Leo's progress with arrow-making for him, then in the evening, he went to the Roadhouse, where he had requested the presence of Donna, Shelly, and Audrey with his notes. He watched them as they tried to decipher his message.\nIn the morning, Leo brought Earle a pair of slippers and a pipe, followed by the newspaper, in which he found the next chess move from Cooper, which Windom saw as a trick, angrily discovering that Cooper was receiving help.\n \nDisguised as Doctor Gerald Craig, an old colleague of Doctor Will Hayward, Earle visited the Hayward home. Donna answered and he delivered his cover story. She invited him in and he gave her a gift for her father, then left.\nIn a different disguise, he went to the diner and encouraged Shelly to enter the Miss Twin Peaks Contest and observed Cooper from across the room.\nThe following day, Earle listened in on Regional Bureau Chief Gordon Cole's visit to the sheriff's station, where a bugged bonsai plant sat on the sheriff's desk, which Earle had delivered as being from Josie Packard. They discussed the possibility of Earle faking his illness after the doctors discovered that he was injecting himself with haloperidol. They also discussed that he was loaned out for two years to the Air Force in 1965 as part of Project Blue Book although it was top secret for national security. However, he stopped listening when Cole yelled directly into the bonsai plant. He then had Leo pick three cards from a deck: three queens, with Donna, Audrey, and Shelly's faces on them. He picked one more card: a king with Cooper's face on it. He then found the queen of hearts and placed it on a poster for the Miss Twin Peaks contest, declaring that the winner would die.\nHe went to the library, disguised as poetry teacher Edward Perkins, and ran into Audrey, who was researching civil disobedience. She showed him the poem he had sent her and he had her read it for him. Earle commented that looking at her and hearing her recite it made her look like a queen.\nEarle then traveled to Owl Cave, where the Twin Peaks Sheriff's Department had uncovered a petroglyph. He inverted the symbol found at the site, causing a sort of physical effect in the cave.\nIn the woods, he encountered a youth named Rusty Tomasky and promised him beer and a party. Back at the cabin, he told Tomasky about the White Lodge, a good place, and its evil opposite, the Black Lodge. The latter he said he intended to find. Rusty became restless, wondering about the beer and party. Earle told the youth \"in good time\" and played a flute.\nHe built a large chess pawn around Rusty and had Leo give him a beer. He painted it, then got out a crossbow. Earle had a reluctant Leo bring him an arrow, which he then fired into Rusty, killing him.\nLater, Earle observed Cooper spending a romantic time with Annie Blackburn, and he smirked. In the evening, he delivered the pawn containing Rusty's corpse to the park gazebo.\nThe next day, again listening through the bonsai plant, Earle found that Cooper and the other lawmen had caught onto his search for the Black Lodge, and he wished to ask questions to Major Garland Briggs, who previously worked with him on Project Blue Book.\nHe told Leo about the dugpas, saying that he would have appreciated them. Leo then saw the card with Shelly's face on it and said her name. Earle asks him if he would mourn her death, but doubted it, believing he would even help him kill her if she won Miss Twin Peaks. Leo denied this and pointed the shock collar remote at him, and Windom feigned fear until Leo ended up shocking himself.\nWith Leo and himself in a horse costume, Earle approached Briggs in the woods and he fired a dart into him, causing him to fall. Laughing, Earle revealed his identity to Briggs. After going back to the cabin, Earle interrogated Briggs about Owl Cave, but the Major stayed silent, so he injects him with a truth serum, and Briggs said he first saw the petroglyph at Owl Cave in a dream. He said that the symbols meant that \"there's a time if Jupiter and Saturn meet, they will receive you.\" Earle deciphered the meaning of this statement and discovered that the petroglyph was a map to the Black Lodge.\nEarle went to the cabin in the morning with corpse-like skin tone and black teeth and found that Major Briggs had escaped with Leo's help. He did not immediately punish Leo but grinned whilst waving a bag in front of his face.\nHe listened in on the sheriff's station, where Cooper and Truman discussed Earle's motives and the death of Josie Packard, believing she was killed by fear, and that after she died, Cooper saw an entity called \"BOB\" from the Black Lodge, who seemed to be feeding off of Josie's fear. Earle had an epiphany, knowing all he needed to know to access the Black Lodge. He packed his bags to prepare for the Miss Twin Peaks Contest, leaving a nest of tarantulas dangling above Leo's head, ready to fall if he let go of a rope between his teeth.\nHe went to the Miss Twin Peaks contest, disguised as the Log Lady. When Bobby Briggs approached him, Windom knocked him out with a log. He went up to the lighting catwalk as Annie Blackburn delivered her speech.\nAfter Annie was announced as the winner, Windom shut off the lights and turned on strobes as he began to set off smoke bombs, one going off directly in front of Cooper. He then pulled Annie off of the stage with a chloroform rag and stole Pete Martell's truck.\nEarle took Annie to Glastonbury Grove, commenting that he liked the fear she was expressing. He took her to the circle of sycamore trees, where she became hypnotized and he led her into the Black Lodge.\n \nIn the Lodge, he appeared to Cooper. Annie appeared and disappeared. Windom then laughed, saying she would live if Dale gave up his soul. He said he would and Earle stabbed him. This was quickly reversed and BOB appeared, saying he could not ask for Cooper's soul, then took Earle's.\nLegacy\nTwenty-five years later, both Dale Cooper and his doppelganger were reminded of the events that happened on March 26, 1989, faintly remembering that Windom Earle was there.\nModus operandi\nWindom Earle was a meticulous and proficient serial killer, who left little to no clues, including a full absence of fingerprints and posed victims in rather eccentric ways, making tableaus, signifying some meaning. While his killing spree was originally stylized as a chess game with Dale Cooper with each victim being a lost figure of Cooper's in a play, it was later revealed to mostly being a façade for his real actions regarding the Black Lodge.\nWindom Earle usually stabbed his victims in the aorta but would kill people in a variety of ways, including crossbows and complicated traps.\nChess game\nEarle was playing white:\nEarle: P to K-4 (Pawn to King's 4)\nCooper: P to Q4 (Pawn to Queen's 4)\nEarle: P to Q4 (Pawn to Queen's 4)\nCooper: N to QB3 (Knight to Queen's Bishop 3)\nEarle: PxP (Pawn takes Pawn)\nCooper/Pete: P to QN3 (Pawn to Queen's Knight 3), Pete claimed that Earle would not be able to take another piece before five or six moves although he actually did in just three moves. The Twin Peaks Gazette printed the move as B to QB4 (Bishop to Queen's Bishop 4)\nEarle: N to KB3 (Knight to King's Bishop 3)\nCooper/Pete: P to QR3 (Pawn to Queen's Rook 3)\nEarle: BxP (Bishop takes Pawn)\nDisguises\nWindom Earle was a master of disguise, who could easily hide in plain sight, undetected even by people who had seen him. He casually changed his appearance with incredible ease, utilizing both elaborate make-up and costumes and a full change of mannerisms.\nCourier - thick glasses, whiskers, stylized mustache, accent. Used to deliver a message to Audrey Horne and Dale Cooper in Great Northern Hotel.\nTrucker - \"Courtwright Diesel & Machines\" baseball cap, a single gold tooth, a fat suit under the shirt. Used to deliver a message to Shelly Johnson in Double R Diner and also to spy on Donna Hayward, Shelly and Audrey in a Roadhouse.\nDr. Gerald Craig - grayed eyebrows, gray mustache, a hat. Used to deliver \"a gift\" for William \"Doc\" Hayward through Donna Hayward which is also an announcement of his next move in a chess play with Dale Cooper.\nA Kind Biker - Harley-Davidson motorcycle rider outfit, a long hair wig, bandana, fake tattoos on left arm (fire) and face (spider), mustache and beard. Used to spy on Dale Cooper and converse to Shelly Johnson in Double R Diner.\nEdward Perkins - beard, mustache, thin glasses, a pipe, a bowtie. Used to converse to Audrey Horne in the library.\n\"Weird Suit\" - used to lure Rusty Tomasky.\nFisherman - fisherman outfit. Used to spy on Dale Cooper and Annie Blackburn on the lake.\nThe Log Lady - used to infiltrate Miss Twin Peaks Contest and steal the car of Pete Martell.\nVictims\nCaroline Earle - single stab wound, one inch beneath the sternum, severing the aorta.\nErik Powell (\"The Dead Man\"/\"John Doe\") - single stab wound, one inch beneath the sternum, severing the aorta.\nUnknown Man - taped to the bottom of the table at the power station.\nRusty Tomasky (\"Heavy Metal Youth\"/\"Young Man\") - shot with a crossbow while being in a large papier-mâché figure of a chess pawn.\nLeo Johnson - shot 5 times in and around the heart. Shooter unconfirmed, but Earle is mostly likely suspect according to the FBI.\nAttempted\nDale Cooper - tries to claim his soul using Black Lodge, stabs him in the Lodge after he first sees Laura's doppelganger\nAnnie Blackburn - tried to claim her soul using Black Lodge.\nInjured\nMajor Garland Briggs - drugged up and tortured with crossbow and bolts.\nBobby Briggs - knocked out with a log.\nNadine Hurley - knocked out with a sandbag.\nBehind the scenes\nWindom Earle was played by Canadian actor Kenneth Welsh. Robert Engels, who was friends with Welsh, was the one who suggested he should audition for the part. Engels also knew Welsh played the flute and suggested he play it for one of his scenes in Episode 22. Welsh used his own shakuhachi flute. Most of Earle's disguises were Welsh's own ideas.\nHarley Peyton named Earle after actor William Windom and Humphrey Bogart's character from the 1941 film High Sierra: \"Mad Dog\" Roy Earle.\nSubtitles on various releases of Twin Peaks erroneously state that Sarah Palmer speaks with Earle's voice in her scene with Major Briggs in Episode 29.\nWelsh wasn't asked to reprise his role in the 2017 series, but he would have been loved to. He does incidentally appear in the series; footage from Episode 29 featured in Part 2 and Part 5 as flashbacks of Dale Cooper and his doppelganger, respectively, feature his shadow and a brief glimpse of his jacketed shoulder, which shows several times due to footage being looped. \nTrivia\nDespite only appearing in 10 episodes (one of which only as a voice), Kenneth Welsh is still considered a member of the main cast of Season 2.\nThe Twin Peaks Collectible CardArt card \"DON'T LET 'EM RATTLE YOU, COOP...\" erroneously states that Earle was sent to Twin Peaks to conduct an Internal Affairs investigation against Cooper. This was actually assigned to Agent Roger Hardy.\nWhile Windom makes no appearance in Twin Peaks: Fire Walk with Me, nor is he mentioned, there are a few signs of his existence in the movie which are of note. Firstly, Annie Blackburn appearing in the vision of Laura Palmer is dressed like Caroline Earle and secondly, Dale Cooper acting very differently than what we see in the series may be interpreted as a sign of psychological trauma received by him in the encounter with Earle.\nThere is a garage punk/ surf/ rockabilly band named Thee Windom Earles. Based in Manchester, they regularly perform in the U.K., playing at the 10th Twin Peaks Festival with a surprise guest appearing with Kenneth Welsh in 2019.\nGallery\nEarle appearing to Cooper in the Lodge."}