{"name": "Woodsman", "url": "https://twinpeaks.fandom.com/wiki/Woodsman", "text": "Woodsman\n\"Now I remember! I saw them in a room. I saw the bearded men, the same type Albert and I saw. Dirty, bearded men, in a room!\"\n ―Gordon Cole\nThe woodsmen were mysterious beings observed above a convenience store, which took the form of disheveled, bearded men.\nBiography\n\n1940s-50s\nA great number of woodsmen appeared outside a convenience store, shuffling to and fro, their arrival a direct outcome of the Trinity nuclear test in White Sands, New Mexico.\nOn August 5, 1956, a woodsman, resembling a pitch-black bearded man, materialized and descended from the sky in New Mexico near the site of the nuclear test, along with another shadowy man. They stopped a car and the woodsman asked the couple inside, \"Gotta light?\" Frightened, the couple drove away.\nStill repeating his question, the woodsman then went to the office of KPJK, killed the receptionist, and held a disc jockey tightly by the head as he repeatedly broadcast the words:\n\"This is the water and this is the well. Drink full and descend. The horse is the white of the eyes, and dark within.\"\nThe broadcast caused those who heard it to lose consciousness, including a young girl. A strange creature that had just hatched in the desert took the opportunity to crawl inside the girl's mouth. Afterward, the woodsman crushed the disc jockey's skull and left.\n1980s\nTwo bearded woodsmen witnessed a meeting between the arm and BOB above a convenience store. One adjusted something behind a device and affected the room's lights, while another slapped his knee in response to the arm's statements. The Electrician, Mrs. Tremond, her grandson, and a jumping man were also present.\n2010s\nA staring pitch-black woodsman sat in the cell two doors down from William Hastings while Hastings was being held for the murder of Ruth Davenport. The figure, motionless, disappeared, while his disembodied head floated toward the ceiling.\nAnother figure skulked through the hallway at the Buckhorn Police Department while Lieutenant Cynthia Knox inspected the cadaver which matched Garland Briggs' fingerprints.\nAfter Ray Monroe shot Dale Cooper's doppelganger, he witnessed several woodsmen swarm out of the nearby trees and attack Cooper's body, smearing blood all over him. While doing so they removed a fleshy object from his body which appeared to have BOB's face on it. Monroe fled in terror, and Cooper awoke some time afterward.\n \nHastings led the FBI to a location where he and Ruth Davenport had entered \"the zone,\" which he believed to be an alternate dimension. Woodsmen were lurking around the area, flickering in and out of view. Gordon Cole was nearly lost when a vortex opened, leading to a staircase where several of the woodsmen stood. While Cole and Rosenfield searched the premises, Diane Evans watched as one of them sneaked up to Dave Macklay's car. Hastings, sitting in the back seat, died moments later, the top half of his head crushed inward.\nSeveral woodsmen greeted Dale Cooper's doppelganger when he arrived at a convenience store in the woods. Above the store, he asked to see Phillip Jeffries, and one of them turned a lever on a tube amplifier. Another woodsman led him down a corridor and up the staircase from Cole's vision, eventually coming to a darkened motel.\nWhen Lucy Brennan shot Cooper's doppelganger at the Twin Peaks Sheriff's Department, the room grew dark and three woodsmen appeared to intervene, as they had the previous time. They smeared Cooper with blood, and soon a gaping hole opened in his chest. BOB, in the form of a black orb, emerged from the opening and floated into the air.\nBehind the scenes\nTwo woodsmen, identified as \"Woodsman\" and \"Second Woodsman\" in the end credits, were portrayed by Jurgen Prochnow and David Brisbin in Twin Peaks: Fire Walk with Me and Twin Peaks: The Missing Pieces. They appear with no dialogue only in the convenience store sequence.\nIn Twin Peaks (2017), several unidentified pitch-black, disheveled woodsmen appear throughout the series. The woodsman in New Mexico was portrayed by Robert Broski in Part 8 and Part 14. The others were portrayed, uncredited, by Anthony Marcacci, Jon-Thomas Butler, Christian Calloway, Mike Cochrane, Patrick Dawson, Liam Kennedy, Gabriel Lane, David Nieker, Richard Staley, and Stewart Strauss.\nWhen asked about a connection between the Woodsmen and the Night of the Burning River described in his book The Secret History of Twin Peaks, author Mark Frost acknowledged the possibility without confirming or denying it."}